Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/arms.po
Languages: es_mx, fr_ca, zh_cn

source: Arms
es_mx: Brazos
fr_ca: Bras
zh_cn: 机械臂

source: Arms encompass a large variety of mechanisms. In FTC, they are used to add extension and flexibility to end effectors. Arms are especially powerful when paired with other mechanisms such as linear extension and mini-turrets.
es_mx: Los brazos abarcan una gran variedad de mecanismos. En FTC, se utilizan para añadir extensión y flexibilidad a los efectores finales. Los brazos son especialmente potentes cuando se combinan con otros mecanismos, como la extensión lineal y las minitorretas.
fr_ca: Les bras englobent une grande variété de mécanismes. En FTC, ils sont utilisés pour ajouter de l'extension et de la flexibilité aux mécanismes. Les bras sont particulièrement avantageux lorsqu'ils sont associés à d'autres mécanismes tels que des extensions linéaires et des mini-tourelles.
zh_cn: 机械臂包括各种各样的机械装置。在 FTC 中，它们用于增加末端效应器的伸展性和灵活性。当机械臂与线性伸展和小关节发射装置等其他机构搭配使用时，其功能尤为强大。

source: Arms for Extension
es_mx: Brazos para Extensión
fr_ca: Bras pour extension
zh_cn: 伸展机械臂

source: Arms can be a useful tool for extension. Long arms need large reduction ratios to drive. The example in the :ref:`Single Arm section <single-arm>` uses a 254.5:1 reduction. It is recommended to transfer torque to the arm through a gear, chain, or belt rather than directly mounting to a motor shaft due to axial forces and the ability to get a larger reduction. Due to the large amount of momentum these arms can carry, if suddenly stopped they may be able to break a motor's gearbox or even tip your robot over. Software control can help to reduce the load on motor gearboxes (see :doc:`/docs/software/concepts/control-loops`).
es_mx: Los brazos pueden ser una herramienta útil para la extensión. Los brazos largos necesitan grandes relaciones de reducción para su accionamiento. El ejemplo de la sección :ref:`Brazo Único <single-arm>` utiliza una reducción de 254,5:1. Se recomienda transferir el torque al brazo a través de un engranaje, cadena o correa en lugar de montarlo directamente en el eje de un motor debido a las fuerzas axiales y a la posibilidad de obtener una mayor reducción. Debido a la gran cantidad de impulso que estos brazos pueden llevar, si se detienen repentinamente pueden ser capaces de romper la caja de engranajes de un motor o incluso volcar su robot. El control por software puede ayudar a reducir la carga de las cajas de engranajes de los motores (véase :doc:`/docs/software/concepts/control-loops`).
fr_ca: Les bras peuvent être un outil utile pour l'extension. Les bras longs ont besoin de rapports de réduction importants pour être entraînés. L'exemple présenté dans la section :ref:`Single Arm <single-arm>` utilise un rapport de réduction de 254,5:1. Il est recommandé de transférer le couple au bras par l'intermédiaire d'un engrenage, d'une chaîne ou d'une courroie plutôt que de le monter directement sur l'arbre du moteur en raison des forces axiales et de la possibilité d'obtenir une réduction plus importante. En raison de la grande quantité d'élan que ces bras peuvent transporter, s'ils s'arrêtent soudainement, ils peuvent briser la boîte de vitesses d'un moteur ou même faire basculer votre robot. Le contrôle logiciel peut aider à réduire la charge sur les boîtes de vitesses des moteurs (voir :doc:`/docs/software/concepts/control-loops`).
zh_cn: 机械臂可以是一个有用的伸展工具。长机械臂需要较大的减速比来驱动。在 :ref:` 单臂部分<single-arm>` 中的示例使用了 254.5:1 的减速比。建议通过齿轮、链条或皮带将扭矩传递到机械臂，而不是直接安装到电机轴上，因为这样可以获得更大的轴向力和减速比。由于这些机械臂可携带较大的动力，如果突然停止，可能会导致电机齿轮箱损坏，甚至使机器人翻倒。软件控制有助于减轻电机齿轮箱的负荷（参见 :doc:`/docs/software/concepts/control-loops`）。

source: Depending on the application and implementation, arms can be either faster or slower than other extension options.
es_mx: Dependiendo de la aplicación y la implementación, los brazos pueden ser más rápidos o más lentos que otras opciones de extensión.
fr_ca: Selon l'application et la mise en œuvre, les bras peuvent être plus rapides ou plus lents que les autres options d'extension.
zh_cn: 根据应用和实现，机械臂可能比延伸方案更快或更慢。

source: Single Arm
es_mx: Brazo Único
fr_ca: Bras simple
zh_cn: 单机械臂

source: The most simple type of arm, a single arm refers to an arm on one axis of rotation. These arms are relatively easy and quick to build, however they have little high-level competitive viability as a main extension system since the extension it provides is limited due to the length restrictions of the starting cube, only being able to provide around 16" of extension whereas over 24" of extension is desired for most games.
es_mx: El tipo más simple de brazo, un brazo único se refiere a un brazo en un eje de rotación. Estos brazos son relativamente fáciles y rápidos de construir, sin embargo, tienen poca viabilidad competitiva a alto nivel como sistema de extensión principal, ya que la extensión que proporciona es limitada debido a las restricciones de longitud del cubo inicial, solo pudiendo proporcionar alrededor de 16" de extensión, mientras que en la mayoría de los juegos se desean más de 24" de extensión.
fr_ca: Le type de bras le plus simple, un bras simple se réfère à un bras sur un seul axe de rotation. Ces bras sont relativement faciles et rapides à construire, mais ils ont peu de viabilité compétitive à haut niveau en tant que système d'extension principal, car l'extension qu'ils fournissent est limitée en raison des restrictions de longueur du cube de départ, ne pouvant fournir qu'environ 16" d'extension alors que plus de 24" d'extension sont souhaités pour la plupart des jeux.
zh_cn: 单机械臂是最简单的机械臂类型，指的是只有一个旋转轴的机械臂。这种机械臂的制作相对简单快捷，但作为主要的延伸系统，它们在高级别竞技比赛中的可行性不高，因为由于起始立方体的长度限制，它所提供的延伸能力有限，只能提供大约 16 英寸的延伸，而大多数游戏都需要超过 24 英寸的延伸。

source: goBILDA starter bot, Into The Deep, single arm.
es_mx: goBILDA starter bot, Into The Deep, brazo único.
fr_ca: goBILDA starter bot, Into The Deep, bras simple.
zh_cn: goBILDA 启动机器人，Into The Deep，单机械臂。

source: goBILDA starter bot, Into The Deep, single arm used for extension.
es_mx: goBILDA starter bot, Into The Deep, brazo único utilizado para la extensión.
fr_ca: goBILDA starter bot, Into The Deep, un seul bras utilisé pour l'extension.
zh_cn: goBILDA 启动机器人，Into The Deep，单机械臂用于伸展。

source: Pivot Extension
es_mx: Extensión pivotante
fr_ca: Extension du pivot
zh_cn: 枢轴延伸

source: A pivot extension mechanism is an arm with a linear extension (typically linear slides) attached. This allows the linear extension to provide the desired extension length for both horizontal and vertical extension along with removing the need for a transfer stage.
es_mx: Un mecanismo de extensión pivotante es un brazo con una extensión lineal (normalmente guías lineales) acoplada. Esto permite que la extensión lineal proporcione la longitud de extensión deseada para la extensión horizontal y vertical, junto con la eliminación de la necesidad de una etapa de transferencia.
fr_ca: Un mécanisme d'extension à pivot est un bras auquel est attachée une extension linéaire (généralement des glissières linéaires). Cela permet à l'extension linéaire de fournir la longueur d'extension souhaitée à la fois pour l'extension horizontale et verticale, tout en supprimant la nécessité d'un étage de transfert.
zh_cn: 枢轴延伸机构是一个连接有线性延伸装置（通常是线性滑轨）的机械臂。这样，线性伸展装置就可以为水平和垂直伸展提供所需的伸展长度，同时无需使用传送结构。

source: Robot with a pivoting arm and long linear extension.
es_mx: Robot con brazo pivotante y larga extensión lineal.
fr_ca: Robot doté d'un bras pivotant et d'une longue extension linéaire.
zh_cn: 带有旋转机械臂和长线性伸展机械臂的机器人。

source: goBILDA Robot in 3 Days, Into The Deep, pivoting linear slides
es_mx: goBILDA Robot in 3 Days, Into The Deep, guías lineales pivotantes
fr_ca: goBILDA Robot en 3 jours, Into The Deep, glissières linéaires pivotantes
zh_cn: goBILDA 机器人 3 天内完成，Into The Deep，旋转线性滑轨

source: 19098's pivot slides
es_mx: Correderas de pivote de 19098
fr_ca: Glissières pivotantes de 19098
zh_cn: 19098 队伍的枢轴线性滑轨

source: 19098 Eastern Foxes, Into The Deep, Winning Alliance First Pick (Franklin), pivoting linear slides
es_mx: 19098 Eastern Foxes, Into The Deep, Alianza Ganadora 1er Pick (Franklin), guías lineales pivotantes
fr_ca: 19098 Eastern Foxes, Into The Deep, premier choix de l'alliance gagnante (Franklin), glissières linéaires pivotantes
zh_cn: 19098 Eastern Foxes，Into The Deep，Winning Alliance First Pick（富兰克林），可转动线性滑轨

source: 8417's single arm attached to a belt driven linear extension
es_mx: El brazo único del 8417 está unido a una extensión lineal accionada por correa
fr_ca: Le bras unique de 8417 est fixé à une extension linéaire entraînée par une courroie.
zh_cn: 8417 队伍的单机械臂连接到皮带驱动的线性延伸装置上

source: 8417 'Lectric Legends, Rover Ruckus, Finalist Alliance First Pick (Ochoa), single arm + custom belt driven linear extension
es_mx: 8417 'Lectric Legends, Rover Ruckus, Finalista Alliance First Pick (Ochoa), brazo único + extensión lineal a medida accionada por correa
fr_ca: 8417 'Lectric Legends, Rover Ruckus, premier choix de l'alliance finaliste (Ochoa), bras simple + extension linéaire personnalisée entraînée par courroie
zh_cn: 8417 'Lectric Legends，Rover Ruckus，入围联盟第一名（于 Ochoa 奥乔亚举办），单臂 + 定制皮带驱动线性延长杆

source: Multi-Axis Arms
es_mx: Brazos multieje
fr_ca: Bras multi-axes
zh_cn: 多轴臂

source: A multi-axis arm consists of multiple rotational joints. A multi-axis arm provides the extension single arms lack in addition to providing much more flexibility in positioning the end effector. While multi-axis arms seem like the obvious solution to the problems single axis arms face, they are much more difficult to design, manufacture, and control, having issues with accuracy, backlash, and packaging, while providing little benefit over linear slides and other extension methods.
es_mx: Un brazo multieje consta de múltiples articulaciones giratorias. Un brazo multieje proporciona la extensión de la que carecen los brazos simples, además de ofrecer mucha más flexibilidad a la hora de posicionar el efector final. Aunque los brazos multieje parecen la solución obvia a los problemas a los que se enfrentan los brazos de un solo eje, son mucho más difíciles de diseñar, fabricar y controlar, y presentan problemas de precisión, holgura y empaquetado, además de ofrecer pocas ventajas con respecto a las guías lineales y otros métodos de extensión.
fr_ca: Un bras multi-axes se compose de plusieurs articulations rotatives. Un bras multi-axes offre l'extension dont les bras simples sont dépourvus, ainsi qu'une plus grande flexibilité dans le positionnement du mécanisme de manipulation. Bien que les bras multi-axes semblent être la solution évidente aux problèmes rencontrés par les bras à axe unique, ils sont beaucoup plus difficiles à concevoir, à fabriquer et à contrôler, posent des problèmes de précision, de jeu et d'emballage, tout en offrant peu d'avantages par rapport aux glissières linéaires et aux autres méthodes d'extension.
zh_cn: 多轴机械臂由多个旋转关节组成。多轴机械臂除了具有单轴机械臂所缺乏的延伸能力外，还能更灵活地定位末端效应器。虽然多轴机械臂似乎是解决单轴机械臂所面临问题的明显方案，但其设计、制造和控制难度要大得多，存在精度、反向间隙和封装等问题，而且与线性滑轨和其他延伸方法相比几乎没有任何优势。

source: This is highly discouraged for inexperienced FTC teams.
es_mx: Se desaconseja encarecidamente a los equipos de FTC sin experiencia.
fr_ca: Cette pratique est fortement déconseillée aux équipes de FTC inexpérimentées.
zh_cn: 对于缺乏经验的 FTC 团队来说，这种做法是非常不可取的。

source: 11146's multi-axis arm
es_mx: Brazo multieje de 11146
fr_ca: Le bras multi-axes de 11146
zh_cn: 11146 队伍的多轴机械臂

source: 11146 Barker Redbacks, Into The Deep, multi-axis arm
es_mx: 11146 Barker Redbacks, Into The Deep, brazo multieje
fr_ca: 11146 Barker Redbacks, Into The Deep, bras multi-axes
zh_cn: 11146 Barker Redbacks，Into The Deep，多轴机械臂

source: 20700's multi-axis arm
es_mx: Brazo multieje de 20700
fr_ca: Bras multi-axes de 20700
zh_cn: 20700 队伍的多轴机械臂

source: 20700 Snap, Freight Frenzy, multi-axis arm
es_mx: 20700 Snap, Freight Frenzy, brazo multieje
fr_ca: 20700 Snap, Freight Frenzy, bras multi-axes
zh_cn: 20700 Snap，Freight Frenzy，多轴机械臂

source: Arms for End Effectors
es_mx: Brazos para efectores finales
fr_ca: Bras pour mécanismes de manipulation
zh_cn: 末端执行器机械臂

source: Arms are the most common way to add flexibility and control to end effectors. These arms typically have one or more rotational joints and/or linear extension. Due to the relatively small power requirement of these arms, they are often driven by servos instead of motors.
es_mx: Los brazos son la forma más común de añadir flexibilidad y control a los efectores finales. Estos brazos suelen tener una o varias articulaciones giratorias y/o una extensión lineal. Debido a las necesidades de potencia relativamente pequeñas de estos brazos, a menudo se accionan mediante servos en lugar de motores.
fr_ca: Les bras sont le moyen le plus courant d'ajouter de la flexibilité et du contrôle aux mécanismes de manipulation. Ces bras sont généralement dotés d'une ou plusieurs articulations rotatives et/ou d'une extension linéaire. En raison de la puissance relativement faible qu'ils requièrent, ces bras sont souvent actionnés par des servomoteurs plutôt que par des moteurs.
zh_cn: 机械臂是为末端效应器增加灵活性和控制性的最常见方式。这些机械臂通常具有一个或多个旋转接头或线性延伸装置。由于这些机械臂所需的功率相对较小，因此通常由伺服电动机而非电机驱动。

source: End effectors are likely to see collisions and with arms acting as a lever, it is imperative to take extra caution to mount and support these servos properly (see :doc:`/docs/power-and-electronics/servo-guide/usage-tips`).
es_mx: Los efectores finales son propensos a colisiones y con los brazos actuando como una palanca, es imperativo tomar precauciones adicionales para montar y apoyar estos servos correctamente (ver :doc:`/docs/power-and-electronics/servo-guide/usage-tips`).
fr_ca: Les mécanismes de manipulation sont susceptibles de subir des collisions et, les bras agissant comme un levier, il est impératif de prendre des précautions supplémentaires pour monter et soutenir ces servos correctement (voir :doc:`/docs/power-and-electronics/servo-guide/usage-tips`).
zh_cn: 末端效应器很可能会发生碰撞，而且以机械臂作为杠杆，必须格外小心，正确安装和支撑这些舵机（参见 :doc:`/docs/power-and-electronics/servo-guide/usage-tips`)。

source: Single and multi-axis arms can add control to the vertical and horizontal distance of an end effector. In Into The Deep, this type of arm was common in intakes to allow the intake on a horizontal extension to go over the submersible barrier and then "reach down" for samples. They can be used to line up intakes and outtakes to facilitate transfers or just generally add flexibility to where end effectors can act.
es_mx: Los brazos de uno o varios ejes pueden añadir control a la distancia vertical y horizontal de un efector final. En Into The Deep, este tipo de brazo era habitual en los intakes para permitir que el intake en una extensión horizontal sobrepasara la barrera sumergible y luego "alcanzara" las muestras. Pueden utilizarse para alinear los intakes y las outtakes para facilitar las transferencias o, en general, para añadir flexibilidad a la actuación de los efectores finales.
fr_ca: Les bras à un ou plusieurs axes permettent de contrôler la distance verticale et horizontale d'un mécanisme de manipulation. Dans Into The Deep, ce type de bras était courant dans les prises d'eau pour permettre à la prise d'eau sur une extension horizontale de franchir la barrière submersible, puis de "descendre" pour prélever des échantillons. Ils peuvent être utilisés pour aligner les prises d'eau et les prises d'air afin de faciliter les transferts ou simplement pour ajouter de la flexibilité à l'endroit où les effecteurs peuvent agir.
zh_cn: 单轴和多轴机械臂可以增加对末端效应器垂直和水平距离的控制。在 Into The Deep 中，这种机械臂在拾取装置很常见，可以让水平延伸的拾取装置越过水下障碍物，然后 “伸手向下 ”取样。这种机械臂可用于将拾取装置和发射装置排成一线，以方便转移，或者通常只是增加末端效应器作用位置的灵活性。

source: Linear extension is usually seen on outtakes to increase the range of the robot's deposit.
es_mx: La extensión lineal suele verse en las outtakes para aumentar el alcance del depósito del robot.
fr_ca: L'extension linéaire est généralement utilisée sur les prises de vues afin d'augmenter la portée de la dépose du robot.
zh_cn: 线性延伸通常出现在发射装置上，以增加机器人的存放范围。

source: 15972's robot with multi-axis intake and outtake arms
es_mx: Robot 15972 con brazos de intake y outtake multieje
fr_ca: Robot 15972 avec bras de ramasseur et de sortie multi-axes
zh_cn: 15972 的机器人配有多轴拾取装置和发射装置

source: 15972 TehnoZ, Into The Deep, Finalist Alliance Captain (Edison), arms used on both intake and outtake, linear extension is used on outtake.
es_mx: 15972 TehnoZ, Into The Deep, Capitán de Alianza Finalista (Edison), los brazos se utilizan tanto en el intake como en el outtake, la extensión lineal se utiliza en la outtake.
fr_ca: 15972 TehnoZ, Into The Deep, capitaine d'alliance finaliste (Edison), les bras sont utilisés à la fois à l'entrée et à la sortie, l'extension linéaire est utilisée à la sortie.
zh_cn: 15972 TehnoZ，Into The Deep，入围联盟队长（Edison），拾取装置和发射装置都使用了双机械臂，发射装置使用了线性延伸。

source: 12993's high dof outtake with horizontal extension
es_mx: Outtake de alta dof de 12993 con extensión horizontal
fr_ca: Prise de vue de 12993 avec une grande portée et une extension horizontale
zh_cn: 12993 的高拾取装置，水平伸展

source: 12993 RoboKings Aurum, Centerstage, Finalist Alliance 1st Pick, high degree of freedom outtake arm with horizontal extension.
es_mx: 12993 RoboKings Aurum, Centerstage, Alianza Finalista 1er Pick, brazo de outtake de alto grado de libertad con extensión horizontal.
fr_ca: 12993 RoboKings Aurum, Centerstage, Premier choix d'alliance finaliste, bras de sortie à haut degré de liberté avec extension horizontale.
zh_cn: 12993 RoboKings Aurum，中心舞台，入围联盟第 1 轮选拔赛，高自由度摄取机械臂，带水平伸展功能。
