Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/dead-wheels.po
Languages: es_mx, fr_ca, ro_ro

source: FTC 18172's vertical springing
es_mx: El resorte vertical del equipo de FTC 18172
fr_ca: Ressort vertical de la FTC 18172
ro_ro: Arcuirea verticală a echipei 18172

source: Gallery
es_mx: Galería
fr_ca: Galerie
ro_ro: Galerie

source: Open Odometry (REV Through Bore Encoder)
es_mx: Odometría abierta (REV Through Bore Encoder)
fr_ca: Odométrie ouverte (Encodeur REV à travers l'alésage)
ro_ro: Open Odometry (Encoderul REV Through Bore)

source: Exploded drawing of Open Odometry design
es_mx: Despiece del diseño de Odometría Abierta
fr_ca: Dessin éclaté de la conception de l'Odométrie Ouverte
ro_ro: Desenul extins al design-ului Open Odometry

source: Section view of Open Odometry
es_mx: Vista en sección de la Odometría Abierta
fr_ca: Vue en coupe de l'odométrie ouverte
ro_ro: Vedere secționată a Open Odometry

source: FTC\ |reg| Team 14310 (REV Through Bore Encoder)
es_mx: FTC\ |reg| Equipo 14310 (REV Through Bore Encoder)
fr_ca: FTC\ |reg| Équipe 14310 (Encodeur de Passage REV)

source: 14130's odometry
es_mx: Odometría de 14130
fr_ca: L'odométrie du 14130
ro_ro: Odometria echipei 14130

source: FTC Team 8802 (REV Through Bore Encoder)
es_mx: Equipo de FTC 8802 (REV Through Bore Encoder)
fr_ca: FTC Team 8802 (Encodeur à Alésage REV)
ro_ro: Echipa 8802 (Encoder REV Through Bore)

source: 8802's odometry
es_mx: Odometría de 8802
fr_ca: L'odométrie du 8802
ro_ro: Odometria echipei 8802

source: 14320's odometry
es_mx: Odometría de 14320
fr_ca: L'odométrie du 14320
ro_ro: Odometria echipei 14320

source: 11115's odometry
es_mx: Odometría de 11115
fr_ca: L'odométrie de 11115
ro_ro: Odometria Echipei 11115

source: FTC Team 14481 (REV Through Bore Encoder)
es_mx: Equipo de FTC 14481 (REV Through Bore Encoder)
fr_ca: FTC Team 14481 (Encodeur à Alésage REV)
ro_ro: Echipa 14481 (Encoder REV Through Bore)

source: 14481's odometry
es_mx: Odometría de 14481
fr_ca: L'odométrie de 14481
ro_ro: Odometria Echipei 14481

source: FTC Team 3658 (REV Through Bore Encoder)
es_mx: Equipo de FTC 3658 (REV Through Bore Encoder)
fr_ca: FTC Team 3658 (Encodeur REV à Travers l'Alésage)
ro_ro: Echipa 3658 (Encoder REV Through Bore)

source: Render of 3658's odometry
es_mx: Render de la odometría de 3658
fr_ca: Rendu de l'odométrie de 3658
ro_ro: Randare a odometriei echipei 3658

source: FTC Team 3658 CAD
es_mx: Equipo de FTC 3658 CAD
fr_ca: Équipe FTC 3658 CAD
ro_ro: CAD-ul echipei 3658

source: FTC Team 7236 (REV Through Bore Encoder)
es_mx: Equipo de FTC 7236 (REV Through Bore Encoder)
fr_ca: FTC Team 7236 (Encodeur à Alésage REV)
ro_ro: Echipa 7236 (Encoder REV Through Bore)

source: Exploded view of 7236's odometry
es_mx: Despiece de la odometría de 7236
fr_ca: Vue éclatée de l'odométrie du 7236
ro_ro: Vedere extinsă a odometriei echipei 7236

source: FTC Team 7236 CAD
es_mx: Equipo de FTC 7236 CAD
fr_ca: Équipe FTC 7236 CAD
ro_ro: CAD-ul echipei 7236

source: 7236's odometry
es_mx: Odometría de 7236
fr_ca: L'odométrie de l'équipe 7236
ro_ro: Odometria echipei 7236

source: Accessible
es_mx: Accesible
ro_ro: Accesibil

source: FTC Team 14320 (US Digital S4T)
es_mx: Equipo de FTC 14320 (US Digital S4T)
ro_ro: Echipa 14320 (US Digital S4T)

source: FTC Team 11115 (US Digital S4T)
es_mx: Equipo de FTC 11115 (US Digital S4T)
ro_ro: Odometria Echipei 11115 (US Digital S4T)

source: `FTC Team 11115 Photo Album <https://photos.google.com/share/AF1QipPx5inCdVxK6wAqtIznFE-KqvnuzgRq9rFxrhzI50r0DeYYo2o11hWB4hroYObm8A?key=UWwxd3hFdXpYaHFqaFhTSFJnWFlEWjgtV1FTN3Zn>`_
es_mx: `Álbum de fotos del equipo 11115<https://photos.google.com/share/AF1QipPx5inCdVxK6wAqtIznFE-KqvnuzgRq9rFxrhzI50r0DeYYo2o11hWB4hroYObm8A?key=UWwxd3hFdXpYaHFqaFhTSFJnWFlEWjgtV1FTN3Zn>`_
ro_ro: `Album Foto al echipei 11115 <https://photos.google.com/share/AF1QipPx5inCdVxK6wAqtIznFE-KqvnuzgRq9rFxrhzI50r0DeYYo2o11hWB4hroYObm8A?key=UWwxd3hFdXpYaHFqaFhTSFJnWFlEWjgtV1FTN3Zn>`_

source: **9794 Wizards.exe Design**
ro_ro: **Design-ul echipei 9794 Wizards.exe**
