Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/dead-wheels.po
Languages: es_mx, fr_ca, ro_ro

source: If one chooses to design dead wheels, there are only two recommended encoders that one should use for FTC: REV Through-Bore Encoders and U.S. Digital S4T Encoders.
es_mx: Si se opta por diseñar ruedas muertas, sólo hay dos codificadores recomendados para FTC: REV Through-Bore Encoders y U.S. Digital S4T Encoders.
fr_ca: Si l'on choisit de concevoir des roues non motrices, il n'y a que deux encodeurs recommandés pour FTC : Les encodeurs à alésage REV et les encodeurs U.S. Digital S4T.

source: REV Through-Bore
fr_ca: REV Passage Intégral

source: Often short-handed to "REVcoders" or "revcoders," the `REV Through-Bore encoders <https://www.revrobotics.com/rev-11-1271/>`_ has quickly become the de facto option the FTC community. The REV encoders have gained such a reputation due to its relative affordability, much improved reliability, and ease of use. The through-bore design proves to be a *significant* improvement over previous optical disc encoder designs. Optical disc encoders are very fragile, prone to scratching, and are much less tolerant to design flaws.
es_mx: A menudo abreviado como "REVcoders" o "revcoders", el `REV Through-Bore encoders <https://www.revrobotics.com/rev-11-1271/>`_ se ha convertido rápidamente en la opción de facto de la comunidad FTC. Los codificadores REV se han ganado tal reputación debido a su relativa asequibilidad, su fiabilidad muy mejorada y su facilidad de uso. El diseño pasante ha demostrado ser una mejora *significativa* con respecto a los diseños anteriores de codificadores de disco óptico. Los codificadores de disco óptico son muy frágiles, propensos a rayarse y mucho menos tolerantes a los fallos de diseño.
fr_ca: Souvent appelés "REVcoders" ou "revcoders", les encodeurs à alésage traversant REV <https://www.revrobotics.com/rev-11-1271/>`_ sont rapidement devenus l'option de facto de la communauté FTC. Les encodeurs REV ont acquis cette réputation en raison de leur prix relativement abordable, de leur fiabilité nettement améliorée et de leur facilité d'utilisation. La conception à alésage traversant s'avère être une amélioration *significative* par rapport aux conceptions précédentes d'encodeurs de disques optiques. Les codeurs à disque optique sont très fragiles, sujets aux rayures et beaucoup moins tolérants aux défauts de conception.
ro_ro: De obicei prescurtate în "REVcodere" sau "revcodere", `encoderele REV Through-Bore <https://www.revrobotics.com/rev-11-1271/>`_ au devenit rapid opțiunea cea mai populară pentru comunitatea FTC. Encodere REV au câștigat atâta reputație pentru prețul său relativ accesibil, fiabilitate și ușurință în utilizare. Design-ul prin ax se dovedește a fi *semnificativ* mai bun decât encoderele optice. Encoderele cu disc optic sunt foarte fragile, ușor de zgâriat, și sunt mai puțin tolerante la probleme de design.

source: A REV Through-Bore Encoder
fr_ca: Un encodeur à alésage REV
ro_ro: Un Encoder REV Through-Bore

source: REV Through-Bore Encoder
fr_ca: Encodeur traversant REV
ro_ro: Encoder REV Through-Bore

source: **Advantages:**
es_mx: Ventajas:
fr_ca: **Avantages:**
ro_ro: **Avantaje**

source: Through-bore design is very robust and easy to design with
es_mx: El diseño through-bore es muy robusto y fácil de diseñar
fr_ca: La conception à passage intégral est très robuste et facile à concevoir.
ro_ro: Design-ul prin ax este foarte robust și ușor de modelat

source: Relatively cheap
es_mx: Relativamente barato
fr_ca: Relativement bon marché
ro_ro: Relativ Ieftin

source: High CPR
es_mx: Alto CPR
fr_ca: RPC élevé
ro_ro: CPR Mare

source: Easy wiring
es_mx: Cableado sencillo
fr_ca: Câblage facile
ro_ro: Ușor de Conectat

source: **Disadvantages:**
es_mx: Desventajas:
fr_ca: **Inconvénients:**
ro_ro: **Dezavantaje**

source: Quite large relative to other encoders. May be challenging to create a compact design
es_mx: Bastante grande en comparación con otros codificadores. Puede ser difícil crear un diseño compacto
fr_ca: Assez grand par rapport aux autres encodeurs. Il peut être difficile de créer un design compact
ro_ro: Destul de mare comparativ cu alte encodere. Ar putea fi destul de greu să creezi un design compact

source: Many Through-Bores seem to experience slight, uneven resistance when rotating. REV says this is normal and will subside as the encoder wears in
es_mx: Muchos through-bore parecen experimentar una resistencia ligera y desigual al girar. REV dice que esto es normal y disminuirá a medida que se desgaste el codificador.
fr_ca: De nombreux alésages traversants semblent présenter une résistance légère et irrégulière lorsqu'ils tournent. REV affirme que ce phénomène est normal et qu'il s'atténuera au fur et à mesure que l'encodeur s'usera
ro_ro: Multe encodere Through-Bore au o ușoară rezistență inconsistentă când se rotesc. REV spune ca acest lucru este normal și devine mai puțin observabil cu cât folosești encoderul mai mult.

source: To forcefully wear in a REV Through-Bore encoder a 1/2" hex shaft can be spun on a drill through the encoder for a couple of minutes
es_mx: Para forzar el desgaste de un codificador REV Through-Bore, se puede hacer girar un eje hexagonal de 1/2" en un taladro a través del codificador durante un par de minutos.
fr_ca: Pour forcer l'usure d'un encodeur REV Through-Bore, on peut faire tourner un arbre hexagonal de 1/2" sur une perceuse à travers l'encodeur pendant quelques minutes.
ro_ro: Pentru a face rodajul forțat al unui encoder REV Through-Bore un ax de 1/2" poate fi rotit cu bormașina prin encoder pentru câteva minute

source: Odd mounting points
es_mx: Puntos de montaje extraños
fr_ca: Points de fixation bizarres
ro_ro: Puncte ciudate de montare

source: The Through-Bore encoders have a very high CPR (8k). The REV Hub transmits velocity in a 16-bit signed integer. This means it can only communicate a maximum value of 2^15 (which is 32768). Thus, it only takes 4 rotations a second (32k / 8k = 4) for the velocity value on the REV Hub to experience an `integer overflow <https://en.wikipedia.org/wiki/Integer_overflow?oldformat=true>`_. This is primarily a concern when dealing with motion profiling. The popular, existing tools (Road Runner and FTCLib) have `mechanisms for dealing with this issue <https://github.com/acmerobotics/road-runner-ftc/blob/e79f8a900f45c9058b67716b5289a52e17769e40/RoadRunner/src/main/java/com/acmerobotics/roadrunner/ftc/Encoders.kt#L66>`_ so this is not a concern and should not sway your design decision. Just keep this detail in mind once you start programming.
es_mx: Los codificadores pasantes tienen una RCP muy alto (8k). El Hub REV transmite la velocidad en un entero con signo de 16 bits. Esto significa que sólo puede comunicar un valor máximo de 2^15 (que es 32768). Por lo tanto, sólo se necesitan 4 rotaciones por segundo (32k / 8k = 4) para que el valor de la velocidad en el REV Hub experimente un `desbordamiento de enteros <https://en.wikipedia.org/wiki/Integer_overflow?oldformat=true>`_. Esto es principalmente una preocupación cuando se trata de perfiles de movimiento. Las herramientas populares existentes (Road Runner y FTCLib) tienen `mecanismos para tratar este problema <https://github.com/acmerobotics/road-runner-ftc/blob/e79f8a900f45c9058b67716b5289a52e17769e40/RoadRunner/src/main/java/com/acmerobotics/roadrunner/ftc/Encoders.kt#L66>`_ así que esto no es una preocupación y no debe influir en su decisión de diseño. Sólo ten en cuenta este detalle cuando empieces a programar.
fr_ca: Les encodeurs Through-Bore ont un CPR très élevé (8k). Le REV Hub transmet la vitesse sous la forme d'un entier signé de 16 bits. Cela signifie qu'il ne peut communiquer qu'une valeur maximale de 2^15 (soit 32768). Ainsi, il suffit de 4 rotations par seconde (32k / 8k = 4) pour que la valeur de la vitesse sur le REV Hub subisse un "dépassement d'entier" <https://en.wikipedia.org/wiki/Integer_overflow?oldformat=true>`_. Ce problème se pose surtout lorsqu'il s'agit d'établir des profils de mouvement. Les outils populaires existants (Road Runner et FTCLib) ont des `mécanismes pour traiter ce problème <https://github.com/acmerobotics/road-runner-ftc/blob/e79f8a900f45c9058b67716b5289a52e17769e40/RoadRunner/src/main/java/com/acmerobotics/roadrunner/ftc/Encoders.kt#L66>_ donc ce n'est pas un problème et ne devrait pas influencer votre décision de conception. Gardez simplement ce détail à l'esprit lorsque vous commencerez à programmer.

source: The `S4T <https://www.usdigital.com/products/encoders/incremental/shaft/S4T>`_ miniature shaft encoder is another viable option used in dead wheel designs. These encoders are very small and may significantly reduce the footprint of your dead wheel design. Gearing these encoders is ideal to prevent shock loads.
es_mx: El encóder de eje en miniatura `S4T <https://www.usdigital.com/products/encoders/incremental/shaft/S4T>`_ es otra opción viable utilizada en diseños de rueda muerta. Estos encóderes son muy pequeños y pueden reducir significativamente la huella de su diseño de rueda muerta. El engranaje de estos encóderes es ideal para evitar cargas de choque.
fr_ca: L'encodeur d'arbre miniature `S4T <https://www.usdigital.com/products/encoders/incremental/shaft/S4T>`_ est une autre option viable utilisée dans les conceptions de roues non motrices. Ces encodeurs sont très petits et peuvent réduire considérablement l'encombrement de votre roue non motrice. L'engrenage de ces encodeurs est idéal pour éviter les chocs.
ro_ro: Encoderul `S4T <https://www.usdigital.com/products/encoders/incremental/shaft/S4T>`_ în miniatură este o altă opțiune viabilă folosită în design-urile cu roți moarte. Aceste encodere sunt foarte mici și pot reduce semnificativ impactul asupra design-ului. Folosirea angrenajelor cu aceste encodere este ideal pentru a preveni șocurile direct pe encoder.

source: An US Digital S4T encoder
es_mx: Un codificador US Digital S4T
fr_ca: Un encodeur US Digital S4T
ro_ro: Un encoder US Digital S4T

source: S4T Encoder
es_mx: Codificador S4T
fr_ca: S4T Encodeur
ro_ro: Encoder S4T

source: *****Advantages:**
es_mx: Ventajas:
fr_ca: *****Avantages:**

source: Very compact
es_mx: Muy compacto
fr_ca: Très compact
ro_ro: Foarte compact

source: More expensive (nearly double the price)
es_mx: Más caro (casi el doble de precio)
fr_ca: Plus cher (près du double du prix)
ro_ro: Mai scump (aproape dublu)

source: Less durable
es_mx: Menos duradero
fr_ca: Moins durable
ro_ro: Mai fragil

source: Very thin wires. Prone to breaking easily if not secured properly
es_mx: Cables muy finos. Propensos a romperse fácilmente si no se sujetan correctamente.
fr_ca: Fils très fins. Ils ont tendance à se casser facilement s'ils ne sont pas fixés correctement.
ro_ro: Cabluri foarte subțiri. Predispus la rupere dacă nu este securizat bine

source: Ideally requires external gearing
es_mx: Idealmente requiere un engranaje externo
fr_ca: L'idéal est de disposer d'un engrenage externe
ro_ro: Ideal, necesită angrenaje externe

source: SRX Mag Encoder
es_mx: Codificador SRX Mag
fr_ca: SRX Mag Encodeur
ro_ro: Encoderul SRX Mag

source: The `SRX Mag Encoder <https://store.ctr-electronics.com/srx-mag-encoder/>`_ from Cross The Road Electronics is a magnetic encoder. It is not used by many FTC teams due to its slightly higher complexity to use and lack of FTC centric documentation. It is more popular in FRC\ |reg|.
es_mx: El `SRX Mag Encoder <https://store.ctr-electronics.com/srx-mag-encoder/>`_ de Cross The Road Electronics es un codificador magnético. No es utilizado por muchos equipos de FTC debido a su complejidad ligeramente mayor de usar y la falta de documentación centrada en FTC. Es más popular en FRC |reg|.
fr_ca: L'encodeur `SRX Mag <https://store.ctr-electronics.com/srx-mag-encoder/>`_ de Cross The Road Electronics est un encodeur magnétique. Il n'est pas utilisé par beaucoup d'équipes FTC en raison de sa complexité d'utilisation légèrement supérieure et du manque de documentation centrée sur FTC. Il est plus populaire en FRC\ |reg|.

source: A CTRE SRX Mag encoder
es_mx: Un codificador magnético CTRE SRX
fr_ca: Un encodeur CTRE SRX Mag
ro_ro: Un Encoder CTRE SRX Mag

source: CTRE SRX Mag Encoder
es_mx: Codificador magnético CTRE SRX
fr_ca: CTRE SRX Mag Encodeur
ro_ro: Encoder CTRE SRC Mag

source: Requires assembly
es_mx: Requiere montaje
fr_ca: Nécessite un assemblage
ro_ro: Necesită asamblare

source: Not much information exists for use in FTC
es_mx: No existe mucha información para utilizar en FTC
fr_ca: Il n'existe pas beaucoup d'informations utilisables par FTC
ro_ro: Nu există multe instrucțiuni de folosire pentru FTC

source: U.S. Digital E8T (deprecated)
es_mx: U.S. Digital E8T (obsoleto)
fr_ca: U.S. Digital E8T (obsolète)
ro_ro: U.S. Digital E8T (învechit)

source: Once the de facto option for most FTC teams, the `E8T <https://www.usdigital.com/products/encoders/incremental/kit/E8T>`_ optical encoders are no longer recommended as the REV Through-Bores are a superior option at an equivalent price. The open-hole optical disc design of these encoders face a number of frustrating design flaws that made them very fragile and prone to breaking. The only advantage that they have relative to the REV Through-Bores is their smaller footprint.
es_mx: Los codificadores ópticos `E8T <https://www.usdigital.com/products/encoders/incremental/kit/E8T>`_, que en su día fueron la opción de facto para la mayoría de los equipos FTC, ya no se recomiendan, ya que los REV Through-Bore son una opción superior a un precio equivalente. El diseño de disco óptico de orificio abierto de estos codificadores se enfrenta a una serie de frustrantes defectos de diseño que los hacen muy frágiles y propensos a romperse. La única ventaja que tienen con respecto a los REV Through-Bore es que ocupan menos espacio.
fr_ca: Autrefois l'option de facto pour la plupart des équipes FTC, les encodeurs optiques `E8T <https://www.usdigital.com/products/encoders/incremental/kit/E8T>`_ ne sont plus recommandés car les REV Through-Bores sont une option supérieure à un prix équivalent. La conception du disque optique à trou ouvert de ces encodeurs est confrontée à un certain nombre de défauts de conception frustrants qui les rendent très fragiles et susceptibles de se casser. Le seul avantage qu'ils présentent par rapport aux REV Through-Bores est leur plus faible encombrement.
ro_ro: Odată cea mai populară opțiune pentru echipele FTC, encoderul optic `E8T <https://www.usdigital.com/products/encoders/incremental/kit/E8T>`_ nu mai sunt recomandate în continuare deoarece REV Though-Bore sunt o opțiune superioară la un preț echivalent. Design-ul optic deschis al acestor encodere au multe greșeli de design care le fac fragile și predispuse la rupere. Singurul avantaj pe care îl au relativ față de REV Though-Bore sunt dimensiunile mai mici.

source: An US Digital E8T encoder
es_mx: Un codificador US Digital E8T
fr_ca: Un encodeur US Digital E8T
ro_ro: Un Encoder US Digital E8T

source: E8T Encoder
es_mx: Codificador E8T
fr_ca: Encodeur E8T
ro_ro: Encoder E8T

source: Design
es_mx: Diseño
fr_ca: Conception

source: There are few open source dead wheel designs. Dead wheels are often designed around a team's own drive train and FTC teams seldom publicly release their own robot CADs.
es_mx: Existen pocos diseños de ruedas muertas de código abierto. Las ruedas muertas suelen diseñarse en torno al propio chasis del equipo y los equipos de FTC rara vez publican los CAD de sus robots.
fr_ca: Il existe peu de modèles de roues mortes ou non motrices open source. Les roues mortes sont souvent conçues autour du châssis d'une équipe et les équipes de FTC publient rarement la CAO de leurs propres robots.
ro_ro: Există câteva design-uri disponibile public cu roți moarte. Roțile moarte sunt de obicei modelate în jurul unui șasiu al unei echipe iar echipele FTC rar fac public CAD-ul propriului robot.

source: Here are a few publicly available dead wheel designs:
es_mx: He aquí algunos diseños de ruedas muertas disponibles públicamente:
fr_ca: Voici quelques modèles de roues mortes ou non motrices accessibles au public :
ro_ro: Aici sunt câteva design-uri publice cu roți moarte:

source: **Open Odometry by 18219**
es_mx: **Odometría Abierta por 18219**
fr_ca: **Odométrie ouverte par 18219**
ro_ro: **Open Odometry, făcut de echipa 18219**

source: Utilizes the REV Through-Bore Encoder
es_mx: Utiliza el REV Through-Bore Encoder
fr_ca: Utilise l'encodeur traversant REV
ro_ro: Utilizeaza Encoderul REV Through-Bore

source: Most popular and robust publicly available design
es_mx: El diseño más popular y robusto disponible públicamente
fr_ca: Le modèle le plus populaire et le plus robuste disponible pour le public
ro_ro: Un design foarte popular și robust disponibil public

source: Compact enough to fit into a goBILDA channel
es_mx: Suficientemente compacto para caber en un canal goBILDA
fr_ca: Suffisamment compact pour tenir dans un canal goBILDA
ro_ro: Suficient de compact să încapă într-un canal goBILDA

source: **Things to consider**:
es_mx: Cosas a tener en cuenta:
fr_ca: **Les éléments à prendre en compte** :
ro_ro: **Lucruri de luat în considerare**:

source: Utilizes Rotacaster 35mm wheels from Australia. Shipping may take a while
es_mx: Utiliza ruedas Rotacaster de 35 mm de Australia. El envío puede tardar un poco
fr_ca: Utilise des roues Rotacaster de 35 mm en provenance d'Australie. L'expédition peut prendre un certain temps
ro_ro: Utilizează roți Rotacaster de 35mm din Australia. Livrarea ar putea dura ceva timp (notă de la plex: livrarea nu ar fi disponibilă pentru România lol)

source: Information only available through their Discord channel
es_mx: Información disponible únicamente a través de su canal de Discord
fr_ca: Informations disponibles uniquement sur leur canal Discord
ro_ro: Informații disponibile doar prin chat-ul lor de Discord

source: Hasn't been iterated on in a while
es_mx: No se ha iterado en un tiempo
fr_ca: Il n'y a pas eu d'itération depuis un certain temps.
ro_ro: Nu a mai fost actualizat de ceva timp

source: **No longer recommended as it utilizes the E8T**
es_mx: **Ya no se recomienda porque utiliza el E8T.
fr_ca: **Il n'est plus recommandé car il utilise l'E8T**.
ro_ro: **Nu mai este recomandat deoarece folosește E8T**

source: Spring Tensioning
es_mx: Tensado de resortes
fr_ca: Tension des ressorts
ro_ro: Tensionarea cu Arc

source: It is *highly* recommended that your dead wheel design includes some form of spring tensioning that pushes the wheel into the ground. This ensures that the wheel is always in contact with ground and has adequate traction. Sufficient force is required to ensure constant traction to prevent the wheels from slipping. Keep in mind that too much force may lift a light drive train off the ground and disrupt driving.
es_mx: Es *altamente* recomendable que el diseño de su rueda muerta incluya algún tipo de resorte tensor que empuje la rueda hacia el suelo. Esto garantiza que la rueda esté siempre en contacto con el suelo y tenga la tracción adecuada. Se requiere una fuerza suficiente para garantizar una tracción constante y evitar que las ruedas patinen. Tenga en cuenta que demasiada fuerza puede levantar del suelo un chasis ligero e interrumpir la conducción.
fr_ca: Il est *vivement* recommandé que la conception de votre roue morte comprenne une forme de tension de ressort qui pousse la roue dans le sol. Cela permet de s'assurer que la roue est toujours en contact avec le sol et qu'elle a une traction adéquate. Une force suffisante est nécessaire pour assurer une traction constante et empêcher les roues de glisser. Il faut garder à l'esprit qu'une force trop importante peut soulever un châssis léger du sol et perturber la conduite.
ro_ro: Este *foarte* recomandat ca roțile tale moarte să conțină o formă de arcuire care împinge roata în pământ. Acest lucru asigură faptul că roata are contact permanent cu pământul și are tracțiune adecvată. Suficientă forță este necesară pentru a asigura tracțiune constantă pentru a preveni ca roata să alunece. Ține minte că prea multă forță poate ridica șasiul de pe pământ și să întrerupă mișcarea.

source: The most popular method of spring tensioning is to pivot your pod around a point and provide a rotational force via a spring or rubber band.
es_mx: El método más popular para tensar los resortes consiste en hacer pivotar la cápsula alrededor de un punto y aplicar una fuerza de rotación mediante un resorte o una goma elástica.
fr_ca: La méthode la plus courante de tension des ressorts consiste à faire pivoter le pod autour d'un point et à exercer une force de rotation à l'aide d'un ressort ou d'un élastique.
ro_ro: Cea mai populară metodă de a tensiona cu arc este să îți pivotezi capsula în jurul unui punct și să obții o forță rotațională printr-un arc sau bandă elastică.

source: A demonstration of pivoting spring tensioning
es_mx: Demostración del tensado de resortes pivotantes
fr_ca: Démonstration de la tension d'un ressort pivotant
ro_ro: O demonstrație a pivotării prin arcuire

source: FTC 14320's spring tensioning
es_mx: Tensado de resorte del equipo de FTC 14320
fr_ca: Tension du ressort du FTC 14320
ro_ro: Arcuirea echipei 14320

source: A much more niche option is to vertically spring odometry pods. The idea is that springing around a pivot will cause the dead wheels to move in the axis parallel to the ground if the height of the dead wheels relative to the ground changes. Vertically sprung odometry pods will not experience such an issue. However, this is not really an issue that most teams will experience. Vertically springing is much harder to design well and is not recommended for the relatively minor improvement in accuracy it yields.
es_mx: Una opción mucho más especializada consiste en mecer verticalmente las cápsulas de odometría. La idea es que la suspensión alrededor de un pivote hará que las ruedas muertas se muevan en el eje paralelo al suelo si cambia la altura de las ruedas muertas con respecto al suelo. Las cápsulas de odometría con resortes verticales no experimentarán este problema. Sin embargo, esto no es realmente un problema que la mayoría de los equipos experimentarán. La suspensión vertical es mucho más difícil de diseñar bien y no se recomienda por la mejora relativamente pequeña de la precisión que proporciona.
fr_ca: Une option beaucoup plus spécialisée consiste à utiliser des nacelles d'odométrie à ressort vertical. L'idée est qu'un ressort autour d'un pivot entraîne le déplacement des roues mortes dans l'axe parallèle au sol si la hauteur des roues mortes par rapport au sol change. Les nacelles d'odométrie à ressort vertical ne connaîtront pas ce problème. Toutefois, ce n'est pas vraiment un problème auquel la plupart des équipes seront confrontées. L'élasticité verticale est beaucoup plus difficile à concevoir et n'est pas recommandée pour l'amélioration relativement mineure de la précision qu'elle apporte.
ro_ro: O altă opțiune este să arcuiești vertical capsulele de odometrie. Ideea este că arcuirea în jurul unui punct de pivotare va cauza ca roțile moarte să se miște în axul pararel cu pământul dacă înălțimea roților moarte relativ cu pământul se schimbă. Capsulele arcuite vertical nu vor avea această problemă. Însă, nu este o problemă așa mare, din moment ce majoritatea echipelor nu o vor întalni. Arcuirea vericală este mult mai greu de modelat bine și nu este recomandată pentru îmbunătățirea minoră în acuratețe pe care o obține.

source: An example of vertical spring tensioning
es_mx: Un ejemplo de tensado vertical de resortes
fr_ca: Un exemple de tension verticale des ressorts
ro_ro: Un exemplu de tensionare cu arc verticală
