Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/dead-wheels.po
Languages: es_mx, fr_ca, ro_ro

source: Dead Wheels
es_mx: Ruedas muertas
fr_ca: Roues non motrice
ro_ro: Roți Moarte

source: This is a very niche aspect of design in FTC\ |reg|. Generally it is something done by more experienced teams who have had time to repeatedly test their designs and mechanisms with software during the off-season.
es_mx: Este es un aspecto muy nicho del diseño en FTC |reg|. Generalmente es algo que hacen los equipos más experimentados, que han tenido tiempo de probar repetidamente sus diseños y mecanismos con software durante el off-season.
fr_ca: Il s'agit d'un aspect très particulier de la conception dans le cadre de FTC. Il est généralement le fait d'équipes plus expérimentées qui ont eu le temps de tester à plusieurs reprises leurs conceptions et leurs mécanismes avec des logiciels pendant l'intersaison.

source: The term dead wheels, tracking wheels, odometry pods, and odometry are often conflated in the FTC community. However, there are a few key differences one must keep in mind. Odometry is an umbrella term and refers to the general use of motion sensors for localization purposes. Meanwhile, dead wheels, tracking wheels, and odometry pods are all synonymous terms.
es_mx: Los términos ruedas muertas, ruedas de seguimiento, cápsulas de odometría y odometría se confunden a menudo en la comunidad de FTC. Sin embargo, hay algunas diferencias clave que hay que tener en cuenta. La odometría es un término genérico que se refiere al uso general de sensores de movimiento con fines de localización. Mientras tanto, ruedas muertas, ruedas de seguimiento y cápsulas de odometría son términos sinónimos.
fr_ca: Les termes “roues folles” ou non motrices, “roues de suivi”, “modules d’odométrie” et “odométrie” sont souvent confondus au sein de la communauté FTC. Cependant, il existe quelques différences essentielles qu'il convient de garder à l'esprit. L'odométrie est un terme générique qui fait référence à l'utilisation générale de capteurs de mouvement à des fins de localisation. En revanche, les roues non motrices, les roues de poursuite et les nacelles d'odométrie sont des termes synonymes.
ro_ro: Termenul de roți moarte, roți de monitorizare, capsule de odometrie, și odometria sunt de obicei confundate în comunitatea FTC. Totuși, există câteva diferențe cheie pe care trebuie să le reții. Odometria este un termen umbrelă și se referă la folosirea generală a senzorilor de mișcare în scopul localizării. Între timp, roțile moarte, roțile de monitorizare și capsulele de odometrie sunt toate termeni sinonimi.

source: Term
es_mx: Términos
fr_ca: Durée
ro_ro: Termen

source: Dead Wheel
es_mx: Rueda muerta
fr_ca: Roue non motrice
ro_ro: Roata Moartă

source: A small unpowered wheel (usually an :term:`omni wheel <Omni Wheel>`) that tracks the distance the robot has traveled through the encoder attached to the wheel's axle.
es_mx: Una pequeña rueda sin motor (normalmente una :term:`rueda omni <Omni Wheel>`) que realiza un seguimiento de la distancia que ha recorrido el robot a través del codificador acoplado al eje de la rueda.
fr_ca: Une petite roue non motorisée (généralement une :term:` roueomni <Omni Wheel>`) qui suit la distance parcourue par le robot grâce à l'encodeur attaché à l'axe de la roue.
ro_ro: O roată mică fără putere (de obicei o :term:`roată omni<Omni Wheel>`) care monitorizează distanță pe care robotul a parcurs-o prin encoderul atașat la axul roții.

source: Usually, there will be two or three wheels - one or two on the x and y axis each to track the front-back and left-right position relative to the starting point. Generally, odometry wheels are sprung so that the wheel is in contact with the floor tiles at all times to ensure accuracy.
es_mx: Normalmente, habrá dos o tres ruedas: una o dos en los ejes x e y para seguir la posición delante-detrás y a la izquierda-derecha en relación con el punto de partida. Por lo general, las ruedas de odometría tienen muelles para que la rueda esté en contacto con las baldosas del suelo en todo momento para garantizar la precisión.
fr_ca: En général, il y a deux ou trois roues - une ou deux sur les axes x et y pour suivre la position avant-arrière et gauche-droite par rapport au point de départ. En général, les roues odométriques sont suspendues de manière à ce que la roue soit toujours en contact avec les tuiles du sol afin de garantir la précision.
ro_ro: De obicei, există două sau trei roți - una sau două pe axele X si Y pentru a monitoriza poziția față-spate și stânga-dreapta relativă cu punctul de start. În general, roțile de odometrie sunt arcuite pentru a ține roata în contact cu plăcile de spumă tot timpul pentru a asigura acuratețe.

source: Odometry refers to the use of motion sensors for localization. Localization is a means for being able to locate the position of the bot at some point in time. Localization is crucial in path following and advanced autonomous modes as one needs to know where they are to generate the necessary movements needed to reach a desired destination. :doc:`Localization software </docs/software/concepts/odometry>` plays a major role in odometry; however, in order to produce accurate results, reliable and accurate hardware design is a necessity.
es_mx: La odometría se refiere al uso de sensores de movimiento para la localización. La localización es un medio para poder localizar la posición del robot en un momento dado. La localización es crucial en el seguimiento de trayectorias y en los modos autónomos avanzados, ya que uno necesita saber dónde se encuentra para generar los movimientos necesarios para alcanzar el destino deseado. :doc:`El software de localización </docs/software/concepts/odometry>` desempeña un papel fundamental en la odometría; sin embargo, para producir resultados precisos, es necesario un diseño de hardware fiable y preciso.
fr_ca: L'odométrie fait référence à l'utilisation de capteurs de mouvement pour la localisation. La localisation est un moyen de localiser la position du robot à un moment donné. La localisation est cruciale dans le suivi de trajectoire et les modes autonomes avancés, car il faut savoir où l'on se trouve pour générer les mouvements nécessaires pour atteindre la destination souhaitée. :doc:`Le logiciel de localisation </docs/software/concepts/odometry>` joue un rôle majeur dans l'odométrie ; cependant, pour produire des résultats précis, il est nécessaire de concevoir un matériel fiable et précis.
ro_ro: Odometria se referă la folosirea senzorilor de mișcare pentru localizare. Localizarea reprezintă abilitatea de a localiza poziția robotului într-un punct în timp. Localizarea este esențială pentru urmarea unei traiectorii sau autonomii avansate, din moment ce trebuie să știi unde te afli pentru a genera mișcările necesare pentru a ajunge la o destinație dorită. :doc:`software-ul de localizare </docs/software/concepts/odometry>` joacă un rol important în odometrie; totuși, ca să produci rezultate precise, hardware-ul fiabil este o necesitate.

source: The simplest form of odometry is drive encoder localization. This is the use of encoders measuring the rotation of motors that power the drive train. One is able to read the encoder data and feed it through the kinematic equation for that specific drive train to derive the body's velocity. Drive encoder localization is generally quite simple and easy to setup as almost all of the FTC legal motors have built-in encoders. Getting drive encoder localization setup is simply a matter of plugging in wires, no additional hardware needed.
es_mx: La forma más sencilla de odometría es la localización por codificador de accionamiento. Se trata del uso de codificadores que miden la rotación de los motores que accionan el chasis. Se leen los datos del codificador y se introducen en la ecuación cinemática del chasis específico para obtener la velocidad del cuerpo. Por lo general, la localización del codificador de accionamiento es bastante sencilla y fácil de configurar, ya que casi todos los motores legales FTC tienen codificadores incorporados. Conseguir la localización del codificador de accionamiento es simplemente una cuestión de conectar los cables, sin necesidad de hardware adicional.
fr_ca: La forme la plus simple d'odométrie est la localisation par codeur d'entraînement. Il s'agit de l'utilisation d'encodeurs mesurant la rotation des moteurs qui alimentent le châssis. Il est possible de lire les données de l'encodeur et de les introduire dans l'équation cinématique de ce châssis spécifique afin d'en déduire la vitesse du corps. La localisation de l'encodeur de l'entraînement est généralement assez simple et facile à mettre en place, car presque tous les moteurs légaux de FTC sont équipés d'encodeurs intégrés. L'installation de la localisation du codeur d'entraînement consiste simplement à brancher des fils, sans matériel supplémentaire.
ro_ro: Cea mai simplă formă de odometrie este localizarea prin encoderele motoarelor. Aceasta folosește encoderele care măsoară rotația motoarelor care pun în mișcare șasiul. Prin această metodă poți să citești datele encoderelor și să o folosești prin ecuația cinematică pentru tipul acela de șasiu pentru a deriva velocitatea corpului. Localizarea prin encoderele motoarelor este în general destul de simplă și ușor de setat pentru aproape toate motoarele FTC legale cu encodere incorporate. Trebuie doar să conectezi câteva cabluri, fără hardware adițional necesar.

source: Many teams in the community have converged on a unique solution that isn't seen very much outside of FTC: the use of "dead wheels," "tracking wheels," or "odometry pods" (these terms are all synonymous). These refer to small "dead" or non-driven (not powered by a motor) wheels attached to an `encoder sensor <#encoders>`_. Two or three dead wheel pods are often sprung to the ground to ensure accurate tracking. The two-wheel design utilizes one parallel and one perpendicular pod (parallel and perpendicular with respect to the drive wheel axis), measuring x and y movement respectively. Change in heading is measured via a gyroscope. The three-wheel design utilizes two parallel and one perpendicular pod, measuring x and y movement respectively. However, this design forgoes the gyroscope and instead measures heading via the difference with the two parallel wheels. This is often more accurate in the context of the FTC control system because the BNO055 IMU (used for the gyroscope in the two-wheel design) utilizes I2C which is slower than the rest of the I/O on the REV Hub and cannot be bulk read. These two issues lead to minute drift issues which can compound over time, thus leading to a more inaccurate localization system when using the two-wheel design.
es_mx: Muchos equipos de la comunidad han convergido en una solución única que no se ve mucho fuera de FTC: el uso de "ruedas muertas", "ruedas de seguimiento" o "cápsulas de odometría" (todos estos términos son sinónimos). Se trata de pequeñas ruedas "muertas" o no propulsadas (no accionadas por un motor) unidas a un `sensor codificador <#encoders>`_. A menudo, dos o tres ruedas muertas se apoyan en el suelo para garantizar un seguimiento preciso. El diseño de dos ruedas utiliza una cápsula paralela y otra perpendicular (paralela y perpendicular con respecto al eje de la rueda del chasis), que miden el movimiento x e y respectivamente. El cambio de rumbo se mide mediante un giroscopio. El diseño de tres ruedas utiliza dos cápsulas paralelas y una perpendicular, que miden el movimiento x e y respectivamente. Sin embargo, este diseño renuncia al giroscopio y en su lugar mide el rumbo a través de la diferencia con las dos ruedas paralelas. Esto es a menudo más preciso en el contexto del sistema de control FTC porque el BNO055 IMU (utilizado para el giroscopio en el diseño de dos ruedas) utiliza I2C que es más lento que el resto de la E / S en el Hub REV y no se puede leer a granel. Estos dos problemas conducen a problemas de desvío de minutos que pueden agravarse con el tiempo, lo que lleva a un sistema de localización más inexacta cuando se utiliza el diseño de dos ruedas.
fr_ca: De nombreuses équipes de la communauté ont convergé vers une solution unique que l'on ne voit pas beaucoup en dehors de FTC : l'utilisation de "roues non motrices", de "roues de poursuite" ou de "pods d'odométrie" (ces termes sont tous synonymes). Il s'agit de petites roues "mortes" ou non motrices (qui ne sont pas mues par un moteur) attachées à un encodeur <#encoders>`_. Deux ou trois roues non mortes sont souvent suspendues au sol pour assurer un suivi précis. La conception à deux roues utilise une nacelle parallèle et une nacelle perpendiculaire (parallèle et perpendiculaire par rapport à l'axe de la roue motrice), mesurant respectivement les mouvements x et y. Le changement de cap est mesuré à l'aide d'un gyroscope. Le changement de cap est mesuré par un gyroscope. Le modèle à trois roues utilise deux nacelles parallèles et une nacelle perpendiculaire, mesurant respectivement les mouvements x et y. Cependant, ce modèle renonce au gyroscope et mesure le cap par la différence avec les deux roues parallèles. Ceci est souvent plus précis dans le contexte du système de contrôle FTC parce que l'IMU BNO055 (utilisé pour le gyroscope dans la conception à deux roues) utilise I2C qui est plus lent que le reste des E/S sur le REV Hub et ne peut pas être lu en bloc. Ces deux problèmes entraînent des dérives minimes qui peuvent s'aggraver avec le temps, ce qui conduit à un système de localisation plus imprécis lorsque l'on utilise la conception à deux roues.
ro_ro: Multe echipe din comunitate au convenit o soluție unică care nu este văzută foarte mult în afara FTC-ului: folosirea "roților moarte", "roților de monitorizare", sau "capsulelor de odometrie" (acesti termeni sunt sinonimi). Acestea se referă la roți "moarte" sau fără putere (de la un motor) atașate la un `senzor (encoder) <#encoders>`_. Capsulele cu două sau trei roți moarte sunt de obicei arcuite pentru a asigura contact permanent cu pământul / acuratețe. Design-ul cu două roți folosește una pararelă și una perpendiculară (la axul motoarelor de șasiu), măsurând mișcarea X și Y. O schimbare în direcție este măsurată prin giroscop. Design-ul cu trei roți folosește două capsule pararele și una perpendiculară, măsurând mișcarea X și Y. Însă, acest design uită de giroscop și în schimb măsoară direcția prin diferența dintre cele două capsule pararele. Această metodă este mai precisă deoarece BNO055 IMU (folosit pentru giroscop în design-ul anterior) utilizează I2C care este mai încet decât restul I/O-ul de pe REV Hub și nu poate citi în masă (bulk read). Aceste două probleme pot duce la probleme de abatere care se adună în timp, astfel ducând la o localizare imprecisă atunci când folosești design-ul cu două roți.

source: However, designing consistently accurate dead wheels proves to be a difficult design challenge. It is often quite pricey. A set of three dead wheels will cost a minimum of $100 for the encoders alone, prior to any hardware.
es_mx: Sin embargo, diseñar ruedas muertas de precisión constante resulta un reto de diseño difícil. Además, suele ser bastante caro. Un juego de tres ruedas muertas costará como mínimo 100 dólares sólo por los codificadores, antes de cualquier hardware.
fr_ca: Cependant, la conception de roues non motrices d'une précision constante s'avère être un défi difficile à relever. Elle est souvent très coûteuse. Un jeu de trois roues non motrices coûtera au minimum 100$ pour les seuls encodeurs, avant tout matériel.
ro_ro: Însă, modelarea unui sistem cu roți moarte consistent se dovedește a fi o provocare dificilă de design. Este de obicei scump. Un set de trei roți moarte costă minim 100$ (490 Lei) pentru encodere, înainte de orice hardware.

source: Let's go through the advantages and disadvantages of each system.
es_mx: Veamos las ventajas e inconvenientes de cada sistema.
fr_ca: Passons en revue les avantages et les inconvénients de chaque système.
ro_ro: Hai să trecem prin avantajele și dezavantajele fiecărui sistem.

source: Drive Encoder Localization
es_mx: Localización del codificador de accionamiento
fr_ca: Localisation à l’aide des encodeurs du châssis
ro_ro: Localizarea prin Encoderele Motoarelor

source: **Pros**:
fr_ca: **Avantages** :
ro_ro: **Pro**:

source: Cheap (the motors you're using most likely already have encoders built in)
es_mx: Barato (lo más probable es que los motores que utilices ya incorporen codificadores (encoders)).
fr_ca: Bon marché (les moteurs que vous utilisez sont probablement déjà équipés d'encodeurs)
ro_ro: Ieftin (motoarele pe care le folosești cel mai probabil au deja encodere integrate)

source: Very little configuration necessary
es_mx: Se necesita muy poca configuración
fr_ca: Très peu de configuration nécessaire
ro_ro: Puțin efort depus

source: **Cons**:
fr_ca: **Inconvénients** :
ro_ro: **Contra**:

source: Drive encoder localization on mecanum drive can be quite inaccurate due to lack on traction on mecanum wheels.
es_mx: La localización del codificador del accionamiento mecanum puede ser bastante imprecisa debido a la falta de tracción de las ruedas mecanum.
fr_ca: La localisation de l'encodeur du châssis sur un châssis mecanum peut être assez imprécise en raison du manque de traction sur les roues mecanums.
ro_ro: Această metodă de localizare pe șasiurile mecanum poate fi destul de inprecisă din cauza lipsei tracțiunii pe roțile mecanum.

source: Will drift on high acceleration on mecanum drive. Accuracy will be good enough for basic autonomous modes if acceleration is limited
es_mx: Se desviará en aceleraciones altas con accionamiento mecánico. La precisión será suficiente para los modos autónomos básicos si se limita la aceleración.
fr_ca: Dérivera en cas de forte accélération sur le système de châssis mecanum. La précision sera suffisante pour les modes autonomes de base si l'accélération est limitée.
ro_ro: Va aluca la accerelații puternice pe șasiurile mecanum. Acuratețea va fi destul de bună pentru autonomii simple dacă accerelația este limitată.

source: Two-Wheel Odometry Pods
es_mx: Cápsulas de odometría de dos ruedas
fr_ca: Nacelles d'odométrie à deux roues
ro_ro: Capsule de Odometrie cu Două Roți

source: Cheaper than 3-wheel design
es_mx: Más barato que el diseño de 3 ruedas
fr_ca: Moins cher que le modèle à 3 roues
ro_ro: Mai ieftine decât design-ul cu 3 roți

source: Pretty good accuracy
es_mx: Bastante buena precisión
fr_ca: Assez bonne précision
ro_ro: Acuratețe destul de bună

source: No tuning of the heading necessary
es_mx: No es necesario ajustar el rumbo
fr_ca: Aucun réglage du cap n'est nécessaire
ro_ro: Nu este necesar reglajul pe direcție

source: Subject to more drift than the 3-wheel design
es_mx: Sujeto a más desvío que el diseño de 3 ruedas
fr_ca: Sujet à plus de dérive que le modèle à 3 roues
ro_ro: Se poate abate de la drum mai ușor decât design-ul cu 3 roți

source: Three-Wheel Odometry Pods
es_mx: Cápsulas de odometría de tres ruedas
fr_ca: Nacelles d'odométrie à trois roues
ro_ro: Capsule de Odometrie cu Trei Roți

source: Relatively accurate tracking. Great accuracy in a 30-second autonomous mode
es_mx: Seguimiento relativamente preciso. Gran precisión en un modo autónomo de 30 segundos.
fr_ca: Suivi relativement précis. Grande précision en mode autonome de 30 secondes
ro_ro: Localizare destul de precisă. Acuratețe bună într-o autonomie de 30 de secunde

source: Quite pricey
es_mx: Bastante caro
fr_ca: Assez cher
ro_ro: Destul de scump

source: Tuning of the heading is very important
es_mx: Es muy importante afinar el rumbo
fr_ca: L'ajustement du cap est très important
ro_ro: Reglajul direcției este destul de important

source: Encoders
es_mx: Codificadores (Encoders)
fr_ca: Encodeurs
ro_ro: Encodere

source: A lot of the localization done in software relies on readings from encoders. :ref:`encoders` are sensors that track "counts" or "ticks," which are values that represent a certain amount of a rotation. Different encoders might have a different number of counts per revolution (CPR), which is also sometimes also called ticks per revolution. The greater the number of counts, the more precise the data.
es_mx: Gran parte de la localización realizada en software se basa en las lecturas de los encóderes. :ref:`encóderes` son sensores que realizan un seguimiento de los "recuentos" o "ticks", que son valores que representan una cierta cantidad de una rotación. Diferentes codificadores pueden tener un número diferente de cuentas por revolución (CPR), que a veces también se llama ticks por revolución. Cuanto mayor sea el número de cuentas, más precisos serán los datos.
fr_ca: Une grande partie de la localisation effectuée dans les logiciels repose sur les relevés des encodeurs. Les :ref:`encodeurs` sont des capteurs qui suivent les "comptes" ou les "ticks", qui sont des valeurs représentant une certaine quantité d'une rotation. Différents codeurs peuvent avoir un nombre différent de comptes par révolution (CPR), qui est aussi parfois appelé ticks par révolution. Plus le nombre de comptes est élevé, plus les données sont précises.
ro_ro: Multe din localizările făcute în software se bazează pe citirea din encodere. :ref:`Encoderele` sunt senzori care înregistrează "pașii" sau "ticks", care sunt valori care reprezintă un anumit grad de rotație. Encoderele pot avea un număr diferit de citiri pe revoluție (CPR), care de asemenea uneori se numește și tick-uri pe revoluție. Cu cât numărul acesta este mai mare, cu cât datele sunt mai precise.

source: Encoders are plugged into the JST-PH ports in the REV hubs. These encoders can either be built-in to the motors or external. External encoders will still need to be plugged into an encoder port but are not related to the motor in that port. Through software, we can use the motor object to determine the position of the encoder. This should be done with motors that do not use encoders. If you're using dead wheels, you will not need the drive motor encoder ports, so those are potential ports you might want to use.
es_mx: Los codificadores se conectan a los puertos JST-PH de los REV hubs. Estos codificadores pueden ser incorporados a los motores o externos. Los encoders externos aún necesitarán ser conectados a un puerto de encoder pero no están relacionados con el motor en ese puerto. A través del software, podemos utilizar el objeto motor para determinar la posición del encoder. Esto debe hacerse con motores que no utilicen encoders. Si estás usando ruedas muertas, no necesitarás los puertos de encoder del motor de accionamiento, así que esos son puertos potenciales que podrías querer usar.
fr_ca: Les encodeurs sont branchés dans les ports JST-PH des moyeux REV. Ces encodeurs peuvent être intégrés aux moteurs ou externes. Les encodeurs externes doivent toujours être branchés sur un port d'encodeur, mais ils ne sont pas liés au moteur de ce port. Le logiciel permet d'utiliser l'objet moteur pour déterminer la position de l'encodeur. Cela doit être fait avec des moteurs qui n'utilisent pas d'encodeurs. Si vous utilisez des roues mortes, vous n'aurez pas besoin des ports d'encodage du moteur d'entraînement, ce sont donc des ports potentiels que vous pourriez vouloir utiliser.
ro_ro: Encoderele sunt conectate la porturile JST-PH ale hub-urilor REV. Aceste encodere pot fie să fie integrate în motoare sau externe. Encoderele externe vor trebui să fie conectate într-un port de encoder însă nu sunt în relație cu motorul din acel port. Prin software, putem folosi obiectul motorului pentru a determina poziția encoderului. Acest lucru ar trebui să fie făcut cu motoare care nu folosesc encodere. Dacă folosești roți moarte, nu vei avea nevoie de porturile motoarelor de pe șasiu, deci acelea sunt porturile pe care ai putea să le folosesti.
