Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/design-tradeoffs.po
Languages: es_mx, fr_ca

source: Design Tradeoffs
es_mx: Compensaciones de Diseño
fr_ca: Compromis de conception

source: **Problem**
es_mx: **Problema**
fr_ca: **Problème**

source: **2 motor drivetrain**
es_mx: **Chasis de 2 motores**
fr_ca: **Châssis à 2 moteurs**

source: Less power
es_mx: Menos potencia
fr_ca: Moins de puissance

source: Less acceleration
es_mx: Menos aceleración
fr_ca: Moins d'accélération

source: **4 motor drivetrain**
es_mx: **Chasis de 4 motores**
fr_ca: **Châssis à 4 moteurs**

source: Ability to traverse obstacles
es_mx: Capacidad para atravesar obstáculos
fr_ca: Capacité à franchir des obstacles

source: Improved power and acceleration
es_mx: Mayor potencia y aceleración
fr_ca: Amélioration de la puissance et de l'accélération

source: Poor agility/manuverability
es_mx: Poca agilidad/maniobrabilidad
fr_ca: Manque d'agilité/maniabilité

source: Poor top speed
es_mx: Poca velocidad máxima
fr_ca: Vitesse de pointe médiocre

source: **Mecanum, 6WD, etc.**
fr_ca: **Mecanum, 6 roues motrices, etc.**

source: More agile, higher top speed
es_mx: Más ágil, mayor velocidad maxima
fr_ca: Plus agile, vitesse de pointe plus élevée

source: Customizable gear ratio
es_mx: Relación de engranes personalizable
fr_ca: Rapport de vitesse personnalisable

source: **Claw**
es_mx: *Garra**
fr_ca: **Pince**

source: Controls 1 element at a time
es_mx: Controla 1 elemento a la vez
fr_ca: Contrôle 1 élément à la fois

source: Easy to break
es_mx: Fácil de romper
fr_ca: Facile à casser

source: **Intake**
fr_ca: **Ramassage**

source: Controls multiple elements at a time
es_mx: Controla varios elementos a la vez
fr_ca: Contrôle de plusieurs éléments à la fois

source: Much more efficient
es_mx: Mucho más eficaz
fr_ca: Beaucoup plus efficace

source: **Spur gear gearboxes**
es_mx: **Cajas de engranajes rectos**
fr_ca: **Réducteurs à engrenages droits**

source: Not for high load use cases
es_mx: No para casos de uso de alta carga
fr_ca: Pas pour les cas d'utilisation à forte charge

source: Will break under shock load
es_mx: Se romperá bajo carga de choque
fr_ca: Rupture sous l'effet d'un choc

source: **Planetary gearboxes**
es_mx: **Cajas de engranes planetarios**
fr_ca: **Réducteurs planétaires**

source: Better for drivetrains and high load
es_mx: Mejor para chasises y cargas elevadas
fr_ca: Meilleur pour les châssis et les charges élevées

source: Resistant to shock loads
es_mx: Resistente a las cargas de choque
fr_ca: Résistance aux chocs

source: **Single/multi-axis arm**
es_mx: **Brazo de uno o varios ejes**
fr_ca: **Bras à un ou plusieurs axes**

source: Often needs high gear ratio
es_mx: A menudo necesita una relación de engranaje alta
fr_ca: Nécessite souvent un rapport de démultiplication élevé

source: More complex than linear extension
es_mx: Más complejo que la extensión lineal
fr_ca: Plus complexe que l'extension linéaire

source: **Linear extension**
es_mx: **Extensión lineal**
fr_ca: **Extension linéaire**

source: Generally faster than arms
es_mx: Generalmente más rápido que los brazos
fr_ca: Généralement plus rapide que les bras

source: Much more precise
es_mx: Mucho más preciso
fr_ca: Beaucoup plus précis

source: 2 Motor Drivetrain |rarr| 4 Motor Drivetrain
es_mx: Chasis de 2 Motores |rarr| Chasis de 4 Motores
fr_ca: Châssis à 2 moteurs |rarr| Châssis à 4 moteurs

source: In general, it is not recommended for teams to use 2 motors on the drivetrain, but instead use 4. This is mainly due to the added power and increased acceleration 4 motors provide.
es_mx: En general, no se recomienda que los equipos utilicen 2 motores en el chasis, sino 4. Esto se debe principalmente a la mayor potencia y aceleración que proporcionan 4 motores.
fr_ca: En général, il n'est pas recommandé aux équipes d'utiliser 2 moteurs sur le châssis, mais plutôt 4. Cela est principalement dû à la puissance et à l'accélération accrues que procurent 4 moteurs.

source: Typically, top speed is determined by the gear ratio and the motor specifications, not the number of motors. **However**, acceleration is affected by the number of motors, and as FTC\ |reg| robots need to change direction and accelerate numerous times per match, slow acceleration has a significant adverse effect on the competitiveness of the robot. In addition, 2 motor robots may struggle to get over obstacles or climb up ramps, due to less power. One question that often comes up is "don't I need more motors for other things on the robot?" This is a valid question, but the answer is generally no. It is possible to build a competitive robot with 4 motors allocated to drivetrain, and 4 motors for other mechanisms, so there should be no reason to skimp. Do remember that the drivetrain is the foundation of the robot. Your mechanisms will not be anywhere near optimized if the drivetrain can't get your robot from A to B quickly and efficiently. There has not been a game in FTC history where the top robots needed >4 motors for the drivetrain, so this is a pretty safe rule to follow.
es_mx: Normalmente, la velocidad máxima está determinada por la relación de engranajes y las especificaciones del motor, no por el número de motores. Sin embargo, la aceleración se ve afectada por el número de motores, y como los robots FTC necesitan cambiar de dirección y acelerar varias veces por partida, una aceleración lenta tiene un efecto adverso significativo en la competitividad del robot. Además, los robots con 2 motores pueden tener dificultades para superar obstáculos o subir rampas debido a la menor potencia. Una pregunta que suele surgir es "¿no necesito más motores para otras cosas en el robot?" Esta es una pregunta válida, pero la respuesta generalmente es no. Es posible construir un robot competitivo con 4 motores asignados al chasis y 4 motores para otros mecanismos, por lo que no debería haber motivo para escatimar. Recuerda que el chasis es la base del robot. Tus mecanismos no estarán optimizados si el chasis no puede llevar tu robot de A a B de manera rápida y eficiente. No ha habido un juego en la historia de FTC donde los mejores robots necesitaran >4 motores para el chasis, por lo que esta es una regla bastante segura de seguir.
fr_ca: En règle générale, la vitesse maximale est déterminée par le rapport de vitesse et les spécifications du moteur, et non par le nombre de moteurs. **Cependant, l'accélération est affectée par le nombre de moteurs et, comme les robots de FTC\ |reg| doivent changer de direction et accélérer plusieurs fois par match, une accélération lente a un effet négatif important sur la compétitivité du robot. En outre, les robots à 2 moteurs peuvent avoir du mal à franchir des obstacles ou à monter des rampes, en raison d'une puissance moindre. Une question revient souvent : "N'ai-je pas besoin de plus de moteurs pour d'autres choses sur le robot ?". C'est une question valable, mais la réponse est généralement non. Il est possible de construire un robot compétitif avec 4 moteurs alloués à la transmission et 4 moteurs pour d'autres mécanismes, il n'y a donc aucune raison de lésiner. N'oubliez pas que le châssis est la base du robot. Vos mécanismes ne seront pas optimisés si le châssis ne peut pas amener votre robot de A à B rapidement et efficacement. Il n'y a pas eu un seul jeu dans l'histoire de FTC où les meilleurs robots ont eu besoin de plus de 4 moteurs pour le châssis, c'est donc une règle assez sûre à suivre.

source: Pushbot |rarr| Mecanum, 6WD, Other Recommended Drivetrains
es_mx: Pushbot |rarr| Mecanum, 6WD, chasises recomendados
fr_ca: Pushbot |rarr| Mecanum, 6 roues motrices, autres transmissions recommandées

source: The pushbot drivetrain, commonly built by first-year teams using the *FIRST*\ |reg|-provided guides, is not recommended as a competitive drivetrain.
es_mx: El chasis pushbot, comúnmente construida por equipos de primer año usando las guías proporcionadas por *FIRST*\, no se recomienda como chasis competitivo.
fr_ca: Le châssis pushbot, couramment construit par les équipes de première année à l'aide des guides *FIRST*\ |reg|, n'est pas recommandé comme châssis de compétition.

source: We do recommend teams who have purchased the Tetrix kit to build it for educational purposes only - that is, to get familiarized with the parts and basic building principles using a :term:`channel-based <Channel>` kit. However, we do not advise that teams use that pushbot at a competition due to its many flaws.
es_mx: Recomendamos a los equipos que hayan comprado el kit Tetrix que lo construyan sólo con fines educativos, es decir, para familiarizarse con las piezas y los principios básicos de construcción utilizando un kit :term:`basado en canales <Channel>`. Sin embargo, no aconsejamos que los equipos utilicen ese pushbot en una competencia debido a sus muchos defectos.
fr_ca: Nous recommandons aux équipes qui ont acheté le kit Tetrix de le construire à des fins éducatives uniquement - c'est-à-dire pour se familiariser avec les pièces et les principes de construction de base en utilisant un kit :term:`basé sur des profilés <Channel>`. Cependant, nous ne conseillons pas aux équipes d'utiliser ce pushbot lors d'une compétition en raison de ses nombreux défauts.

source: The pushbot is powered by 2 motors, and as stated above, there isn't a reason to stay with 2 motors on drivetrain.
es_mx: El pushbot es accionado por 2 motores, y como se ha dicho anteriormente, no hay una razón para quedarse con 2 motores en la transmisión.
fr_ca: Le pushbot est alimenté par 2 moteurs, et comme indiqué ci-dessus, il n'y a pas de raison de rester avec 2 moteurs sur le châssis.

source: The pushbot has poor top speed and turning ability, given that the gear ratio (40:1 on 4 inch wheels) is half the speed that many teams use.
es_mx: El pushbot tiene poca velocidad maxima y capacidad de giro, dado que la relación de transmisión (40:1 en ruedas de 4 pulgadas) es la mitad de la velocidad que utilizan muchos equipos.
fr_ca: Le pushbot a une vitesse de pointe et une capacité de virage médiocres, étant donné que le rapport de transmission (40:1 sur des roues de 4 pouces) correspond à la moitié de la vitesse utilisée par de nombreuses équipes.

source: It is not advisable to use direct drive.
es_mx: No es recomendable utilizar la transmisión directa.
fr_ca: Il n'est pas conseillé d'utiliser l'entraînement direct.

source: However, most if not all of these problems will be solved by using a four-motor drivetrain such as the ones recommended in the drivetrain guide (mecanum, 6WD, etc.). Therefore, it is recommended for teams to refer to the :doc:`drivetrain </docs/common-mechanisms/drivetrains/index>` section and see which drivetrain would fit best for their overall game strategy.
es_mx: Sin embargo, la mayoría de estos problemas, si no todos, se resolverán utilizando una chasis de cuatro motores como las recomendadas en la guía de chasis (mecanum, 6WD, etc.). Por lo tanto, se recomienda a los equipos que consulten la sección :doc:`chasis </docs/common-mechanisms/drivetrains/index>` y vean qué chasis se adapta mejor a su estrategia general de juego.
fr_ca: Cependant, la plupart de ces problèmes, si ce n'est tous, seront résolus par l'utilisation d'une transmission à quatre moteurs, comme celles recommandées dans le guide des transmissions (Mécanisme, 6RM, etc.). Il est donc recommandé aux équipes de se référer à la section :doc:`châssis </docs/common-mechanisms/drivetrains/index>` et de voir quelle transmission conviendrait le mieux à leur stratégie de jeu globale.

source: Passive Intake/Claw |rarr| Active Intake
es_mx: Intake Pasivo/Garra |rarr| Intake Activo
fr_ca: Ramasseur/Pince passif(ve) |rarr| Ramasseur actif

source: Active intakes (ones with continuous rotational motion) should always be prioritized over passive intakes and grippers.
es_mx: Los intakes activos (los que tienen un movimiento de rotación continuo) siempre deben tener prioridad sobre los intakes pasivos y las pinzas.
fr_ca: Les ramasseurs actifs (ceux qui ont un mouvement de rotation continu) doivent toujours être privilégiées par rapport aux ramasseurs passeurs et aux pinces.

source: Active intakes are much more efficient and effective in picking up common game elements such as balls, cubes, and rectangular prisms than claws. This has been a widely accepted rule; many Worlds-level robots over the years use intakes. **The exception** is that a claw should be used for irregularly shaped objects that would be impossible to control via intake; for example, the relic in Relic Recovery.
es_mx: Los intakes activos son mucho más eficientes y eficaces que las garras a la hora de recoger elementos comunes del juego, como bolas, cubos y prismas rectangulares. Esta ha sido una regla ampliamente aceptada; muchos robots de nivel Mundial a lo largo de los años utilizan intakes. **La excepción** es que una garra debe utilizarse para objetos de forma irregular que serían imposibles de controlar mediante la ingesta; por ejemplo, la reliquia en Relic Recovery.
fr_ca: Les ramasseurs actifs sont beaucoup plus efficaces pour ramasser les éléments de jeu courants tels que les balles, les cubes et les prismes rectangulaires que les pinces. Il s'agit d'une règle largement acceptée ; de nombreux robots de niveau mondial utilisent des ramasseurs. **L'exception** est qu'une pince doit être utilisée pour les objets de forme irrégulière qu'il serait impossible de contrôler à l'aide d'un ramasseur ; par exemple, la relique dans Relic Recovery.

source: Intakes have two major advantages over claws.
es_mx: Los intakes tienen dos grandes ventajas sobre las garras.
fr_ca: Les ramasseurs présentent deux avantages majeurs par rapport aux pinces.

source: Intakes can control multiple game elements at a time.
es_mx: Los intakes pueden controlar varios elementos del juego a la vez.
fr_ca: Les ramasseurs peuvent contrôler plusieurs éléments de jeu à la fois.

source: Intakes are indiscriminate at picking up objects, making them much more efficient.
es_mx: Los intakes son indiscriminados a la hora de recoger objetos, lo que los hace mucho más eficaces.
fr_ca: Les ramasseurs ne font pas de distinction pour ramasser les objets, ce qui les rend beaucoup plus efficaces.

source: Claws can only pick up one object at a time, and the driver needs to aim the claw at that specific object to grab it. With an intake, the driver does not need to focus on one game element - instead; intakes will just pick up anything in its path, if designed properly. Claws are also prone to breakage, and thus suffer to defensive robots. They are also generally more fragile than intakes. Therefore, active intakes are as a result much more efficient than claws. Nearly every competitive robot from past years has used active intakes to great effect, so there is plenty of precedent to follow.
es_mx: Las garras sólo pueden recoger un objeto a la vez, y el conductor tiene que apuntar la garra a ese objeto específico para cogerlo. Con un intake, el conductor no necesita centrarse en un elemento del juego; en cambio, los intakes recogerán cualquier cosa que encuentren en su camino, si se diseñan adecuadamente. Las garras también son propensas a romperse, por lo que sufren ante los robots defensivos. Además, suelen ser más frágiles que los intakes. Por lo tanto, los intakes activos son mucho más eficientes que las garras. Casi todos los robots de competencia de los últimos años han utilizado intakes activos con gran éxito, así que hay muchos precedentes que seguir.
fr_ca: Les pinces ne peuvent saisir qu'un seul objet à la fois, et le pilote doit viser cet objet spécifique pour le saisir. Avec un ramasseur, le pilote n'a pas besoin de se concentrer sur un seul élément du jeu - au lieu de cela, ils ramasseront tout ce qui se trouve sur leur chemin, s'ils sont conçus correctement. Les pinces sont également sujettes à la casse, et souffrent donc pour les robots défensifs. Elles sont aussi généralement plus fragiles que les ramasseurs. Par conséquent, les ramasseurs actifs sont beaucoup plus efficaces que les pinces. Presque tous les robots de compétition des années passées ont utilisé des ramasseurs actifs avec beaucoup d'efficacité, il y a donc de nombreux précédents à suivre.

source: Spur Gear Gearboxes |rarr| Planetary Gearboxes
es_mx: Cajas de engranajes rectos |rarr| Cajas de engranajes planetarios
fr_ca: Réducteurs à engrenages droits |rarr| Réducteurs planétaires

source: Spur gear gearboxes are fine for most applications for a rookie team. We are not advocating necessarily having to upgrade to planetary motors, but there are some advantages which may become useful in more advanced use cases such as high-load systems.
es_mx: Las cajas de engranajes rectos están bien para la mayoría de las aplicaciones de un equipo novato. No estamos abogando por tener que pasar necesariamente a motores planetarios, pero hay algunas ventajas que pueden llegar a ser útiles en casos de uso más avanzados, como los sistemas de alta carga.
fr_ca: Les réducteurs à engrenages droits conviennent à la plupart des applications pour une équipe débutante. Nous ne préconisons pas de passer nécessairement à des moteurs planétaires, mais ils présentent certains avantages qui peuvent s'avérer utiles dans des cas d'utilisation plus avancés, tels que les systèmes à forte charge.

source: Spur gear gearboxes have inherent disadvantages to planetary gearboxes. Spur gear gearboxes should not be used in high-load situations, primarily because the gears can strip and destroy the gearbox.
es_mx: Las cajas de engranajes rectos presentan desventajas inherentes a las cajas de engranes planetarios. Las cajas de engranajes rectos no deben utilizarse en situaciones de carga elevada, principalmente porque los engranajes pueden desgastarse y destruir la caja de engranajes.
fr_ca: Les réducteurs à engrenages droits présentent des inconvénients inhérents aux réducteurs planétaires. Les réducteurs à engrenages droits ne doivent pas être utilisés dans des situations de forte charge, principalement parce que les engrenages peuvent se déchirer et détruire le réducteur.

source: An example would be a drivetrain that has to change directions repeatedly and quickly. Planetary gearboxes are much better suited for drivetrain and arms, due to the configuration of the sun and planet gears. In addition, spur gear gearboxes are prone to shock loads; therefore, direct drive is not advisable on drivetrains. Refer to the :doc:`gearbox anatomy </docs/power-and-electronics/motor-guide/gearbox-anatomy>` section for more complete information on gearboxes. **This refers to using spur gear gearboxes which are attached directly to the pinion gear of the motor. It does not mean external ratios outside of the motor gearbox, which will always be in a spur gear configuration.**
es_mx: Un ejemplo sería un chasis que tenga que cambiar de dirección repetida y rápidamente. Las cajas de engranes planetarios son mucho más adecuados para el chasis y brazos, debido a la configuración de los engranajes planetarios y solares. Además, las cajas de engranajes rectos son propensos a las cargas de choque, por lo que la transmisión directa no es aconsejable en las transmisiones. Consulta la sección :doc:`anatomía de las cajas de engranajes</docs/power-and-electronics/motor-guide/gearbox-anatomy>` para obtener información más completa sobre las cajas de cambios. **Se refiere al uso de cajas de engranajes rectos que se acoplan directamente al piñón del motor. No se refiere a relaciones externas fuera de la caja de engranajes del motor, que siempre estarán en una configuración de engranajes rectos.**
fr_ca: C'est le cas, par exemple, d'un châssis qui doit changer de direction de manière répétée et rapide. Les réducteurs planétaires sont beaucoup mieux adaptés aux transmissions et aux bras, en raison de la configuration des engrenages solaires et planétaires. En outre, les réducteurs à engrenages droits sont sujets aux chocs ; par conséquent, l'entraînement direct n'est pas conseillé pour les châssis. Reportez-vous à la section :doc:`anatomie des boites d'engrenages </docs/power-and-electronics/motor-guide/gearbox-anatomy>` pour obtenir des informations plus complètes sur les boîtes de vitesses. **Il s'agit d'utiliser des réducteurs à engrenages droits qui sont fixés directement sur le pignon du moteur. Cela ne concerne pas les rapports externes à la boîte de vitesses du moteur, qui seront toujours dans une configuration d'engrenage droit.**

source: Single/multi axis arm |rarr| Linear extension
es_mx: Brazo de un solo/múltiples ejes |rarr| Extensión lineal
fr_ca: Bras à un ou plusieurs axes |rarr| Extension linéaire

source: Teams are generally advised to stay away from arms and move in the direction of linear slides, primarily due to the issue of complexity. This is because arms typically are less effective than linear extensions and are harder to implement properly.
es_mx: Por lo general, se aconseja a los equipos que se mantengan alejados de los brazos y avancen en la dirección de los deslizamientos lineales, principalmente debido a la cuestión de la complejidad. Esto se debe a que los brazos suelen ser menos eficaces que las extensiones lineales y son más difíciles de implementar correctamente.
fr_ca: Il est généralement conseillé aux équipes d'éviter les bras et de s'orienter vers les glissières linéaires, principalement pour des raisons de complexité. En effet, les bras sont généralement moins efficaces que les extensions linéaires et sont plus difficiles à mettre en œuvre correctement.

source: Arms require a high gear ratio, so arms must be supported extremely well to bear the torque that the motor provides. A poorly supported and/or constructed arm will cause the driver needless pain as it is exceedingly difficult to line up an arm that constantly shakes. In contrast, linear extensions do not need to worry about gear ratios and gearboxes. They can be optimized to be more efficient than arms, and typically are more precise, as linear motion is easier to control than angular motion. Another positive is that linear slides can have more extension than arms, with some reaching 5+ feet in length.
es_mx: Los brazos requieren una elevada relación de transmisión, por lo que deben estar muy bien apoyados para soportar el par que proporciona el motor. Un brazo mal soportado y/o construido causará al conductor un dolor innecesario, ya que es extremadamente difícil alinear un brazo que tiembla constantemente. Por el contrario, las extensiones lineales no necesitan preocuparse por las relaciones de transmisión y las cajas de cambios. Pueden optimizarse para ser más eficientes que los brazos, y suelen ser más precisas, ya que el movimiento lineal es más fácil de controlar que el angular. Otro aspecto positivo es que las guías lineales pueden tener más extensión que los brazos, y algunas alcanzan más de 1,5 metros de longitud.
fr_ca: Les bras ont besoin d'un rapport de transmission élevé et doivent donc être extrêmement bien soutenus pour supporter le couple fourni par le moteur. Un bras mal soutenu et/ou mal construit causera au conducteur des douleurs inutiles, car il est extrêmement difficile d'aligner un bras qui tremble constamment. En revanche, les extensions linéaires n'ont pas besoin de se préoccuper des rapports de transmission et des boîtes de vitesses. Elles peuvent être optimisées pour être plus efficaces que les bras et sont généralement plus précises, car le mouvement linéaire est plus facile à contrôler que le mouvement angulaire. Un autre point positif est que les glissières linéaires peuvent avoir une plus grande extension que les bras, certaines pouvant atteindre plus de 5 mètres de long.

source: Solution
es_mx: Solución
