Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linkages.po
Languages: es_mx, fr_ca, zh_cn

source: Linkages
es_mx: Enlaces
fr_ca: Liens
zh_cn: 连杆机构

source: There are many different types of linkages. Often, linkages are used to convert rotational motion, such as that from a servo or motor, to linear motion. Linkages can do this efficiently, and also have specialized movement patterns that can make them desirable for certain mechanisms.
es_mx: Existen muchos tipos de enlaces. A menudo, se utilizan para convertir movimientos rotativos, como los de un servomotor, en movimientos lineales. Los enlaces pueden hacerlo de forma eficiente y también tienen patrones de movimiento especializados que pueden hacerlos deseables para ciertos mecanismos.
fr_ca: Il existe de nombreux types de liaisons mécaniques. Souvent, les liaisons sont utilisées pour convertir un mouvement de rotation, comme celui provenant d’un servo ou d’un moteur, en mouvement linéaire. Les liaisons peuvent effectuer cette conversion de manière efficace, et elles présentent également des schémas de mouvement particuliers qui les rendent intéressantes pour certains mécanismes.
zh_cn: 有许多不同类型的连杆类型。通常，连杆机构用于将旋转运动，例如舵机或电机的运动转换为线性运动。连杆机构可以有效地做到这一点，并且具有专门的运动模式，可以使它们成为某些机构的理想选择。

source: Term
es_mx: Término
fr_ca: Définition
zh_cn: 术语

source: Linkage
es_mx: Enlace
fr_ca: Lien
zh_cn: 连杆

source: A system of solid links or bars connected to two or more other links by hinges, sliding joints, ball-and-socket joints, etc., so as to form a closed chain or a series of closed chains. Generally used to convert linear motion to rotational motion or vice versa.
es_mx: Sistema de eslabones o barras sólidas conectadas a otros dos o más eslabones mediante bisagras, articulaciones deslizantes, rótulas, etc., para formar una cadena cerrada o una serie de cadenas cerradas. Generalmente se utiliza para convertir el movimiento lineal en movimiento de rotación o viceversa.
fr_ca: Système de maillons ou de barres solides reliés à deux ou plusieurs autres maillons par des charnières, des joints coulissants, des joints à rotule, etc., de manière à former une chaîne fermée ou une série de chaînes fermées. Généralement utilisé pour convertir un mouvement linéaire en mouvement rotatif ou vice versa.
zh_cn: 通过铰链、滑动接头、球窝接头等连接到两个或多个其他链节上的实心链节或杆件系统。从而形成一个封闭链或一系列封闭链。一般用于将直线运动转换为旋转运动或反之亦然。

source: Considerations
es_mx: Consideraciones
fr_ca: Considérations
zh_cn: 考虑因素

source: There are several things to consider when constructing a linkage.
es_mx: Hay que tener en cuenta varias cosas a la hora de construir un enlace.
fr_ca: Plusieurs éléments doivent être pris en compte lors de la construction d'une liaison.
zh_cn: 在构建连杆系统时，有几个方面需要考虑。

source: Over-centering is when a linkage is rotated past its center point (usually the point where both bars of the linkage are parallel). Driving a linkage over center can have some benefits, like making the linkage harder to backdrive. See this `informational youtube video <https://www.youtube.com/watch?v=I7iy8DCNmic>`_ for more details on this. Essentially, linkages can form a structure where pushing on the linkage moves the robot instead of rotating the linkage.
es_mx: El sobrecentrado se produce cuando un enlace se gira más allá de su punto central (normalmente el punto en el que ambas barras del enlace son paralelas). Sobrecentrar un enlace puede tener algunas ventajas, como hacer que el enlace sea más difícil de conducir hacia atrás. Vea este `video informativo de youtube <https://www.youtube.com/watch?v=I7iy8DCNmic>`_ para más detalles sobre esto. Básicamente, los enlaces pueden formar una estructura en la que al empujar el enlace se mueve el robot en lugar de girar el enlace.
fr_ca: Le surcentrage se produit lorsqu’une liaison est tournée au-delà de son point central (généralement le point où les deux barres de la liaison sont parallèles). Actionner une liaison au-delà de ce point peut présenter certains avantages, comme rendre la liaison plus difficile à faire reculer (ou à entraîner en sens inverse). Consultez cette vidéo YouTube d’information <https://www.youtube.com/watch?v=I7iy8DCNmic>`_ pour plus de détails à ce sujet. En résumé, les liaisons peuvent former une structure où exercer une poussée sur la liaison déplace le robot au lieu de simplement faire tourner la liaison.
zh_cn: 过中心是指连杆旋转时超过其中心点（通常是连杆两杆平行的点）。将连杆机构转过中心点有一些好处，例如可以使连杆机构更难反向驱动。有关这方面的更多详情，请参阅此 youtube 信息视频 <https://www.youtube.com/watch?v=I7iy8DCNmic>`_ 。从本质上讲，连杆可以形成一种结构，在这种结构中，推动连杆可以移动机器人，而不是旋转连杆。

source: Linkages will not have a constant linear speed or force. They generally reach a maximum speed and force when the bars are perpendicular, and the speed and force will decrease as the linkage is rotated farther.
es_mx: Los enlaces no tienen una velocidad o fuerza lineal constante. Por lo general, alcanzan una velocidad y una fuerza máximas cuando las barras están perpendiculares, y la velocidad y la fuerza disminuirán a medida que el enlace gire más.
fr_ca: Les liaisons mécaniques n’ont pas une vitesse ou une force linéaire constante. En général, elles atteignent leur vitesse et leur force maximales lorsque les barres sont perpendiculaires, puis la vitesse et la force diminuent à mesure que la liaison continue de tourner.
zh_cn: 连杆机构不会有恒定的线速度或力。它们通常在杆垂直时达到最大速度和力，并且随着连杆机构旋转得更远，速度和力会减小。

source: Cadding the linkage can be useful to check if it will do what you want it to do. See this `youtube video <https://www.youtube.com/watch?v=QsAC_seQHJY>`_ for an example of how to set up the mates in OnShape.
es_mx: Puede ser útil para comprobar si el enlace hará lo que usted quiere que haga. Vea este `youtube video <https://www.youtube.com/watch?v=QsAC_seQHJY>`_ para un ejemplo de cómo configurar las relaciones de posición en OnShape.
fr_ca: Le cadrage de la liaison peut être utile pour vérifier si elle fera ce que vous voulez qu'elle fasse. Voir cette `vidéo YouTube <https://www.youtube.com/watch?v=QsAC_seQHJY>`_ pour un exemple de la façon de paramétrer les contraintes dans OnShape.
zh_cn: 将连杆机构进行建模对检查联动装置是否能达到您的要求非常有用。有关如何在 OnShape 中设置配合的示例，请参阅此 `youtube 视频 <https://www.youtube.com/watch?v=QsAC_seQHJY>`_。

source: Common Linkage Types
es_mx: Tipos de enlaces comunes
fr_ca: Types de liens courants
zh_cn: 常见连杆类型

source: Linkage Slides
es_mx: Rieles de enlace
fr_ca: Liaisons à glissière
zh_cn: 滑轨连杆

source: A common use for linkages is to drive a linear extension. This allows for a compact method of converting the rotational motion from a motor or servo into linear motion moving a mechanism like drawer slides. Generally, a two bar linkage with multi degree ball linkage components are used to construct these linkages.
es_mx: Un uso común de los enlaces es accionar una extensión lineal. Esto permite un método compacto de convertir el movimiento de rotación de un motor o servo en movimiento lineal moviendo un mecanismo como los rieles de los cajones. Generalmente, para construir estos enlaces se utiliza una articulación de dos barras con componentes de articulación de bolas multigrado.
fr_ca: Une utilisation courante des liaisons mécaniques consiste à actionner une extension linéaire. Cela permet une méthode compacte de conversion du mouvement de rotation provenant d’un moteur ou d’un servo en un mouvement linéaire, qui déplace un mécanisme tel qu’un système de glissières de tiroir. En général, une liaison à deux barres avec des composants à rotules multidirectionnelles est utilisée pour construire ce type de liaison.
zh_cn: 连杆的一个常见用途是驱动线性延伸。这允许一种紧凑的方法将电机或舵机的旋转运动转换为线性运动，移动抽屉滑轨等机构。通常，带有多度球连杆部件的两杆连杆机构用于构建这些连杆机构。

source: A picture of a 7236 Recharged Green linkage driven slides
es_mx: Una foto de un 7236 Recharged Green enlace accionado por rieles
fr_ca: Une image des glissières actionnées par liaison de l’équipe 7236 Recharged Green.
zh_cn: 一张7236充电式绿色连杆驱动滑轨的照片

source: Four Bar
es_mx: Cuatro barras
fr_ca: Liaison à quatre barres
zh_cn: 四连杆

source: One type of linkage is called a four bar linkage. This is a linkage that keeps the end bar at the same angle to the ground at all times. For example, if the end bar of a virtual four bar is parallel to the ground when retracted, it will be parallel to the ground at all times, even when rotated fully out. This is beneficial for mechanisms like claws, which you want parallel to the ground during operation. In addition, four bars can provide extension outside of the robot frame, and generally provide both vertical and horizontal extension due to the "arc" that the arm follows. Also, the construction material of the four bar can be carefully selected to save weight.
es_mx: Un tipo de enlace se denomina enlace de cuatro barras. Se trata de un enlace que mantiene la barra final en el mismo ángulo con respecto al suelo en todo momento. Por ejemplo, si la barra final de una barra virtual de cuatro está paralela al suelo cuando está retraída, estará paralela al suelo en todo momento, incluso cuando esté completamente girada. Esto es beneficioso para mecanismos como las garras, que se quieren paralelas al suelo durante su funcionamiento. Además, las cuatro barras pueden proporcionar extensión fuera del marco del robot, y generalmente proporcionan extensión tanto vertical como horizontal debido al "arco" que sigue el brazo. Además, el material de construcción de las cuatro barras puede seleccionarse cuidadosamente para ahorrar peso.
fr_ca: Un type de liaison est appelé liaison à quatre barres. Il s’agit d’une liaison qui maintient la barre terminale à un angle constant par rapport au sol en tout temps. Par exemple, si la barre terminale d’une liaison virtuelle à quatre barres est parallèle au sol lorsqu’elle est rétractée, elle restera parallèle au sol en permanence, même lorsqu’elle est complètement déployée. Ce principe est particulièrement avantageux pour des mécanismes tels que les pinces, que l’on souhaite garder parallèles au sol pendant leur fonctionnement. De plus, les liaisons à quatre barres peuvent offrir une extension au-delà du châssis du robot, et permettent généralement une extension à la fois verticale et horizontale en raison de l’arc que suit le bras. Enfin, le matériau de construction d’une liaison à quatre barres peut être choisi avec soin afin de réduire le poids du mécanisme.
zh_cn: 一种类型的连杆称为四杆连杆。这是一种使端杆始终与地面保持相同角度的连杆。例如，如果虚拟四杆的端杆在缩回时与地面平行，则它将始终与地面平行，即使完全旋转出去。这对于像爪子这样的机构是有益的，您希望在操作过程中与地面平行。此外，四杆可以在机器人框架之外提供延伸，并且由于手臂跟随的“弧线”，通常提供垂直和水平延伸。此外，可以仔细选择杆的构造材料以节省重量。

source: This mechanism is not widely used in FTC\ |reg| due to the space requirements. The linkage bars that keep the end bar parallel restrict a four bar to under 180 degrees of travel (less then 90 degrees in either direction) without specialized mechanical construction, and the bars also take up space in the robot frame.
es_mx: Este mecanismo no se utiliza mucho en los FTC debido a los requisitos de espacio. Las barras de acoplamiento que mantienen la barra final paralela limitan el recorrido de las cuatro barras a menos de 180 grados (menos de 90 grados en cualquier dirección) sin una construcción mecánica especializada, y las barras también ocupan espacio en el marco del robot.
fr_ca: Ce mécanisme n’est pas largement utilisé dans la compétition FTC |reg| en raison de ses exigences d’espace. Les barres de liaison qui maintiennent la barre terminale parallèle limitent une liaison à quatre barres à un mouvement inférieur à 180 degrés (soit moins de 90 degrés dans chaque direction) sans recours à une construction mécanique spécialisée. De plus, ces barres occupent de l’espace à l’intérieur du châssis du robot, ce qui peut poser des contraintes de conception.
zh_cn: 由于空间要求，这种机构在FTC中没有广泛使用。保持末端杆平行的连杆将四杆的行程限制在180度以下（两个方向都小于90度），没有专门的机械结构，并且杆还占用机器人框架中的空间。

source: CAD Example of Four Bar (Click to expand)
es_mx: Ejemplo CAD de cuatro barras (Haga clic para ampliar)
fr_ca: Exemple CAO de quatre barres (Cliquez pour agrandir)
zh_cn: 四杆CAD示例（点击展开）

source: `Click here to open this example in Onshape Cad, where you can click and drag parts to see how they move! <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/204f2654fb268fb556c1b7b1>`_.
es_mx: Haga clic aquí para abrir este ejemplo en Onshape Cad, donde puede hacer clic y arrastrar las piezas para ver cómo se mueven. <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/204f2654fb268fb556c1b7b1>`_.
fr_ca: `Cliquez ici pour ouvrir cet exemple dans Onshape Cad, où vous pouvez cliquer et faire glisser les pièces pour voir comment elles se déplacent ! <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/204f2654fb268fb556c1b7b1>`_.
zh_cn: 单击此处在Onshape Cad中打开此示例，您可以单击并拖动部件以查看它们如何移动！ <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/204f2654fb268fb556c1b7b1>`_.

source: A picture of a goBILDA Four Bar
es_mx: Una foto de un goBILDA Cuatro Barras
fr_ca: Photo d'une liaison à quatre barres goBILDA
zh_cn: 一张goBILDA四连杆的照片

source: Virtual Four Bar
es_mx: Cuatro Barras Virtual
fr_ca: Liaison à quatres barres virtuelles
zh_cn: 虚拟四连杆

source: The more popular alternative to the Four Bar linkage is a Virtual Four Bar. While not technically a linkage, a virtual four bar uses chains or belts to create an effect similar to a four bar, where the end effector is kept at a fixed angle to the ground at all times. Because the need for additional bars are eliminated, this "linkage" can travel more then 180 degrees, and also can take up less space then a traditional four bar linkage.
es_mx: La alternativa más popular al enlace de cuatro barras es un enlace de cuatro barras virtual. Aunque técnicamente no es un enlace, un cuatro barras virtual utiliza cadenas o correas para crear un efecto similar al de un cuatro barras, en el que el efector final se mantiene en un ángulo fijo con respecto al suelo en todo momento. Debido a que se elimina la necesidad de barras adicionales, este "enlace" puede desplazarse más de 180 grados, y también puede ocupar menos espacio que un enlace de cuatro barras tradicional.
fr_ca: L’alternative la plus populaire à la liaison à quatre barres est la liaison virtuelle à quatre barres. Bien qu’il ne s’agisse pas techniquement d’une liaison mécanique, une liaison virtuelle à quatre barres utilise des chaînes ou des courroies pour reproduire un effet similaire à celui d’une véritable liaison à quatre barres, où l’organe terminal (ou effecteur) reste à un angle fixe par rapport au sol en tout temps. Comme elle ne nécessite pas de barres supplémentaires, cette « liaison » peut effectuer un mouvement supérieur à 180 degrés tout en occupant moins d’espace qu’une liaison à quatre barres traditionnelle.
zh_cn: 四杆连杆更受欢迎的替代方案是虚拟四杆。虽然从技术上讲不是连杆，但虚拟四杆使用链条或皮带来创造类似于四杆的效果，其中末端执行器始终与地面保持固定角度。因为不需要额外的杆，这种“连杆”可以移动超过180度，并且比传统的四杆连杆占用的空间更少。

source: This mechanism is more widely used in FTC, as it is an easy addition to an arm to maintain the end effector's angle relative to the ground.
es_mx: Este mecanismo se utiliza más en FTC, ya que es una adición fácil a un brazo para mantener el ángulo del efector final en relación con el suelo.
fr_ca: Ce mécanisme est plus largement utilisé en FTC, car il est facile à ajouter à un bras pour maintenir l'angle de l'effecteur par rapport au sol.
zh_cn: 这种机构更广泛地应用于FTC，因为它很容易添加到臂上，以保持末端执行器相对于地面的角度。

source: Note: Both chain and belt can be used to construct a virtual four bar, and there isn't a specific benefit to using either. Due to the fact that the chain doesn't have to completely rotate around the sprocket, a zip-tie can be used to tension the chain, making construction easier.
es_mx: Nota: Tanto la cadena como la correa pueden utilizarse para construir un cuatro barras virtual, y no hay ninguna ventaja específica en utilizar una u otra. Debido al hecho de que la cadena no tiene que girar completamente alrededor del piñon, un zip-tie se puede utilizar para tensar la cadena, por lo que la construcción más fácil.
fr_ca: Remarque : Une chaîne ou une courroie peuvent toutes deux être utilisées pour construire une liaison virtuelle à quatre barres, sans qu’aucune ne présente d’avantage particulier par rapport à l’autre. Cependant, comme la chaîne n’a pas besoin de tourner complètement autour du pignon, il est possible d’utiliser un collier de serrage ou zip-tie pour tendre la chaîne, ce qui rend la construction plus simple et plus pratique.
zh_cn: 注意：链条和皮带都可以用来构造一个虚拟的四杆，使用它们都没有具体的好处。由于链条不必完全围绕链轮旋转，可以使用拉链来拉紧链条，使构造更容易。

source: CAD Example of Virtual Four Bar (Click to expand)
es_mx: Ejemplo CAD de cuatro barras virtuales (Haga clic para ampliar)
fr_ca: Exemple CAO de liaison virtuelle à quatre barres (cliquer pour agrandir)
zh_cn: 虚拟四连杆CAD示例（点击展开）

source: `Click here to open this example in Onshape Cad, where you can click and drag parts to see how they move! <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/62097ae7e6d154b9232d8957>`__.
es_mx: Haga clic aquí para abrir este ejemplo en Onshape Cad, donde puede hacer clic y arrastrar las piezas para ver cómo se mueven. <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/62097ae7e6d154b9232d8957>`__.
fr_ca: `Cliquez ici pour ouvrir cet exemple dans Onshape Cad, où vous pouvez cliquer et faire glisser les pièces pour voir comment elles se déplacent ! <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/62097ae7e6d154b9232d8957>`__.
zh_cn: 单击此处在Onshape Cad中打开此示例，您可以单击并拖动部件查看它们如何移动！ <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/62097ae7e6d154b9232d8957>`__.

source: 7244 OUT of the BOX Robotics Virtual Four Bar
es_mx: 7244 OUT of the BOX Robotics Cuatro Barras Virtual
fr_ca: Liaison virtuelle à quatre barres de l’équipe 7244 OUT of the BOX Robotics

source: Double-Reverse Four Bar
es_mx: Cuatro barras en Doble Invertido
fr_ca: Double liaison à quatre barres inversée
zh_cn: 双反四杆

source: The double reverse four bar is an extension of the four bar linkage that allows for more extension. A double reverse four bar consists of a four bar linkage with a second four bar linkage mounted to the end of the first. This allows for purely linear extension, as opposed to the "arc" that a single four bar will take. The end effector will still stay at a fixed angle to the ground due to the purely linear extension.
es_mx: El cuatro barras doble invertido es una extensión del enlace de cuatro barras que permite una mayor extensión. Un cuatro barras doble invertido consiste en un enlace de cuatro barras con un segundo enlace de cuatro barras montado en el extremo de la primera. Esto permite una extensión puramente lineal, a diferencia del "arco" que realiza un cuatro barras simple. El efector final permanecerá en un ángulo fijo respecto al suelo debido a la extensión puramente lineal.
fr_ca: La liaison à double renversement à quatre barres est une évolution de la liaison à quatre barres qui permet d’obtenir une plus grande extension. Elle se compose d’une première liaison à quatre barres sur laquelle est montée une seconde liaison du même type à son extrémité. Cette configuration permet une extension purement linéaire, contrairement à l’arc de mouvement décrit par une seule liaison à quatre barres. De plus, l’effecteur terminal conserve un angle fixe par rapport au sol, grâce à cette extension linéaire.
zh_cn: 双反向四杆是四连杆的延伸，允许更多的延伸。双反向四杆由一个四连杆组成，第二个四连杆安装在第一个连杆的末端。这允许纯线性延伸，而不是单个四杆将采取的“弧形”。由于纯线性延伸，末端执行器仍将与地面保持固定角度。

source: This mechanism is not widely used in FTC due to the generally large space requirements needed, but is a fairly compact method of producing large amounts of linear extension. Care needs to be taken that each side of a double reverse four bar is driven equally so that issues do not arise from asymmetric lifting.
es_mx: Este mecanismo no está muy usado en FTC debido al gran espacio que suele requerir, pero es un método bastante compacto para producir grandes cantidades de extensión lineal. Hay que tener cuidado de que cada lado de un cuatro barras doble invertido se accione por igual para que no surjan problemas de elevación asimétrica.
fr_ca: Ce mécanisme n’est pas largement utilisé dans la compétition FTC, principalement en raison de ses importants besoins en espace. Cependant, il constitue une méthode relativement compacte pour obtenir une grande extension linéaire. Il faut toutefois veiller à ce que chaque côté d’une liaison à double renversement à quatre barres soit entraîné de manière égale, afin d’éviter les problèmes liés à un levage asymétrique.
zh_cn: 由于所需空间通常很大，这种机构在FTC中没有广泛使用，但它是一种相当紧凑的产生大量线性延伸的方法。需要注意的是，双反四杆的每一侧都被平等地驱动，这样就不会出现不对称提升的问题。

source: 11115 Gluten Free Double Reverse Four Bar
es_mx: 11115 Gluten Free Cuatro Barras Doble Invertido
fr_ca: Barre double inversée de Gluten Free 11115

source: Virtual Double-Reverse Four Bar
es_mx: Cuatro Barras Doble Invertido Virtual
fr_ca: Liaison virtuelle à double renversement à quatre barres
zh_cn: 虚拟双反四杆

source: Similar to the virtual four bar, the virtual double-reverse four bar is a linkage that uses belts or chains to replace the linkage bars of the double-reverse four bar. The virtual double-reverse four bar is simply a virtual four bar where the end effector sprocket/pulley is half the size of the static sprocket/pulley, leading to a 2:1 driving ratio. Then, a bar is mounted to the end effector sprocket/pulley, and another chain/belt is run, which creates purely linear motion with an end effector that is always at the same angle to the ground. This creates much more compact linear motion then a double-reverse four bar, and can also extend in both directions.
es_mx: Al igual que el cuatro barras virtual, el cuatro barras doble invertido virtual es un enlace que utiliza correas o cadenas para sustituir las barras del enlace del cuatro barras doble invertido virtual. El cuatro barras doble invertido virtual es simplemente un cuatro barras virtual en la que el piñón/polea del efector final tiene la mitad de tamaño que el piñón/polea estático, lo que da lugar a una relación de transmisión de 2:1. A continuación, se monta una barra en el piñón/polea del efector final y se hace funcionar otra cadena/correa, lo que crea un movimiento puramente lineal con un efector final que siempre está en el mismo ángulo con respecto al suelo. Esto crea un movimiento lineal mucho más compacto que un cuatro barras doble invertido, y también puede extenderse en ambas direcciones.
fr_ca: Similaire à la liaison virtuelle à quatre barres, la liaison virtuelle à double renversement à quatre barres est un mécanisme qui utilise des courroies ou des chaînes pour remplacer les barres mécaniques d’une liaison à double renversement classique. Elle fonctionne comme une liaison virtuelle à quatre barres dont la poulie ou le pignon de l’effecteur terminal est deux fois plus petit que le pignon ou la poulie fixe, créant ainsi un rapport de transmission de 2:1. Une barre est ensuite fixée à la poulie ou au pignon de l’effecteur, et une seconde courroie ou chaîne est installée, ce qui permet d’obtenir un mouvement purement linéaire, tout en maintenant l’effecteur terminal à un angle constant par rapport au sol. Ce système offre un mouvement linéaire beaucoup plus compact qu’une liaison à double renversement à quatre barres traditionnelle, et il peut en outre s’étendre dans les deux directions.
zh_cn: 与虚拟四杆类似，虚拟双反四杆是一种连杆机构，它使用皮带或链条来代替双反四杆的连杆机构。虚拟双反四杆只是一个虚拟四杆机构，其中末端执行器链轮/皮带轮的尺寸是静态链轮/皮带轮的一半，导致2:1的驱动比。然后，将一根杆安装到末端执行器链轮/皮带轮上，并运行另一条链条/皮带，这创造了纯粹的线性运动，末端执行器始终与地面成相同的角度。这比双反四杆产生了更紧凑的线性运动，并且还可以向两个方向延伸。

source: 8644 Brainstormers Virtual Double Reverse Four Bar
es_mx: 8644 Brainstormers Cuatro Barras Doble Invertido Virtual
fr_ca: Liaison virtuelle à double renversement à quatre barres de l’équipe 8644 Brainstormers
