Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/passive-intake-claw.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Passive Intake/Claw
es_mx: Admisión Pasiva/Garra
fr_ca: Ramasseur passif/pince
ro_ro: Intake Pasiv / Gheară
zh_cn: 被动吸入拾取装置/爪式

source: Passive intakes are mechanisms in which the driver must pick up individual items, usually by actuating some sort of gripper, which holds the game element.
es_mx: Las tomas pasivas son mecanismos en los que el conductor debe recoger elementos individuales, normalmente accionando algún tipo de pinza, que sujeta el elemento de juego.
fr_ca: Les ramasseurs passifs sont des mécanismes dans lesquels le pilote doit ramasser des objets individuels, généralement en actionnant une sorte de pince qui tient l'élément de jeu.
ro_ro: Intake-urile Pasive sunt mecanisme prin care driver-ul trebuie să ridice elemente individuale, de obicei prin acționarea unui prinderi, care ține elementul de joc.
zh_cn: 被动吸入拾取装置是操作手必须拾取单个物品的机制，通常是通过启动某种抓手来拾取游戏元素。

source: Claws are the most common sort of passive intake and probably one of the first mechanisms that jump to mind during brainstorming. Unlike most intakes, claws can be made with only servos, and thus don’t require valuable motor slots.
ro_ro: Ghearele sunt cele mai comune tipuri de intake-uri pasive și probabil primele mecanisme la care te gândești când faci brainstorming. Spre deosebire de majoritatea intake-urilor, ghearele pot fi făcute doar cu servomotoare, și astfel nu necesită port-uri de motoare.

source: This is not to say there are no disadvantages; notably, unlike intakes, when you pick up something with a claw, it isn’t easy to transfer the collected element to a separate scoring mechanism. For this reason, in most cases, claws double as both a collection method and a scoring method.
ro_ro: Ca să nu zicem că nu există dezavantaje, notabil, spre deorebire de intake-uri, când ridici ceva cu o gheară, este destul de greu să transferi elementul colectat într-un mecanism separat de punctare. Din această cauză, ghearele sunt de asemenea și un mecanism de punctare.

source: **Claws are extremely useful for picking up large, unwieldy elements that cannot be controlled by active intakes**. For example, the relic in Relic Recovery would be much harder to control using a more active intake; so teams used a claw.
es_mx: **Las garras son muy útiles para recoger elementos grandes y difíciles de manejar que no se pueden controlar con intakes activos**. Por ejemplo, la reliquia en Relic Recovery sería mucho más difícil de controlar usando un intake más activo; por eso los equipos usaron una garra.
fr_ca: **Les pinces sont extrêmement utiles pour ramasser des éléments volumineux et peu maniables qui ne peuvent pas être contrôlés par des ramasseurs actifs**. Par exemple, la relique dans Relic Recovery aurait été beaucoup plus difficile à contrôler en utilisant un ramasseur plus actif ; les équipes ont donc utilisé une pince.
ro_ro: **Ghearele sunt foarte folositoare pentru colectarea elementelor mari care nu pot fi controlate de intake-uri active**. De exemplu, relicva din Relic Recovery ar fi foarte greu de controlat cu un intake activ, așa că echipele au folosit o gheară.
zh_cn: **爪子对于拾取无法被主动摄取控制的大而笨重的元素非常有用。例如，Relic Recovery中的 relic 使用更主动的吸入拾取装置会更难控制；所以团队使用爪子。**

source: However, claws are outclassed by active intakes for picking up small game pieces in nearly every game.
es_mx: Sin embargo, las garras se ven superadas por los intakes activos para recoger pequeñas piezas del juego en casi todos los juegos.
fr_ca: Cependant, les pinces sont surclassées par les ramasseurs actifs qui permettent de ramasser de petites pièces de jeu dans presque tous les jeux.
ro_ro: Insă, ghearele sunt depășite de intake-uri active în ridicarea elementelor mici de joc în aproape orice joc.
zh_cn: 然而，在几乎每场比赛中，爪子都被主动吸入拾取装置小游戏碎片的行为所超越。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
ro_ro: Avantaje
zh_cn: 优点

source: Much simpler than an intake
es_mx: Mucho más sencillo que un intake
fr_ca: Beaucoup plus simple qu'un ramasseur
ro_ro: Mai simplu decât un intake
zh_cn: 比吸入拾取装置简单多了

source: Takes a lot less time to build than a reliable intake + transfer
es_mx: Se tarda mucho menos en construir que una intake fiable + transferencia
fr_ca: Cela prend beaucoup moins de temps à construire qu'un système de ramassage et de transfert fiable.
ro_ro: Se poate construi mai rapid decât un intake fiabil + transfer
zh_cn: 与可靠的进气+转移相比，建造时间要短得多

source: Less moving parts = less things that can go wrong
es_mx: Menos piezas móviles = menos cosas que pueden ir mal
fr_ca: Moins de pièces mobiles = moins de choses qui peuvent mal tourner
ro_ro: Mai puține piese în mișcare = mai putine probleme
zh_cn: 活动部件越少=可能出错的事情越少

source: Usually does not take up a motor slot
es_mx: No suele ocupar espacio en el motor
fr_ca: N'occupe généralement pas d'emplacement pour le moteur
ro_ro: De obicei nu ocupă un port de motor
zh_cn: 通常不占用电机槽

source: Can pick up odd shaped game elements that active intakes can’t
ro_ro: Poate colecta elemente de joc în forme ciudate pe care intake-urile active nu pot

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
ro_ro: Dezavantaje
zh_cn: 缺点

source: Depending on their use case, claws are slower than intakes.
es_mx: Según su uso, las garras son más lentas que los intakes.
fr_ca: En fonction de leur utilisation, les pinces sont plus lentes que les ramasseurs.
ro_ro: În funcție de folosință, ghearele sunt mai lente decât intake-urile
zh_cn: 根据它们的用例，爪子比吸入拾取装置慢。

source: The driver must angle the robot, position the claw, and grab the game element.
es_mx: El conductor debe inclinar el robot, colocar la garra y agarrar el elemento de juego.
fr_ca: Le pilote doit orienter le robot, positionner la pince et saisir l'élément de jeu.
ro_ro: Driver-ul trebuie să poziționeze robotul la un unghi și să poziționeze gheara pentru a colecta un element
zh_cn: 操作手必须调整机器人的角度，定位爪子，并抓住游戏元素。

source: By contrast, with an intake, the driver needs only to position the intake and grab the game elements.
es_mx: En cambio, con un intake, el conductor sólo tiene que colocar el intake y agarrar los elementos de juego.
fr_ca: En revanche, avec un ramasseur, le pilote n'a qu'à positionner le ramasseur et à saisir les éléments du jeu.
ro_ro: În schimb, cu un intake, driver-ul trebuie doar să poziționeze intake-ul și să preia elementele de joc.
zh_cn: 相比之下，有了吸入拾取装置，操作手只需要定位吸入拾取装置并抓住游戏元素。

source: Claws can be more fragile and break easily.
es_mx: Las garras pueden ser más frágiles y romperse con facilidad.
fr_ca: Les pinces peuvent être plus fragiles et se casser facilement.
ro_ro: Ghearele pot fi mai fragile și se pot rupe ușor.
zh_cn: 爪子可能更脆弱，更容易折断。

source: In cases in which claws are slower than intakes, they can be much more prone to defensive maneuvers. The more time spent collecting, the more vulnerable you are.
es_mx: En los casos en que las garras son más lentas que los intakes, pueden ser mucho más propensos a las maniobras defensivas. Cuanto más tiempo pase recogiendo, más vulnerable será.
fr_ca: Lorsque les pinces sont plus lentes que les ramasseurs, elles peuvent être beaucoup plus sujettes aux manœuvres défensives. Plus on passe de temps à collecter, plus on est vulnérable.
ro_ro: În cazul în care gheara este mai lentă decât un intake, ele pot fi predispuse la manevre defensive. Cu cât petreci mai mult timp colectând, cu cât ești mai vulnerabil.
zh_cn: 在爪子比吸入拾取装置慢的情况下，它们更容易采取防御策略。花在收集上的时间越多，你就越脆弱。

source: 11115's relic claw
es_mx: Garra reliquia 11115
fr_ca: Pince de #11115 pour les reliques
ro_ro: Gheara pentru relicve echipei 11115
zh_cn: 11115队伍 relic 爪子

source: 11115 Gluten Free, Finalist Alliance Captain (Detroit), Relic Recovery
es_mx: 11115 Gluten Free, Capitán de la Alianza Finalista (Detroit), Relic Recovery
fr_ca: 11115 Gluten Free, Capitaine de l'alliance finaliste (Détroit), Relic Recovery
ro_ro: Echipa 11115 Gluten Free, parte din alianța finalistă în rol de căpitan (Detroit), Relic Recovery
zh_cn: 11115 Gluten Free,决赛联盟冠军(于底特律举办), Relic Recovery

source: 8680's relic claw
es_mx: Garra reliquia 8680
fr_ca: Pince de #8680 pour les reliques
ro_ro: Gheara pentru relicve a echipei 8680
zh_cn: 8680's relic 爪子

source: 8680 Kraken-Pinion, Relic Recovery
ro_ro: Echipa 8680 Kraken-Pinion, Relic Recovery

source: 13075's glyph claw
es_mx: Garra glífica 13075
fr_ca: Pince de #13075 pour les glyphs
ro_ro: Gheara pentru relicve a echipei 13075
zh_cn: 13075's glyph 爪子

source: 13075 Coram Deo Academy Robotics, Relic Recovery (**suboptimal use case**)
es_mx: 13075 Robótica de la Academia Coram Deo, Relic Recovery (**caso de uso subóptimo**)
fr_ca: 13075 Académie Coram Deo Robotique, Relic Recovery (**cas d'utilisation sous-optimal**)
ro_ro: Echipa 13075 Coram Deo Academy Robotics, Relic Recovery
zh_cn: 13075 Coram Deo Academy Robotics, Relic Recovery (**次优用例**)

source: Claws are the most common sort of passive intake and probably one of the first mechanisms that jump to mind during brainstorming. Unlike most intakes, claws can be made with only servos, and thus don't require valuable motor slots.
es_mx: Las garras son el tipo más común de admisión pasiva y probablemente uno de los primeros mecanismos que saltan a la mente durante una lluvia de ideas. A diferencia de la mayoría de los intakes, las garras se pueden hacer solo con servos, por lo que no requieren valiosas ranuras para el motor.
fr_ca: Les pinces sont le type de ramasseur actif le plus courant et probablement l'un des premiers mécanismes qui viennent à l'esprit lors d'un brainstorming. Contrairement à la plupart des ramasseurs, les pinces peuvent être fabriquées avec seulement des servos, et ne nécessitent donc pas d'emplacements précieux pour les moteurs.
zh_cn: 爪子是最常见的被动吸入拾取装置，可能是头脑风暴中首先想到的机构之一。与大多数吸入拾取装置不同，爪子只需舵机即可制作，因此不需要有价值的电机插槽。

source: This is not to say there are no disadvantages; notably, unlike intakes, when you pick up something with a claw, it isn't easy to transfer the collected element to a separate scoring mechanism. For this reason, in most cases, claws double as both a collection method and a scoring method.
es_mx: Esto no quiere decir que no haya desventajas; en particular, a diferencia de los intakes, cuando se recoge algo con una garra, no es fácil transferir el elemento recogido a un mecanismo de puntuación independiente. Por esta razón, en la mayoría de los casos, las garras sirven tanto de método de recogida como de método de puntuación.
fr_ca: Cela ne veut pas dire qu'il n'y a pas d'inconvénients ; notamment, contrairement aux ramasseurs, lorsque vous ramassez quelque chose avec une pince, il n'est pas facile de transférer l'élément collecté vers un mécanisme de notation distinct. C'est pourquoi, dans la plupart des cas, les pinces servent à la fois de méthode de collecte et de méthode de notation.
zh_cn: 这并不是说没有缺点；值得注意的是，与吸入拾取装置不同，当你用爪子拾取东西时，将收集的元素转移到单独的评分机制并不容易。因此，在大多数情况下，爪子既是一种收集方法，也是一种评分方法。

source: Can pick up odd shaped game elements that active intakes can't
es_mx: Puede recoger elementos de juego de forma extraña que las intakes activos no pueden
fr_ca: Peut capter des éléments de jeu de forme irrégulière, ce que les ramasseurs actifs ne peuvent pas faire.
zh_cn: 可以捕捉到主动吸入拾取装置无法捕捉到的奇怪形状的游戏元素
