Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs.po
Languages: ro

source: Gallery Of Robot Designs
ro: Galeria Roboților Documentați

source: Collection of robot designs from past seasons. Feel free to borrow some design solutions for your robot!
ro: Colecția roboților din sezoanele trecute. Nu ezitați să vă inspirați din aceste modele pentru propriul robot!

source: Copying another team's design usually doesn't work if you don't understand why their design works and why they built it that way. Just like copying your friend's homework doesn't mean you learned the material.
ro: Copierea designului unei alte echipe nu funcționează de obicei dacă nu înțelegi de ce funcționează designul lor și de ce l-au construit în acel mod. Este ca și cum ai copia temele prietenului tău, dar asta nu înseamnă că ai învățat lecția.

source: `Robot Pictures <https://photos.google.com/share/AF1QipORERv83O2EB2hgFqmfkuEavisH8N4cqhkPNFVCDFGqgaVcj6ED77WXLYPi9yIQIQ?key=VUhvZmxIejYwRUU4b3lPaXZTcmZ0emFsa21yNy13>`__
ro: `Pozele Robotului <https://photos.google.com/share/AF1QipORERv83O2EB2hgFqmfkuEavisH8N4cqhkPNFVCDFGqgaVcj6ED77WXLYPi9yIQIQ?key=VUhvZmxIejYwRUU4b3lPaXZTcmZ0emFsa21yNy13>`__

source: `Engineering Portfolio <https://drive.google.com/file/d/1pJoChbVlvHk76GqQmj4wkOcPWZAHNehL/edit>`__
ro: `Portofoliu <https://drive.google.com/file/d/1pJoChbVlvHk76GqQmj4wkOcPWZAHNehL/edit>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=eSGSAS1RTHQ>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=eSGSAS1RTHQ>`__

source: `Engineering Portfolio <https://docs.google.com/document/d/1Gd3HlolZlD26xz__ngC1cJsoUYtvUFR_MTUYkEW_L1g/edit>`__
ro: `Portofoliu <https://docs.google.com/document/d/1Gd3HlolZlD26xz__ngC1cJsoUYtvUFR_MTUYkEW_L1g/edit>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=mSsAVnTCXg0>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=mSsAVnTCXg0>`__

source: `Robot Explanation Video <https://www.youtube.com/watch?v=fZFT6Cdp58g>`_
ro: `Explicarea Mecanismelor Robotului <https://www.youtube.com/watch?v=fZFT6Cdp58g>`_

source: `Robot Description Flyer <https://www.canva.com/design/DAEkqnr3g_8/vUqf5zKo3njwY0KRxsmhXg/view>`_
ro: `Fluturaș cu Descrierea Robotului <https://www.canva.com/design/DAEkqnr3g_8/vUqf5zKo3njwY0KRxsmhXg/view>`_

source: `Remote Match Video <https://www.youtube.com/watch?v=4Y9WguSl4DE>`__
ro: `Meci Oficial Remote <https://www.youtube.com/watch?v=4Y9WguSl4DE>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=i2g_b54MEFI>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=i2g_b54MEFI>`__

source: `Former World Record Match Video <https://www.youtube.com/watch?v=hL4nYgLUCeg>`__
ro: `Record Mondial Anterior <https://www.youtube.com/watch?v=hL4nYgLUCeg>`__

source: `Technical Binder <https://docs.google.com/presentation/d/1MtXrXihTsF2XNWUVU9fH8fmdqNRnnIpUPR5ZxJDZaH0/edit?usp=sharing>`__
ro: `Portofoliu <https://docs.google.com/presentation/d/1MtXrXihTsF2XNWUVU9fH8fmdqNRnnIpUPR5ZxJDZaH0/edit?usp=sharing>`__

source: `Animation <https://drive.google.com/file/d/1wCHZ42TfqL1imSi1w5dGu1kQKBtCGrvr/view?usp=drive_open>`__
ro: `Animație <https://drive.google.com/file/d/1wCHZ42TfqL1imSi1w5dGu1kQKBtCGrvr/view?usp=drive_open>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=3d8-TN8YVNU>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=3d8-TN8YVNU>`__

source: `Robot Reveal Video <https://drive.google.com/file/d/1O44wlNqllfe16ktQYHCRPb-YUxIXzPUp/view>`__
ro: `Prezentarea Robotului <https://drive.google.com/file/d/1O44wlNqllfe16ktQYHCRPb-YUxIXzPUp/view>`__

source: `Behind the Bot Interview <https://www.youtube.com/watch?v=IW70TEpFtxM>`__
ro: `Interviu Tehnic Robot <https://www.youtube.com/watch?v=IW70TEpFtxM>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=pMI2PXhnlS0>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=pMI2PXhnlS0>`__

source: `Behind the Bot Interview <https://www.youtube.com/watch?v=6PjfbOV496c>`__
ro: `Interviu Tehnic Robot <https://www.youtube.com/watch?v=6PjfbOV496c>`__

source: `Practice Match Video <https://www.youtube.com/watch?v=NQvhvYJXVMA>`__
ro: `Meci de Antrenament <https://www.youtube.com/watch?v=NQvhvYJXVMA>`__

source: `World Record Match Video <https://www.youtube.com/watch?v=Nm3ff5JqvzM>`__
ro: `Record Mondial <https://www.youtube.com/watch?v=Nm3ff5JqvzM>`__

source: `Behind the Bot Interview <https://www.youtube.com/watch?v=zun--sNljks>`__
ro: `Interviu Tehnic Robot <https://www.youtube.com/watch?v=zun--sNljks>`__

source: `Robot Description Flyer <https://qrobotics.blob.core.windows.net/2018/mti.pdf>`__
ro: `Fluturaș cu Descrierea Robotului <https://qrobotics.blob.core.windows.net/2018/mti.pdf>`__

source: `Practice Match Video <https://www.youtube.com/watch?v=v4Jpfe0eJUc>`__
ro: `Meci de Antrenament <https://www.youtube.com/watch?v=v4Jpfe0eJUc>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=v4XP_VJ7nZU>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=v4XP_VJ7nZU>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=wBmb-4cu4Vs>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=wBmb-4cu4Vs>`__

source: `3D model of the claw <https://www.thingiverse.com/thing:2785600>`__
ro: `Model 3D al mecanismului <https://www.thingiverse.com/thing:2785600>`__

source: `Misc CAD models <https://drive.google.com/drive/folders/1Ng-DqcyMdsfpHy7Mc6W0cfxUMahaA2Sn>`__
ro: `Diverse Modele CAD <https://drive.google.com/drive/folders/1Ng-DqcyMdsfpHy7Mc6W0cfxUMahaA2Sn>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=8jvF94d46cs>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=8jvF94d46cs>`__

source: `Robot Render <https://drive.google.com/file/d/1oCy7M8DCr8fLGUcjR6L4Akm1JUgkqhYt/view?usp=drive_open>`__
ro: `Modele Procesate 3D <https://drive.google.com/file/d/1oCy7M8DCr8fLGUcjR6L4Akm1JUgkqhYt/view?usp=drive_open>`__

source: `Engineering drawing <https://drive.google.com/file/d/1YQMyEWS5sPdL1YOPntXIR0FdsY30-G6H/view?usp=drive_open>`__
ro: `Schiță Mecanică <https://drive.google.com/file/d/1YQMyEWS5sPdL1YOPntXIR0FdsY30-G6H/view?usp=drive_open>`__

source: `Technical Binder <https://docs.google.com/document/d/1RMsGYUu_mo943I42diFhakRUgHF-Bi4TcWEwkxHUE9g/edit?usp=sharing>`__
ro: `Portofoliu <https://docs.google.com/document/d/1RMsGYUu_mo943I42diFhakRUgHF-Bi4TcWEwkxHUE9g/edit?usp=sharing>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=acWoCPkWOZs>`__
ro: `Prezentare Robot <https://www.youtube.com/watch?v=acWoCPkWOZs>`__

source: `Match Video <https://www.youtube.com/watch?v=myq3DyHqM0w>`__
ro: `Meci Live <https://www.youtube.com/watch?v=myq3DyHqM0w>`__

source: `Robot Reveal Video <https://www.youtube.com/watch?v=pJs-R-j0zXg>`__
ro: `Prezentarea Robotului <https://www.youtube.com/watch?v=pJs-R-j0zXg>`__

source: Appendix
ro: Diverse

source: License
ro: Licență

source: Game Manual 0 is licensed under `CC BY-NC 2.0 <https://github.com/gamemanual0/gm0/blob/main/LICENSE>`_.
ro: Game Manual 0 este licențiat sub `CC BY-NC 2.0 <https://github.com/gamemanual0/gm0/blob/main/LICENSE>`_.

source: Vendor Guide
ro: Ghidul Producătorilor de Piese

source: Vendor Identification
ro: Identificarea Producătorului

source: When you read some Bill of Materials (BOMs) or part numbers that are references in this guide, it might be confusing to find what vendor the part you need comes from. The obvious thing to do is Google the part number, and generally it can identify what you want and where it comes from. But if that fails, here are some quick tips to identify the vendor selling what you need.
ro: Atunci când citiți unele liste de materiale sau numere de piese care sunt referințe în acest ghid, ar putea fi greu să aflați de la ce furnizor provine piesa de care aveți nevoie. Lucrul evident este să căutați pe Google numărul piesei și, în general, puteti identifica ceea ce doriți și de unde provine. Dar dacă acest lucru nu dă rezultate, iată câteva sfaturi rapide pentru a identifica furnizorul care vinde ceea ce vă trebuie.

source: Prefix Identification
ro: Identificarea Prefixului

source: AM- signifies AndyMark (i.e. AM-0447)
ro: AM- reprezintă AndyMark (ex. AM-0447)

source: REV- signifies REV Robotics (i.e. REV-31-1155)
ro: REV- reprezintă REV Robotics (ex. REV-31-1155)

source: WCP- signifies West Coast Products (i.e. WCP-0117)
ro: WCP- reprezintă West Coast Products (ex. WCP-0117)

source: 217- signifies VEXpro (i.e. 217-6194)
ro: 217- reprezintă VEXpro (ex. 217-6194)

source: 276- signifies VEX EDR (i.e. 276-2193)
ro: 276- reprezintă VEX EDR (ex. 276-2193)

source: SKU Identification
ro: Identificare SKU

source: Actuonix: 3-4 digit SKU, alphanumeric, in the form of XX00 or X00 (i.e. PQ12)
ro: Actuonix: 3-4 cifre SKU, alfanumeric, sub formă de XX00 sau X00 (ex. PQ12)

source: goBILDA: 12 digit SKU, numerical, in the form of 0000-0000-0000 (i.e. 3213-3606-0001)
ro: goBILDA: 12 cifre SKU, numeric, sub formă de 0000-0000-0000 (ex. 3213-3606-0001)

source: Pitsco/Tetrix: 6 digit SKU, W + 5 numbers, in the form of W00000 (i.e. W44260)
ro: Pitsco/Tetrix: 6 cifre SKU, W + 5 numere, sub formă de W00000 (ex. W44260)

source: Servocity/Actobotics: 6 digit SKU, numerical, in the form of 000000 (i.e. 615190)
ro: Servocity/Actobotics: 6 cifre SKU, numeric, sub formă de 000000 (ex. 615190)

source: Where can I get ...?
ro: De unde pot obține ...?

source: Motors and Gearboxes
ro: Motoare și Rapoarte

source: Spur Gear Motors
ro: Motoare cu Roți Dințate

source: :term:`AndyMark NeveRest <NeveRest Motor>` Classic
ro: :term:`AndyMark NeveRest <NeveRest Motor>` Clasic

source: goBILDA 5201 Spur Gear
ro: goBILDA 5201 Angrenaj Drept

source: Planetary Gearbox Motors (recommended)
ro: Motoare cu Angrenaje Planetare (recomandate)

source: VEX *VersaPlanetary Lite* (gearbox only)
ro: VEX *VersaPlanetary Lite* (doar angrenajul)

source: (*italicized* = customizable gearbox ratio)
ro: (*italicized* = raport personalizat)

source: Servos
ro: Servomotoare

source: HiTec (from ServoCity); 24 tooth spline
ro: HiTec (from ServoCity); suport cu 24 de dinți

source: REV Smart Robot Servo; 25 tooth spline
ro: REV Smart Robot Servo; suport cu 25 de dinți

source: goBILDA Dual Mode Servo; 25 tooth spline
ro: goBILDA Dual Mode Servo; suport cu 25 de dinți

source: Futaba (Futaba servos are widely used in RC and hobby aircraft); 25 tooth spline
ro: Futaba (servomotoarele Futaba sunt folosite des în mașini cu telecomandă sau drone); suport cu 25 de dinți

source: Savox heavy-duty servos; 25 tooth spline
ro: Savox heavy-duty servos; suport cu 25 de dinți

source: Actuonix (linear actuators)
ro: Actuonix (dispozitive cu acționare liniară)

source: :term:`VEX 393 EDR`; 1/8" square shaft
ro: :term:`VEX 393 EDR`; 1/8" ax pătrat

source: Sensors
ro: Senzori

source: Hardware & Raw Materials
ro: Componente Hardware și Materiale

source: Local hardware store
ro: Magazin local de materiale hardware

source: Aluminum Components
ro: Componente din Aluminiu

source: Actobotics :term:`channel <Channel>`, mini :term:`channel <Channel>`, X-rail :term:`extrusion <Extrusion>`
ro: :term:`Profil <Channel>` Actobotics, mini :term:`profil <Channel>`, :term:`extrudare <Extrusion>` X-rail

source: REV extrusion, C :term:`channel <Channel>`, U :term:`channel <Channel>`
ro: Extrudare REV, :term:`profil <Channel>` tip C, :term:`profil <Channel>` tip U

source: goBILDA :term:`channel <Channel>`, goRAIL :term:`extrusion <Extrusion>`
ro: :term:` Profil<Channel>` goBILDA, :term:`extrudare <Extrusion>` goRAIL

source: TETRIX :term:`channel <Channel>`
ro: :term:`Profil <Channel>` TETRIX

source: MiSUMI :term:`extrusion <Extrusion>`
ro: :term:`Extrudare<Extrusion>` MiSUMI

source: Gears/Sprockets/Pulleys
ro: Angrenaje/Pinioane/Scripeți

source: AndyMark sells the official game field and game sets, as well as individual game parts and the SoftTiles foam tiles.
ro: AndyMark vinde terenul de joc oficial și seturile de joc, precum și piesele de joc individuale și plăcile de spumă SoftTiles.

source: AndyMark also sells NeveRest and NeveRest Sport motors, TileRunner, compliant, stealth, and mecanum wheels, as well as many other items.
ro: AndyMark vinde, de asemenea, motoare NeveRest și NeveRest Sport, TileRunner, roți conforme, stealth și mecanum, precum și multe alte articole.

source: Cheap vendor for fasteners/other hardare.
ro: Producători ieftini de elemente de fixare/alte componente hardware.

source: Vendor for raw plastics, such as polycarbonate, acetal, HDPE, etc.
ro: Furnizor de materiale plastice brute, cum ar fi policarbonat, acetal, HDPE etc.

source: Vendor for raw plastics, including smoked polycarbonate.
ro: Furnizor de materiale plastice brute, inclusiv policarbonat afumat.

source: Mid-range vendor for fasteners/other hardare, including tools.
ro: Vânzător de produse de fixare/alte articole, inclusiv unelte.

source: goBILDA sells its own build system, complete with Yellow Jacket motors, channel, motion components, and battery. Note that the cheapest batteries are found here, the MATRIX 12V Batteries are $39.99, with the team discount they are $29.99, nearly half the price of the $50 batteries sold elsewhere.
ro: goBILDA își vinde propriul sistem de construcție, cu motoare "Yellow Jacket", profile din aluminiu, componente de mișcare și baterii. Rețineți că cele mai ieftine baterii se găsesc aici, bateriile "MATRIX 12V" costă 39,99 dolari / 190 RON, cu reducerea echipei sunt 29,99 dolari / 140 RON, aproape jumătate din prețul bateriilor de 50 de dolari / 235 RON vândute în altă parte.

source: Teams can get a 25% Team Discount from goBILDA.
ro: Echipele FTC pot beneficia de o reducere de 25% pentru echipe de la goBILDA.

source: McMaster-Carr sells hardware and raw materials in bulk quantities. They stock nearly every type of bolt, screw, and nut possible, as well as washers, bearings, springs, etc. Purchase from them for bulk quantities of hardware, as well as the times you need a very obscure part.
ro: Dedeman vinde produse hardware și materii prime în cantități mari. Aceștia au în stoc aproape toate tipurile de holșuruburi, șuruburi și piulițe, precum și șaibe, rulmenți, arcuri de tensiune etc. Cumpărați de la ei pentru cantități mari de piese hardware, precum și pentru momentele în care aveți nevoie de o piesă neobișnuită.

source: Don't be turned off by the hidden shipping. Generally, McMaster-Carr's shipping is around the same price as other vendors, and shipping is usually next-day.
ro: În general, costurile de transport ale Dedeman sunt aproximativ la același preț ca și la alți furnizori din România, iar transportul se face de obicei a doua zi.

source: MiSUMI also sells aluminum drawer slides that are popular for linear extensions. They are available in different lengths, but the most common is 400mm.
ro: MiSUMI vinde, de asemenea, glisiere de aluminiu pentru sertare, care sunt populare pentru extensii liniare. Acestea sunt disponibile în diferite lungimi, dar cea mai comună este de 400 mm (40 cm).

source: Active Intake
ro: Intake-uri Active

source: There’s one main rule when it comes to intakes in FTC: you need one. Before diving in, what *is* an intake in the first place?
ro: Există o singură regulă principală în ceea ce privește intake-urile în FTC: aveți nevoie de unul. Înainte de a intra în subiect, ce este un intake în primul rând?

source: An intake is differentiated from a claw as an intake does not grasp individual game elements using a pinching motion, but rather sucks the element in through a variety of means such as wheels, tubes, etc.
ro: Un intake se diferențiază de o gheară deoarece acesta nu apucă elementele individuale ale jocului prin intermediul unei mișcări de "ciupire", ci mai degrabă "aspiră" elementul printr-o varietate de mijloace, cum ar fi roți moi, tuburi etc.

source: There are multiple parts of an effective intake: intake geometry, intake type and material, and speed. However, a common rule of them is the faster the intake, often the more effective it is. For example, near the end of Rover Ruckus, many of the top performing teams used a 3.7:1 (1600 RPM) motor or a 5.2:1 (1000 RPM) motor on their intake.
ro: Există mai multe părți ale unui intake eficient: geometria intake-ului, tipul și materialul intake-ului și viteza. Cu toate acestea, o regulă comună a acestora este că, cu cât este mai rapid intake-ul, cu atât este mai eficient. De exemplu, aproape de finalul sezonului "Rover Ruckus", multe dintre echipele cu performanțe de top au folosit un motor de 3,7:1 (1600 RPM) sau un motor de 5,2:1 (1000 RPM) la intake.

source: While not a necessity, it is highly recommended that teams dedicate at least one motor to their intake if possible.
ro: Deși nu este o necesitate, este foarte recomandat ca echipele să dedice cel puțin un motor pentru intake-ul lor, dacă este posibil.

source: When your intake comes in contact with game elements, you want it to instantly control them. You should design with a margin for error, both in the orientation of the game piece and in the alignment of the robot. For example, look at FRC\ |reg| Team 694’s ball intake on their 2019 robot:
ro: Atunci când intake-ul intră în contact cu elementele de joc, vrei ca acesta să le "aspire" instantaneu. Ar trebui să proiectați design-ul cu o marjă de eroare, atât în ceea ce privește orientarea piesei de joc, cât și în ceea ce privește alinierea robotului. De exemplu, uitați-vă la intake-ul de minge al echipei de FRC \ |reg| Team 694 de pe robotul lor din 2019:

source: When this robot drives up to a ball, it barely has to point itself at the ball before the ball is instantly locked in between the two rows of wheels. What makes it so effective is the immense amount of testing that went into its design. The team tried a number of intake shapes, initially building with wood and rubber bands, and recorded which shapes were most effective. By testing their intake design out before competition, they didn’t have to guess whether it would work as intended: they put it on the field with confidence.
ro: Atunci când acest robot se apropie de o minge, abia dacă trebuie să se îndrepte spre ea și mingea este blocată instantaneu între cele două rânduri de roți. Ceea ce îl face atât de eficient este cantitatea imensă de teste care au fost efectuate pentru proiectarea sa. Echipa a încercat o serie de forme de intake, construind inițial cu lemn și benzi de cauciuc, și a înregistrat care forme au fost cele mai eficiente. Prin testarea design-ului de intake înainte de competiție, nu a trebuit să ghicească dacă va funcționa așa cum a fost prevăzut: au pus-o pe teren cu încredere.

source: Principles of an Intake
ro: Principiile unui Intake

source: An intake must be reliable, as picking up and scoring game elements is the primary method to gain points in all FTC games.
ro: Un intake trebuie să fie fiabil, deoarece colectarea și marcarea elementelor de joc este principala metodă de a câștiga puncte în toate jocurile FTC.

source: Intakes have many moving parts and are susceptible to breaking, especially at high RPM. Thus, the intake material must be durable to withstand long periods of operation.
ro: Intake-urile au multe piese mobile și sunt predispuse la rupere, în special la viteze mari. Astfel, materialul intake-ului trebuie să fie durabil pentru a rezista la perioade lungi de funcționare.

source: Intakes often stick outside of the robot frame perimeter. In this case, durability becomes extremely important; the intake must be built so that they can withstand impacts/collisions with other robots or parts of the field.
ro: Adesea, intake-urile se lipesc în afara perimetrului cadrului robotului. În acest caz, durabilitatea devine extrem de importantă; intake-urile trebuie să fie construite astfel încât să poată rezista la impacturi/coliziuni cu alți roboți sau cu părți ale terenului.

source: There are two ways to accomplish this - either by building the intake very robustly (lots of support so it doesn't break), or making the intake flexible (for example out of lexan or spring loading it) so that even though it may bend due to impacts, it will always spring back into place.
ro: Există două modalități de a realiza acest lucru - fie construind intake-ul foarte robust (cu mult suport pentru a nu se rupe), fie făcând intake-ul flexibil (de exemplu, din plexiglas sau cu un arc), astfel încât, chiar dacă se va îndoi din cauza impactului, acesta isi va reveni întotdeauna la locul ei.

source: Another way to prevent intake breaking is to make a fully retractable intake that won’t protrude outside the 18” cube, though this is seldom needed.
ro: O altă modalitate de a preveni ruperea intake-ului este de a face un intake complet retractabil care să nu iasă în afara cubului de 45 cm, deși acest lucru este rareori necesar.

source: Even though it was relatively easy to make a compliant wheel intake that could effectively intake glyphs in one direction, it was hard to make an intake that could deal with angled glyphs. Being able to intake glyphs in all orientations was especially important for multi-glyph autonomous modes.
ro: Chiar dacă a fost relativ ușor să se realizeze un dispozitiv de intake din roti "compliant" care să poată "aspira" eficient elementele de joc într-o singură direcție, a fost greu să se realizeze un intake care să poată face față elementelor de joc înclinate. Capacitatea de a aspira elemente de joc în toate orientările a fost deosebit de importantă pentru autonomiile cu mai multe elemente de joc.

source: The intake must be able to consistently control the game elements. For example, if the intake is too fast and the collection box is not well designed, then game pieces might fly out. If the intake is too slow, it may jam itself when contacting the game elements.
ro: Intake-ul trebuie să fie capabil să controleze în mod constant elementele de joc. De exemplu, dacă intake-ul este prea rapid și cuva de colectare a elementelor nu este bine concepută, atunci piesele de joc ar putea să zboare. Dacă intake-ul este prea lent, se poate bloca singur la contactul cu elementele de joc.

source: It is possible for pieces to get jammed at an unreachable angle, especially when using wheeled intakes. If this occurs, ensure that the driver can jar the stuck element loose to avoid having a disabled robot.
ro: Este posibil ca piesele să se blocheze într-un unghi inaccesibil, în special atunci când se utilizează intake-uri cu roți. Dacă se întâmplă acest lucru, asigurați-vă că driver-ul poate să zguduie elementul blocat pentru a evita să aveți un robot inutilizabil.

source: The key to any successful robot is cycle time. Reducing cycle time by having an efficient intake will lead to major improvements in score. A good intake should take no more than a few seconds to successfully collect the needed elements.
ro: Cheia pentru orice robot de succes este timpul de ciclu. Reducerea duratei ciclului prin intermediul unui intake eficient va duce la îmbunătățiri majore ale scorului. Un ciclu ideal nu ar trebui să dureze mai mult de câteva secunde pentru a colecta cu succes elementele necesare.

source: For example, in Relic Recovery, the best intakes often had a <3 second collection time for two game elements, and in Rover Ruckus a 1 second collection time was desired at the highest level.
ro: De exemplu, în Relic Recovery, cele mai bune intake-uri au avut adesea un timp de colectare de sub 3 secunde pentru două elemente de joc, iar în Rover Ruckus s-a dorit un timp de colectare de o secundă la cel mai înalt nivel.

source: Types of Intake
ro: Tipuri de Intake-uri

source: Horizontal/Top Intake
ro: Intake Orizontal/Superior
