Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs.po
Languages: ro

source: A horizontal intake generally is a wider style of intake that has the intake rotating on a horizontal axis or plane. Horizontal intakes are generally used for intaking smaller game elements, as these types of intakes can control more than one piece at a time. Horizontal intakes have been used successfully in games such as Res-Q and Rover Ruckus, where teams needed to pick up small cubes and balls from the floor.
ro: Un intake orizontal este, în general, un stil de intake mai lat, în care intake-ul se rotește pe o axă sau un plan orizontal. Intake-urile orizontale sunt în general folosite pentru "aspirarea" elementelor de joc mai mici, deoarece aceste tipuri de intake-uri pot controla mai mult de un element odată. Intake-urile orizontale au fost utilizate cu succes în jocuri precum Res-Q și Rover Ruckus, în care echipele trebuiau să ridice cuburi și bile mici de pe podea.

source: Vertical Intake
ro: Intake Vertical

source: A vertical intake typically has wheels or other intake components rotating on a vertical axis (the z-axis). Vertical intakes are more controllable, as they can only pick up one element at a time. Vertical intakes excel at picking up large game elements which would be impossible to control more than one piece at once, such as the foam glyphs in Relic Recovery.
ro: Un intake vertical are de obicei roți sau alte componente de intake care se rotesc pe o axă verticală (axa z). Intake-urile verticale sunt mai ușor de controlat, deoarece pot prelua doar un singur element la un moment dat. Intake-urile verticale excelează la preluarea elementelor mari de joc care ar fi imposibil de controlat mai mult de un element deodată, cum ar fi elementele din spumă din Relic Recovery.

source: Below are different implementations of horizontal and vertical intakes:
ro: Mai jos sunt prezentate diferite implementări ale intake-urilor orizontale și verticale:

source: Roller and Wheeled Intakes
ro: Intake-uri cu Roți/Role

source: Roller and wheeled intakes refer to types of intakes which work by having some sort of hard or pliable object rotate along an axis. Wheeled intakes use different kinds of wheels (solid traction, compliant, or foam wheels) that propel the game element to the collection bin. Roller intakes are wider, and can sometimes intake more than one game element.
ro: Intake-urile cu role și cu roți se referă la tipuri de intake-uri care funcționează prin rotirea unui obiect dur sau flexibil de-a lungul unei axe. Intake-urile cu roți folosesc diferite tipuri de roți (roți cu tracțiune solidă, roți flexibile sau roți din spumă) care propulsează elementul de joc către coșul de colectare. Intake-urile cu roti sunt mai late și, uneori, pot prelua mai multe elemente de joc.

source: A compliant wheel is a flexible rubber wheel that is primarily used for intakes. These are **NOT** designed for use in drivetrains.
ro: O roată flexibilă (compliant) este o roată de cauciuc flexibilă care este utilizată în principal pentru intake-uri. Acestea NU sunt concepute pentru a fi utilizate în șasiuri.

source: The available bore options vary depending on the vendor. As with the compliant wheels, durometer (hardness of rubber) affects both traction and longevity, sacrificing one for the other. However, in the case of intakes, a lower durometer is recommended to have maximum grippiness for intaking game elements.
ro: Opțiunile de axe disponibile variază în funcție de furnizor. Ca și în cazul roților "complaint", durometrul (duritatea cauciucului) afectează atât tracțiunea, cât și longevitatea, sacrificând una pentru cealaltă. Cu toate acestea, în cazul preluărilor, se recomandă un durometru mai mic pentru a avea o aderență maximă pentru preluarea elementelor de joc.

source: Solid Wheel Intake
ro: Intake cu Roată Dură

source: Solid wheel intakes use wheels such as grip and traction wheels to pick up game elements. They can be effective in picking up large game elements which do not have much tolerance difference.
ro: Intake-urile de roți dure folosesc roți precum roțile de aderență și de tracțiune pentru a prelua elemente de joc. Acestea pot fi eficiente în preluarea elementelor de joc mari care nu au o diferență de toleranță prea mare.

source: However, compliant wheel intakes generally will be more effective because compliant wheels offer more adjustability and forgiveness for the game elements. Compliant wheels also accounting for different game element orientations (the game pieces can get rotated when being controlled) and intake angles (the orientation of the game piece before it reaches the intake).
ro: Cu toate acestea, în general, intake-urile din roți flexibile vor fi mai eficiente, deoarece roțile flexibile oferă mai multă toleranță pentru elementele de joc. De asemenea, roțile tip "compliant" țin cont de diferitele orientări ale elementelor de joc (piesele de joc se pot roti atunci când sunt controlate) și de unghiurile de "aspirare" (orientarea piesei de joc înainte de a ajunge la intake).

source: Compliant Wheel Intake
ro: Intake cu Roți "Compliant"

source: Spring-Loaded Intakes
ro: Intake-uri cu Arc

source: A spring-loaded intake is able to pivot in order to accommodate a game element when it is passing through the intake, but will snap back when the element has gone through. A spring-loaded intake requires more thought, but guarantees that the intake wheel will always be in contact with the desired element.
ro: Un intake cu arc este capabil să pivoteze pentru a găzdui un element de joc atunci când acesta trece prin intake, dar se va întoarce la loc atunci când elementul a trecut. Un intake cu arc necesită mai multă gândire, dar garantează că roata de intake va fi întotdeauna în contact cu elementul dorit.

source: A locked intake simply means that the wheels are locked into place and cannot pivot.
ro: Un intake blocat înseamnă pur și simplu că roțile sunt blocate în poziție și nu pot pivota.

source: 5 mm hex :term:`shaft <Shaft>` is also prone to bending, especially if the :term:`shaft <Shaft>` is long.
ro: :term:` Axul<Shaft> ` de 5 mm hexagonal este, de asemenea, predispus la îndoire, în special dacă :term:`axul<Shaft> ` este lung.

source: The TETRIX build system revolves around 32 mm aluminum :term:`c-channels <Channel>` and a 16mm bolt circle, on 16mm spacing (centers of the circles are 16mm apart). TETRIX is patterned along these :term:`channels <Channel>` to create many mounting options for building structures.
ro: Sistemul de construcție TETRIX se învârte în jurul unor profile din aluminiu de 32 mm :term:`c-channels <Channel> ` și o gaură de șuruburi de 16 mm, la o distanță de 16 mm (centrele găurilor sunt la 16 mm distanță). TETRIX este modelat de-a lungul acestor :term:`profile <Channel> ` pentru a crea numeroase variante de montare pentru structurile de construcție.

source: These channels have a tendency to flex and bend under load, often requiring reinforcement using multiple :term:`channels <Channel>` to maintain their shape.
ro: Aceste canale au tendința de a se îndoi sub sarcină, necesitând deseori întărire cu ajutorul mai multor :term:`profile <Channel> ` pentru a-și menține forma.

source: While TETRIX :term:`channel <Channel>` is measured in metric units, the system employs Imperial (SAE) bolts and Imperial :term:`chain <Chain>`. This mix of units means that things often don’t quite line up how they’re supposed to, causing unforeseen problems.
ro: În timp ce :term:`profilul <Channel> ` TETRIX este măsurat în unități metrice, sistemul folosește șuruburi imperiale și :term:`lanțuri<Chain> ` imperiale. Acest amestec de unități înseamnă că adesea lucrurile nu se aliniază cum ar trebui, provocând probleme neprevăzute.

source: Additional tensioners are often required when using :term:`chain <Chain>` on TETRIX.
ro: Întinzătoarele sunt adesea necesare atunci când se utilizează :term:`lanțurile <Chain> ` pe TETRIX.

source: TETRIX :term:`gears <Gear>` and :term:`sprockets <Sprocket>` offer very limited options for creating ratios. The aluminum :term:`gears <Gear>` tend to grind away very quickly, especially if they are not supported correctly on both sides.
ro: :term:`Angrenajele <Gear> ` TETRIX și :term:`pinioanele <Sprocket> ` oferă opțiuni foarte limitate pentru crearea de rapoarte. :term:`Angrenajele<Gear>` din aluminiu tind să se uzeze foarte repede, mai ales dacă nu sunt susținute corect pe ambele părți.

source: Tetrix parts generally do not have the best track record for reliability and longevity due to subpar material choices.
ro: Piesele Tetrix nu au, în general, cea mai bună reputație în ceea ce privește fiabilitatea și longevitatea din cauza alegerii unor materiale inferioare.

source: Tetrix parts are slightly overpriced and lack bang-for-your-buck value found in kits such as REV and goBILDA.
ro: Piesele Tetrix au un preț ușor supraevaluat și nu au un raport calitate-preț bun, așa cum se găsește în kituri precum REV și goBILDA.

source: While you may be considering TETRIX as a starter kit, we encourage you to explore your options before selecting a kit. While Tetrix does pick up quite a lot of flak from the community, it isn’t a bad choice in terms of physical qualities such as strength, but the mounting options and hole patterns leave more to be desired and restrict teams in terms of flexibility.
ro: Deși este posibil să luați în considerare TETRIX ca kit de pornire, vă încurajăm să vă explorați toate opțiunile posibile înainte de a alege un kit. Deși Tetrix primește destul de multe critici din partea comunității, nu este o alegere rea în ceea ce privește calitățile fizice, cum ar fi rezistența, dar opțiunile de montare și modelele de găuri lasă mai mult de dorit și restricționează echipele în ceea ce privește flexibilitatea.

source: The TETRIX kit, being the most basic of all kit options, is easy to learn and provides a variety of options in building. The kit itself comes with :term:`c-channel <Channel>`, which is aluminum shaped in a C. It has pre-cut holes so motors, :term:`gears <Gear>`, or :term:`drive shafts <Shaft>` can be seamlessly integrated into the channel. For a beginner team with little to no experience, a TETRIX kit allows you to assemble a working drivetrain in a couple of hours (Note: Most other kits allow you to do the same thing, but with more customization options).
ro: Kitul TETRIX, fiind cea mai de bază dintre toate opțiunile de kit, este ușor de învățat și oferă o varietate de opțiuni de construcție. Kitul în sine vine cu :term:`profile<Channel> `, care este o foaie de aluminiu în formă de C. Acesta are găuri pretăiate, astfel încât motoarele, :term:`angrenajele <Gear> `, sau :term:`transmisiile <Shaft> ` pot fi integrate fără probleme în canal. Pentru o echipă la început de drum cu puțină sau deloc experiență, un kit TETRIX vă permite să asamblați o transmisie funcțională în câteva ore (Notă: Majoritatea kit-urilor vă permit să faceți același lucru, dar cu mai multe opțiuni de personalizare).
