Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/index.po
Languages: es, fr, ja, ro, ru, zh_cn

source: Game Manual 0 Table of Contents
es: Game Manual 0 Índice
fr: table des matières de Game Manual 0
ja: Game Manual 0 目次
ro: Cuprinsul Ghidului "Game Manual 0"
ru: Содержание Game Manual 0
zh_cn: Game Manual 0 目录

source: Index
es: Índice
fr: Annexe
ja: 目次
ro: Categorii
ru: Указатель
zh_cn: 索引

source: This content is translated from English, and as such may include some English phrases for technical terms.
es: Este contenido se traduce del inglés y, como tal, puede incluir algunas frases en inglés para términos técnicos.
fr: Ce contenu est traduit de l'anglais, et peut donc inclure certains termes techniques en anglais.
ja: このコンテンツは英語から翻訳された物のため、専門用語に英語表現が含まれる可能性があります。また、翻訳に間違いがありましたら、GitHubで教えて下さい。
ro: Conținutul acestui ghid este tradus din limba engleză și poate conține diverse expresii în limba engleză pentru termeni tehnici.
ru: Этот документ переведен с английского языка и поэтому может содержать некоторые английские фразы, обозначающие технические термины.
zh_cn: 本手册内容翻译自英文，因此可能其中的一些专业术语依然保留英文原文。FTC #19656的团队贡献了上百小时时间进行翻译和润色，但依然可能有不少纰漏。欢迎提出指正，参见 :doc:`/docs/contributing/methods-of-contributing` 。手册中涉及的内容和观点仅代表原作者看法，与译者无关。

source: Start Here
es: Comenzar Aquí
fr: Commencer Ici
ja: ここから始める
ro: Introducere
ru: С чего начать?
zh_cn: 从这里开始

source: Are you a rookie team? Are you new to FTC\ |reg|? Are you just looking for a refresher? Check out this section for a curated list of the most pertinent pages!
es: ¿Eres un equipo novato? ¿Eres nuevo en FTC\ |reg|? ¿Solo estás buscando una actualización? ¡Consulta esta sección para obtener una lista seleccionada de las páginas más pertinentes!
fr: Êtes-vous une équipe débutante ? Êtes-vous nouveau dans le Défi Techno FTC\ |reg|? Ou cherchez-vous simplement à réviser ? Consultez cette section pour une liste sélectionnée des pages les plus pertinentes !
ru: Вы новая команда? Вы новичок в FTC\ |reg|? Вам просто нужно освежить знания? Загляните в этот раздел, где собраны самые важные страницы!
zh_cn: 你是新秀团队吗？你是 FTC\ |reg| 的新手吗？你只是想复习一下？请查看本部分最相关页面的精选列表！

source: Being a Team
es: Ser un Equipo
fr: Être une Équipe
ja: チームを始める
ru: Работа в команде
zh_cn: 成为一个团队

source: Covers how to start, organize, and run an effective team.
es: Cubre cómo comenzar, organizar y dirigir un equipo efectivo.
fr: Couvre comment démarrer, organiser et diriger une équipe efficace.
ja: どのようにして効果的なチームを立ち上げ、組織化し、運営するかを説明します。
ru: Рассказывает о том, как создать, организовать и эффективно управлять командой.
zh_cn: 涵盖如何建立、组织和运行一个有效的团队。

source: Design Skills
es: Habilidades de Diseño
fr: Compétences en Conception
ja: 設計スキル
ro: Elemente de Design
ru: Стратегия разработки
zh_cn: 设计技巧

source: Covers generic design skills, including the engineering design process, design strategy, and CAD.
es: Cubre habilidades de diseño genéricas, incluyendo el proceso de diseño de ingeniería, estrategia de diseño y CAD.
fr: Couvre les compétences de conception génériques, y compris le processus de conception ingénierie, la stratégie de conception et le CAD
ja: エンジニアリング設計プロセス、設計戦略、CADなど、一般的な設計スキルについて説明します。
ro: Elemente generale de design, inclusiv procesul de design și prototipare, strategii de design și CAD.
ru: Рассказывает общие навыки проектирования, включая процесс инженерного проектирования, стратегию проектирования и САПР.
zh_cn: 涵盖通用设计技能，包括工程设计过程、设计策略和CAD。

source: Hardware Components
es: Componentes de Hardware
fr: Composants matériels
ja: ハードウェアの構成要素
ro: Componente Hardware
ru: Компоненты оборудования
zh_cn: 硬件组件

source: Compares the kit options, has a list of useful tools, and some general advice.
es: Compara las opciones del kit, tiene una lista de herramientas útiles y algunos consejos generales.
fr: Compare des options de trousse, liste d'outils utiles et conseils généraux
ja: キットの比較、便利なツール、いくつかの一般的なアドバイスを示します。
ro: Comparații între diferite kit-uri, unelte necesare și sfaturi generale.
ru: Сравнение вариантов комплектации, список полезных инструментов и несколько общих советов.
zh_cn: 比较套件选项，列出有用的工具和一些常规建议。

source: Common Mechanisms
es: Mecanismos Comunes
fr: Mécanismes communs
ja: 一般的な機構
ro: Mecanisme Generale
ru: Распространенные механизмы
zh_cn: 常见机械结构

source: Contains descriptions, advantages/disadvantages, and examples of common mechanisms, including: drivetrains, arms, linear motion, intakes, and dead wheels. Also covers some specific common design tradeoff recommendations and power transmission.
es: Contiene descripciones, ventajas/desventajas y ejemplos de mecanismos comunes, incluyendo: chasis, brazos, movimiento lineal, intakes y ruedas muertas. También abarca algunas recomendaciones específicas de compensación de diseño comunes y transmisión de potencia.
fr: Contient des descriptions, avantages/désavantages, et des exemples de mécanismes communs, incluant; châssis, bras, le mouvement linéaire, l'aspiration, et les roues mortes. Cela couvre également certaines recommandations spécifiques sur les compromis de conception courants et la transmission de puissance.
ja: Drivetrain、Arm、Linear Motion、Intake、Dead Wheelsなど、一般的なメカニズムの説明、長所/短所、および例が含まれています。また、一般的な設計におけるトレードオフの推奨事項と動力伝達についても説明します。
ro: Descrieri, pro și contra, și exemple de mecanisme comune în FTC, precum: șasiuri, brațe mecanice, mișcarea liniară, intake-uri și "dead wheels". De asemenea și niște recomandări în legătură cu compromisuri comune în mecanică și transmisii.
ru: Содержит описания, преимущества/недостатки и примеры распространенных механизмов, включая колесные базы, манипуляторы, линейные системы, активные захваты и одометрию. Также рассматриваются некоторые конкретные рекомендации по улучшениям при проектировании и передаче мощности.
zh_cn: 包含常见机构的描述、优/缺点,和示例，包括：传动系统、机械臂、直线运动导轨、吸入拾取结构和惰轮。还涵盖了一些特定的常见设计权衡建议和动力传动。

source: Custom Manufacturing
es: Fabricación Personalizada
fr: Fabrication sur mesure
ja: カスタムパーツの作成
ro: Fabricarea Componentelor "Custom"
ru: Кастомное производство
zh_cn: 定制制造

source: Covers which materials are appropriate to use when and specifics to 3D printing and machining.
es: Cubre qué materiales son apropiados para cuándo usarlos y detalles sobre impresión 3D y maquinado.
fr: Couvre les matériaux appropriés à utiliser selon les situations et les spécificités de l'impression 3D et de l'usinage.
ja: 3D プリントと加工の際にどの材料を使用するのが適切か、およびその詳細について説明します。
ro: Ce materiale sunt potrivite pentru fabricarea componentelor personalizate și recomandări pentru printarea 3D și fabricarea cu CNC.
ru: Рассказывается о том, какие материалы целесообразно использовать в тех или иных случаях, а также о специфике 3D-печати и механической обработки.
zh_cn: 涵盖哪些材料适合在何时使用以及3D打印和机械加工的细节。

source: Electronics and Motion Components
es: Electrónica y Componentes de Movimiento
fr: Composants Électroniques et de Mouvement
ja: 電子部品・機構部品
ro: Componente Electronice și de Mișcare
ru: Электроника и компоненты движения
zh_cn: 电子和运动元件

source: Covers wiring, the control system, motors, servos, and sensors.
es: Cubre el cableado, el sistema del control, los motores, los servos y los sensores.
fr: Couvre le câblage, le système de contrôle, les moteurs, les servomoteurs et les capteurs.
ja: 配線、制御システム、モーター、サーボ、センサーについて説明します。
ro: Conectarea componentelor electronice, sistemul de control al robotului, motoare electrice, servomotoare și senzori.
ru: Рассказывается о проводке, системе управления, моторах, сервоприводах и датчиках.
zh_cn: 涵盖布线、控制系统、电机、舵机和传感器。

source: Software
fr: Logiciel
ja: ソフトウェア
ro: Programare
ru: Программное обеспечение
zh_cn: 软件

source: Covers a range of software topics.
es: Cubre una variedad de temas de software.
fr: Couvre un éventail de sujets liés au logiciel.
ja: ソフトウェアに関して説明します。
ro: Diverse subiecte legate de programarea robotului.
ru: Охватывает целый ряд тем, связанных с программным обеспечением.
zh_cn: 涵盖一系列软件主题。

source: Useful Resources
es: Recursos Útiles
fr: Ressources utiles
ja: 役に立つリソース
ro: Resurse Folositoare
ru: Полезные ресурсы
zh_cn: 有用资源

source: A list of useful resources and accompanying descriptions, with especially pertinent ones marked.
es: Una lista de recursos útiles y descripciones correspondientes, con los más pertinentes marcados.
fr: Une liste de ressources utiles avec des descriptions accompagnantes, avec des éléments particulièrement pertinents.
ja: 役に立つリソースと説明のリストです。特に重要なものはマークされています。
ro: O listă cu diverse resurse folositoare, elaborate.
ru: Список полезных ресурсов и сопровождающих описаний, самые актуальные помечены.
zh_cn: 有用资源的列表和随附的描述，并标记出特别相关的内容。

source: Know Your Lingo
es: Conoce tu Jerga
fr: Connaissez votre jargon
ja: 用語解説
ro: Dicționarul FTC
ru: Знайте ваш язык!
zh_cn: 了解行话

source: A list of commonly used FTC slang and their meanings.
es: Una lista de jerga comúnmente utilizada por la FTC y sus significados.
fr: Une liste d’argot couramment utilisé en FTC et leurs significations.
ja: よく使われるFTCスラングとその意味の一覧です。
ro: O listă de termeni comuni folosiți de comunitatea FTC.
ru: Список часто используемых сленгов FTC и их значений.
zh_cn: 常用FTC术语列表及其含义。

source: Appendix
es: Apéndice
fr: Annexe
ja: 付録
ro: Diverse
ru: Приложение
zh_cn: 附录

source: Contains a glossary, a robot design gallery, and information about specific vendors.
es: Contiene un glosario, una galería de diseño de robots e información sobre proveedores específicos.
fr: Contient un glossaire, une galerie de conceptions de robots et des informations sur des fournisseurs spécifiques.
ja: 用語集、ロボットデザインギャラリー、ベンダー情報などがあります。
ro: Aici găsești o galerie cu modelele roboților documentați în trecut și diverse sfaturi în legătură cu producătorii de piese pentru roboți.
ru: Содержит глоссарий, галерею дизайна роботов и информацию о конкретных производителях.
zh_cn: 包含词汇表、机器人设计库以及有关特定供应商的信息。

source: Are you a rookie team? Are you new to FTC? Are you just looking for a refresher? Check out this section for a curated list of the most pertinent pages!
ro: Fie că faci parte dintr-o echipă la început de drum, ești în primul tău an de FTC sau vrei să îți împrospătezi memoria, aici poți găsi o listă cu cele mai folositoare pagini din acest ghid.
