Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/custom.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Custom Options
es_mx: Opciones personalizadas
fr_ca: Options Personnalisées
ro_ro: Opțiuni Personalizate
zh_cn: 个性化定制选择

source: Some teams have opted to build custom solutions for linear motion. Many of these teams borrow concepts from FRC\ |reg| teams, modeling their elevators off of the tall systems found on the larger robots. There's a reason that many competitive FRC teams build the same type of elevator - at their scale, the box tube elevator has proven to be the most efficient way to get game pieces off the ground at blisteringly fast speeds.
es_mx: Algunos equipos han optado por construir soluciones personalizadas para el movimiento lineal. Muchos de estos equipos toman prestados conceptos de los equipos de FRC\ |reg|, modelando sus elevadores a partir de los sistemas altos que se encuentran en los robots más grandes. Hay una razón por la cual muchos equipos competitivos de FRC construyen el mismo tipo de elevador: a su escala, el elevador de tubo de caja ha demostrado ser la forma más eficiente de sacar las piezas del juego del suelo a velocidades increíblemente rápidas.
fr_ca: Certaines équipes ont choisi de construire des solutions personnalisées pour le mouvement linéaire. Beaucoup de ces équipes empruntent des concepts aux équipes FRC\ |reg|, en modelant leurs ascenseurs sur les grands systèmes que l'on trouve sur les robots plus grands. Ce n'est pas pour rien que de nombreuses équipes FRC compétitives construisent le même type d'élévateur : à leur échelle, l'élévateur à tubes s'est avéré être le moyen le plus efficace de faire décoller les pièces du jeu à des vitesses épatantes.
zh_cn: 一些团队选择定制线性运动解决方案。其中许多团队借鉴了 FRC\ |reg| 团队的概念，以大型机器人上的高大系统为蓝本来设计他们的升降结构。许多 FRC 竞技团队建造相同类型的升降机是有原因的--在他们的规模中，箱管式升降结构已被证明是以极快的速度将游戏部件送离地面的最有效方式。

source: When built correctly, an elevator of this type can withstand hundreds of pounds of load on any axis while barely weighing anything. However, existing off-the-shelf options already fill the linear motion needs of most FTC\ |reg| teams.
es_mx: Cuando se construye correctamente, un elevador de este tipo puede soportar cientos de libras de carga en cualquier eje mientras apenas pesa algo. Sin embargo, las opciones existentes disponibles ya satisfacen las necesidades de movimiento lineal de la mayoría de los equipos de FTC\ |reg|.
fr_ca: Lorsqu'il est construit correctement, un ascenseur de ce type peut supporter des centaines de livres de charge sur n'importe quel axe tout en ayant un faible poids. Cependant, les options existantes sur étagère répondent déjà aux besoins de la plupart des équipes FTC\ |reg| en matière de mouvements linéaires.
zh_cn: 如果制造得当，这种类型的升降结构可以在任何轴上承受数百磅的负载，而几乎没有任何重量。然而，现有的现成选件已经可以满足大多数 FTC\ |reg| 团队的线性运动需求。

source: Custom extension systems also require tons of work in CAD, hours upon hours of manufacturing time, and may need multiple iterations before they work correctly. Due to their complexity and how challenging they are to design, less experienced teams may encounter significant challenges.
es_mx: Los sistemas de extensión personalizados también requieren toneladas de trabajo en CAD, horas y horas de tiempo de fabricación, y pueden necesitar múltiples iteraciones antes de que funcionen correctamente. Debido a su complejidad y lo desafiante que es diseñarlos, los equipos menos experimentados pueden enfrentar desafíos significativos.
fr_ca: Les systèmes d'extension personnalisés nécessitent également des tonnes de travail en CAO, des heures et des heures de fabrication, et peuvent nécessiter de nombreuses itérations avant de fonctionner correctement. En raison de leur complexité et de la difficulté de leur conception, les équipes moins expérimentées peuvent rencontrer des difficultés importantes.
ro_ro: Sistemele personalizate necesită de asemenea multe ore de proiectare a acestora, urmate de alte multe ore de manufacturare și este posibil să necesite iterații multiple pentru a funcționa corect. Din cauza complexității lor și a faptului că sunt dificil de proiectat, echipele mai puțin experimentate este posibil să întâmpine dificultăți.
zh_cn: 定制扩展系统还需要大量的计算机辅助设计工作，数小时的制造时间，并且可能需要多次迭代才能正常工作。由于它们的复杂性和设计的挑战性，经验不足的团队可能会遇到重大挑战。

source: Lightweight drawer slides (MiSUMI aluminum and Long Robotics Slides) can offer similar performance at a fraction of the complexity.
es_mx: Rieles de cajón ligeros (aluminio MiSUMI y rieles Long Robotics) pueden ofrecer un rendimiento similar a una fracción de la complejidad.
fr_ca: Les glissières légères (MiSUMI aluminium et Long Robotics Slides) peuvent offrir des performances similaires pour une fraction de la complexité.
ro_ro: Glisierele de sertar ușoare (glisierele de aluminiu de la MISUMI și cele de la Long Robotics) pot oferi performanțe similare la o complexitate redusă semnificativ.
zh_cn: 轻型抽屉滑轨（MiSUMI 铝制滑轨和 Long Robotics 滑轨）可以提供类似的性能，但复杂程度却远低于上述架构。

source: 7236's Rover Ruckus bot with custom box tube elevator
es_mx: 7236's Rover Ruckus bot con elevador de tubo de caja personalizado
fr_ca: Le robot Rover Ruckus de 7236 avec l'élévateur à tubes en boîte personnalisé
ro_ro: Robotul echipei 7236 din sezonul Rover Ruckus construit cu un sistem de ridicare de tip box tube
zh_cn: 7236 的 Rover Ruckus 机器人，装载有定制的箱管升降结构

source: 7236 Recharged Green, Rover Ruckus, custom box tube linear elevator
es_mx: 7236 Recharged Green, Rover Ruckus, elevador lineal de tubo de caja personalizado
fr_ca: 7236 Recharged Green, Rover Ruckus, élévateur linéaire à tubes en caisson sur mesure
ro_ro: Robotul echipei 7236, Recharged Green din sezonul Rover Ruckus construit cu un sistem de ridicare de tip box tube
zh_cn: 7236 Recharged Green，Rover Ruckus，定制的箱管式线性升降结构

source: 13075's Rover Ruckus bot with custom 8020 hang
es_mx: 13075's Rover Ruckus bot con gancho personalizado 8020
fr_ca: Le bot Rover Ruckus de 13075 avec une suspension 8020 personnalisée
ro_ro: Robotul echipei 13075 din sezonul Rover Ruckus cu un sistem de suspendare personalizat
zh_cn: 13075 的 Rover Ruckus 机器人，带有定制的 8020 挂件

source: 13075 Coram Deo Academy Robotics, Rover Ruckus, custom 8020 chain driven hang
es_mx: 13075 Coram Deo Academy Robotics, Rover Ruckus, cadena 8020 personalizada impulsada para colgar.
fr_ca: 13075 Coram Deo Academy Robotics, Rover Ruckus, suspension à chaîne 8020 personnalisée
ro_ro: Robotul echipei 13075, Coram Deo Academy Robotics din sezonul Rover Ruckus cu un sistem de suspendare personalizat, pe bază de lanț.
zh_cn: 13075 Coram Deo Academy Robotics，Rover Ruckus，并装载了定制 8020 链传动吊架

source: 7172's custom fishing pole based extension CAD model
es_mx: 7172's modelo CAD de extensión de caña de pescar personalizada
fr_ca: La canne à pêche personnalisée de 7172 est basée sur le modèle CAO de l'extension.
ro_ro: Proiectul 3D al sistemului liniar personalizat al echipei 7172, bazat pe undițe de pescuit.
zh_cn: 7172 的定制鱼竿，基于扩展 CAD 模型

source: 7172's custom fishing pole based extension
es_mx: 7172's extensión de caña de pescar personalizada
fr_ca: L'extension personnalisée de 7172 basée sur une canne à pêche
ro_ro: Sistemul liniar personalizat al echipei 7172, bazat pe undițe de pescuit.
zh_cn: 7172 定制的基于鱼竿的扩展装置

source: 7172 Technical Difficulties, Rover Ruckus, fishing pole extension using gear rack
es_mx: 7172 Technical Difficulties, Rover Ruckus, extensión de caña de pescar utilizando cremallera de engranajes
fr_ca: 7172 Difficultés techniques, Rover Ruckus, extension de la canne à pêche à l'aide d'un porte-bagages
ro_ro: Sistemul liniar personalizat al echipei 7172, Technical Difficulties, bazat pe undițe de pescuit, folosind un sistem de roți dințate.
zh_cn: 7172 的技术难题：Rover Ruckus，使用齿轮架延长鱼竿

source: Some teams have opted to build custom solutions for linear motion. Many of these teams borrow concepts from FRC\ |reg| teams, modeling their elevators off of the tall systems found on the larger robots. There’s a reason that many competitive FRC\ |reg| teams build the same type of elevator - at their scale, the box tube elevator has proven to be the most efficient way to get game pieces off the ground at blisteringly fast speeds.
ro_ro: Unele echipe au ales să construiască soluții personalizate pentru mișcarea liniară. Multe dintre acestea împrumută concepte de la echipe din FRC/ |reg|, modelându-și sistemele de ridicare după sisteme înalte găsite pe roboți mai mari. Multe dintre echipele competitive din FRC/ |reg| construiesc același tip de sistem de ridicare cu un motiv - la scara acestor roboți, un sistem de ridicare de tip box tube s-a dovedit a fi cel mai eficient mod de a ridica elementele de joc de pe pământ cu viteze foarte mari.

source: When built correctly, an elevator of this type can withstand hundreds of pounds of load on any axis while barely weighing anything. However, existing off-the-shelf options already fill the linear motion needs of most FTC teams.
ro_ro: Construit corect, un sistem de ridicare de acest tip poate suporta o sarcină de sute de kilograme pe orice axă, sistemul în sine cântărind foarte puțin. Cu toate acestea, sistemele pre-fabricate existente pe piață deja îndeplinesc cerințele de mișcare liniară pentru majoritatea echipelor FTC.
