Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/drawer-slides.po
Languages: es_mx, fr_ca, zh_cn

source: Recommended to mount slides to channel to prevent bending
es_mx: Recomendado montar los rieles al canal para evitar que se doble.
fr_ca: Il est recommandé de monter les glissières sur le canal pour éviter qu'elles ne se plient.
zh_cn: 建议将滑轨安装在通道上以防止弯曲

source: Long Robotics Slides
fr_ca: Glissières Long Robotics
zh_cn: Long Robotics 滑轨

source: Due to the tendency of the endstops to fail, as well as inconsistent jamming issues on the slides, Long Robotics slides are no longer recommended to purchase
es_mx: Debido a la tendencia de los finales de tope a fallar, así como a problemas inconsistentes de atasco en los deslizadores, ya no se recomienda comprar los deslizadores de Long Robotics.
fr_ca: En raison de la tendance à la défaillance des butées et des problèmes de blocage des glissières, il n'est plus recommandé d'acheter les glissières Long Robotics.
zh_cn: 由于末端限位装置容易失效，以及滑轨出现随机的卡顿问题，因此现已不再建议购买 Long Robotics 滑轨

source: The `Long Robotics <https://longrobotics.com/>`_ slides are also used by teams because they are almost as smooth as MiSUMI slides due to the ball bearing system but slightly cheaper.
es_mx: Los rieles de `Long Robotics <https://longrobotics.com/>`_ también son utilizados por los equipos porque son casi tan suaves como los rieles de MiSUMI debido al sistema de rodamientos de bolas pero un poco más baratas.
fr_ca: Les glissières "Long Robotics <https://longrobotics.com/>" sont également utilisées par les équipes car elles sont presque aussi douces que les glissières MiSUMI grâce au système de roulement à billes, mais elles sont légèrement moins chères.
zh_cn: Long Robotics <https://longrobotics.com/>`_滑轨也被参赛队使用，因为它采用滚珠轴承系统，几乎与 MiSUMI 滑轨一样顺滑，但价格略低。

source: They utilize M4 mounting bolts, and can mount directly to goBILDA channel. They are virtually identical to the SAR2 series of MiSUMI slides.
es_mx: Utilizan tornillos de montaje M4 y se pueden montar directamente en el canal goBILDA. Son prácticamente idénticos a la serie SAR2 de deslizadores MiSUMI.
fr_ca: Elles utilisent des boulons de montage M4 et peuvent être montées directement sur le profilé goBILDA. Elles sont pratiquement identiques aux glissières MiSUMI de la série SAR2.
zh_cn: 它们使用 M4 安装螺栓，可直接安装到 goBILDA 通道上。它们与 SAR2 系列 MiSUMI 滑轨几乎完全相同。

source: The manufacturer website has CAD files for 3D printed inserts that go between the slides, which V-bearings are mounted to. V-bearings are `available from Long Robotics <https://longrobotics.com/product/3x12x4mm-v-bearing-10-pack/>`_. To attach slides, one will need to purchase **countersunk M4 screws**, which are `also available from Long Robotics <https://longrobotics.com/product/6mm-d-low-head-10mm-m4-screw-10-pack-t10-torx-drive/>`_.
es_mx: El sitio web del fabricante tiene archivos CAD para insertos impresos en 3D que van entre los rieles, a las cuales se montan los rodamientos en V. Los rodamientos en V están disponibles en Long Robotics <https://longrobotics.com/product/3x12x4mm-v-bearing-10-pack/>. Para sujetar los rieles, se necesitará comprar **tornillos M4 avellanados**, los cuales también están disponibles en Long Robotics <https://longrobotics.com/product/6mm-d-low-head-10mm-m4-screw-10-pack-t10-torx-drive/>.
fr_ca: Le site web du fabricant propose des fichiers CAO pour des inserts imprimés en 3D qui s'insèrent entre les glissières, sur lesquelles sont montés les paliers en V. Les paliers en V sont `disponibles auprès de Long Robotics <https://longrobotics.com/product/3x12x4mm-v-bearing-10-pack/>`_. Pour fixer les glissières, il faut acheter des **vis M4 à tête fraisée**, qui sont ``également disponibles auprès de Long Robotics <https://longrobotics.com/product/6mm-d-low-head-10mm-m4-screw-10-pack-t10-torx-drive/>`_.
zh_cn: 制造商网站上有三维打印嵌入件的 CAD 文件，这些嵌入件用于安装滑块之间的轴承滑轮，轴承滑轮 `可从 Long Robotics 购买 <https://longrobotics.com/product/3x12x4mm-v-bearing-10-pack/>`_。要安装滑块，需要购买 **M4 沉头螺丝** ， `也可以从 Long Robotics 处购买 <https://longrobotics.com/product/6mm-d-low-head-10mm-m4-screw-10-pack-t10-torx-drive/>`_。

source: These are available in both a `300 mm rail length option <https://longrobotics.com/product/lrs-300-aluminum-slide-300mm-black-anodized/>`_ and `400 mm rail length option <https://longrobotics.com/product/lrs-400-aluminum-slide-400mm-black-anodized/>`_.
es_mx: Estos están disponibles en una opción de longitud de riel de 300 mm <https://longrobotics.com/product/lrs-300-aluminum-slide-300mm-black-anodized/>`_ y una opción de longitud de riel de 400 mm. <https://longrobotics.com/product/lrs-400-aluminum-slide-400mm-black-anodized/>`_.
fr_ca: Ils sont disponibles en option avec un rail de 300 mm de long <https://longrobotics.com/product/lrs-300-aluminum-slide-300mm-black-anodized/>`_ et un rail de 400 mm de long <https://longrobotics.com/product/lrs-400-aluminum-slide-400mm-black-anodized/>`_.
zh_cn: 这些滑轨有 `长度为 300 毫米的 <https://longrobotics.com/product/lrs-300-aluminum-slide-300mm-black-anodized/>`_ 和 `长度为 400 毫米的 <https://longrobotics.com/product/lrs-400-aluminum-slide-400mm-black-anodized/>`_。

source: Compatible with goBILDA channel
es_mx: Compatible con el canal goBILDA.
fr_ca: Compatible avec le profilé goBILDA
zh_cn: 与 goBILDA 生态兼容

source: Cheaper than MiSUMI slides
es_mx: Más barato que los rieles de MiSUMI
fr_ca: Moins cher que les rails coulissants MiSUMI
zh_cn: 比 MiSUMI滑轨便宜

source: 3D Printed spacers are almost required; while other solutions exist, 3D Printed spacers are the simplest and lowest-risk
es_mx: Los espaciadores impresos en 3D son casi necesarios; aunque existen otras soluciones, los espaciadores impresos en 3D son los más simples y de menor riesgo.
fr_ca: Les entretoises imprimées en 3D sont presque obligatoires ; bien qu'il existe d'autres solutions, les entretoises imprimées en 3D sont les plus simples et les moins risquées.
zh_cn: 3D 打印垫片几乎是必需的；虽然存在其他解决方案，但 3D 打印垫片是最简单、风险最低的解决方案

source: Can be difficult to mount to kit systems which aren't :term:`extrusion <Extrusion>` based or don't have holes spaced at 8 mm apart
es_mx: Puede ser difícil de montar en sistemas de kit que no están basados en :term:`extrusión <Extrusion>` o no tienen agujeros espaciados a 8 mm de distancia.
fr_ca: Peut être difficile à monter sur des systèmes de kits qui ne sont pas basés sur :term:`extrusion <Extrusion>` ou qui n'ont pas de trous espacés de 8 mm.
zh_cn: 可能难以安装到非 :term:`extrusion <Extrusion>` 型或孔距不是 8 毫米的套件系统上。

source: The endstops on the slides have been known to fail, spilling ball bearings out of the slide onto the field
es_mx: Los topes en los deslizadores se han sabido fallar, derramando rodamientos de bolas fuera del deslizador hacia el campo.
fr_ca: Les butées de fin de course des glissières sont connues pour parfois céder, provoquant l’échappement de billes hors de la glissière et leur dispersion sur le terrain.
zh_cn: 众所周知，滑轨上的限位装置会发生故障，导致滚珠轴承从滑轨中溢出，掉落到赛场上。

source: Slides have been known to seize and jam on occasion
es_mx: Las rieles se han conocido por atascarse y trabarse en ocasiones.
fr_ca: Les glissières sont connues pour se gripper et se bloquer à l'occasion.
zh_cn: 滑轨有时会卡住或卡死
