Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/drawer-slides.po
Languages: es_mx, fr_ca, zh_cn

source: Drawer Slides
es_mx: Rieles para cajones
fr_ca: Glissières de tiroir
zh_cn: 抽屉滑轨

source: You've *definitely* used a drawer slide before - at least two of them are mounted to almost any drawer that you've opened. Teams use these drawer slides for linear motion, often stacking them using 3D printed spacers to achieve plenty of extension.
es_mx: Has utilizado *definitivamente* un riel de cajón antes, al menos dos de ellos están montados en casi cualquier cajón que hayas abierto. Los equipos utilizan estos deslizadores de cajón para el movimiento lineal, a menudo apilándolos usando espaciadores impresos en 3D para lograr una gran extensión.
fr_ca: Vous avez **certainement** déjà utilisé une glissière de tiroir — au moins deux d'entre elles sont montées sur presque tous les tiroirs que vous avez ouverts. Les équipes utilisent ces glissières de tiroir pour des mouvements linéaires, les empilant souvent à l'aide d'entretoises imprimées en 3D afin d'obtenir une grande extension.
zh_cn: 你 *肯定* 用过抽屉滑轨--几乎所有你打开过的抽屉上都安装有至少两个抽屉滑轨。团队使用这些抽屉滑轨进行线性运动，通常使用 3D 打印垫片将它们堆叠起来，以获得足够的伸展距离。

source: These slides are available from a number of different vendors, and come in many varieties, so choosing the right slide can seem overwhelming. Steel drawer slides are common, but can be hard to mount, as they aren't made to be stacked. Aluminum drawer slides, such as the MiSUMI slides, are generally the best option for teams.
es_mx: Estos rieles están disponibles en varios proveedores y vienen en muchas variedades, por lo que elegir el riel correcto puede parecer abrumador. Los rieles de acero para cajones son comunes, pero pueden ser difíciles de montar, ya que no están hechos para apilarse. Los rieles de aluminio para cajones, como los rieles MiSUMI, son generalmente la mejor opción para los equipos.
fr_ca: Ces glissières sont disponibles auprès d'un certain nombre de fournisseurs et se déclinent en de nombreuses variétés, si bien que le choix de la bonne glissière peut sembler insurmontable. Les glissières en acier sont courantes, mais elles peuvent être difficiles à monter, car elles ne sont pas conçues pour être empilées. Les glissières en aluminium, comme celles de MiSUMI, sont généralement la meilleure option pour les équipes.
zh_cn: 这些滑轨有许多不同的供应商提供，而且种类繁多，因此选择合适的滑轨可能会让人不知所措。钢制抽屉滑轨很常见，但很难安装，因为它们不是用来堆叠使用的。铝制抽屉滑轨，如 MiSUMI 滑轨，通常是团队的最佳选择。

source: **We recommend the Viper Slides or MiSUMI slides for newer teams.** Viper Slides are cheaper and interface better with goBILDA products, while MiSUMI slides interface better with REV products. Viper slides are also available in a `complete kit <https://www.gobilda.com/2-stage-viper-slide-kit/>`_
es_mx: **Recomendamos los Viper Slides o los slides MiSUMI para equipos más nuevos.** Los Viper Slides son más baratos y se interfazan mejor con los productos goBILDA, mientras que los slides MiSUMI se interfazan mejor con los productos REV. Los Viper Slides también están disponibles en un `kit completo <https://www.gobilda.com/2-stage-viper-slide-kit/>`_
fr_ca: **Nous recommandons les Viper Slides ou les glissières MiSUMI pour les nouvelles équipes.** Les Viper Slides sont moins chers et s'interfacent mieux avec les produits goBILDA, tandis que les glissières MiSUMI s'interfacent mieux avec les produits REV. Les Viper Slides sont également disponibles en kit complet <https://www.gobilda.com/2-stage-viper-slide-kit/>_
zh_cn: **我们向新团队推荐 Viper 滑轨或 MiSUMI 滑轨。** Viper 滑轨的价格便宜，与 goBILDA 产品的接口适配更好，而 MiSUMI 滑轨与 REV 产品的安装孔位适配更好。Viper 滑轨也有 `"完整套件"可供购买 <https://www.gobilda.com/2-stage-viper-slide-kit/>`_。

source: When running two sets of drawer slides together, they should be mounted to face each other in order to reduce sag. This is especially important for horizontal extensions.
es_mx: Cuando se ejecutan dos juegos de rieles de cajón juntos, deben montarse cara a cara entre sí para reducir la caída. Esto es especialmente importante para las extensiones horizontales.
fr_ca: Lorsque deux jeux de glissières de tiroirs sont utilisés ensemble, ils doivent être montés face à face afin de réduire l'affaissement. Ceci est particulièrement important pour les extensions horizontales.
zh_cn: 当两组抽屉滑轨一起运行时，它们应面对面安装，以减少下垂。这对于水平方向上的延伸尤其重要。

source: 7236 Recharged Green's Rover Ruckus robot with two sets of SAR3 slides both facing the ground on their horizontal extension.
es_mx: 7236 Robot de Recharged Green de Rover Ruckus con dos juegos de rieles SAR3, ambos mirando hacia el suelo en su extensión horizontal.
fr_ca: 7236 Recharge du robot Rover Ruckus de Green avec deux jeux de glissières SAR3 orientées vers le sol sur leur extension horizontale.
zh_cn: 7236 Recharged Green的 Rover Ruckus 机器人，拥有两套 SAR3 滑轨，都在水平延伸的情况下朝向地面。

source: On 7236's robot, the slides are not facing each other. The sag caused by this is largely mitigated by supporting the extension at the end with omni wheels.
es_mx: En el robot 7236, los rieles no están cara a cara entre sí. La caída causada por esto se mitiga en gran medida al soportar la extensión al final con ruedas omni.
fr_ca: Sur le robot 7236, les glissières ne se font pas face. L'affaissement causé par cette situation est largement atténué par le soutien de l'extension à l'extrémité à l'aide de roues omnidirectionnelles.
zh_cn: 在 7236 的机器人上，滑轨不是面对面的。但通过在末端使用万向轮支撑延伸部分，在很大程度上缓解了由此造成的下垂。

source: 12791 Iterative Intentions's Freight Frenzy Robot with two sets of SAR240 slides facing each other on their horizontal extension.
es_mx: 12791 Robot de Freight Frenzy de Iterative Intentions con dos juegos de rieles SAR240 cara a cara entre sí en su extensión horizontal.
fr_ca: 12791 Robot Freight Frenzy d'Iterative Intentions avec deux jeux de glissières SAR240 se faisant face sur leur extension horizontale.
zh_cn: 12791 Iterative Intentions 的 Freight Frenzy Robot，两组 SAR240 滑轨在水平延伸部分相对。

source: On 12791's robot, the slides face each other, which decreases sag in comparison to other orientations.
es_mx: En el robot 12791, los rieles estan cara a cara entre sí, lo que disminuye la flacidez en comparación con otras orientaciones.
fr_ca: Sur le robot 12791, les glissières se font face, ce qui réduit l'affaissement par rapport à d'autres orientations.
zh_cn: 在 12791 的机器人上，两组滑轨面对面，与其他方向相比，可以减少下垂。

source: Listed below are the recommended drawer slides.
es_mx: A continuación se enumeran los rieles de cajón recomendados.
fr_ca: Les glissières de tiroir recommandées sont indiquées ci-dessous.
zh_cn: 以下是推荐的抽屉滑轨。

source: Steel-rolled cabinet drawer slides
es_mx: Rieles de cajón de gabinete laminados en acero
fr_ca: Glissières de tiroirs de meuble roulées en acier
zh_cn: 钢制橱柜抽屉滑轨

source: Available from your local hardware store, steel slides aren't a bad option for FTC\ |reg| teams, as they are heavy-duty enough for most use cases. However, these kinds of slides are much heavier than other aluminum slide options. Furthermore, these slides are not designed to have bearings or a second slide attached to them, because they only contain mounting for a standard drawer. Thus, these slides require drilling holes in order to mount the necessary parts for linear extension.
es_mx: Disponible en tu ferretería local, los rieles de acero no son una mala opción para los equipos de FTC, ya que son lo suficientemente resistentes para la mayoría de los casos de uso. Sin embargo, este tipo de rieles son mucho más pesados que otras opciones de rieles de aluminio. Además, estos rieles no están diseñados para tener rodamientos o un segundo riel adjunto, ya que solo contienen montaje para un cajón estándar. Por lo tanto, estos rieles requieren perforar agujeros para montar las piezas necesarias para la extensión lineal.
fr_ca: Disponibles dans votre quincaillerie locale, les glissières en acier ne sont pas une mauvaise option pour les équipes de FTC\ |reg|, car elles sont suffisamment résistantes pour la plupart des cas d'utilisation. Cependant, ces glissières sont beaucoup plus lourdes que les autres glissières en aluminium. En outre, ces glissières ne sont pas conçues pour recevoir des roulements ou une deuxième glissière, car elles ne contiennent qu'une fixation pour un tiroir standard. Par conséquent, ces glissières nécessitent de percer des trous afin de monter les pièces nécessaires à l'extension linéaire.
zh_cn: 钢制滑轨可以在当地五金店买到，对于 FTC\ |reg| 团队来说，钢制滑轨也不失为一种好的选择，因为它们的重量足以满足大多数使用情况。不过，这种滑轨比其他铝制滑轨要重很多。此外，这些滑轨在设计上没有孔位安装轴承滑轮或第二个滑轨，因为它们只包含一个标准抽屉所需的的安装孔位。因此，这些滑轨需要钻孔才能安装线性延伸所需的部件。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Commonplace at any hardware store
es_mx: Común en cualquier tienda de ferretería.
fr_ca: Banal dans n'importe quelle quincaillerie
zh_cn: 在任何五金店都很常见

source: Not very expensive
es_mx: No muy caro
fr_ca: Pas très cher
zh_cn: 价格不贵

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Heavier than other slide options (steel as opposed to aluminum)
es_mx: Más pesado que otras opciones de deslizamiento (acero en lugar de aluminio)
fr_ca: Plus lourd que les autres options de glissières (acier par opposition à aluminium)
zh_cn: 比其他滑轨更重（钢制而非铝制）

source: Sliding is usually good but not great
es_mx: El deslizamiento generalmente es bueno pero no excelente.
fr_ca: Le glissement est généralement bon, mais pas excellent
zh_cn: 滑动性能通常还不错，但不是非常好

source: Hard to adapt to building systems
es_mx: Difícil de adaptar a los sistemas de construcción
fr_ca: Difficile de s'adapter aux systèmes de construction
zh_cn: 难以适应仍在搭建的系统

source: 3D printed spacers may be required
es_mx: Espaciadores impresos en 3D pueden ser necesarios
fr_ca: Des entretoises imprimées en 3D peuvent être nécessaires
zh_cn: 可能需要 3D 打印的垫片

source: MiSUMI Telescopic Slide Rails
es_mx: MiSUMI Rieles de Deslizamiento Telescópicos
fr_ca: Rails coulissants télescopiques MiSUMI
zh_cn: MiSUMI伸缩式滑轨

source: The `MiSUMI slide rails <https://us.misumi-ec.com/vona2/detail/110300072130/?HissuCode=SAR240>`_ are preferred by many top-tier teams because they are sturdy, very reliable, and ridiculously smooth due to the ball bearing system. **MiSUMI slides are able to withstand a significant amount of load with little flex**.
es_mx: Los rieles deslizantes de `MiSUMI <https://us.misumi-ec.com/vona2/detail/110300072130/?HissuCode=SAR240>`_ son preferidos por muchos equipos de primer nivel porque son robustos, muy confiables y ridículamente suaves debido al sistema de rodamientos de bolas. **Los rieles de MiSUMI pueden soportar una cantidad significativa de carga con poco flex**.
fr_ca: Les glissières MiSUMI <https://us.misumi-ec.com/vona2/detail/110300072130/?HissuCode=SAR240>`_ sont préférées par de nombreuses équipes de haut niveau parce qu'elles sont robustes, très fiables et ridiculement douces grâce au système de roulement à billes. **Les glissières MiSUMI sont capables de supporter une charge importante avec peu de flexion**.
zh_cn: `MiSUMI 伸缩式滑轨 <https://us.misumi-ec.com/vona2/detail/110300072130/?HissuCode=SAR240>`_ 是许多顶级团队的首选，因为它们坚固耐用、非常可靠，而且由于采用了滚珠轴承系统，顺滑得令人发指。**MiSUMI滑轨能够承受巨大的负荷，几乎没有弯曲。**

source: They are also low-profile, and have a M3 mounting pattern, meaning they are easy to attach to REV components. However, MiSUMI slides have a slightly higher price point, and it is often difficult to attach one slide to the next. An easy solution is to attach the end of one slide piece to REV extrusion, and do the same with the next slide. Then attach the REV pulley bearing on the top of the extrusion piece for the string to run through.
es_mx: También son de perfil bajo y tienen un patrón de montaje M3, lo que significa que son fáciles de sujetar a los componentes REV. Sin embargo, las rieles MiSUMI tienen un punto de precio ligeramente más alto y a menudo es difícil sujetar un riel al siguiente. Una solución fácil es sujetar el extremo de una pieza de riel al extrusor REV y hacer lo mismo con el siguiente riel. Luego, coloque el rodamiento de polea REV en la parte superior de la pieza de extrusión para que pase la cuerda.
fr_ca: Elles sont également peu encombrantes et présentent un schéma de montage M3, ce qui signifie qu'elles sont faciles à fixer sur les composants REV. Cependant, les glissières MiSUMI ont un prix légèrement plus élevé et il est souvent difficile de les fixer l'une à l'autre. Une solution simple consiste à fixer l'extrémité d'une glissière à l'extrusion REV et à faire de même avec la glissière suivante. Fixez ensuite le roulement de la poulie REV sur le haut de la pièce extrudée pour que la ficelle passe à travers.
zh_cn: 它们的外形也很小巧，采用 M3 螺丝安装，这意味着它们很容易安装到 REV 套件上。不过，MiSUMI 滑轨的价位略高，而且通常很难把一个滑轨接到另一个上面。一个简单的解决方案是将一个滑轨的末端连接到 REV 铝挤压型材上，然后将下一个滑轨也这样做。然后将 REV 滑轮轴承安装在铝型材的顶部，让绳子穿过。

source: To save space, some teams have 3D printed an insert that goes between each slide instead of using the 15mm extrusion piece. In order to attach the slides to anything, teams will need to purchase **countersunk M3 screws** from McMaster-Carr. For attaching to REV extrusion, buy 6mm M3 screws with the M3 nut (**not locknut**) to insert inside the extrusion. As a tip, try to protect chips or sawdust from falling into the slides, as the sliding will have a noticeable difference.
es_mx: Para ahorrar espacio, algunos equipos han impreso en 3D un inserto que va entre cada riel en lugar de usar la pieza de extrusión de 15 mm. Para sujetar los rieles a cualquier cosa, los equipos necesitarán comprar **tornillos M3 avellanados** de McMaster-Carr. Para sujetar a la extrusión REV, compre tornillos M3 de 6 mm con la tuerca M3 (**no tuerca de seguridad**) para insertar dentro de la extrusión. Como consejo, trate de proteger las virutas o el aserrín para evitar que caigan en los rieles, ya que el deslizamiento tendrá una diferencia notable.
fr_ca: Pour gagner de la place, certaines équipes ont imprimé en 3D un insert qui va entre chaque glissière au lieu d'utiliser la pièce d'extrusion de 15 mm. Pour fixer les glissières à quoi que ce soit, les équipes devront acheter des **vis M3 à tête fraisée** chez McMaster-Carr. Pour la fixation à l'extrusion REV, achetez des vis M3 de 6 mm avec l'écrou M3 (**pas le contre-écrou**) à insérer à l'intérieur de l'extrusion. Comme conseil, essayez de protéger les copeaux ou la sciure de bois de tomber dans les glissières, car le glissement aura une différence notable.
zh_cn: 为了节省空间，一些团队用 3D 打印技术在每个滑块之间制作了一个插入件，而不是使用 15 毫米宽的铝挤压型材。为了将滑轨固定到任何东西上，团队需要从 McMaster-Carr 购买 **M3 沉头螺丝**。如果要固定到 REV 挤压件上，则需要购买 6 毫米 M3 螺丝，并将 M3 螺母（**不是防松螺母**）插入挤压件内部。提示：尽量防止切屑或锯末落入滑轨，这会导致滑轨变得不顺滑

source: MiSUMI sells two different types of slides: SAR2 and SAR3. The SAR2 is a two-piece slide, while the the SAR3 is a three-stage slide (has intermediate slider to increase the extension of the slide). Teams have used both successfully, and there isn't neither option is clearly superior.
es_mx: MiSUMI vende dos tipos diferentes de deslizadores: SAR2 y SAR3. El SAR2 es un deslizador de dos piezas, mientras que el SAR3 es un deslizador de tres etapas (tiene un deslizador intermedio para aumentar la extensión del deslizador). Los equipos han utilizado ambos con éxito y no hay ninguna opción claramente superior.
fr_ca: MiSUMI vend deux types de glissières : SAR2 et SAR3. Le SAR2 est une glissière en deux parties, tandis que le SAR3 est une glissière en trois étapes (avec un curseur intermédiaire pour augmenter l'extension de la glissière). Les équipes ont utilisé les deux avec succès, et aucune des deux options n'est clairement supérieure.
zh_cn: MiSUMI 销售两种不同类型的滑轨：SAR2 和 SAR3。SAR2 是一种二段式滑轨，而 SAR3 是一种三段式滑轨（具有中间段，可增加滑轨的延伸长度至约原长度的一倍）。我们的团队已经成功地使用了这两种滑轨，并没有明显的优劣之分。

source: Teams using SAR3 slides will generally need to buy low profile M3 jam nuts from McMaster-Carr to connect the slides together. These nuts fit inside the slides with a tiny bit of clearance when tightened.
es_mx: Los equipos que utilizan las diapositivas SAR3 generalmente necesitarán comprar tuercas de bloqueo M3 de perfil bajo de McMaster-Carr para conectar los rieles entre sí. Estas tuercas se ajustan dentro de los rieles con un pequeño margen de holgura cuando se aprietan.
fr_ca: Les équipes qui utilisent des glissières SAR3 devront généralement acheter des contre-écrous M3 à profil bas chez McMaster-Carr pour relier les glissières entre elles. Ces écrous s'insèrent à l'intérieur des glissières avec un tout petit peu de jeu lorsqu'ils sont serrés.
zh_cn: 使用 SAR3 滑轨的参赛队通常需要从 McMaster-Carr 购买低矮型 M3 防松螺母来将滑轨连接在一起。拧紧时，这些螺母与滑轨内部有微小的间隙。

source: A 3 stage lift using SAR2 slides and a 2 stage lift using SAR3 slides
es_mx: Un ascensor de 3 etapas utilizando deslizadores SAR2 y un ascensor de 2 etapas utilizando deslizadores SAR3
fr_ca: Un ascenseur à 3 étages utilisant des glissières SAR2 et un ascenseur à 2 étages utilisant des glissières SAR3
zh_cn: 使用 SAR2 滑轨的 3 级伸缩结构和使用 SAR3 滑轨的 2 级伸缩结构

source: Left: cross section of a 3 stage lift using 3D printed inserts (blue) and SAR2 slides; right: cross section of a 2 stage lift using a 3D printed insert and SAR3 slides. The left approach is also used for Long Robotics slides (discussed below).
es_mx: Izquierda: sección transversal de un elevador de 3 etapas utilizando inserciones impresas en 3D (azules) y deslizadores SAR2; derecha: sección transversal de un elevador de 2 etapas utilizando una inserción impresa en 3D y deslizadores SAR3. El enfoque de la izquierda también se utiliza para los deslizadores de Long Robotics (discutidos a continuación).
fr_ca: À gauche : coupe transversale d'un ascenseur à 3 étages utilisant des inserts imprimés en 3D (bleu) et des glissières SAR2 ; à droite : coupe transversale d'un ascenseur à 2 étages utilisant un insert imprimé en 3D et des glissières SAR3. L'approche de gauche est également utilisée pour les glissières Long Robotics (voir ci-dessous).
zh_cn: 左图：使用 3D 打印嵌入件（蓝色）和 SAR2 滑轨的 3 级伸缩结构横截面图；右图：使用 3D 打印嵌入件和 SAR3 滑轨的 2 级伸缩结构横截面图。左边的方法也用于Long Robotics滑轨（下文将讨论）。

source: Rail length Options:
es_mx: Opciones de Longitud de riel:
fr_ca: Options pour la longueur du rail :
zh_cn: 滑轨的长度选项：

source: 200 mm, part number SAR220 (SAR2) or SAR320 (SAR3)
es_mx: 200 mm, número de parte SAR220 (SAR2) o SAR320 (SAR3)
fr_ca: 200 mm, référence SAR220 (SAR2) ou SAR320 (SAR3)
zh_cn: 200毫米，零件号SAR220（SAR2）或SAR320（SAR3）

source: 300 mm, part number SAR230 (SAR2) or SAR330 (SAR3)
es_mx: 300 mm, número de parte SAR230 (SAR2) o SAR330 (SAR3)
fr_ca: 300 mm, référence SAR230 (SAR2) ou SAR330 (SAR3)
zh_cn: 300毫米，零件号SAR230（SAR2）或SAR330（SAR3）

source: 400 mm, part number SAR240 (SAR2) or SAR340 (SAR3)
es_mx: 400 mm, número de parte SAR240 (SAR2) o SAR340 (SAR3)
fr_ca: 400 mm, référence SAR240 (SAR2) ou SAR340 (SAR3)
zh_cn: 400毫米，零件号SAR240（SAR2）或SAR340（SAR3）

source: Best slide smoothness due to ball bearings
es_mx: Mejor suavidad de deslizamiento debido a los rodamientos de bolas
fr_ca: Meilleure fluidité de glissement grâce aux roulements à billes
zh_cn: 滚珠轴承带来最佳的滑动顺滑度

source: Very little slide flex, robust build quality
es_mx: Muy poca flexibilidad en el deslizamiento, calidad de construcción robusta
fr_ca: Très peu de flexion de la glissière, qualité de construction robuste
zh_cn: 滑动时弯曲极小，结构坚固，质量高

source: Can handle relatively heavy load use cases (within reason)
es_mx: Puede manejar casos de uso relativamente pesados (dentro de lo razonable)
fr_ca: Peut gérer des cas d'utilisation relativement lourds (dans la limite du raisonnable)
zh_cn: 可处理相对较重负载的工况（在合理范围内）

source: Compatible with REV 15mm extrusion system
es_mx: Compatible con el sistema de extrusión REV de 15 mm
fr_ca: Compatible avec le système d'extrusion REV 15mm
zh_cn: 与 REV 15 毫米搭建体系兼容

source: Not cheap
es_mx: No es barato
fr_ca: Assez cher
zh_cn: 不便宜

source: Tricky to adapt if not using REV
es_mx: Complicado de adaptar si no se utiliza REV
fr_ca: Difficile à adapter si l'on n'utilise pas le système REV
zh_cn: 如果不使用 REV搭建体系，适应起来很困难

source: Steel ball bearings wear into the aluminum rails over time, introducing play
es_mx: Los rodamientos de bolas de acero se desgastan con el tiempo en los rieles de aluminio, lo que introduce el juego.
fr_ca: Les roulements à billes en acier s'usent dans les rails en aluminium au fil du temps, ce qui introduit du jeu.
zh_cn: 随着时间的推移，钢珠轴承会磨损铝制导轨，从而产生虚位

source: Viper Slides
fr_ca: Glissières Viper
zh_cn: goBILDA Viper 滑轨

source: `goBILDA Viper Slides <https://www.gobilda.com/steel-viper-slide-14-ball-carriage-336mm-length-244mm-travel/>`_ are a relatively new addition to the goBilda ecosystem. They are COTS steel drawer slides that can be purchased in `a kit with all the parts needed to assemble and rig them right away <https://www.gobilda.com/2-stage-viper-slide-kit/>`_.
es_mx: goBILDA Viper Slides <https://www.gobilda.com/steel-viper-slide-14-ball-carriage-336mm-length-244mm-travel/> son una adición relativamente nueva al ecosistema goBilda. Son rieles de cajón de acero COTS que se pueden comprar en un kit con todas las piezas necesarias para ensamblarlos y ajustarlos de inmediato <https://www.gobilda.com/2-stage-viper-slide-kit/>.
fr_ca: `goBILDA Viper Slides <https://www.gobilda.com/steel-viper-slide-14-ball-carriage-336mm-length-244mm-travel/>`_ est un ajout relativement nouveau à l'écosystème goBilda. Il s'agit de glissières de tiroir en acier COTS qui peuvent être achetées en `kit avec toutes les pièces nécessaires pour les assembler et les monter immédiatement <https://www.gobilda.com/2-stage-viper-slide-kit/>`_.
zh_cn: `goBILDA Viper 滑轨 <https://www.gobilda.com/steel-viper-slide-14-ball-carriage-336mm-length-244mm-travel/>`_是 goBilda 搭建体系中相对较新的产品。它们是 COTS 钢制抽屉滑轨，可在 "套件 "中购买，其中包含立即组装和安装所需的 `所有零件 <https://www.gobilda.com/2-stage-viper-slide-kit/>`_。

source: They use M4 mounting bolts, and are on the standard 8 mm goBilda pattern.
es_mx: Utilizan tornillos de montaje M4 y están en el patrón estándar de 8 mm de goBilda.
fr_ca: Ils utilisent des boulons de montage M4 et sont sur le modèle standard goBilda de 8 mm.
zh_cn: 它们使用 M4 安装螺栓，采用标准的 8 毫米 goBilda 模式。

source: Slide are smooth due to ball bearings
es_mx: Los rieles son suaves debido a los rodamientos de bolas.
fr_ca: Les glissières sont douces grâce aux roulements à billes
zh_cn: 采用滚珠轴承，滑动顺滑

source: Compatible with goBILDA ecosystem
es_mx: Compatible con el ecosistema goBILDA
fr_ca: Compatible avec l'écosystème goBILDA
zh_cn: 与 goBILDA 生态兼容

source: Steel slides can handle more load (can use one set of slides instead of two in many situations)
es_mx: Los rieles de acero pueden manejar más carga (pueden usar un solo juego de rieles en lugar de dos en muchas situaciones)
fr_ca: Les glissières en acier peuvent supporter une charge plus importante (on peut utiliser un jeu de glissières au lieu de deux dans de nombreuses situations).
zh_cn: 钢制滑轨可承受更大的载荷（在许多情况下可使用一组滑轨而不是两组滑轨）

source: Available in a kit with everything you need to start using in one purchase
es_mx: Disponible en un kit con todo lo que necesitas para comenzar a usar en una sola compra
fr_ca: Disponible en kit avec tout ce dont vous avez besoin pour commencer à l'utiliser en un seul achat.
zh_cn: 套装中包含一次购买即可开始使用的所有零件

source: Longer stroke (more extension) then the same length misumi slide
es_mx: Carrera más larga (más extensión) que el mismo deslizador de longitud Misumi.
fr_ca: Course plus longue (plus d'extension) que celle d'un coulisseau misumi de même longueur
zh_cn: 与相同长度的 misumi 滑轨相比，伸展距离更长。

source: Cheaper then misumi slides
es_mx: Más barato que los rieles de Misumi
fr_ca: Moins cher que les rails coulissants misumi
zh_cn: 比 misumi 滑轨便宜

source: Twice as heavy per slide compared to misumi slides
es_mx: Dos veces más pesado por riel en comparación con las rieles de Misumi.
fr_ca: Deux fois plus lourd par diapositive que les diapositives misumi
zh_cn: 每个滑轨的重量是 misumi 滑轨的两倍
