Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/extrusion-slides.po
Languages: es_mx, fr_ca, zh_cn

source: Extrusion Slides
es_mx: Guías de extrusión
fr_ca: Glissières d'extrusion
zh_cn: 铝型材滑轨

source: Extrusion slides are made up of a stack of extrusions that extend by sliding along each other. There are two ways to make this happen: bushings or V-wheels. Bushing slides connect the two slides with two self-lubricating plastic pieces that slide smoothly along the slots in the extrusion. V-wheel slides have V-shaped groove bearings on both sides of the extrusion that bite intro grooves on the extrusion, allowing the stages to slide smoothly.
es_mx: Las guías de extrusión están formadas por una pila de extrusiones que se extienden deslizándose unas sobre otras. Hay dos formas de hacerlo: con casquillos o con ruedas en V. Las guías con casquillos conectan las dos guías con dos piezas de plástico autolubricantes que se deslizan suavemente por las ranuras de la extrusión. Las guías con ruedas en V tienen cojinetes de ranura en forma de V a ambos lados de la extrusión que muerden las ranuras de introducción de la extrusión, permitiendo que las etapas se deslicen suavemente.
fr_ca: Les glissières d'extrusion sont constituées d'une pile d'extrusions qui s'étendent en glissant l'une sur l'autre. Il y a deux façons d'y parvenir : les bagues ou les roues en V. Les glissières à bagues relient les deux glissières à l'aide de deux pièces en plastique autolubrifiantes qui glissent en douceur le long des fentes de l'extrusion. Les glissières à roues en V ont des roulements à rainures en forme de V des deux côtés de l'extrusion qui s'insèrent dans les rainures de l'extrusion, ce qui permet aux étages de glisser en douceur.
zh_cn: 挤压滑轨由一叠铝挤压型材组成，这些铝挤压型材通过相互滑动而延伸。有两种方法可以实现这种效果：衬套或 V 形轮。衬套滑轨用两个自润滑塑料件连接两个滑轨，这些塑料件可沿着挤出件的槽顺利滑动。V 形轮滑轨在挤出件的两侧装有 V 形槽轴承，可咬合挤出件上的导槽，使各级滑轨平稳滑动。

source: REV, Actobotics, and goBILDA all sell extrusion slide kits that integrate nicely with existing FTC\ |reg| kit parts. Beyond this, OpenBuilds sells a V-wheel extrusion slide kit suitable for heavier loads, and Misumi offers a few different sizes of bushing-based extrusion slides. REV furthermore sells a 8020 V-groove bearing slide kit for FRC\ |reg|, that is not recommended for FTC use cases.
es_mx: REV, Actobotics y goBILDA venden kits de guías de extrusión que se integran perfectamente con las piezas del kit FTC. Además, OpenBuilds vende un kit de guías de extrusión con rueda en V adecuado para cargas más pesadas, y Misumi ofrece guías de extrusión con casquillos de diferentes tamaños. Además, REV vende un kit de guías de cojinetes de ranura en V 8020 para FRC |reg|, que no se recomienda para casos de uso de FTC.
fr_ca: REV, Actobotics et goBILDA vendent tous des kits de glissières d'extrusion qui s'intègrent bien aux pièces existantes du kit FTC\ |reg|. En outre, OpenBuilds vend un kit de glissière d'extrusion à roue en V adapté aux charges plus lourdes, et Misumi propose quelques tailles différentes de glissières d'extrusion à douille. REV vend en outre un kit de glissières à roulements en V 8020 pour FRC\ |reg|, qui n'est pas recommandé pour les cas d'utilisation de FTC.
zh_cn: REV、Actobotics 和 goBILDA 都在销售挤压滑轨套件，这些套件可以很好地与现有的 FTC\ |reg| 套件部件集成。除此之外，OpenBuilds 还销售适用于较重负载的 V 轮挤压滑轨套件，Misumi 则提供几种不同尺寸的套管式挤压滑轨。此外，REV 还销售一种 8020 V 形槽轴承滑轨套件，适用于 FRC\ |reg|，但不建议用于 FTC 使用情况。

source: We recommend that newer teams using extrusion slides stick to kits designed for FTC instead of making their own.
es_mx: Recomendamos a los equipos más nuevos que utilicen guías de extrusión que utilicen los kits diseñados para FTC en lugar de fabricar los suyos propios.
fr_ca: Nous recommandons aux nouvelles équipes qui utilisent des glissières d'extrusion de s'en tenir aux kits conçus pour le FTC plutôt que de fabriquer leurs propres kits.
zh_cn: 我们建议使用挤压式滑轨的新团队坚持使用为 FTC 设计的套件，而不是自己制作。

source: REV Robotics 15mm Linear Motion Kit
es_mx: Kit de movimiento lineal de 15 mm de REV Robotics
fr_ca: REV Robotics Kit de mouvement linéaire de 15 mm
zh_cn: REV 机器人 15 毫米线性运动套件

source: The `REV 15mm Linear Motion Kit <https://www.revrobotics.com/rev-45-1507/>`_ is based on the 15mm extrusion system. **This extrusion kit does not perform well without modification.** This has been partially remedied by REV as they have developed a second iteration of their slide kit, which has much better tolerances on the Delrin sliders.
es_mx: El `REV 15mm Linear Motion Kit <https://www.revrobotics.com/rev-45-1507/>`_ está basado en el sistema de extrusión de 15mm. **Esto ha sido parcialmente remediado por REV, ya que han desarrollado una segunda iteración de su kit de guías, que tiene tolerancias mucho mejores en los deslizadores Delrin.
fr_ca: Le kit de mouvement linéaire REV 15mm <https://www.revrobotics.com/rev-45-1507/>`_ est basé sur le système d'extrusion 15mm. **Ce kit d'extrusion ne fonctionne pas bien sans modification, ce à quoi REV a partiellement remédié en développant une seconde itération de son kit de glissière, qui a de bien meilleures tolérances sur les glissières en Delrin.
zh_cn: `REV 15 毫米线性运动套件 <https://www.revrobotics.com/rev-45-1507/>`_ 基于 15 毫米挤压系统。 **这个铝型材套件必须经过精修才好用** REV公司开发了第二代滑动套件，该套件的 Delrin 滑轨公差更小，因此部分弥补了这一缺陷。

source: Still, you'll see some competitive teams use this kit with multiple modifications, such as adding lots of lubricant and mounting the sliders differently. Teams have also 3D printed their own sliders, though this is not a great idea for teams without much 3D printing experience. One of the biggest issues with the stock REV kit is the tendency of the slides to bind. Additionally, since the only thing attaching one extrusion to another is the plastic slider, the REV slides are not particularly sturdy, and require crossbeams to keep alignment.
es_mx: Aun así, verás que algunos equipos competitivos utilizan este kit con múltiples modificaciones, como añadir mucho lubricante y montar los deslizadores de forma diferente. Los equipos también han impreso en 3D sus propias guías, aunque esto no es una gran idea para los equipos sin mucha experiencia en impresión 3D. Uno de los mayores problemas del kit REV es la tendencia de las guías a atascarse. Además, dado que lo único que une una extrusión a otra es el deslizador de plástico, los deslizadores REV no son especialmente resistentes y requieren travesaños para mantener la alineación.
fr_ca: Néanmoins, certaines équipes compétitives utilisent ce kit en y apportant de nombreuses modifications, comme l'ajout d'une grande quantité de lubrifiant et un montage différent des curseurs. Des équipes ont également imprimé en 3D leurs propres glissières, mais ce n'est pas une bonne idée pour les équipes qui n'ont pas une grande expérience de l'impression 3D. L'un des principaux problèmes du kit REV de série est que les glissières ont tendance à se coincer. De plus, comme la seule chose qui attache une extrusion à une autre est la glissière en plastique, les glissières REV ne sont pas particulièrement robustes et nécessitent des traverses pour maintenir l'alignement.
zh_cn: 不过，你还是会看到一些参赛队在使用该套件时进行了多种改装，例如添加大量润滑剂和以不同的方式安装滑轨。也有团队用 3D 打印出了自己的滑轨，不过对于没有太多 3D 打印经验的团队来说，这并不是一个好主意。原装 REV 套件的最大问题之一是滑轨容易卡住。此外，由于连接一个挤出件和另一个挤出件的唯一部件是塑料滑轨，因此 REV 滑轨并不特别坚固，需要横梁来保持对齐。

source: Overall, this kit is lightweight, simple, and cheap. It can be a good start for teams using REV and needing a linear extension, and is generally usable out of the box. However, it is not very smooth and only achieves its maximum potential when modified and tweaked.
es_mx: En general, este kit es ligero, sencillo y barato. Puede ser un buen comienzo para los equipos que utilizan REV y necesitan una extensión lineal, y es generalmente utilizable fuera de la caja. Sin embargo, no es muy suave y solo alcanza su máximo potencial cuando se modifica y ajusta.
fr_ca: Dans l'ensemble, ce kit est léger, simple et bon marché. Il peut constituer un bon point de départ pour les équipes utilisant le système REV et ayant besoin d'une extension linéaire, et il est généralement utilisable dès sa sortie de l'emballage. Cependant, il n'est pas très fluide et n'atteint son potentiel maximum que lorsqu'il est modifié et ajusté.
zh_cn: 总的来说，该套件轻便、简单、便宜。对于使用 REV 和需要线性扩展的团队来说，它是一个良好的开端，开箱即可使用。不过，它并不十分顺畅，只有在修改和调整后才能发挥其最大潜力。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: REV has complete guide on how to rig the linear slides
es_mx: REV tiene una guía completa sobre cómo aparejar las guías lineales
fr_ca: REV propose un guide complet sur l'installation des glissières linéaires.
zh_cn: REV 拥有关于如何安装线性滑轨的完整指南

source: Easily interfaces with REV building system
es_mx: Interfaz sencilla con el sistema de construcción REV
fr_ca: Interfaces faciles avec le système de construction REV
zh_cn: 与 REV 系统轻松连接

source: Lightweight, should be used for light/medium loads only
es_mx: Ligero, sólo debe utilizarse para cargas ligeras/medias
fr_ca: Léger, ne doit être utilisé que pour des charges légères/moyennes
zh_cn: 重量轻，只能用于轻型/中型负载

source: If tweaked, can be a very efficient linear slide
es_mx: Si se ajusta, puede ser una guía lineal muy eficiente
fr_ca: S'il est adapté, il peut être un toboggan linéaire très efficace.
zh_cn: 如果加以调整，可以成为非常高效的线性滑轨

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 劣势

source: Does not perform well out of the box
es_mx: No funciona bien al sacarlo de la caja
fr_ca: N'est pas très performant dès sa sortie de l'emballage
zh_cn: 在箱子外面的使用场景下表现并不好

source: Can flex under load, needs additional support
es_mx: Puede flexionarse bajo carga, necesita soporte adicional
fr_ca: Peut fléchir sous la charge, nécessite un soutien supplémentaire
zh_cn: 在负载下会弯曲，需要额外的支撑

source: May need some modifications such as custom sliders
es_mx: Puede necesitar algunas modificaciones, como deslizadores personalizados
fr_ca: Peut nécessiter quelques modifications telles que des curseurs personnalisés
zh_cn: 可能需要一些修改，如定制滑轨

source: 11115 Gluten Free's Rover Ruckus robot with slides extended
es_mx: 11115 Robot Rover Ruckus de Gluten Free con guías extendidas
fr_ca: 11115 Robot Rover Ruckus de Gluten Free avec glissières déployées
zh_cn: 11115 Gluten Free的 Rover Ruckus 机器人，滑轨已加长

source: 11115 Gluten Free's custom Rev slider
es_mx: 11115 Gluten Free's guía Rev personalizada
fr_ca: 11115 Gluten Free's glissière personnalisée de REV
zh_cn: 11115 Gluten Free 的定制 Rev 滑轨

source: 11115 Gluten Free, Rover Ruckus, custom REV slides
es_mx: 11115 Sin Gluten, Rover Ruckus, guías REV personalizadas
fr_ca: 11115 Gluten Free, Rover Ruckus, glissière personnalisée de REV
zh_cn: 11115 Gluten Free，Rover Ruckus的定制 REV 滑轨

source: 8680 Kraken-Pinion's Rover Ruckus robot with slides extended
es_mx: 8680 Robot Rover Ruckus de Kraken-Pinion con las guías extendidas
fr_ca: 8680 Le robot Rover Ruckus de Kraken-Pinion avec les glissières déployées
zh_cn: 8680 Kraken-Pinion 的 Rover Ruckus 机器人，滑轨已展开

source: 8680 Kraken-Pinion, Rover Ruckus, REV slides
es_mx: 8680 Kraken-Pinion, Rover Ruckus, guías REV
fr_ca: 8680 Kraken-Pinion, Rover Ruckus, glissière REV
zh_cn: 8680 Kraken-Pinion，Rover Ruckus，REV 滑轨

source: OpenBuilds Mini V Gantry Kit
zh_cn: OpenBuilds Mini V “龙门”式套件

source: The `OpenBuilds Mini V Gantry Kit <https://openbuildspartstore.com/mini-v-gantry-kit/>`_ is designed for use with OpenBuilds' 20mm V-slot extrusion, which can be mounted to other build systems using M3 screws and sliding T nuts. OpenBuilds slides are used for high precision applications such as 3D printers and CNC machines and have a **much higher load capacity** than REV and Actobotics slides. OpenBuilds slides are also much heavier than REV and Actobotics slides, but because they are so strong they can be used in applications where two sets of lighter duty slides would otherwise be required. Out of the box, OpenBuilds slides are tailored to single-stage belt lifts, but they could easily be adapted to work for multi-stage or string lifts given some thought and additional parts.
zh_cn: `OpenBuilds 迷你 V “龙门”式套 <https://openbuildspartstore.com/mini-v-gantry-kit/>`_专为 OpenBuilds 的 20 毫米 V 型槽挤出机而设计，可使用 M3 螺丝和滑动 T 型螺母安装到其他构建系统上。OpenBuilds 滑轨可用于 3D 打印机和数控机床等高精度应用，与 REV 和 Actobotics 滑轨相比，具有 **高的承载能力** 。OpenBuilds 滑轨也比 REV 和 Actobotics 滑轨重得多，但由于它们非常坚固，因此可用于需要两套轻型滑轨的应用场合。开箱即用的 OpenBuilds 滑轨专为单级皮带式升降结构量身定做，但只要花点心思并增加一些部件，就能轻松地将它们改装成多级或串式升降机。

source: Sturdy, doesn't flex even under a lot of load
es_mx: Robusto, no se dobla incluso con mucha carga
fr_ca: Robuste, ne fléchit pas même sous une charge importante
zh_cn: 坚固耐用，即使负载很大也不会弯曲

source: Interfaces with most other build systems thanks to sliding T nuts
es_mx: Compatible con la mayoría de los sistemas de montaje gracias a las tuercas deslizantes en T
fr_ca: S'adapte à la plupart des autres systèmes de construction grâce aux écrous en T coulissants
zh_cn: 通过滑动 T 型螺母，可与大多数其他构建系统连接

source: Not designed for multi-stage lifts right out of the box
es_mx: No está diseñado para ascensores de varias etapas nada más al sacarlo de la caja
fr_ca: N'est pas conçu pour les ascenseurs à plusieurs étages dès la sortie de la boîte
zh_cn: 并非设计用于箱式结构外的多级升降结果

source: **Heavy**, overkill for lifting lighter objects unless precision is important
es_mx: **Pesado**, excesivo para levantar objetos ligeros a menos que la precisión sea importante
fr_ca: **Lourd**, inutile de soulever des objets plus légers à moins que la précision ne soit importante
zh_cn: **很重**，除非精度要求很高，否则对于提升较轻的物体来说较为多余。

source: OpenBuilds only offers M3 and M5 T nuts, although other compatible sizes might be found on Amazon or McMaster-Carr
es_mx: OpenBuilds sólo ofrece tuercas en T M3 y M5, aunque se pueden encontrar otros tamaños compatibles en Amazon o McMaster-Carr
fr_ca: OpenBuilds ne propose que des écrous en T M3 et M5, bien que d'autres tailles compatibles puissent être trouvées sur Amazon ou McMaster-Carr.
zh_cn: OpenBuilds 只提供 M3 和 M5型号的T 型螺母，但在亚马逊或McMaster-Carr网站上可以找到其他兼容尺寸的螺母。

source: 4997 Masquerade's Cascade Effect robot with lift extended
es_mx: 4997 Robot Efecto Cascada de Masquerade con ascensor extendido
fr_ca: 4997 Le robot Cascade Effect de Masquerade avec l'ascenseur déployé
zh_cn: 4997 Masquerade's Cascade Effect的机器人，并配有一个加长的升降结构

source: 4997 Masquerade, Cascade Effect, OpenBuilds slides
es_mx: 4997 Masquerade, efecto cascada, guías OpenBuilds
fr_ca: 4997 Masquerade, Cascade Effect, glissières OpenBuilds
zh_cn: 4997 Masquerade's Cascade Effect 的滑轨设计

source: `Linear motion guides <https://www.gobilda.com/gorail-based/>`_ are goBILDA's take on linear motion using goRAIL, which is a type of extrusion compatible with V-groove bearings. Similar to a standard 8020 V-groove carriage, used in FRC, goRAIL is a lighter option that is better suited for FTC.
es_mx: `Guías de movimiento lineal <https://www.gobilda.com/gorail-based/>`_ son la apuesta de goBILDA por el movimiento lineal mediante goRAIL, que es un tipo de extrusión compatible con rodamientos de ranura en V. Similar a un carro de ranura en V 8020 estándar, utilizado en FRC, goRAIL es una opción más ligera que se adapta mejor a FTC.
fr_ca: `Linear motion guides <https://www.gobilda.com/gorail-based/>`_ sont le point de vue de goBILDA sur le mouvement linéaire en utilisant goRAIL, qui est un type d'extrusion compatible avec les roulements à rainure en V. Semblable à un chariot standard 8020 à rainure en V, utilisé en FRC, goRAIL est une option plus légère qui convient mieux au FTC.
zh_cn: `线性运动导轨 <https://www.gobilda.com/gorail-based/>`_ 是 goBILDA 使用 goRAIL 实现的线性运动，goRAIL 是一种与 V 型槽轴承兼容的挤压产品。goRAIL 与用于 FRC 的标准 8020 V 型槽滑轨类似，是一种更轻的选择，更适合用于 FTC。

source: Actobotics X-rail Slide Kit
es_mx: Kit de deslizamiento Actobotics X-rail
zh_cn: Actobotics X-rail 滑动套件

source: ServoCity has discontinued the Actobotics X-rail Slide Kit.
es_mx: ServoCity ha descatalogado el kit de deslizamiento Actobotics X-rail.
fr_ca: ServoCity ne propose plus le kit Actobotics X-rail Slide Kit.
zh_cn: 请注意：ServoCity 已停产 Actobotics X-rail 滑动套件。

source: Actobotics' `X-rail Slide Kit <https://www.servocity.com/cascading-x-rail-slide-kit>`_ works well out of the box. However, the main caveat is that the kit has a **very low maximum load (2lb. at maximum extension)**.
es_mx: Actobotics `X-rail Slide Kit <https://www.servocity.com/cascading-x-rail-slide-kit>`_ funciona bien fuera de la caja. Sin embargo, la principal advertencia es que el kit tiene una **carga máxima muy baja (2 lb. a extensión máxima)**.
fr_ca: Le kit de glissière pour rail en X d'Actobotics <https://www.servocity.com/cascading-x-rail-slide-kit>`_ fonctionne bien. Cependant, la principale mise en garde est que le kit a une **charge maximale très faible (2lb. à l'extension maximale)**.
zh_cn: Actobotics 的 `X 导轨滑动套件 <https://www.servocity.com/cascading-x-rail-slide-kit>`_ 开箱即用，效果很好。不过，需要注意的是，该套件的 **最大负载值非常非常低（最大伸展时仅为 2 磅）** 。

source: Teams will have to keep their designs on this kit particularly lightweight. This slide uses elastic retraction through the use of surgical tubing, which means that instead of having both an extend and return string, there is a retraction force applied at all times. This helps simplify tensioning and spooling, however, limits how fast the slide can be run. Additionally, the plastic end caps have a reputation of breaking regularly because they endure shock load every time the slide extends to maximum. 3D printed alternatives may be more sturdy than the stock end caps.
es_mx: Los equipos tendrán que conseguir que sus diseños en este kit sean especialmente ligeros. Este guía utiliza la retracción elástica mediante el uso de tubos quirúrgicos, lo que significa que en lugar de tener una cuerda de extensión y otra de retorno, hay una fuerza de retracción aplicada en todo momento. Esto ayuda a simplificar la tensión y la bobina, sin embargo, limita la velocidad a la que puede funcionar la corredera. Además, las tapas de plástico tienen fama de romperse con regularidad porque soportan cargas de choque cada vez que la corredera se extiende al máximo. Las alternativas impresas en 3D pueden ser más resistentes que las tapas originales.
fr_ca: Les équipes devront veiller à ce que leurs conceptions sur ce kit soient particulièrement légères. Ce toboggan utilise une rétraction élastique grâce à l'utilisation de tubes chirurgicaux, ce qui signifie qu'au lieu d'avoir une corde d'extension et de retour, il y a une force de rétraction appliquée à tout moment. Cela permet de simplifier la tension et l'enroulement, mais limite la vitesse à laquelle le toboggan peut être utilisé. En outre, les embouts en plastique ont la réputation de se casser régulièrement car ils subissent des chocs à chaque fois que la glissière se déploie au maximum. Les alternatives imprimées en 3D peuvent être plus robustes que les embouts de série.
zh_cn: 参赛队在设计该套件时必须特别注意保持轻巧。这种滑梯通过使用外科手术管来实现弹性回缩，这意味着在任何时候都会有一个回缩力作用在滑梯上，而不是同时有一个伸展和回缩绳。这有助于简化张紧和绕线，但也限制了滑轨的运行速度。此外，由于塑料端盖在滑轨每次伸展到最大限度时都要承受冲击负荷，因此经常会损坏。3D 打印的替代品可能比原装端盖更坚固。

source: It is highly recommended that teams add an additional set of v-groove bearings at the end of each piece of extrusion to give each stage an additional point of support. This will increase load capacity and possibly smoothness.
es_mx: Es muy recomendable que los equipos añadan un juego adicional de cojinetes de ranura en V al final de cada pieza de extrusión para dar a cada etapa un punto de apoyo adicional. Esto aumentará la capacidad de carga y posiblemente la suavidad.
fr_ca: Il est fortement recommandé aux équipes d'ajouter un jeu supplémentaire de roulements à gorge en V à l'extrémité de chaque pièce d'extrusion afin de donner à chaque étage un point d'appui supplémentaire. Cela augmentera la capacité de charge et éventuellement la fluidité.
zh_cn: 强烈建议团队在每块铝挤压型材的末端增加一组 V 形槽支座，为每个阶段提供额外的支撑点。这将增加承载能力，并可能提高平稳性。

source: Easily interfaces with Actobotics building system
es_mx: Interfaz sencilla con el sistema de construcción Actobotics
fr_ca: Interfaces faciles avec le système de construction Actobotics
zh_cn: 与 Actobotics 系统轻松连接

source: Elastic retraction is a simple way to retract
es_mx: La retracción elástica es una forma sencilla de retraer
fr_ca: La rétraction élastique est un moyen simple de rétracter
zh_cn: 弹性回缩是一种简单的回缩方式

source: **Should be used for light/medium loads only**
es_mx: **Sólo debe utilizarse para cargas ligeras/medias**
fr_ca: **Ne doit être utilisé que pour des charges légères/moyennes**
zh_cn: **仅适用于轻型/中型负载**

source: Will flex under load, needs additional support
es_mx: Se flexionará bajo carga, necesita soporte adicional
fr_ca: Fléchit sous l'effet de la charge, nécessite un support supplémentaire
zh_cn: 负载时会弯曲，需要额外的支撑

source: Elastic retraction slows down extension speed and retraction will be slower than string retraction
es_mx: La retracción elástica reduce la velocidad de extensión y la retracción será más lenta que la de la cuerda
fr_ca: La rétraction élastique ralentit la vitesse d'extension et la rétraction sera plus lente que la rétraction de la corde.
zh_cn: 弹性回缩会减慢伸展速度，回缩速度将慢于绳索回缩速度

source: 12599 Overcharged's Relic Recovery robot with relic slide extended
es_mx: 12599 Robot de Relic Recovery de Overcharged con guía de reliquias extendida
fr_ca: 12599 Robot de Relic Recovery Overcharged avec glissière de reliques déployée
zh_cn: 12599 Overcharged's Relic Recovery 的机器人，文物回收滑轨已加长

source: 12599 Overcharged, Relic Recovery, Actobotics X-Rail slides
es_mx: 12599 Overcharged, Relic Recovery, Actobotics X-Rail se desliza
fr_ca: 12599 Surcharge, Relic Recovery, glissières Actobotics X-Rail
zh_cn: 12599 Overcharged's Relic Recovery ，Actobotics X-Rail 滑轨
