Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/lead-screws.po
Languages: es_mx, fr_ca, zh_cn

source: Lead Screws
es_mx: Tornillos de Avance
fr_ca: Système vis-écrou

source: Lead screws use a threaded rod to create high-torque linear motion. Their primary advantage is being able to handle much higher loads than other unmodified kit options. While this option was popularized in Rover Ruckus for hanging robots, variations have been in use since as far back as Res-Q. Another use case for lead screws is to change the angle of an arm platform, though this is more common in FRC\ |reg|. However, this ability to handle high loads comes at a cost: lead screws are extremely slow.
es_mx: Los tornillos de avance utilizan una varilla roscada para crear un movimiento lineal de alto torque. Su principal ventaja es que pueden soportar cargas mucho mayores que otras opciones de kit sin modificar. Aunque esta opción se popularizó en el Rover Ruckus para robots colgantes, se han utilizado variaciones desde Res-Q. Otro caso de uso para los tornillos de avance es cambiar el ángulo de una plataforma de brazo, aunque esto es más común en FRC |reg|. Sin embargo, esta capacidad para soportar cargas elevadas tiene un coste: los tornillos de avance son extremadamente lentos.
fr_ca: Les système vis-écrou utilisent une tige filetée pour créer un mouvement linéaire à couple élevé. Leur principal avantage est de pouvoir supporter des charges beaucoup plus élevées que d'autres options de kit non modifiées. Cette option a été popularisée par Rover Ruckus pour les robots suspendus, mais des variantes sont utilisées depuis Res-Q. Un autre cas d'utilisation vis-écrou est la modification de l'angle d'une plate-forme de bras, bien que cela soit plus courant en FRC. Toutefois, cette capacité à supporter des charges élevées a un coût : les vis à plomb sont extrêmement lentes.
zh_cn: 导螺杆使用螺纹杆来产生高扭矩线性运动。其主要优点是能够承受比其他未改装套件高得多的负载。虽然这种选择在用于悬挂机器人的 Rover Ruckus 中得到了推广，但早在 Res-Q 中就已经开始使用各种变体。导螺杆的另一个用例是改变机械臂平台的角度，不过这在 FRC\ |reg| 中更为常见。然而，这种处理高负载的能力是有代价的：导螺杆的速度极慢。

source: By far the most popular lead screw option is the `ServoCity Linear Actuator kit <https://www.servocity.com/linear-actuator-kit-a-7-4-stroke-x-rail-piston/>`_. Overall, this kit is lightweight, simple, and cheap. It can be a good start for teams using REV and needing a linear extension, and is generally usable out of the box.
es_mx: Con diferencia, la opción de tornillo de avance más popular es el `Kit de actuador lineal ServoCity <https://www.servocity.com/linear-actuator-kit-a-7-4-stroke-x-rail-piston/>`_. En general, este kit es ligero, sencillo y barato. Puede ser un buen comienzo para los equipos que utilizan REV y necesitan una extensión lineal, y es generalmente utilizable fuera de la caja.
fr_ca: Le kit d'actionneur linéaire ServoCity <https://www.servocity.com/linear-actuator-kit-a-7-4-stroke-x-rail-piston/>`_ est de loin l'option la plus populaire. Dans l'ensemble, ce kit est léger, simple et bon marché. Il peut constituer un bon point de départ pour les équipes utilisant REV et ayant besoin d'une extension linéaire, et il est généralement utilisable dès sa sortie de l'emballage.
zh_cn: 迄今为止，最受欢迎的导螺杆选项是 "ServoCity 线性致动器套件 <https://www.servocity.com/linear-actuator-kit-a-7-4-stroke-x-rail-piston/>"。总体而言，该套件轻便、简单、便宜。对于使用 REV 并需要线性扩展的团队来说，它是一个良好的开端，一般开箱即可使用。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Easy way for high-load, high-torque applications
es_mx: Manera fácil para aplicaciones de alta carga y alto torque
fr_ca: Une solution simple pour les applications à forte charge et à couple élevé
zh_cn: 高负荷、高扭矩应用的简便方法

source: Compact form factor
es_mx: Formato compacto
fr_ca: Facteur de forme compact
zh_cn: 外形紧凑

source: Typically only requires one motor
es_mx: Normalmente sólo requiere un motor
fr_ca: Ne nécessite généralement qu'un seul moteur
zh_cn: 通常只需要一个电机

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Not for quick linear extensions
es_mx: No para extensiones lineales rápidas
fr_ca: Pas pour les extensions linéaires rapides
zh_cn: 不适用于快速线性延伸

source: High torque translates to slow extension speed
es_mx: Un torque elevado se traduce en una velocidad de extensión lenta
fr_ca: Un couple élevé se traduit par une vitesse d'extension lente
zh_cn: 扭矩大，伸展速度慢

source: A lead screw with the object that rides It
es_mx: Un tornillo de avance con el objeto que lo monta
fr_ca: Une vis sans fin avec l'objet qui la chevauche
zh_cn: 导螺杆和乘坐它的物体

source: A render of 11115's Rover Ruckus hang mechanism, using lead screws
es_mx: Un render del mecanismo de suspensión del Rover Ruckus 11115, con tornillos de avance
fr_ca: Un rendu du mécanisme d'accrochage du Rover Ruckus de 11115, utilisant des système vis-écrou.

source: 11115 Gluten Free, Rover Ruckus, Actobotics lead screw used for hang
es_mx: 11115 Gluten Free, Rover Ruckus, Actobotics tornillo de avance utilizado para colgar
fr_ca: 11115 Sans gluten, Rover Ruckus, Actobotics système vis-écrou utilisée pour l'accrochage
