Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/linear-bearing-slides.po
Languages: es_mx, fr_ca, zh_cn

source: Linear Bearing Slides
es_mx: Rieles de rodamientos lineales
fr_ca: Glissières à palier linéaire
zh_cn: 直线轴承滑轨

source: Linear bearings are specialty ball bearings. Unlike radial ball bearings, they run balls through cyclical tracks along the length of a rail or shaft to create smooth, stable, precise linear motion. They are used in many industrial automation systems, including 3D printers and CNC machines.
es_mx: Los rodamientos lineales son rodamientos de bolas especiales. A diferencia de los rodamientos radiales de bolas, hacen pasar las bolas por pistas cíclicas a lo largo de un carril o eje para crear un movimiento lineal suave, estable y preciso. Se utilizan en muchos sistemas de automatización industrial, como impresoras 3D y máquinas CNC.
fr_ca: Les roulements linéaires sont des roulements à billes spécialisés. Contrairement aux roulements à billes radiaux, ils font circuler des billes sur des pistes cycliques le long d'un rail ou d'un arbre afin de créer un mouvement linéaire régulier, stable et précis. Ils sont utilisés dans de nombreux systèmes d'automatisation industrielle, notamment les imprimantes 3D et les machines à commande numérique.
zh_cn: 直线轴承是特种球轴承。与向心球轴承不同，它们通过沿着轨道或轴的长度的循环轨道运行球来产生平滑、稳定、精确的直线运动。它们用于许多工业自动化系统，包括 3D 打印机和 数控机床。

source: Unlike with most slides, the balls of linear bearings are not well retained when the bearings are removed from their rails. Linear bearings with a few balls missing have slightly decreased performance. Be sure to handle and store the bearings with care and to be prepared if their balls fall out.
es_mx: A diferencia de lo que ocurre con la mayoría de los rieles, las bolas de los rodamientos lineales no quedan bien retenidas cuando éstos se extraen de sus carriles. Los rodamientos lineales a los que les faltan algunas bolas tienen un rendimiento ligeramente inferior. Asegúrese de manipular y almacenar los rodamientos con cuidado y de estar preparado por si se les caen las bolas.
fr_ca: Contrairement à la plupart des glissières, les billes des roulements linéaires ne sont pas bien retenues lorsque les roulements sont retirés de leurs rails. Les roulements linéaires dont quelques billes sont manquantes ont des performances légèrement réduites. Veillez à manipuler et à stocker les roulements avec soin et à vous préparer à ce que leurs billes tombent.
zh_cn: 与大多数滑轨不同，当轴承从导轨上取下时，直线轴承的滚珠不能很好地保留。缺少一些滚珠的直线轴承性能会略有下降。请务必小心处理和储存轴承，并在滚珠脱落时做好准备。

source: There are two types of linear bearings generally used in FTC: round linear bearings and linear bearing blocks.
es_mx: Existen dos tipos de rodamientos lineales generalmente utilizados en FTC: los rodamientos lineales redondos y los bloques de rodamientos lineales.
fr_ca: Il existe deux types de roulements linéaires généralement utilisés en FTC : les roulements linéaires ronds et les blocs de roulements linéaires.
zh_cn: FTC中一般使用的直线轴承有两种：圆形直线轴承和直线轴承块。

source: MGN Series Linear Bearing Blocks
es_mx: Bloques de rodamientos lineales de la serie MGN
fr_ca: Série MGN Blocs de roulements linéaires
zh_cn: MGN 系列直线轴承座

source: MGN linear bearing blocks are the most common linear bearing blocks in FTC. They are the smallest of a larger classification of slides made by HIWIN Corporation. They come in several sizes, the smallest being MGN7 and the largest being MGN15.
es_mx: Los bloques de rodamientos lineales MGN son los bloques de rodamientos lineales más comunes en FTC. Son los más pequeños de una clasificación más amplia de rieles fabricados por HIWIN Corporation. Existen en varios tamaños, siendo el más pequeño el MGN7 y el más grande el MGN15.
fr_ca: Les blocs de roulements linéaires MGN sont les blocs de roulements linéaires les plus courants en FTC. Ils sont les plus petits d'une classification plus large de glissières fabriquées par HIWIN Corporation. Ils existent en plusieurs tailles, la plus petite étant MGN7 et la plus grande MGN15.
zh_cn: MGN 直线轴承座是 FTC 中最常见的直线轴承座。它们是 HIWIN 公司生产的滑块较大分类中最小的一种。它们有多种尺寸，最小的是 MGN7，最大的是 MGN15。

source: It is **recommended that teams only use MGN7, MGN9, and MGN12 slides.** A pair of MGN12 slides is sufficient to lift a 40lb (20kg) robot. MGN9 slides are similar in weight and scale to MiSUMI drawer slides. MGN7 slides are smaller, but they are slightly more inconvenient to work with because they use smaller M2 screws for mounting.
es_mx: Se **recomienda que los equipos sólo utilicen guías MGN7, MGN9 y MGN12.** Un par de rieles MGN12 es suficiente para levantar un robot de 20 kg (40 lb). Las rieles MGN9 son similares en peso y escala a las rieles de cajón MiSUMI. Los rieles MGN7 son más pequeñas, pero son un poco más incómodos para trabajar porque utilizan tornillos M2 más pequeños para el montaje.
fr_ca: Il est **recommandé aux équipes de n'utiliser que les glissières MGN7, MGN9 et MGN12.** Une paire de glissières MGN12 est suffisante pour soulever un robot de 40lb (20 kg). Les glissières MGN9 ont un poids et une taille similaires à ceux des glissières de tiroir MiSUMI. Les glissières MGN7 sont plus petites, mais elles sont légèrement plus difficiles à utiliser car elles utilisent des vis M2 plus petites pour le montage.
zh_cn: **建议参赛队只使用 MGN7、MGN9 和 MGN12 滑轨。**一对 MGN12 滑轨足以提升一个 40 磅（20 千克）的机器人。MGN9 滑轨的重量和规模与 MiSUMI 抽屉滑轨相似。MGN7 滑轨的尺寸较小，但由于使用较小的 M2 螺钉进行安装，因此使用起来稍有不便。

source: If ordered directly through industrial supply centers such as HIWIN, these slides can be expensive. For hobbyists, however, they are sold at more reasonable prices through sellers on Amazon and eBay, although these sellers may have questionable quality control. You can find more information with a Google search of "improving cheap MGN slides"
es_mx: Si se piden directamente a través de centros de suministros industriales como HIWIN, estas rieles pueden resultar caros. Para los aficionados, sin embargo, se venden a precios más razonables a través de vendedores en Amazon y eBay, aunque estos vendedores pueden tener un control de calidad cuestionable. Puedes encontrar más información con una búsqueda en Google de "mejorar rieles MGN baratos"
fr_ca: Si elles sont commandées directement auprès de centres de fournitures industrielles tels que HIWIN, ces glissières peuvent être onéreuses. Pour les amateurs, cependant, elles sont vendues à des prix plus raisonnables par des vendeurs sur Amazon et eBay, bien que ces vendeurs puissent avoir un contrôle de qualité douteux. Vous trouverez de plus amples informations en effectuant une recherche Google sur "améliorer les lames MGN bon marché"
zh_cn: 如果直接通过 HIWIN 等工业供应中心订购，这些滑轨可能会很贵。不过，对于业余爱好者来说，亚马逊和 eBay 上的卖家出售的价格比较合理，不过这些卖家的质量控制可能有问题。您可以在谷歌搜索 "改进便宜的 MGN 玻片"，了解更多信息。

source: All different sizes of MGN slides
es_mx: Todos los tamaños de rieles MGN
fr_ca: Toutes les tailles de lames MGN
zh_cn: 所有不同尺寸的 MGN 滑轨

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Extremely smooth thanks to usage of ball bearings
es_mx: Extremadamente suave gracias al uso de rodamientos de bolas
fr_ca: Extrêmement fluide grâce à l'utilisation de roulements à billes
zh_cn: 由于使用滚珠轴承，运行极为平稳

source: Stiffer and stronger than almost any other type of slide
es_mx: Más rígido y resistente que casi cualquier otro tipo de riel
fr_ca: Plus rigide et plus solide que presque tous les autres types de glissières
zh_cn: 几乎比任何其他类型的滑轨都更坚硬、更牢固

source: Steel rails don't wear out the way aluminum slides do
es_mx: Los rieles de acero no se desgastan como los de aluminio
fr_ca: Les rails en acier ne s'usent pas comme les glissières en aluminium.
zh_cn: 钢轨不会像铝滑轨那样磨损

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Because MGN rails and sliders are made entirely of steel, they are generally much heavier than aluminum drawer slides. This is not an issue with MGN9 slides, which are marginally heavier, and MGN7 slides, which are marginally lighter.
es_mx: Dado que los carriles y rieles MGN están fabricados totalmente en acero, suelen ser mucho más pesados que las rieles de aluminio para cajones. Esto no es un problema con los rieles MGN9, que son marginalmente más pesadas, y las rieles MGN7, que son marginalmente más ligeras.
fr_ca: Les rails et glissières MGN étant entièrement en acier, ils sont généralement beaucoup plus lourds que les glissières en aluminium. Ce problème ne se pose pas avec les glissières MGN9, qui sont légèrement plus lourdes, et les glissières MGN7, qui sont légèrement plus légères.
zh_cn: 由于 MGN 导轨和滑轨完全由钢制成，因此通常比铝制抽屉滑轨重得多。但 MGN9 滑轨和 MGN7 滑轨不存在这个问题，前者稍重，后者稍轻。

source: Simplest way to connect slides together and mount pulleys is using custom parts
es_mx: La forma más sencilla de conectar las rieles entre sí y montar las poleas es utilizando piezas a medida
fr_ca: La façon la plus simple de relier les glissières entre elles et de monter les poulies est d'utiliser des pièces sur mesure.
zh_cn: 将滑块连接在一起并安装滑轮的最简单方法是使用定制部件

source: Cheap slides generally need some attention to clean and re-grease
es_mx: Los rieles baratos suelen necesitar un poco de atención para limpiarlas y volver a engrasarlas
fr_ca: Les glissières bon marché nécessitent généralement une certaine attention pour être nettoyées et regraissées.
zh_cn: 便宜的滑轨一般需要注意清洁和重新上油

source: 8813 The Winter Soldiers' Rover Ruckus robot with lift extended
es_mx: 8813 The Winter Soldiers' Rover Ruckus robot con ascensor extendido
fr_ca: 8813 Robot Rover Ruckus de The Winter Soldiers avec ascenseur déployé
zh_cn: 8813 "冬日战士 "的 Rover Ruckus 机器人加长了升降机

source: 8813 The Winter Soldiers, Rover Ruckus, MGN12 slides connected with custom box tubes
es_mx: 8813 The Winter Soldiers, Rover Ruckus, rieles MGN12 conectados con tubos de caja personalizados
fr_ca: 8813 The Winter Soldiers, Rover Ruckus, diapositives MGN12 connectées avec des tubes en boîte personnalisés
zh_cn: 8813 ”冬日战士“，Rover Ruckus，用定制部件连接的 MGN12 滑轨

source: 8221 Cubix's Res-Q robot with deposit extended
es_mx: 8221 Robot Res-Q de Cubix con depósito extendido
fr_ca: 8221 Robot Res-Q de Cubix avec extension de la consigne
zh_cn: 8221 Cubix 的 Res-Q 机器人押金延期

source: 8221 Cubix, Res-Q, MGN slides connected with 3D printed parts
es_mx: 8221 Cubix, Res-Q, guías MGN conectados con piezas impresas en 3D
fr_ca: 8221 Glissières Cubix, Res-Q, MGN connectées avec des pièces imprimées en 3D
zh_cn: 8221 Cubix、Res-Q、MGN 滑轨与 3D 打印部件相连接

source: Round Linear Bearings
es_mx: Rodamientos Lineales Redondos
fr_ca: Roulements linéaires ronds
zh_cn: 圆形直线轴承

source: Round linear bearings are similar to bearing blocks and have similar properties, but they can be used on any round shaft rather than a specialized rail. They can also be used in applications where sliding mechanisms have to rotate on the same axis.
es_mx: Los rodamientos lineales redondos son similares a los bloques de rodamientos y tienen propiedades parecidas, pero pueden utilizarse en cualquier eje redondo en lugar de en un carril especializado. También pueden utilizarse en aplicaciones en las que mecanismos deslizantes tienen que girar sobre el mismo eje.
fr_ca: Les roulements linéaires ronds sont similaires aux blocs de roulements et ont des propriétés similaires, mais ils peuvent être utilisés sur n'importe quel arbre rond plutôt que sur un rail spécialisé. Ils peuvent également être utilisés dans des applications où des mécanismes coulissants doivent tourner sur le même axe.
zh_cn: 圆形直线轴承与轴承座相似，也具有类似的特性，但它们可用于任何圆形轴，而非专用导轨。它们还可用于滑动机构必须在同一轴上旋转的应用场合。

source: Round linear bearings can easily be sourced from most robotics suppliers, including goBILDA and Actobotics. However, there are currently no out-of-the-box lift kits using these bearings available from these suppliers. It is difficult to make a compact slide setup using only kit parts, and for this reason most teams using round linear bearings use custom parts to mount them.
es_mx: Los rodamientos lineales redondos pueden adquirirse fácilmente en la mayoría de los proveedores de robótica, incluidos goBILDA y Actobotics. Sin embargo, actualmente no hay kits de elevación listos para usar que utilicen estos rodamientos disponibles en estos proveedores. Es difícil hacer una configuración de deslizamiento compacta utilizando sólo piezas de kit, y por esta razón la mayoría de los equipos que utilizan rodamientos lineales redondos utilizan piezas personalizadas para montarlos.
fr_ca: Les roulements linéaires ronds peuvent facilement être obtenus auprès de la plupart des fournisseurs de robotique, y compris goBILDA et Actobotics. Cependant, il n'existe actuellement aucun kit de levage prêt à l'emploi utilisant ces roulements. Il est difficile de fabriquer un dispositif de glissement compact en utilisant uniquement des pièces de kit, et c'est pourquoi la plupart des équipes qui utilisent des roulements linéaires ronds utilisent des pièces personnalisées pour les monter.
zh_cn: 圆形直线轴承可以很容易地从大多数机器人供应商处获得，包括 goBILDA 和 Actobotics。不过，这些供应商目前还没有使用这些轴承的开箱即用升降机套件。因此，大多数使用圆形直线轴承的团队都使用定制部件来安装它们。

source: Round linear bearings are often mounted with clamps, but they can also be mounted using inexpensive snap rings that snap onto the grooves on the outsides of the bearings.
es_mx: Los rodamientos lineales redondos suelen montarse con abrazaderas, pero también pueden montarse con anillos elásticos baratos que encajan en las ranuras de la parte exterior de los rodamientos.
fr_ca: Les roulements linéaires ronds sont souvent montés à l'aide d'étriers, mais ils peuvent également être montés à l'aide de bagues d'arrêt peu coûteuses qui s'enclenchent dans les rainures situées à l'extérieur des roulements.
zh_cn: 圆形直线轴承通常用夹具安装，但也可以用便宜的卡环安装，卡环卡在轴承外侧的凹槽上。

source: Many teams use round linear bearings with inexpensive aluminum and carbon fiber tubes instead of steel tubes to save weight. Although slide assemblies made this way are extremely light, they are prone to wearing out over time as the steel balls wear into the softer materials. Teams should keep this in mind and try to design their slide systems so that the tubes can easily be replaced.
es_mx: Muchos equipos utilizan rodamientos lineales redondos con tubos económicos de aluminio y fibra de carbono en lugar de tubos de acero para ahorrar peso. Aunque los conjuntos de rieles fabricados de esta forma son extremadamente ligeros, son propensos a desgastarse con el tiempo a medida que las bolas de acero se desgastan en los materiales más blandos. Los equipos deben tener esto en cuenta e intentar diseñar sus sistemas de deslizamiento de modo que los tubos puedan sustituirse fácilmente.
fr_ca: De nombreuses équipes utilisent des roulements linéaires ronds avec des tubes en aluminium et en fibre de carbone peu coûteux au lieu de tubes en acier pour gagner du poids. Bien que les glissières ainsi fabriquées soient extrêmement légères, elles ont tendance à s'user au fil du temps, les billes d'acier s'usant dans les matériaux plus tendres. Les équipes doivent garder cela à l'esprit et essayer de concevoir leurs systèmes de glissières de manière à ce que les tubes puissent être facilement remplacés.
zh_cn: 为了减轻重量，许多团队使用价格低廉的铝管和碳纤维管代替钢管制作圆形直线轴承。虽然这样制作的滑动组件非常轻便，但随着时间的推移，钢珠会磨损到较软的材料，因此容易磨损。参赛队应牢记这一点，在设计滑轨系统时尽量使管易于更换。

source: 8417 'Lectric Legends' Rover Ruckus robot with slides extended
es_mx: 8417 'Lectric Legends' Robot Rover Ruckus con rieles extendidos
fr_ca: 8417 'Lectric Legends' Robot Rover Ruckus avec glissières déployées
zh_cn: 8417 "Lectric Legends" Rover Ruckus 机器人，滑轨加长

source: 8417 'Lectric Legends, Rover Ruckus, round linear bearings and carbon fiber tubes with 3D printed mounts
es_mx: 8417 'Lectric Legends, Rover Ruckus, rodamientos lineales redondos y tubos de fibra de carbono con soportes impresos en 3D
fr_ca: 8417 'Lectric Legends, Rover Ruckus, roulements linéaires ronds et tubes en fibre de carbone avec supports imprimés en 3D
zh_cn: 8417 “Lectric Legends”，Rover Ruckus，圆形直线轴承和碳纤维管，带 3D 打印支架

source: 5975 Cybots Relic Recovery robot with relic arm extended
es_mx: 5975 Robot Relic Recovery de Cybots con brazo de reliquia extendido
fr_ca: 5975 Cybots Relic Recovery robot avec bras de relique étendu
zh_cn: 5975 Cybots ，Relic Recovery机器人，伸展机械臂

source: 5975 Cybots, Relic Recovery, round linear bearings and carbon fiber tubes with 3D printed mounts
es_mx: 5975 Cybots, Relic Recovery, rodamientos lineales redondos y tubos de fibra de carbono con soportes impresos en 3D
fr_ca: 5975 Cybots, Relic Recovery, roulements linéaires ronds et tubes en fibre de carbone avec supports imprimés en 3D
zh_cn: 5975 Cybots，Relic Recovery，圆形直线轴承和碳纤维管，带 3D 打印支架

source: 11115 Gluten Free Skystone linear slide arm
es_mx: 11115 Skystone Gluten Free brazo de deslizamiento lineal
fr_ca: 11115 Bras coulissant linéaire Skystone sans gluten
zh_cn: 11115 Gluten Free Skystone 直线滑臂

source: 11115 Gluten Free, Skystone, round linear bearings and metal shafts with 3D printed mounts
es_mx: 11115 Gluten Free, Skystone, rodamientos lineales redondos y ejes metálicos con soportes impresos en 3D
fr_ca: 11115 Sans gluten, Skystone, roulements linéaires ronds et arbres métalliques avec supports imprimés en 3D
zh_cn: 11115 Gluten Free， Skystone、圆形直线轴承和带 3D 打印支架的金属轴

source: goBILDA round linear bearing product insight
es_mx: goBILDA rodamiento lineal redondo visión del producto
fr_ca: Aperçu des roulements linéaires ronds goBILDA
zh_cn: goBILDA 圆形直线轴承产品洞察

source: goBILDA, round linear bearings with metal clamps and shafts
es_mx: goBILDA, rodamientos lineales redondos con abrazaderas y ejes metálicos
fr_ca: goBILDA, roulements linéaires ronds avec colliers et arbres métalliques
zh_cn: goBILDA，带金属夹具和轴的圆形直线轴承
