Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/rack-and-pinion.po
Languages: es_mx, fr_ca, zh_cn

source: Rack and Pinion
es_mx: Cremallera y piñón
fr_ca: Crémaillère et pignon
zh_cn: 齿条和小齿轮

source: Rack and pinion refers to a a toothed linear gear (the rack), meshed with a a circular gear (the pinion gear). When the pinion gear is driven, it will drive the pinion gear upwards or downwards, depending on how the rack and pinion is mounted.
es_mx: La cremallera es un engranaje lineal dentado (la cremallera) engranado con un engranaje circular (el piñón). Cuando se acciona el piñón, éste se mueve hacia arriba o hacia abajo, dependiendo de cómo esté montada la cremallera.
fr_ca: La crémaillère désigne un engrenage linéaire denté (la crémaillère), engrené avec un engrenage circulaire (le pignon). Lorsque le pignon est entraîné, il entraîne le pignon vers le haut ou vers le bas, en fonction de la façon dont la crémaillère est montée.
zh_cn: 齿轮齿条是指一个齿形线性齿轮（齿条）与一个圆形齿轮（小齿轮）啮合。当驱动小齿轮时，它将向上或向下驱动小齿轮，这取决于齿条和小齿轮的安装方式。

source: Generally, rack and pinion is a good light-use option for FTC\ |reg| teams in terms of linear extension. However, there are some disadvantages to rack and pinion compared to the other options of linear extension. Therefore, rack and pinion is generally not recommended for teams.
es_mx: En general, la cremallera es una buena opción de uso ligero para los equipos FTC |reg| en términos de extensión lineal. Sin embargo, hay algunas desventajas en la cremallera y el piñón en comparación con las otras opciones de extensión lineal. Por lo tanto, la cremallera y el piñón no se recomiendan generalmente para los equipos.
fr_ca: En règle générale, la crémaillère est une bonne option pour les équipes FTC en termes d'extension linéaire. Cependant, la crémaillère présente certains inconvénients par rapport aux autres options d'extension linéaire. Par conséquent, la crémaillère n'est généralement pas recommandée pour les équipes.
zh_cn: 一般来说，对于 FTC\ |reg| 团队来说，齿轮齿条式线性延长器是一个不错的轻型用途选择。不过，与其他线性延伸方案相比，齿轮齿条式也有一些缺点。因此，一般不建议伍队使用齿轮齿条式线性延长器。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优点

source: Easy way to extend upwards.
es_mx: Manera fácil de extender hacia arriba.
fr_ca: Une façon simple d'étendre le champ d'action vers le haut.
zh_cn: 向上延伸的简单方法

source: Power and linear motion in one package
es_mx: Potencia y movimiento lineal en un solo paquete
fr_ca: Puissance et mouvement linéaire en un seul paquet
zh_cn: 集动力和直线运动于一体

source: Can with proper support, sustain heavy load (e.g. hang robot)
es_mx: Puede, con el apoyo adecuado, sostener una carga pesada (por ejemplo, un robot colgante).
fr_ca: Peut, avec un soutien approprié, supporter une charge lourde (par exemple, suspension de robot).
zh_cn: 能在适当的支撑下承受重物（如悬挂式机器人）

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Rack and pinion generally is only used in one stage, because multiple mechanisms require other forms of powering it (belt, string, chain, etc.)
es_mx: Por lo general, el piñón y la cremallera sólo se utilizan en una etapa, ya que los mecanismos múltiples requieren otras formas de alimentación (correa, cuerda, cadena, etc.).
fr_ca: La crémaillère n'est généralement utilisée qu'à un seul stade, car les mécanismes multiples nécessitent d'autres formes d'entraînement (courroie, ficelle, chaîne, etc.).
zh_cn: 齿轮齿条一般只用于一个阶段，因为多个机构需要其他形式的动力（皮带、绳索、链条等）。

source: Rack and pinion needs to be supported very well to sustain heavy load, or else the mesh will fail. **It is not advisable to use the Tetrix rack and pinion in high stress conditions**.
es_mx: La cremallera y el piñón deben estar muy bien apoyados para soportar cargas pesadas o, de lo contrario, el engrane fallará. **No es aconsejable utilizar el piñón y la cremallera de Tetrix en condiciones de gran tensión**.
fr_ca: La crémaillère et le pignon doivent être très bien soutenus pour supporter une charge importante, faute de quoi le maillage se rompt. **Il est déconseillé d'utiliser la crémaillère Tetrix dans des conditions de fortes contraintes**.
zh_cn: 齿条和小齿轮需要很好的支撑以承受重负荷，否则网罩会失效。**不建议在高应力条件下使用Tetrix齿条和小齿轮**。

source: A marketing image for the tetrix rack and pinion
es_mx: Una imagen comercial de la cremallera tetrix
fr_ca: Une image marketing pour la crémaillère tetrix
zh_cn: tetrix齿条齿轮的市场形象

source: The Tetrix rack and pinion has a tendency to fail under medium to high load.
es_mx: La cremallera y el piñón Tetrix tienen tendencia a fallar con cargas medias o altas.
fr_ca: La crémaillère Tetrix a tendance à céder sous une charge moyenne à élevée.
zh_cn: Tetrix齿条和小齿轮在中高负荷下容易发生故障。
