Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/rigging.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Unlike string, belts used on slides never need to be tensioned. As discussed in the linear motion section, in order for string-driven slides to remain efficient, string tension must be maintained. Naturally, string loosens over time, so you either need a mechanism that can provide extra tension (a spring) or manually tighten string, which can get a bit tedious (especially for cascade rigging).
es_mx: A diferencia de la cuerda, las correas utilizadas en los rieles nunca necesitan tensarse. Como ya se ha comentado en la sección de movimiento lineal, para que las rieles accionados por cuerda sigan siendo eficientes, es necesario mantener la tensión de la cuerda. Naturalmente, la cuerda se afloja con el tiempo, por lo que o bien se necesita un mecanismo que proporcione tensión adicional (un resorte) o bien tensar manualmente la cuerda, lo que puede resultar un poco tedioso (especialmente para el rigging en cascada).
fr_ca: Contrairement à la corde, les courroies utilisées sur les glissières n'ont jamais besoin d'être tendues. Comme nous l'avons vu dans la section consacrée au mouvement linéaire, pour que les glissières à corde restent efficaces, la tension de la corde doit être maintenue. Naturellement, la corde se détend avec le temps, il faut donc soit un mécanisme capable de fournir une tension supplémentaire (un ressort), soit tendre manuellement la corde, ce qui peut s'avérer un peu fastidieux (en particulier pour les montages en cascade).
ro_ro: Spre deosebire de sfori, curelele utilizate pe glisiere nu trebuie niciodată tensionate. După cum s-a discutat în secțiunea privind mișcarea liniară, pentru ca glisierele acționate de șiruri să rămână eficiente, trebuie menținută tensiunea acestora. În mod natural, coarda se slăbește în timp, așa că aveți nevoie fie de un mecanism care să asigure o tensiune suplimentară (un resort), fie să strângeți manual coarda, ceea ce poate deveni puțin plictisitor (în special pentru montajul în cascadă).
zh_cn: 与线缆不同，滑轨上使用的皮带无需张紧。正如线缆性运动部分所讨论的，为了让线缆驱动的滑轨保持高效，必须保持线缆的张力。随着时间的推移，线缆自然会松弛，因此您要么需要一个能提供额外张力的装置（弹簧），要么需要手动拉紧线缆，这可能会有点繁琐（尤其是在级联索具上）。

source: However, belts do not have this issue. They tend not to stretch over time, meaning complex external tensioners are rarely needed. Belts are also on an automatic one to one loop, meaning that for every inch you pull in on the extension side, you always feed back out that inch on the retraction side, and vise versa. While this might not seem like a big deal, if a string winds itself up on a spool and overlaps at any point, the diameter of the spool changes, making the two spools out of sync.
es_mx: Sin embargo, las correas no tienen este problema. No tienden a estirarse con el tiempo, lo que significa que rara vez se necesitan tensores externos complejos. Las correas también tienen un bucle automático de uno a uno, lo que significa que por cada centímetro que se tira hacia dentro en el lado de extensión, siempre se retrocede ese centímetro en el lado de retracción, y viceversa. Aunque esto puede no parecer un gran problema, si una cuerda se enrolla en un carrete y se empalma en algún punto, el diámetro del carrete cambia, haciendo que los dos carretes no estén sincronizados.
fr_ca: Cependant, les courroies n'ont pas ce problème. Elles ont tendance à ne pas s'étirer avec le temps, ce qui signifie que des tendeurs externes complexes sont rarement nécessaires. Les courroies fonctionnent également en boucle automatique, ce qui signifie que pour chaque centimètre que vous tirez du côté de l'extension, vous réintroduisez toujours le même centimètre du côté de la rétraction, et vice versa. Cela peut sembler anodin, mais si une corde s'enroule sur une bobine et se chevauche à un moment donné, le diamètre de la bobine change, ce qui désynchronise les deux bobines.
zh_cn: 然而，皮带却没有这个问题。它们往往不会随着时间的推移而拉伸，这意味着很少需要复杂的外部张紧器。皮带也是一对一自动循环的，这意味着在拉伸侧每拉进一英寸，就会在缩回侧拉出一英寸，反之亦然。虽然这看起来不是什么大问题，但如果绳子在线轴上缠绕，并在任何一点上重叠，线轴的直径就会发生变化，从而使两个线轴不同步。

source: Disadvantages over string
es_mx: Desventajas frente a la cuerda
fr_ca: Inconvénients par rapport à la corde
zh_cn: 与线缆相比的缺点

source: The main disadvantage of belt-driven slides is the amount of space they take up. Simply put, belt pulleys take up much more room than the 4mm thick, 12mm diameter pulley bearings REV sells. When using belt-driven slides, pulleys are at least double that thickness and have a considerably larger diameter, meaning each stage must be thicker.
es_mx: La principal desventaja de los rieles accionados por correa es la cantidad de espacio que ocupan. En pocas palabras, las poleas de correa ocupan mucho más espacio que los rodamientos de polea de 4 mm de grosor y 12 mm de diámetro que vende REV. Cuando se utilizan rieles accionados por correa, las poleas tienen al menos el doble de grosor y un diámetro considerablemente mayor, lo que significa que cada etapa debe ser más gruesa.
fr_ca: Le principal inconvénient des glissières à courroie est leur encombrement. En termes simples, les poulies à courroie prennent beaucoup plus de place que les roulements à poulie de 4 mm d'épaisseur et de 12 mm de diamètre vendus par REV. Lorsque l'on utilise des glissières à courroie, les poulies sont au moins deux fois plus épaisses et ont un diamètre considérablement plus grand, ce qui signifie que chaque étage doit être plus épais.
zh_cn: 皮带驱动滑轨的主要缺点是占用空间大。简而言之，皮带轮比 REV 出售的厚度为 4 毫米、直径为 12 毫米的皮带轮轴承占用的空间要大得多。使用皮带驱动滑轨时，滑轮的厚度至少是皮带驱动滑轨的两倍，直径也大得多，这意味着每个阶段都必须加厚。

source: 7236's Rover Ruckus' robot's belt rigging
es_mx: 7236's Rover Ruckus' rigging de correa del robot
fr_ca: La courroie du robot Rover Ruckus 7236
zh_cn: 7236 的 Rover Ruckus 机器人的皮带传动装置

source: 7236 Recharged Green, Rover Ruckus, **continuous** rig
es_mx: 7236 Recharged Green, Rover Ruckus, **rigging continuo**
fr_ca: 7236 Recharged Green, Rover Ruckus, gréement continu
zh_cn: 7236 Recharged Green，Rover Ruckus， **连续** 钻机

source: 11190's Relic Recovery robot's belt rigging
es_mx: 11190's Relic Recovery robot rigging de correa
fr_ca: Courroie du robot de Relic Recovery 11190
zh_cn: 11190 队伍在Relic Recovery任务中机器人的皮带传动装置

source: 11190 Mechadojos, Relic Recovery, continuous belt rig
es_mx: 11190 Mechadojos, Relic Recovey, rigging de correa continua
fr_ca: 11190 Mechadojos, Relic Recovery, plate-forme à bande continue
zh_cn: 11190 Mechadojos，Relic Recovery，连续带式钻机

source: 5064's cascading belt rigging diagram
es_mx: Esquema de rigging de correa en cascada del 5064
fr_ca: Schéma du gréement de la courroie en cascade de 5064
zh_cn: 5064 的级联皮带传动装置图

source: 5064 Aperture Science Rover Ruckus **cascade** belt-driven proof of concept drawing
es_mx: 5064 Aperture Science Rover Ruckus **cascada** dibujo de prueba de concepto accionado por correa
fr_ca: 5064 Aperture Science Rover Ruckus **cascade** dessin de démonstration à entraînement par courroie
zh_cn: 5064 光圈科学漫游车 Ruckus **级联**皮带驱动概念验证图

source: 5064's cascading belt rigging
es_mx: rigging de correa en cascada del 5064
fr_ca: Le gréement de courroie en cascade de 5064
zh_cn: 5064 队伍级联皮带传动装置

source: 5064 Aperture Science Rover Ruckus **cascade** belt-driven final version
es_mx: 5064 Aperture Science Rover Ruckus **cascada** versión final accionada por correa
fr_ca: 5064 Aperture Science Rover Ruckus **cascade** version finale à entraînement par courroie
zh_cn: 5064 光圈科学漫游车 Ruckus **级联**皮带驱动最终版

source: Belt or chain driven elevators
es_mx: Elevadores accionados por correa o cadena
fr_ca: Élévateurs à courroie ou à chaîne
zh_cn: 皮带或链条驱动升降机

source: Almost ubiquitous in FRC\ |reg|, belt and chain elevators have existed seemingly forever. The basic premise is to have sprockets or pulleys mounted at the top and bottom of the elevator to the robot superstructure. Then, the belt or chain is hard bolted to the elevator near the bottom sprocket or pulley. When the chain or belt is driven, the elevator will move up and down. It is possible for elevators to have multi stage designs, but powering them will be more complex.
es_mx: Casi omnipresentes en FRC |reg|, los elevadores de correa y cadena han existido aparentemente desde siempre. La premisa básica es tener ruedas piñones o poleas montadas en la parte superior e inferior del elevador a la superestructura del robot. A continuación, la correa o cadena se atornilla al elevador cerca del piñon o polea inferior. Cuando se acciona la cadena o la correa, el elevador se mueve hacia arriba y hacia abajo. Es posible que los elevadores tengan diseños multietapa, pero su accionamiento será más complejo.
fr_ca: Presque omniprésents dans FRC\ |reg|, les ascenseurs à courroie et à chaîne existent depuis toujours. Le principe de base consiste à monter des pignons ou des poulies en haut et en bas de l'élévateur sur la superstructure du robot. La courroie ou la chaîne est ensuite solidement boulonnée à l'élévateur, près du pignon ou de la poulie du bas. Lorsque la chaîne ou la courroie est entraînée, l'élévateur monte et descend. Il est possible de concevoir des ascenseurs à plusieurs étages, mais leur alimentation sera plus complexe.
zh_cn: 皮带和链条升降机在 FRC |reg | 中几乎无处不在，似乎一直存在。其基本前提是在升降器的顶部和底部安装链轮或滑轮，将其固定在机器人上部结构上。然后，用硬螺栓将皮带或链条固定在靠近底部链轮或滑轮的升降器上。当链条或皮带被驱动时，升降器将上下移动。升降器可以采用多级设计，但其动力装置将更为复杂。

source: 7236's belt driven elevator
es_mx: Elevador accionado por correa del 7236
fr_ca: Élévateur à courroie du 7236
zh_cn: 7236 队伍设计的皮带传动升降机

source: Tensioners
es_mx: Tensores
fr_ca: Tendeurs
zh_cn: 拉伸器

source: Tensioning string is one of the most painstaking tasks for a builder in FTC. Ensuring that both sets of slides are tensioned evenly can be an arduous and annoying job. However, adding tensioners to your strings can help solve the uneven tension and ensure that both sides of slides run together. The most common type of tensioner is a spring that can be purchased at a hardware store. It generally will be placed at the end of the string run, near the part that extends farthest out from the robot's center. By doing so, the string will stretch out when the spool extends the arm, keeping tension so that the string does not detach from the pulleys in the linear slide extension.
es_mx: Tensar la cuerda es una de las tareas más laboriosas para un constructor en FTC. Asegurarse de que ambos juegos de rieles estén tensados de manera uniforme puede ser un trabajo arduo y molesto. Sin embargo, añadir tensores a las cuerdas puede ayudar a resolver la tensión desigual y garantizar que ambos lados de las correderas funcionen juntos. El tipo más común de tensor es un resorte que se puede comprar en una ferretería. Generalmente se coloca al final del recorrido de la cuerda, cerca de la parte que se extiende más lejos del centro del robot. De este modo, la cuerda se estirará cuando el carrete extienda el brazo, manteniendo la tensión para que la cuerda no se suelte de las poleas en la extensión lineal del riel.
fr_ca: La tension des cordes est l'une des tâches les plus laborieuses pour un constructeur de FTC. Veiller à ce que les deux jeux de glissières soient tendus de manière uniforme peut s'avérer une tâche ardue et ennuyeuse. Cependant, l'ajout de tendeurs à vos cordes peut aider à résoudre les problèmes de tension inégale et à garantir que les deux côtés des glissières fonctionnent ensemble. Le type de tendeur le plus courant est un ressort que l'on peut acheter dans une quincaillerie. Il est généralement placé à l'extrémité de la corde, près de la partie la plus éloignée du centre du robot. Ainsi, la corde s'étire lorsque la bobine déploie le bras, ce qui maintient la tension afin que la corde ne se détache pas des poulies de l'extension du coulisseau linéaire.
zh_cn: 张紧线缆是 FTC 建筑工人最辛苦的工作之一。确保两组滑轨张力均匀是一项艰巨而恼人的工作。不过，在线缆上安装张紧器可以帮助解决张力不均的问题，并确保两边的滑轨一起运行。最常见的张力器是一个弹簧，可以在五金店买到。一般来说，它会被放置在线缆的末端，靠近从机器人中心向外延伸最远的部分。这样，当线轴伸出机械臂时，线缆绳就会伸展开来，保持张力，从而避免线缆绳从线缆性滑轨延伸部分的滑轮上脱落。

source: Another form of tensioner can be a spring-loaded pulley. Since the pulley is spring-loaded, it will take up the slack in the string. Alternatively, it is possible to mount a pulley on a piece of extrusion, and slide it so the string is taut.
es_mx: Otra forma de tensor puede ser una polea accionada por resorte. Como la polea está cargada con un resorte, absorberá la holgura de la cuerda. Otra posibilidad es montar una polea en una pieza de extrusión y deslizarla para que la cuerda quede tensa.
fr_ca: Une autre forme de tendeur peut être une poulie à ressort. Comme la poulie est montée sur ressort, elle absorbera le mou de la corde. Il est également possible de monter une poulie sur un morceau d'extrusion et de la faire glisser de manière à ce que la corde soit tendue.
zh_cn: 另一种张紧器是弹簧滑轮。由于滑轮是弹簧加载的，因此它可以承受绳子的松弛。另外，也可以将滑轮安装在一块挤压件上，然后滑动滑轮使绳子绷紧。

source: There are two main reasons that tensioners are highly recommended in string based linear slides, the first and oftentimes more important one, is that at its core, a run of string is a series of polygons, and as the slide extends the effective size of that polygon changes. Meaning that when fully extended, your slide may require more or less string compared to when halfway extended. Or partially extended. The closer each set of bearings are, the less this impracts string tension.
es_mx: Hay dos razones principales por las que los tensores son muy recomendables en los rieles lineales basadas en cuerdas: la primera, y a menudo la más importante, es que, en esencia, una riel de cuerda es una serie de polígonos y, a medida que el riel se extiende, el tamaño efectivo de ese polígono cambia. Esto significa que, cuando está totalmente extendida, el riel puede necesitar más o menos cuerda que cuando está medio extendida. O parcialmente extendida. Cuanto más cerca estén los rodamientos, menor será la tensión de la cuerda.
fr_ca: Il y a deux raisons principales pour lesquelles les tendeurs sont fortement recommandés dans les glissières linéaires à cordes. La première, et souvent la plus importante, est qu'à la base, une glissière à cordes est une série de polygones, et que lorsque la glissière s'étend, la taille effective de ces polygones change. Cela signifie qu'une fois entièrement déployée, votre glissière peut nécessiter plus ou moins de corde que lorsqu'elle est à moitié déployée. Ou partiellement déployée. Plus les roulements sont proches les uns des autres, moins la tension de la corde est importante.
zh_cn: 在基于线缆性滑轨的线缆中强烈推荐使用拉伸器有两个主要原因，第一个也是通常更重要的一个原因是，线缆的核心是一系列多边形，随着滑轨的延伸，多边形的有效尺寸也会发生变化。这意味着，当滑轨完全伸展时，与半伸展时相比，可能需要更多或更少的线缆。或部分伸展时。每组轴承的距离越近，对线缆张力的影响就越小。

source: Another (but less impactful) thing to keep in mind that spool size changes as string is added/removed from the spool. If the spool radius increases, the speed of the extension will also increase, and torque, which opposes speed, will decrease. Consequently, tension will change as well. Therefore, a bit of slack is inherent in all linear extension designs using string.
es_mx: Otra cosa (pero menos impactante) a tener en cuenta es que el tamaño del carrete cambia a medida que se añade/quita cuerda del carrete. Si el radio del carrete aumenta, la velocidad de la extensión también aumentará, y el torque, que se opone a la velocidad, disminuirá. En consecuencia, la tensión también cambiará. Por lo tanto, en todos los diseños de extensiones lineales que utilizan cuerda es inherente un poco de holgura.
fr_ca: Une autre chose (mais qui a moins d'impact) à garder à l'esprit est que la taille de la bobine change lorsque la corde est ajoutée/enlevée de la bobine. Si le rayon de la bobine augmente, la vitesse de l'extension augmentera également, et le couple, qui s'oppose à la vitesse, diminuera. Par conséquent, la tension changera également. Par conséquent, un peu de mou est inhérent à toutes les conceptions d'extension linéaire utilisant de la ficelle.
zh_cn: 另一个（但影响较小）需要注意的问题是，线轴的尺寸会随着线缆绳从线轴上添加/移除而发生变化。如果线轴半径增大，延伸的速度也会增大，而与速度相反的扭矩会减小。因此，张力也会发生变化。因此，在所有使用线缆绳的线缆性延伸设计中，都会存在一定的松弛。

source: It is highly encouraged that teams have at least one spring tensioner per linear slide set.
es_mx: Se recomienda encarecidamente que los equipos dispongan de al menos un tensor de resortes por juego de rieles lineales.
fr_ca: Il est vivement recommandé aux équipes de disposer d'au moins un tendeur de ressort par ensemble de glissières linéaires.
zh_cn: 强烈建议参赛队为每套线性滑块至少配备一个弹簧拉伸器。

source: An image of 13075 linear slides
es_mx: Una imagen de 13075 rieles lineales
fr_ca: Une image de 13075 glissières linéaires
zh_cn: 13075 队伍制作线性滑轨的图像

source: An image of 13075 linear slide's string tensioner
es_mx: Una imagen del tensor de cuerda del riel lineal 13075
fr_ca: Image du tendeur de corde de la glissière linéaire de 13075
zh_cn: 13075 线缆性滑轨线缆张紧器的图像

source: 13075 Coram Deo Robotics, Rover Ruckus, string tensioner
es_mx: 13075 Coram Deo Robotics, Rover Ruckus, tensor de cuerda
fr_ca: 13075 Coram Deo Robotics, Rover Ruckus, tendeur de corde
zh_cn: 13075 Coram Deo Robotics、Rover Ruckus、线缆张紧器

source: Picking the right spool size
es_mx: Elegir el tamaño de carrete adecuado
fr_ca: Choisir la bonne taille de bobine
zh_cn: 选择合适的线轴尺寸

source: Spools have a special property that isn't often discussed, but is extremely useful when creating linear slide systems. Just as the system's speed and torque can be changed by changing its gear ratio, speed and torque can also be changed by changing the spool size. The motor rotates the spool at a constant angular speed. Thus, the translational speed (the speed of the slide) is proportional to the radius of the spool, and since torque is inversely proportional to speed, changing the spool size changes torque as well.
es_mx: Los carretes tienen una propiedad especial de la que no se habla mucho, pero que resulta muy útil a la hora de crear sistemas de rieles lineales. Al igual que la velocidad y el torque del sistema pueden modificarse cambiando la relación de engranajes, la velocidad y el torque también pueden modificarse cambiando el tamaño del carrete. El motor hace girar el carrete a una velocidad angular constante. Por tanto, la velocidad de traslación (la velocidad del riel) es proporcional al radio del carrete y, puesto que el torque es inversamente proporcional a la velocidad, al cambiar el tamaño del carrete también cambia el torque.
fr_ca: Les bobines ont une propriété particulière qui n'est pas souvent évoquée, mais qui est extrêmement utile lors de la création de systèmes de glissières linéaires. Tout comme la vitesse et le couple du système peuvent être modifiés en changeant le rapport de transmission, la vitesse et le couple peuvent également être modifiés en changeant la taille de la bobine. Le moteur fait tourner la bobine à une vitesse angulaire constante. Ainsi, la vitesse de translation (la vitesse du chariot) est proportionnelle au rayon de la bobine, et comme le couple est inversement proportionnel à la vitesse, le fait de changer la taille de la bobine modifie également le couple.
zh_cn: 线轴有一个不常被讨论的特殊属性，但在创建线性滑轨系统时却非常有用。正如系统的速度和扭矩可以通过改变齿轮比来改变一样，速度和扭矩也可以通过改变线轴尺寸来改变。电机以恒定的角速度旋转线轴。因此，平移速度（滑动速度）与转轴半径成正比，由于扭矩与速度成反比，因此改变转轴尺寸也会改变扭矩。

source: This is important to recognize, as changing spool size is often more convenient than changing gear ratio to get the desired combination of speed and torque. To illustrate this, say you have a linear extension system with a 3.7:1 gear ratio. You then decide that a 5:1 gear ratio would provide a more desirable combination of speed and torque than your current 3.7:1 ratio.
es_mx: Esto es importante de reconocer, ya que cambiar el tamaño del carrete es a menudo más conveniente que cambiar la relación de engranajes para obtener la combinación deseada de velocidad y torque. Para ilustrar esto, supongamos que tiene un sistema de extensión lineal con una relación de engranajes de 3,7:1. Luego decide que una relación de engranajes de 5:1 proporcionaría una combinación más deseable de velocidad y torque. Entonces decide que una relación de engranajes de 5:1 proporcionaría una combinación más deseable de velocidad y torque que su relación actual de 3,7:1.
fr_ca: Il est important de le savoir, car il est souvent plus pratique de changer la taille de la bobine que le rapport de transmission pour obtenir la combinaison souhaitée de vitesse et de couple. Pour illustrer cela, supposons que vous ayez un système d'extension linéaire avec un rapport de transmission de 3,7:1. Vous décidez ensuite qu'un rapport de 5:1 offrirait une meilleure combinaison de vitesse et de couple que votre rapport actuel de 3,7:1.
zh_cn: 认识到这一点很重要，因为要获得所需的速度和扭矩组合，改变线轴尺寸往往比改变齿轮比更方便。例如，您有一个齿轮比为 3.7:1 的线性延伸系统。然后，您认为 5:1 的齿轮比比目前 3.7:1 的齿轮比更能提供理想的速度和扭矩组合。

source: In many cases, instead of swapping gearboxes, it makes more sense to swap out spools to a smaller one. If your spool is currently 2 inches, your new size should be :math:`\frac{2*3.7}{5}` inches to achieve the same result.
es_mx: En muchos casos, en lugar de cambiar las cajas de engranajes, tiene más sentido cambiar los carretes por unos más pequeños. Si su carrete actual es de 2 pulgadas, el nuevo tamaño debería ser :math:`\frac{2*3,7}{5}` pulgadas para obtener el mismo resultado.
fr_ca: Dans de nombreux cas, au lieu de changer de boîte de vitesses, il est plus judicieux de changer de bobine pour une plus petite. Si votre bobine fait actuellement 2 pouces, votre nouvelle taille devrait être :math:``frac{2*3.7}{5}` pouces pour obtenir le même résultat.
zh_cn: 在许多情况下，与其更换齿轮箱，不如将转轴更换为更小的转轴。如果目前的线轴是 2 英寸，那么新的线轴尺寸应该是 :math:`\frac{2*3.7}{5}` 英寸，这样才能达到相同的效果。

source: You also need to make sure that when fully wrapped on the spool, your cable or string doesn't overlap. Overlapping can result in a change in spool diameter, which will change the tension in your string.
es_mx: También debes asegurarte de que el cable o la cuerda no se empalmen cuando estén completamente enrollados en el carrete. El empalmamiento puede provocar un cambio en el diámetro del carrete, lo que modificará la tensión de la cuerda.
fr_ca: Vous devez également vous assurer que votre câble ou votre cordage ne se chevauche pas lorsqu'il est entièrement enroulé sur la bobine. Le chevauchement peut entraîner une modification du diamètre de la bobine, ce qui modifiera la tension de votre corde.
zh_cn: 您还需要确保线缆或线缆完全缠绕在线轴上时不会重叠。重叠会导致线轴直径发生变化，从而改变线缆的张力。

source: Cable management
es_mx: Gestión de cables
fr_ca: Gestion des câbles
zh_cn: 电缆管理

source: When extending outwards, wire management becomes increasingly important. Obviously, it is a necessity to use wires slightly longer than the extension length. However, it is not recommended that these wires are left unprotected, as they can get tangled or caught in the slides much more easily than with protection.
es_mx: Cuando se extiende hacia el exterior, la gestión de los cables adquiere cada vez más importancia. Obviamente, es necesario utilizar cables ligeramente más largos que la longitud de la extensión. Sin embargo, no es recomendable dejar estos cables sin protección, ya que pueden enredarse o engancharse en las rieles con mucha más facilidad que con protección.
fr_ca: Lors de l'extension vers l'extérieur, la gestion des fils devient de plus en plus importante. Il est évidemment nécessaire d'utiliser des fils légèrement plus longs que la longueur de l'extension. Cependant, il n'est pas recommandé de laisser ces fils sans protection, car ils peuvent s'emmêler ou se prendre dans les glissières beaucoup plus facilement qu'avec une protection.
zh_cn: 向外延伸时，电线管理变得越来越重要。显然，必须使用比延伸长度稍长的电线。不过，我们不建议在没有保护措施的情况下使用这些电线，因为与有保护措施的电线相比，它们更容易缠绕或卡住滑轨。
