Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/rigging.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: A cascaded system can be retracted in three ways: using continuous retraction, elastic retraction, or reverse-cascade retraction.
es_mx: Un sistema en cascada puede retraerse de tres formas: mediante retracción continua, retracción elástica o retracción en cascada inversa.
fr_ca: Un système en cascade peut être rétracté de trois façons : par rétraction continue, par rétraction élastique ou par rétraction en cascade inverse.
ro_ro: Un sistem în cascadă poate fi retractat în trei moduri: folosind retracție continuă, elastică, sau în cascadă inversă.
zh_cn: 建造成层叠式的传动系统可以通过三种方式缩回：连续缩回、弹性缩回或逆向层叠式缩回。

source: A diagram of cascade rigging
es_mx: Un diagrama de rigging en cascada
fr_ca: Schéma du gréement en cascade
ro_ro: O schemă de legare în cascadă
zh_cn: 一张层叠式传动的示意图

source: Cascade rigging diagram
es_mx: Esquema de rigging en cascada
fr_ca: Schéma de gréement en cascade
ro_ro: Schemă legare în cascadă
zh_cn: 层叠式传动结构的图片

source: Retraction Options
es_mx: Opciones de retracción
fr_ca: Options de rétractation
ro_ro: Opțiuni de retracție
zh_cn: 回缩选项

source: Continuous Retraction
es_mx: Retracción continua
fr_ca: Rétraction continue
ro_ro: Retragere continuă
zh_cn: 连续回缩

source: As the name suggests, continuous retraction utilizes inverted continuous rigging to retract the slides. There are two main methods of doing this, **free floating retraction** where a string is run from the last stage directly back to the spool, and **with slide retraction** where the string is run in an inverse continuous pattern. Generally, **with slide retraction** should be used with extensions going outside the robot frame to prevent entanglement, and **free floating retraction** should only be used with purely vertical slides.
es_mx: Como su nombre indica, la retracción continua utiliza un rigging continuo invertido para retraer las rieles. Hay dos métodos principales para hacer esto, **retracción flotante libre** donde una cuerda se ejecuta desde la última etapa directamente de vuelta al carrete, y **con retracción de rieles** donde la cuerda se ejecuta en un patrón continuo inverso. Generalmente, **con retracción por deslizamiento** debería utilizarse con extensiones que van fuera de la estructura del robot para evitar enredos, y **retracción flotante libre** sólo debería utilizarse con rieles puramente verticales.
fr_ca: Comme son nom l'indique, la rétraction continue utilise un gréement continu inversé pour rétracter les toboggans. Il existe deux méthodes principales : la **rétraction flottante libre**, qui consiste à faire passer une corde du dernier étage directement à la bobine, et la **rétraction avec glissière**, qui consiste à faire passer la corde selon un schéma continu inversé. En règle générale, la méthode **avec rétraction de la glissière** doit être utilisée avec les extensions qui sortent du châssis du robot pour éviter l'enchevêtrement, et la méthode **avec rétraction flottante libre** ne doit être utilisée qu'avec les glissières purement verticales.
ro_ro: După cum sugerează și numele, retracția continuă utilizează un sistem continuu inversat pentru a retrage glisierele. Există două metode principale de a face acest lucru: **retragere cu flotare liberă**, în care un șir este parcurs de la ultima treaptă direct înapoi la bobină, și **retragere cu glisiere**, în care șirul este parcurs într-un model continuu invers. În general, **cu retracție cu alunecare** trebuie utilizată cu extensii care ies în afara cadrului robotului pentru a preveni încâlcirea, iar **retracția cu flotare liberă** trebuie utilizată numai cu alunecări pur verticale.
zh_cn: 顾名思义，连续缩回利用倒置的连续索具来缩回滑轨。主要有两种方法：**自由浮动回缩**，即绳子从最后一级直接回到线轴；**滑块附带回缩**，即绳子以反连续模式运行。一般来说，**滑块附带回缩**应与机器人框架外的延伸部分一起使用，以防止缠绕，而**自由浮动回缩**只能与纯垂直滑块一起使用。

source: If continuous retraction is being used with cascade extension, the two spools cannot be the same diameter. If the variable :math:`N` is the number of stages in the system, the diameter of the cascade extension spool must be :math:`N` **times smaller** than the continuous retraction spool.
es_mx: Si se utiliza retracción continua con extensión en cascada, los dos carretes no pueden tener el mismo diámetro. Si la variable :math:`N` es el número de etapas del sistema, el diámetro del carrete de extensión en cascada debe ser :math:`N` **veces menor** que el carrete de retracción continua.
fr_ca: Si la rétraction continue est utilisée avec l'extension en cascade, les deux bobines ne peuvent pas avoir le même diamètre. Si la variable :math:`N` est le nombre d'étages du système, le diamètre de la bobine d'extension en cascade doit être :math:`N` **fois plus petit** que celui de la bobine de rétraction continue.
ro_ro: În cazul în care se utilizează retracția continuă cu extensia în cascadă, cele două bobine nu pot avea același diametru. Dacă variabila :math:`N` este numărul de nivele din sistem, diametrul bobinei de extensie în cascadă trebuie să fie :math:`N` **de două ori mai mic** decât cel al bobinei de retracție continuă.
zh_cn: 如果连续缩回与级联延伸同时使用，则两个线轴的直径不能相同。如果变量 :math:`N` 是系统中的级数，则级联延伸线轴的直径必须 :math:`N` 比连续缩回线轴小 ** 倍。

source: A diagram of continuous retraction
es_mx: Un diagrama de retracción continua
fr_ca: Schéma d'une rétraction continue
ro_ro: O diagramă de retragere continuă
zh_cn: 连续回缩示意图

source: If free floating retraction is used, **make sure your retract string is always parallel to the slides**. If the string is misaligned, it can pull on your slide and cause excess bending forces on the stages.
es_mx: Si se utiliza la retracción libre, **asegúrese de que la cuerda de retracción esté siempre paralela a los rieles**. Si la cuerda está desalineada, puede tirar del riel y provocar fuerzas de flexión excesivas en las etapas.
fr_ca: En cas d'utilisation d'un système de rétraction flottant, **veillez à ce que la corde de rétraction soit toujours parallèle aux diapositives**. Si la corde est mal alignée, elle peut tirer sur la glissière et provoquer des forces de flexion excessives sur les étages.
ro_ro: În cazul în care se utilizează retracția flotantă liberă, **asigurați-vă că sfoara de retracție este întotdeauna paralelă cu glisierele**. Dacă șnurul nu este aliniat, acesta poate trage de glisieră și poate cauza forțe de îndoire excesive asupra nivelelor.
zh_cn: 如果使用自由浮动缩放，**确保缩放绳始终与滑台平行**。如果线缆错位，就会拉扯滑块，导致平台产生过大的弯曲力。

source: Advantages:
es_mx: Ventajas:
fr_ca: Avantages :
ro_ro: Avantaje:
zh_cn: 优点

source: Simplest retraction rigging
es_mx: El rigging de retracción más sencillo
fr_ca: Montage de rétraction le plus simple
ro_ro: Cea mai simplă schemă de retragere
zh_cn: 缩回装置的结构最简单

source: Disadvantages:
es_mx: Desventajas:
fr_ca: Inconvénients :
ro_ro: Dezavantaje:
zh_cn: 缺点

source: Can become tangled if free floating
es_mx: Puede enredarse si flota libremente
fr_ca: Peut s'emmêler s'il flotte librement
ro_ro: Poate deveni încurcat dacă plutește liber
zh_cn: 如果自由漂浮，可能会缠结在一起

source: Requires different sized spools if used with cascade retraction
es_mx: Requiere carretes de tamaño diferente si se utiliza con retracción en cascada
fr_ca: Nécessite des bobines de tailles différentes en cas d'utilisation avec la rétraction en cascade
ro_ro: Necesită bobine de dimensiuni diferite dacă se utilizează cu retracție în cascadă
zh_cn: 如果与层叠式缩回装置一起使用，则需要不同尺寸的线轴

source: Elastic Retraction
es_mx: Retracción elástica
fr_ca: Rétraction élastique
ro_ro: Retragere elastică
zh_cn: 弹性回缩

source: Instead of retracting using a retraction spool, one common way to retract is to attach a piece of elastic (commonly surgical tubing) to the last stage. The elastic applies a force on the last stage that is counteracted by the motor when extending. However, when retracting, the motor reels the last slide back in. While this is the retraction method recommended by many kit slide manuals, this method is not recommended.
es_mx: En lugar de retraer utilizando un carrete de retracción, una forma común de retraer es adjuntar un trozo de elástico (comúnmente tubo quirúrgico) a la última etapa. El elástico aplica una fuerza sobre la última etapa que es contrarrestada por el motor cuando se extiende. Sin embargo, cuando se retrae, el motor vuelve a enrollar al último riel. Aunque este es el método de retracción recomendado por muchos manuales de guías de kit, este método no es recomendable.
fr_ca: Au lieu de rétracter à l'aide d'une bobine de rétraction, une façon courante de rétracter consiste à attacher un morceau d'élastique (généralement un tube chirurgical) au dernier étage. L'élastique applique une force sur le dernier étage qui est contrebalancée par le moteur lors de l'extension. Cependant, lors de la rétraction, le moteur enroule le dernier étage. Bien qu'il s'agisse de la méthode de rétraction recommandée par de nombreux manuels de diapositives en kit, cette méthode n'est pas recommandée.
ro_ro: În loc să se retragă cu ajutorul unei bobine de retragere, o modalitate obișnuită de retragere este de a atașa o bucată de elastic (de obicei tub chirurgical) la ultima etapă. Elasticul aplică o forță asupra ultimului nivel care este contracarată de către motor atunci când se extinde. Cu toate acestea, atunci când se retrage, motorul înfășoară înapoi ultima cursă. Deși aceasta este metoda de retragere recomandată de multe manuale de kituri de glisiere, această metodă nu este recomandată.
zh_cn: 一种常见的缩回方法是在最后一级上连接一段弹性材料（通常是手术用管），而不是使用缩回线轴。伸展时，松紧带对最后一级施加的力被电机抵消。不过，在缩回时，马达会将最后一个滑块卷回。虽然这是许多套件幻灯片手册推荐的缩回方法，但并不推荐使用这种方法。

source: There is only one string to tension, instead of multiple, so tensioning is simpler.
es_mx: Sólo hay una cuerda que tensar, en lugar de varias, por lo que el tensado es más sencillo.
fr_ca: Il n'y a qu'une seule corde à tendre, au lieu de plusieurs, ce qui simplifie la mise en tension.
ro_ro: Există doar o singură sfoară de tensionat, în loc de mai multe, astfel încât tensionarea este mai simplă.
zh_cn: 只有一根线缆需要张紧，而不是多根，因此张紧更简单。

source: The elastic automatically tensions the extension string.
es_mx: El elástico tensa automáticamente la cuerda extensible.
fr_ca: L'élastique tend automatiquement la corde d'extension.
ro_ro: Elasticul tensionează automat sfoara de extensie.
zh_cn: 松紧带会自动拉紧延长线缆。

source: Since the elastic applies a force to the slide at all times, this force opposes the force applied by the motor when extending the slides. **Thus, elastic retraction decreases extension speed considerably**.
es_mx: Dado que el elástico aplica una fuerza al riel en todo momento, esta fuerza se opone a la aplicada por el motor al extender los rieles. **De este modo, la retracción elástica disminuye considerablemente la velocidad de extensión**.
fr_ca: Comme l'élastique exerce une force sur la glissière à tout moment, cette force s'oppose à la force appliquée par le moteur lors de l'extension des glissières. **Ainsi, la rétraction de l'élastique diminue considérablement la vitesse d'extension**.
ro_ro: Deoarece elasticul aplică în permanență o forță asupra glisierei, această forță se opune forței aplicate de motor atunci când glisierele se extind. **Din acest motiv, retragerea elastică scade considerabil viteza de extensie**.
zh_cn: 由于弹性体在任何时候都会对滑块施加一个力，这个力与马达在拉伸滑块时施加的力相反。**因此，弹性回缩会大大降低伸出速度**。

source: The elastic does not apply a constant force at all times. It applies force proportional to the amount that the slide is extended, so retraction may not be smooth and controlled, like other rigging methods.
es_mx: El elástico no aplica una fuerza constante en todo momento. Aplica una fuerza proporcional a la cantidad que se extiende el riel, por lo que la retracción puede no ser suave y controlada, como otros métodos de rigging.
fr_ca: L'élastique n'applique pas une force constante à tout moment. Il applique une force proportionnelle à l'extension de la glissière, de sorte que la rétraction peut ne pas être régulière et contrôlée, comme c'est le cas avec d'autres méthodes de gréement.
ro_ro: Elasticul nu aplică o forță constantă în orice moment. Acesta aplică o forță proporțională cu cantitatea de extensie a glisierei, astfel încât retragerea poate să nu fie lină și controlată, ca în cazul altor metode de legare.
zh_cn: 松紧带不会始终施加恒定的力。它所施加的力与滑块的伸出量成正比，因此缩回时可能不像其他索具方法那样平稳可控。

source: It is very easy to unwind your extension spool when using elastic retraction.
es_mx: Es muy fácil desenrollar el carrete de extensión cuando se utiliza la retracción elástica.
fr_ca: Il est très facile de dérouler votre bobine d'extension lorsque vous utilisez la rétraction élastique.
ro_ro: Este foarte ușor să derulați bobina de extensie atunci când folosiți retragerea elastică.
zh_cn: 使用弹性回缩时，很容易松开加长卷轴。

source: Cascade Retraction
es_mx: Retracción en cascada
fr_ca: Rétraction en cascade
ro_ro: Retragere în Cascadă
zh_cn: 层叠式回缩

source: Cascade retraction entails simply rigging another set of cascade string that can retract the system when engaged (see the image below).
es_mx: La retracción en cascada consiste simplemente en aparejar otro conjunto de cuerdas en cascada que puedan retraer el sistema cuando se enganche (véase la imagen siguiente).
fr_ca: La rétraction en cascade consiste simplement à installer un autre jeu de cordes en cascade qui peut rétracter le système lorsqu'il est enclenché (voir l'image ci-dessous).
ro_ro: Retragerea în cascadă presupune pur și simplu montarea unui alt set de sfori în cascadă care poate retrage sistemul atunci când este angrenat (a se vedea imaginea de mai jos).
zh_cn: 级联式回缩只需简单地安装另一套级联线缆，在啮合时即可缩回系统（见下图）。

source: If cascade retraction is being used with continuous extension, the two spools cannot be the same diameter. If the variable :math:`N` is the number of stages in the system, the diameter of the continuous extension spool must be :math:`N` **times bigger** than the cascade retraction spool.
es_mx: Si se utiliza retracción en cascada con extensión continua, los dos carretes no pueden tener el mismo diámetro. Si la variable :math:`N` es el número de etapas del sistema, el diámetro de la bobina de extensión continua debe ser :math:`N` **veces mayor** que la bobina de retracción en cascada.
fr_ca: Si la rétraction en cascade est utilisée avec l'extension continue, les deux bobines ne peuvent pas avoir le même diamètre. Si la variable :math:`N` est le nombre d'étages du système, le diamètre de la bobine d'extension continue doit être :math:`N` **fois plus grand** que celui de la bobine de rétraction en cascade.
ro_ro: În cazul în care se utilizează retracția în cascadă cu extensia continuă, cele două bobine nu pot avea același diametru. În cazul în care variabila :math:`N` este numărul de etaje din sistem, diametrul bobinei de extensie continuă trebuie să fie :math:`N` **de două ori mai mare** decât cel al bobinei de retracție în cascadă.
zh_cn: 如果级联缩回与连续拉伸同时使用，则两个线轴的直径不能相同。如果变量 :math:`N` 是系统中的级数，则连续拉伸线轴的直径必须 比级联缩回线轴**大:math:`N` 倍**。

source: Very space-efficient
es_mx: Muy eficiente en cuanto a espacio
fr_ca: Très peu encombrant
ro_ro: Foarte eficient din punct de vedere al spațiului
zh_cn: 非常节省空间

source: All stages retract at the same speed at the same time
es_mx: Todas las etapas se retraen a la misma velocidad al mismo tiempo
fr_ca: Tous les étages se rétractent à la même vitesse et en même temps
ro_ro: Toate etapele se retrag la aceeași viteză și în același timp
zh_cn: 所有阶段同时以相同速度缩回

source: Requires more string (less strings to tension, less strings that can become loose)
es_mx: Requiere más cuerda (menos cuerdas que tensar, menos cuerdas que pueden aflojarse)
fr_ca: Nécessite plus de cordes (moins de cordes à tendre, moins de cordes susceptibles de se détacher).
ro_ro: Necesită mai multe corzi (mai puține corzi de tensionat, mai puține corzi care se pot slăbi)
zh_cn: 需要更多线缆（需要张紧的线缆更少，可能松动的线缆更少）。

source: Requires different sized spools if used with cascade extension
es_mx: Requiere carretes de tamaño diferente si se utiliza con extensión en cascada
fr_ca: Nécessite des bobines de taille différente en cas d'utilisation avec une extension en cascade
ro_ro: Necesită bobine de dimensiuni diferite dacă se utilizează cu extensia în cascadă
zh_cn: 如果与层叠式延长线一起使用，则需要不同尺寸的线轴

source: A diagram of cascade retraction
es_mx: Un diagrama de retracción en cascada
fr_ca: Schéma de la rétraction en cascade
ro_ro: O diagramă de retragere în cascadă
zh_cn: 层叠式回缩示意图

source: Cascade retraction
es_mx: Retracción en cascada
fr_ca: Rétractation en cascade
ro_ro: Retracția în cascadă
zh_cn: 层叠式回缩

source: Additional Considerations:
es_mx: Consideraciones adicionales:
fr_ca: Autres considérations :
ro_ro: Considerații suplimentare:
zh_cn: 其他需考虑因素：

source: If the system has only one stage, cascade rigging is **identical to continuous rigging**
es_mx: Si el sistema sólo tiene una etapa, el rigging en cascada es **idéntico al rigging continuo**.
fr_ca: Si le système ne comporte qu'un seul étage, le gréement en cascade est **identique au gréement en continu**
ro_ro: În cazul în care sistemul are doar o singură etapă, legarea în cascadă este **identică cu legarea continuă**.
zh_cn: 如果系统只有一个阶，则级联索具**与连续索具**相同。

source: Unlike continuous rigging, each time a new stage is added to a cascaded system, the gear ratio required to maintain the same extension speed increases. For instance, if 2 stages are added to a 1 stage cascaded lift that is geared at a ratio of 3:1, the ratio must increase by a factor of :math:`\frac{2+1}{1}` to maintain the same speed, changing the ratio to 9:1.
es_mx: A diferencia del rigging continuo, cada vez que se añade una nueva etapa a un sistema en cascada, aumenta la relación de engranajes necesaria para mantener la misma velocidad de extensión. Por ejemplo, si se añaden 2 etapas a un elevador en cascada de 1 etapa que está engranado con una relación de 3:1, la relación debe aumentar en un factor de :math:`\frac{2+1}{1}` para mantener la misma velocidad, cambiando la relación a 9:1.
fr_ca: Contrairement au gréement continu, chaque fois qu'un nouvel étage est ajouté à un système en cascade, le rapport de transmission nécessaire pour maintenir la même vitesse d'extension augmente. Par exemple, si 2 étages sont ajoutés à un ascenseur en cascade à un étage qui a un rapport de 3:1, le rapport doit augmenter d'un facteur de :math:``frac{2+1}{1}` pour maintenir la même vitesse, ce qui fait passer le rapport à 9:1.
ro_ro: Spre deosebire de un montaj continuu, de fiecare dată când se adaugă o nouă etapă la un sistem în cascadă, raportul de transmisie necesar pentru a menține aceeași viteză de extensie crește. De exemplu, dacă se adaugă 2 nivele la un sistem de ridicare în cascadă cu 1 etaj care este angrenat la un raport de 3:1, raportul trebuie să crească cu un factor de :math:`\frac{2+1}{1}` pentru a menține aceeași viteză, schimbând raportul la 9:1.
zh_cn: 与连续式索具不同的是，层叠系统每增加一级，保持相同延伸速度所需的齿轮比就会增加。例如，如果在齿轮比为 3:1 的一级级联移位机上增加两级，则齿轮比必须增加:math:`frac{2+1}{1}`的系数才能保持相同的速度，即齿轮比变为 9:1。

source: One disadvantage of cascade rigging is that each string must be kept tensioned. This is still the case with continuous rigging, but you have many more strings to keep track of, as tension must be maintained on all of them.
es_mx: Una desventaja del rigging en cascada es que cada cuerda debe mantenerse tensada. Lo mismo ocurre con el rigging continuo, pero hay que controlar muchas más cuerdas, ya que hay que mantener la tensión en todas ellas.
fr_ca: L'un des inconvénients du gréement en cascade est que chaque corde doit être maintenue sous tension. C'est toujours le cas avec le gréement en continu, mais vous avez beaucoup plus de cordes à surveiller, car la tension doit être maintenue sur chacune d'entre elles.
ro_ro: Un dezavantaj al montajului în cascadă este că fiecare sfoară trebuie să fie ținută tensionată. Acest lucru este valabil și în cazul montajului continuu, dar aveți mult mai multe corzi de urmărit, deoarece tensiunea trebuie menținută pe toate.
zh_cn: 层叠索具的一个缺点是必须保持每根线缆的张力。连续式索具虽然也是如此，但需要跟踪的线缆更多，因为必须保持所有线缆的张力。

source: Using PTFE Tubing and John Guest Adapters to Route the String
es_mx: Uso de tubos de PTFE y adaptadores John Guest para guiar la cuerda
fr_ca: Utilisation de tubes en PTFE et d'adaptateurs John Guest pour acheminer la ficelle

source: If you're looking for the ability to mount your linear slides in a different location than your motor/pulley, consider using PTFE tubing and John Guest Adapters to route the string.
es_mx: Si busca la posibilidad de montar sus guías lineales en una ubicación diferente a la de su motor/polea, considere la posibilidad de utilizar tubos de PTFE y adaptadores John Guest para encaminar la cuerda.
fr_ca: Si vous souhaitez monter vos glissières linéaires à un endroit différent de votre moteur/poulie, envisagez d'utiliser des tubes en PTFE et des adaptateurs John Guest pour acheminer la corde.

source: 23292 SuperPowered Jalapenos Rigging Image
es_mx: 23292 SuperPowered Jalapenos Imágen de Aparejo

source: 1/8 in. PTFE tubing and John-guest push-to-connect adapters with M5 thread on one side work really well for this purpose. These tubing are identical to the ones used in 3D printers to route filament.
es_mx: Los tubos de PTFE de 1/8 pulg. y los adaptadores de conexión a presión John-guest con rosca M5 en un lado funcionan muy bien para este propósito. Estos tubos son idénticos a los que se utilizan en las impresoras 3D para guiar el filamento.
fr_ca: Les tubes PTFE de 1/8 in. Les tubes PTFE et les adaptateurs push-to-connect John-guest avec un filetage M5 d'un côté fonctionnent très bien à cette fin. Ces tubes sont identiques à ceux utilisés dans les imprimantes 3D pour acheminer le filament.

source: The tubing can be routed over long distances without adding significant friction
es_mx: Los tubos pueden tenderse a lo largo de grandes distancias sin añadir fricción significativa.
fr_ca: Les tubes peuvent être acheminés sur de longues distances sans ajouter de frottement significatif.

source: String going from slide rigging to a pulley on a motor through John Guest adapters and PTFE tubing.
es_mx: Cuerda que va del aparejo deslizante a una polea en un motor a través de adaptadores John Guest y tubo de PTFE.
fr_ca: Corde allant d'un gréement à coulisse à une poulie sur un moteur par l'intermédiaire d'adaptateurs John Guest et d'un tube PTFE.

source: 23292 SuperPowered Jalapenos, John Guest adapters rigging example
es_mx: 23292 SuperPowered Jalapenos, ejemplo de montaje de adaptadores John Guest
fr_ca: 23292 SuperPowered Jalapenos, exemple de gréement avec adaptateurs John Guest

source: Belt-driven slides
es_mx: Rieles accionados por correa
fr_ca: Glissières entraînées par courroie
ro_ro: Glisiere acționate cu curea
zh_cn: 皮带驱动滑轨

source: One increasingly popular alternative to traditional string-based rigging is belt-driven slides. This can be done continuously or using cascade rigging.
es_mx: Una alternativa cada vez más popular al rigging tradicional basado en cuerdas son las rieles accionados por correas. Esto puede hacerse de forma continua o utilizando rigging en cascada.
fr_ca: Une alternative de plus en plus populaire au gréement traditionnel à base de cordes est l'utilisation de glissières entraînées par des courroies. Ce système peut être utilisé en continu ou en cascade.
ro_ro: O alternativă din ce în ce mai populară la montajele tradiționale pe bază de sfori este reprezentată de glisierele acționate cu curele. Acest lucru se poate face în mod continuu sau prin intermediul unui montaj în cascadă.
zh_cn: 除传统的线缆索具外，皮带驱动滑轨也越来越受欢迎。这种方式可以使用连续结构，也可以使用层叠结构。

source: Advantages over string
es_mx: Ventajas sobre la cuerda
fr_ca: Avantages par rapport à la ficelle
ro_ro: Avantaje față de sfoară
zh_cn: 与线缆相比的优点
