Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/rigging.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Rigging refers to the way that string, belt, or chain is set up to extend and retract a linear extension. This is an important and time-consuming requirement for any team that uses linear extension, so be sure to spend adequate time on it.
es_mx: El rigging se refiere a la forma en que la cuerda, correa o cadena se configura para extender y retraer una extensión lineal. Se trata de un requisito importante y que requiere mucho tiempo para cualquier equipo que utilice una extensión lineal, así que asegúrese de dedicarle el tiempo adecuado.
fr_ca: Le gréement fait référence à la manière dont la corde, la courroie ou la chaîne est installée pour déployer et rétracter une extension linéaire. Il s'agit d'une exigence importante et chronophage pour toute équipe qui utilise une extension linéaire, et il convient donc d'y consacrer suffisamment de temps.
ro_ro: Prin "ancorare" se înțelege modul în care o sfoară, o curea sau un lanț este configurat pentru a extinde și retrage o extensie liniară. Aceasta este o cerință importantă și consumatoare de timp pentru orice echipă care utilizează extensia liniară, așa că asigurați-vă că îi acordați timpul necesar.
zh_cn: 传动结构是指通过设置线缆、皮带或链条来伸展和缩回线缆性延伸器的一种结构设计方式。对于任何使用线缆性延伸器的团队来说，这是一项重要且耗时的要求，因此一定要花足够的时间来完成。

source: The rigging for 7236's elevator in Rover Ruckus
es_mx: El rigging para el ascensor de 7236 en Rover Ruckus
fr_ca: Le gréement de l'ascenseur de 7236 dans Rover Ruckus
ro_ro: Ancorarea pentru liftul echipei 7236 în Rover Ruckus.
zh_cn: Rover Ruckus项目中， 7236 队伍设计的升降器的传动结构

source: Example rigging setup from team 7236 Recharged Green. This setup utilizes a continuous stringing setup for the first stage and a cascaded belt-driven second stage.
es_mx: Ejemplo de montaje del equipo 7236 Recharged Green. Este montaje utiliza una configuración de encuerdado continuo para la primera etapa y una segunda etapa accionada por correa en cascada.
fr_ca: Exemple de montage de l'équipe 7236 Recharged Green. Cette configuration utilise un système de cordage continu pour le premier étage et un deuxième étage à entraînement par courroie en cascade.
ro_ro: Exemplu de ancorare al sistemului de la echipa 7236 Recharged Green. Această configurație utilizează un sistem de sfori continue pentru prima etapă și o a doua etapă acționată de o curea în cascadă.
zh_cn: 来自 7236 Recharged Green 参赛队伍的传动结构安装示例。该装置的第一级采用连续串接装置，第二级采用级联皮带驱动装置。

source: General Rigging Tips
es_mx: Consejos generales sobre rigging
fr_ca: Conseils généraux sur le gréement
ro_ro: Sfaturi Generare de Ancorare
zh_cn: 基本传动结构技巧

source: Rig your extension string when the extension is retracted, and your retract string when the extension is at maximum extension
es_mx: Prepara tu cuerda de extensión cuando la extensión esté retraída, y tu cuerda de retracción cuando la extensión esté al máximo.
fr_ca: Fixez votre corde d'extension lorsque l'extension est rétractée, et votre corde de rétractation lorsque l'extension est au maximum.
ro_ro: Montați coarda de extensie atunci când extensia este retrasă, iar coarda de retragere atunci când extensia este la extensie maximă.
zh_cn: 在加长杆缩回时绑好加长杆绳，在加长杆处于最大加长状态时绑好缩回绳

source: Clamping a string with a bolt instead of tying it around something makes it much easier to quickly change the tension of a string
es_mx: Sujetar una cuerda con un perno en lugar de atarla alrededor de algo hace que sea mucho más fácil cambiar rápidamente la tensión de una cuerda.
fr_ca: En serrant une corde avec un boulon au lieu de l'attacher autour de quelque chose, il est beaucoup plus facile de modifier rapidement la tension d'une corde.
ro_ro: Prinderea unei sfori cu un șurub în loc de legarea ei în jurul a ceva face mult mai ușoară schimbarea rapidă a tensiunii unei sfori.
zh_cn: 用螺栓夹住绳子，而不是把它绑在你的其他架构上，这样可以更容易地快速改变绳子的张力

source: If tying an abrasive material string, like kevlar, around a plastic part, you can tie the string around a washer to distribute the loads across the hole in the pulley instead of tying it directly into a hole in the pulley
es_mx: Si se ata una cuerda de material abrasivo, como kevlar, alrededor de una pieza de plástico, se puede atar la cuerda alrededor de una arandela para distribuir las cargas a través del orificio de la polea en lugar de atarla directamente en un orificio de la polea.
fr_ca: Si vous attachez une corde en matériau abrasif, comme le kevlar, autour d'une pièce en plastique, vous pouvez attacher la corde autour d'une rondelle pour répartir les charges sur le trou de la poulie au lieu de l'attacher directement dans un trou de la poulie.
ro_ro: Dacă legați o sfoară din material abraziv, cum ar fi kevlarul, în jurul unei piese din plastic, puteți lega sfoara în jurul unei șaibe pentru a distribui sarcinile pe gaura din scripete, în loc să o legați direct într-o gaură din scripete.
zh_cn: 如果在塑料部件上绑上凯夫拉纤维（由其同名公司研制的一种芳纶纤维——译者注）等磨蚀性材料线缆，可以将线缆绑在垫圈上，以分散滑轮孔中的载荷，而不是直接绑在滑轮孔中。

source: Its generally easier to start from the side with the pulley and go to the end of the slides then the other way around
es_mx: Por lo general, es más fácil empezar por el lado de la polea e ir hasta el final de las guías que al revés.
fr_ca: Il est généralement plus facile de commencer par le côté où se trouve la poulie et d'aller jusqu'à l'extrémité des glissières que dans l'autre sens.
ro_ro: În general, este mai ușor să începeți din partea cu scripetele și să mergeți la capătul glisierelor decât invers.
zh_cn: 一般来说，从有滑轮的一侧开始绑，到滑道的末端，然后再反过来，会更容易些。

source: Continuous Rigging
es_mx: Rigging continuo
fr_ca: Gréement continu
ro_ro: Ancorare continuuă
zh_cn: 连续传动结构

source: **Generally recommended**
es_mx: **Generalmente recomendado**
fr_ca: **Généralement recommandé**
ro_ro: **Recomandat în general**
zh_cn: **一般建议**

source: Continuous rigging entails rigging one long **extension string**, originating from a motor-powered spool, to the top of the base stage, then to the bottom of the first stage, then to the top of the first stage, then to the bottom of the second stage, etc. A **retraction string**, originating from a second spool on the same axis as the extension spool, is then anchored to the top stage. When the motor rotates one direction, the extension spool reels in the extension string, so it becomes shorter. In doing so, the distance between the top of one stage and the bottom of the next stage decreases, causing the system to extend.
es_mx: El rigging continuo consiste en aparejar una larga **cuerda de extensión**, procedente de un carrete accionado por motor, a la parte superior de la platina base, luego a la parte inferior de la primera platina, luego a la parte superior de la primera platina, luego a la parte inferior de la segunda platina, etc. Una **cuerda de retracción**, procedente de un segundo carrete situado en el mismo eje que el carrete de extensión, se ancla entonces a la etapa superior. Cuando el motor gira en una dirección, el carrete de extensión enrolla el hilo de extensión, de modo que éste se acorta. Al hacerlo, la distancia entre la parte superior de una etapa y la parte inferior de la siguiente disminuye, haciendo que el sistema se extienda.
fr_ca: Le gréement continu consiste à fixer une longue **corde d'extension**, provenant d'une bobine motorisée, au sommet de l'étage de base, puis à la base du premier étage, puis au sommet du premier étage, puis à la base du deuxième étage, etc. Une **corde de rétraction**, provenant d'une deuxième bobine sur le même axe que la bobine d'extension, est ensuite ancrée à l'étage supérieur. Lorsque le moteur tourne dans un sens, la bobine de rallonge enroule la corde de rallonge, qui devient ainsi plus courte. Ce faisant, la distance entre le haut d'un étage et le bas de l'étage suivant diminue, ce qui entraîne l'extension du système.
ro_ro: Ancorarea continuă presupune echiparea unui **corzi de extensie** lungi, care provine de la o bobină cu motor, până la partea superioară a nivelului de bază, apoi până la partea inferioară a primului etaj, apoi până la partea superioară a primului etaj, apoi până la partea inferioară a celui de-al doilea etaj, etc. O **coardă de retragere**, care provine de la o a doua bobină pe aceeași axă ca și bobina de extensie, este apoi ancorat la etajul superior. Atunci când motorul se rotește într-o direcție, bobina de extensie înfășoară șirul de extensie, astfel încât acesta devine mai scurt. În acest fel, distanța dintre partea superioară a unui etaj și partea inferioară a etajului următor scade, ceea ce determină extinderea sistemului.
zh_cn: 连续传动结构需要将一根长长的**延长绳**，从一个马达驱动的线轴上拉出，拉到基础平台的顶部，然后拉到第一级平台的底部，再拉到第一级平台的顶部，然后拉到第二级平台的底部，等等。然后，从与延伸线轴处于同一轴线缆上的第二个线轴上引出的**收缩绳**被固定在顶级上。当电机向一个方向旋转时，延长线缆卷轴将延长线缆卷入，使其变短。这样，一级顶端与下一级底端之间的距离就会减小，从而使系统延伸。

source: The last stage always extends and retracts before the other stages (this can be either an advantage or a disadvantage, depending on the application).
es_mx: La última etapa siempre se extiende y repliega antes que las demás (esto puede ser una ventaja o un inconveniente, según la aplicación).
fr_ca: Le dernier étage se déploie et se rétracte toujours avant les autres étages (ce qui peut être un avantage ou un inconvénient, selon l'application).
ro_ro: Ultima etapă se extinde și se retrage mereu înaintea celorlalte etape ( acesta poate fi fie un avantaj fie un dezavantaj, în functie de aplicatie)
zh_cn: 最后一级总是先于其他各级伸出和缩回（取决于应用情况不同，这可能带来优势，也可能带来劣势）。

source: Once the last stage hits its limit, the next to last stage extends outwards, and so on; the pattern repeats until every stage is fully extended. When the motor spins **in the opposite direction**, the retraction string is reeled in, pulling the top stage closer to its starting position until the system is back where it started. For the retraction string, it is often necessary to add an extra pulley near the back of the extension. This is because the retraction will only retract to the farthest point, which generally is the spool. However, the spool may not be mounted at the very back of the robot - thus an extra pulley is needed. Note that for this to work, the extension string should be wrapped around the spool in the opposite direction of the retraction string. Thus, if the extension is wrapped clockwise, the retraction must be wrapped counterclockwise.
es_mx: Una vez que la última etapa alcanza su límite, la penúltima etapa se extiende hacia fuera, y así sucesivamente; el patrón se repite hasta que todas las etapas están completamente extendidas. Cuando el motor gira **en sentido contrario**, la cuerda de retracción se enrolla, acercando la etapa superior a su posición inicial hasta que el sistema vuelve al punto de partida. Para la cuerda de retracción, a menudo es necesario añadir una polea adicional cerca de la parte posterior de la extensión. Esto se debe a que la retracción sólo se retraerá hasta el punto más lejano, que generalmente es el carrete. Sin embargo, el carrete puede no estar montado en la parte trasera del robot, por lo que se necesita una polea extra. Tenga en cuenta que para que esto funcione, la cuerda de extensión debe envolverse alrededor del carrete en la dirección opuesta a la cuerda de retracción. Así, si la extensión se enrolla en el sentido de las agujas del reloj, la retracción debe enrollarse en sentido contrario.
fr_ca: Une fois que le dernier étage a atteint sa limite, l'avant-dernier étage se déploie vers l'extérieur, et ainsi de suite ; le schéma se répète jusqu'à ce que chaque étage soit complètement déployé. Lorsque le moteur tourne **dans la direction opposée**, la corde de rétraction est enroulée, rapprochant l'étage supérieur de sa position de départ, jusqu'à ce que le système revienne à son point de départ. Pour la corde de rétraction, il est souvent nécessaire d'ajouter une poulie supplémentaire à l'arrière de l'extension. En effet, la rétraction ne s'effectue que jusqu'au point le plus éloigné, qui est généralement la bobine. Cependant, la bobine peut ne pas être montée à l'arrière du robot, d'où la nécessité d'une poulie supplémentaire. Notez que pour que cela fonctionne, la ficelle d'extension doit être enroulée autour de la bobine dans la direction opposée à la ficelle de rétraction. Ainsi, si la rallonge est enroulée dans le sens des aiguilles d'une montre, la rétraction doit être enroulée dans le sens inverse des aiguilles d'une montre.
ro_ro: Odată ce ultima etapă își atinge limita, penultima etapă se extinde către exterior, și așa mai departe; modelul se repetă până când fiecare etapă este extinsă în întregime. Când motorul se învârte **în direcția opusă**, coarda de retragere este înfășurată, trăgând etajul superior mai aproape de poziția de început, până când se întoarce de unde a pornit. Pentru cordajul de retragere, este uneor necesar să adăugați un extra scripete lângă partea din spate a extensiei. Acest lucru se datorează faptului că retracția se va retrage până la cel mai îndepărtat punct, care este în general bobina. Cu toate acestea, bobina nu poate fi montată chiar în partea din spate a robotului, astfel este necesar un scripete în plus. Rețineți că, pentru ca acest lucru să funcționeze, coarda de extensie trebuie să fie înfășurată în jurul bobinei în direcția opusă celei de retragere. Astfel, dacă extensia este înfășurată în sensul acelor de ceasornic, retragerea trebuie să fie înfășurată în sensul opus acelor de ceasornic.
zh_cn: 一旦上一级达到极限，紧接着的下一级就会向外伸展，依此类推；这种模式不断重复，直到每一级都完全伸展为止。当电机**反向**旋转时，缩回绳被卷入，将顶级拉近其起始位置，直到系统回到起始位置。对于缩回绳，通常需要在伸展器后部附近增加一个额外的滑轮。这是因为缩回装置只能缩回到最远点，通常就是线轴。不过，线轴可能不会安装在机器人的最里面，因此需要额外的滑轮。需要注意的是，要想实现这一功能，延长线缆应绕在线轴上，方向与回缩线缆相反。因此，如果延长线缆按顺时针方向缠绕，则缩回线缆必须按逆时针方向缠绕。

source: Here are some additional considerations when rigging a continuous system.
es_mx: He aquí algunas consideraciones adicionales a la hora de aparejar un sistema continuo.
fr_ca: Voici quelques considérations supplémentaires à prendre en compte lors de l'installation d'un système continu.
ro_ro: Iată câteva considerații suplimentare atunci când montați un sistem continuu.
zh_cn: 以下是在装配连续系统时的一些额外注意事项。

source: As a general rule, continuous spools can be powered by a system with a relatively low gear ratio.
es_mx: Por regla general, los carretes continuos pueden accionarse mediante un sistema con una relación de engranajes relativamente baja.
fr_ca: En règle générale, les bobines continues peuvent être alimentées par un système ayant un rapport de démultiplication relativement faible.
ro_ro: Ca o regulă generală, bobinele continue pot fi acționate de un sistem cu un raport relativ mic.
zh_cn: 一般来说，连续线轴可由齿轮比相对较低的系统提供动力。

source: The extension string and retraction string **do not need to be separate strings, but it is much easier to tension the system if they are separate**.
es_mx: La cuerda de extensión y la cuerda de retracción **no necesitan ser cuerdas separadas, pero es mucho más fácil tensar el sistema si están separadas**.
fr_ca: La corde d'extension et la corde de rétraction **ne doivent pas nécessairement être des cordes séparées, mais il est beaucoup plus facile de tendre le système si elles sont séparées**.
ro_ro: Coarda de extensie și coarda de retragere **nu au nevoie de extensii separate, dar este mult mai ușor să tensionați sistemul în cazul în care acestea sunt separate**.
zh_cn: 拉伸绳和回缩绳**不需要分开，但如果分开，张紧这个架构会容易得多。**

source: The extension spool and retraction spool should be the same diameter.
es_mx: El carrete de extensión y el carrete de retracción deben tener el mismo diámetro.
fr_ca: La bobine d'extension et la bobine de rétraction doivent avoir le même diamètre.
ro_ro: Bobina de extensie și bobina de retragere ar trebui să aibă același diametru.
zh_cn: 延伸线轴和缩回线轴的直径应相同。

source: You need to make sure, as with any time you work with strings and pulleys, that you are pulling the string straight. Any amount of misalignment can lead to the string coming off of your pulley.
es_mx: Como siempre que trabajes con cuerdas y poleas, debes asegurarte de que tiras de la cuerda de forma recta. Cualquier desalineación puede hacer que la cuerda se salga de la polea.
fr_ca: Comme à chaque fois que vous travaillez avec des cordes et des poulies, vous devez vous assurer que vous tirez sur la corde en ligne droite. Tout défaut d'alignement peut entraîner le détachement de la ficelle de la poulie.
ro_ro: Trebuie să vă asigurați, că de fiecare dată când lucrati cu sfori și scripeți, că trageți sfoara drept. Orice nealiniere poate duce la desprinderea sforii de pe scripete.
zh_cn: 与任何时候使用绳缆和滑轮一样，您需要确保您拉动的绳缆是直的。任何偏差都可能导致绳子从滑轮上脱落。

source: The width and diameter of your spool should be enough such that once fully wounded, your string never overlaps. The reason for this is because when the string starts to overlap, this can change the diameter of your spool, causing the tension in the string to change.
es_mx: La anchura y el diámetro de la bobina deben ser tales que, una vez enrollada, la cuerda nunca se empalme. Esto se debe a que, cuando la cuerda empieza a empalmarse, puede cambiar el diámetro del carrete y, por tanto, la tensión de la cuerda.
fr_ca: La largeur et le diamètre de votre bobine doivent être suffisants pour qu'une fois enroulée, votre corde ne se chevauche jamais. En effet, lorsque la corde commence à se chevaucher, le diamètre de la bobine peut changer, ce qui modifie la tension de la corde.
ro_ro: Lățimea și diametrul bobinei ar trebui să fie suficient de mari pentru ca, odată ce este complet înfășurată, sfoara să nu se suprapună niciodată. Motivul este că, atunci când sfoara începe să se suprapună, se poate modifica diametrul bobinei, ceea ce face ca tensiunea din coardă să se schimbe.
zh_cn: 线轴的宽度和直径应足够大，这样一旦完全缠绕，线缆就不会重叠。这是因为当线缆开始重叠时，会改变线轴的直径，从而导致线缆的张力发生变化。

source: A diagram of continuous rigging
es_mx: Un diagrama de rigging continuo
fr_ca: Schéma du gréement continu
ro_ro: O diagramă de ancorare continuă
zh_cn: 一个连续传动结构的示意图

source: Continuous rigging diagram
es_mx: Esquema del rigging continuo
fr_ca: Schéma de gréement continu
ro_ro: Diagramă de ancorare continuă
zh_cn: 连续传动结构图

source: Cascade Rigging
es_mx: Rigging en Cascada
fr_ca: Gréement cascade
ro_ro: Ancorare în cascadă
zh_cn: 层叠式传动

source: Cascade rigging is a bit more complicated than continuous rigging. Much like continuous rigging, an extension string originating from a spool is rigged to the top of the base, running down to the bottom of the first stage. However, instead of being rigged to the top of the stage, the extension string is anchored to the bottom of the first stage. A second extension string, anchored to the top of the base, is rigged to the top of the first stage and anchored at the bottom of the second stage. The pattern continues until all stages have been rigged.
es_mx: El rigging en cascada es un poco más complicado que el rigging continuo. Al igual que en el rigging continuo, una cuerda de extensión que se origina en un carrete se apareja en la parte superior de la base y desciende hasta la parte inferior de la primera etapa. Sin embargo, en lugar de fijarse a la parte superior de la plataforma, la extensión se ancla a la parte inferior de la primera plataforma. Una segunda cuerda de extensión, anclada a la parte superior de la base, se apareja a la parte superior de la primera etapa y se ancla a la parte inferior de la segunda etapa. El patrón continúa hasta que se han aparejado todas las etapas.
fr_ca: Le gréement en cascade est un peu plus compliqué que le gréement en continu. Comme pour le gréement en continu, une rallonge partant d'une bobine est fixée au sommet de la base et descend jusqu'au bas du premier étage. Cependant, au lieu d'être fixée au sommet de l'étage, la rallonge est ancrée à la base du premier étage. Une deuxième rallonge, ancrée au sommet de la base, est fixée au sommet du premier étage et ancrée à la base du deuxième étage. Ce schéma se poursuit jusqu'à ce que tous les étages aient été gréés.
ro_ro: Ancorarea în cascadă este un pic mai complicată decât cea continuă. La fel ca și în cazul cablurilor continue, o sfoară de extensie care pornește de la o bobină este fixat în partea superioară a bazei, coborând până la partea inferioară a primei etape. Cu toate acestea, în loc să fie fixată în partea superioară a etapei, sfoara de prelungire este ancorată la partea inferioară a primei etape. O a doua sfoară de prelungire, ancorată în partea superioară a bazei, este fixată în partea superioară a primului etaj și ancorată în partea inferioară a celui de-al doilea etaj. Modelul continuă până când toate etapele au fost ancorate.
zh_cn: 层叠式传动结构比连续传动结构复杂一些。与连续式传动结构类似，从线轴开始的延伸线缆被固定在底座的顶部，然后向下延伸至第一级的底部。不过，延伸绳并不是固定在平台顶部，而是锚定在第一级的底部。锚定在底座顶部的第二根延伸线缆被固定在第一级的顶部，并锚定在第二级的底部。这种模式一直持续到所有阶段都安装完毕。

source: The number of strings required to extend is equal to the number of stages in the system.
es_mx: El número de cuerdas necesarias para extenderse es igual al número de etapas del sistema.
fr_ca: Le nombre de cordes nécessaires à l'extension est égal au nombre d'étages du système.
ro_ro: Numărul de sfori necesare pentru extindere este egal cu numărul de etaje din sistem.
zh_cn: 扩展所需的联结数量等于系统中的级数。

source: When the motor rotates one direction, the extension spool reels in the first string, decreasing the distance between the base and the bottom of the first stage. This pushes the second string forward, decreasing the distance between the top of the first stage and the bottom of the second stage, and so on. Note that unlike continuous rigging, **every stage moves at the same time**. The second stage moves 2 times as fast as the first stage relative to the base, the third 3 times as fast, and so on.
es_mx: Cuando el motor gira en una dirección, el carrete de extensión enrolla la primera cuerda, disminuyendo la distancia entre la base y la parte inferior de la primera etapa. Esto empuja la segunda cuerda hacia delante, disminuyendo la distancia entre la parte superior de la primera etapa y la parte inferior de la segunda, y así sucesivamente. Tenga en cuenta que, a diferencia del rigging continuo, **todas las etapas se mueven al mismo tiempo**. La segunda etapa se mueve 2 veces más rápido que la primera con respecto a la base, la tercera 3 veces más rápido, y así sucesivamente.
fr_ca: Lorsque le moteur tourne dans un sens, la bobine d'extension enroule la première corde, réduisant ainsi la distance entre la base et le bas du premier étage. Cela pousse la deuxième corde vers l'avant, diminuant la distance entre le haut du premier étage et le bas du deuxième étage, et ainsi de suite. Notez que contrairement au gréement continu, **chaque étage se déplace en même temps**. Le deuxième étage se déplace 2 fois plus vite que le premier par rapport à la base, le troisième 3 fois plus vite, et ainsi de suite.
ro_ro: Atunci când motorul se rotește într-o direcție, bobina de extensie înfășoară prima sfoară, micșorând distanța dintre bază și partea inferioară a primului etaj. Acest lucru împinge a doua sfoară înainte, reducând distanța dintre partea superioară a primului nivel și partea inferioară a celui de-al doilea nivel, și așa mai departe. Rețineți că, spre deosebire de rigging-ul continuu, **toate etapele se mișcă în același timp**. A doua treaptă se mișcă de 2 ori mai repede decât prima treaptă în raport cu baza, a treia de 3 ori mai repede, și așa mai departe.
zh_cn: 当电机朝一个方向旋转时，延伸线轴卷入第一根线缆，减小第一级底座和底部之间的距离。这将推动第二根绳向前，减小第一级顶部和第二级底部之间的距离，依此类推。请注意，与连续索具不同的是，**每个级都同时移动**。第二级相对于底座的移动速度是第一级的 2 倍，第三级是第一级的 3 倍，以此类推。
