Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/linear-motion-guide/rigging.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: In general, teams should ensure that wires never protrude outside the structural parts of the robot, because they can get caught on other robots or game pieces. This can be accomplished by cable ties or Velcro ties, or by using acrylic plate to keep wires inside.
es_mx: En general, los equipos deben asegurarse de que los cables nunca sobresalgan fuera de las partes estructurales del robot, ya que pueden engancharse en otros robots o piezas de juego. Esto puede conseguirse mediante cinchos para cables o tiras de velcro, o utilizando una placa acrílica para mantener los cables en el interior.
fr_ca: En général, les équipes doivent veiller à ce que les fils ne dépassent jamais des parties structurelles du robot, car ils peuvent s'accrocher à d'autres robots ou à des pièces de jeu. Pour ce faire, elles peuvent utiliser des colliers de serrage ou des attaches Velcro, ou encore une plaque acrylique pour maintenir les fils à l'intérieur.
zh_cn: 一般来说，参赛队应确保电线永远不会伸出机器人的结构部分之外，因为它们可能会被其他机器人或游戏部件卡住。为此，可以使用扎线带或尼龙搭扣带，或使用丙烯酸板将电线固定在内部。

source: However, for linear extensions, other forms of cable management are needed. The two types of cable management recommended are cable carrier and retractable coil cord. Refer to the :doc:`Electronics and Wiring </docs/power-and-electronics/index>` section for more information.
es_mx: Sin embargo, para las extensiones lineales, se necesitan otras formas de gestión de cables. Los dos tipos de organización de cables recomendados son el portacables y el cable en espiral retráctil. Consulte la sección :doc:`Electrónica y cableado </docs/power-and-electronics/index>` para obtener más información.
fr_ca: Cependant, pour les extensions linéaires, d'autres formes de gestion des câbles sont nécessaires. Les deux types de gestion de câbles recommandés sont le porte-câble et le cordon enrouleur rétractable. Reportez-vous à la section :doc:`Electronique et câblage </docs/power-and-electronics/index>` pour plus d'informations.
zh_cn: 不过，对于线性延长线，还需要其他形式的线缆管理。推荐的两种电缆管理方式是电缆支架和可伸缩卷线。有关详细信息，请参阅 :doc:`电元件与线缆 </docs/power-and-electronics/index>` 部分。

source: Cable Carrier/Drag Chain
es_mx: Portacables/Cadena de arrastre
fr_ca: Porte-câble/Chaîne de traînage
zh_cn: 电缆架/拖链

source: Cable carrier, the standard wire management method within industry, is plastic chain links with a hollow center. Cables are placed inside the chain, allowing the system to extend indefinitely. The links are somewhat stiff yet flexible, allowing cable chain to bend when the extension is retracted and straighten when extended. They typically are stiff enough not to sag excessively when retracted.
es_mx: Los portacables, el método estándar de gestión de cables en la industria, son eslabones de cadena de plástico con un centro hueco. Los cables se colocan dentro de la cadena, lo que permite que el sistema se extienda indefinidamente. Los eslabones son algo rígidos pero flexibles, lo que permite que la cadena portacables se doble cuando se retrae la extensión y se enderece cuando se extiende. Suelen ser lo suficientemente rígidos como para no encorvarse excesivamente cuando se retraen.
fr_ca: La chaîne porte-câbles, méthode standard de gestion des câbles dans l'industrie, est constituée de maillons de chaîne en plastique dont le centre est creux. Les câbles sont placés à l'intérieur de la chaîne, ce qui permet au système de s'étendre indéfiniment. Les maillons sont à la fois rigides et flexibles, ce qui permet à la chaîne de se plier lorsque l'extension est rétractée et de se redresser lorsqu'elle est déployée. Ils sont généralement assez rigides pour ne pas s'affaisser excessivement lorsqu'ils sont rétractés.
zh_cn: 电缆架是工业领域的标准电线管理方法，是一种中心中空的塑料链节。电缆放置在链条内，使系统可以无限延伸。链节有一定的硬度，但又有一定的柔韧性，使电缆链在缩回时可以弯曲，在伸出时可以拉直。它们通常具有足够的硬度，在缩回时不会过度下垂。

source: Here are some links to various drag chain products:
es_mx: Estos son algunos enlaces a diversos productos de cadenas de arrastre:
fr_ca: Voici quelques liens vers divers produits de chaînes de traînage :
zh_cn: 下面是一些有关各种拖链产品的链接：

source: `igus cable carrier <https://www.igus.com/info/energy-chains-e2-micro-small-cable-carrier>`_
es_mx: `portacables igus <https://www.igus.com/info/energy-chains-e2-micro-small-cable-carrier>`_
zh_cn: `igus 电缆支架 <https://www.igus.com/info/energy-chains-e2-micro-small-cable-carrier>`_

source: `uxcell 10x10mm drag chain, from Amazon <https://www.amazon.com/uxcell-InnerH-InnerW-Plastic-Carrier/dp/B01LX02PSW/ref=sr_1_1?keywords=drag%2Bchain&qid=1566188144&s=gateway&sr=8-1&th=1>`_
es_mx: `uxcell 10x10mm cadena de arrastre, de Amazon <https://www.amazon.com/uxcell-InnerH-InnerW-Plastic-Carrier/dp/B01LX02PSW/ref=sr_1_1?keywords=drag%2Bchain&qid=1566188144&s=gateway&sr=8-1&th=1>`_
fr_ca: `chaîne de traînage uxcell 10x10mm, de Amazon <https://www.amazon.com/uxcell-InnerH-InnerW-Plastic-Carrier/dp/B01LX02PSW/ref=sr_1_1?keywords=drag%2Bchain&qid=1566188144&s=gateway&sr=8-1&th=1>`_
zh_cn: uxcell 10x10mm 拖链，来自亚马逊 <https://www.amazon.com/uxcell-InnerH-InnerW-Plastic-Carrier/dp/B01LX02PSW/ref=sr_1_1?keywords=drag%2Bchain&qid=1566188144&s=gateway&sr=8-1&th=1>`_

source: Difficult to get tangled/hooked onto other objects or robots
es_mx: Difícil de enredarse/engancharse a otros objetos o robots
fr_ca: Difficile de s'emmêler ou de s'accrocher à d'autres objets ou robots
zh_cn: 难以缠绕/钩住其他物体或机器人

source: Sturdy and durable
es_mx: Robusto y duradero
fr_ca: Robuste et durable
zh_cn: 坚固耐用

source: Protects wires very well
es_mx: Protege muy bien los cables
fr_ca: Protège très bien les fils
zh_cn: 很好地保护电线

source: Large form factor, takes up a lot of space
es_mx: Factor de forma grande, ocupa mucho espacio
fr_ca: Grand facteur de forme, prend beaucoup de place
zh_cn: 外形尺寸大，占用空间大

source: Links need to be added if additional extension is needed
es_mx: Es necesario añadir enlaces si se necesita una extensión adicional
fr_ca: Des liens doivent être ajoutés si une extension supplémentaire est nécessaire.
zh_cn: 如果需要额外扩展，需要添加连接器

source: Can be on the heavy side, especially with a long length of drag chain
es_mx: Puede resultar pesado, especialmente con una cadena de arrastre larga.
fr_ca: Peut être un peu lourd, surtout avec une grande longueur de chaîne de traînage.
zh_cn: 可能会偏重，尤其是拖链较长时

source: 7236's Rover Ruckus robot with cable carriers visible
es_mx: El robot Rover Ruckus de 7236 con los portacables a la vista
fr_ca: Le robot Rover Ruckus de 7236 avec les porte-câbles visibles
zh_cn: 7236 队伍的 Rover Ruckus 机器人，电缆架清晰可见

source: 7236 Recharged Green, Rover Ruckus: Cable carrier on the left side of their horizontal slides and the right side of vertical slides
es_mx: 7236 Recharged Green, Rover Ruckus: Portacables en el lado izquierdo de sus rieles horizontales y en el lado derecho de los rieles verticales.
fr_ca: 7236 Recharged Green, Rover Ruckus : Porte-câbles sur le côté gauche des toboggans horizontaux et sur le côté droit des toboggans verticaux.
zh_cn: 7236 Recharged Green，Rover Ruckus：水平滑道左侧和垂直滑道右侧的电缆支架

source: Retractable Coil Cord
es_mx: Cable retráctil en espiral
fr_ca: Cordon rétractable
zh_cn: 可伸缩线圈

source: While not common within industry, coil cords are still very common (coil cord is a nearly ubiquitous staple of older telephones). Retractable coil cord is more flexible than cable carriers, stretching when extended.
es_mx: Aunque no son habituales en la industria, los cables en espiral siguen siendo muy comunes (el cable en espiral es un elemento casi omnipresente de los teléfonos antiguos). El cable en espiral retráctil es más flexible que los portacables y se estira cuando se extiende.
fr_ca: Bien qu'ils ne soient pas courants dans l'industrie, les cordons spiralés sont encore très répandus (les cordons spiralés sont presque omniprésents dans les anciens téléphones). Le cordon spiralé rétractable est plus souple que les porte-câbles et s'étire lorsqu'il est déployé.
zh_cn: 虽然线圈在工业中并不常见，但仍然非常普遍（线圈线几乎是老式电话中无处不在的主要部件）。伸缩式线圈电线比电缆载体更灵活，伸展时可以拉伸。

source: Flexible and can usually extend to any length needed (unlike cable carriers, no new links ever need to be added)
es_mx: Flexible y, por lo general, puede ampliarse a cualquier longitud que se necesite (a diferencia de los soportes de cables, nunca es necesario añadir nuevos enlaces).
fr_ca: Flexible et peut généralement s'étendre sur toute la longueur nécessaire (contrairement aux transporteurs par câble, il n'est jamais nécessaire d'ajouter de nouvelles liaisons).
zh_cn: 灵活，通常可延伸至所需的任何长度（与电缆支架不同，无需添加新链路）

source: Can get tangled more easily, as it is less stiff than drag chain
es_mx: Puede enredarse más fácilmente, ya que es menos rígida que la cadena de arrastre
fr_ca: Peut s'emmêler plus facilement, car elle est moins rigide qu'une chaîne de traînage.
zh_cn: 由于硬度低于拖链，因此更容易缠结

source: 10030's robot's coil cord
es_mx: Cable de la bobina del robot 10030
fr_ca: Cordon de la bobine du robot 10030
zh_cn: 10030 队伍的机器人的线圈

source: 10030 7 Sigma Robotics, Relic Recovery: Coil-cord on horizontal extension mechanism
es_mx: 10030 7 Sigma Robotics, Relic Recovery: Cuerda helicoidal en mecanismo de extensión horizontal
fr_ca: 10030 7 Sigma Robotics, récupération de reliques : Cordon spiralé sur le mécanisme d'extension horizontal
zh_cn: 10030 7 Sigma Robotics， Relic Recovery：水平延伸装置上的线圈绳

source: Self-retracting Badge Holder
es_mx: Portacredenciales autorretráctil
fr_ca: Porte-badges auto-rétractable
zh_cn: 自动伸缩支架

source: While an uncommon technique, a self-retracting ID Badge holder can help manage wiring on an extension. These are common items; `here is one from Amazon <https://www.amazon.com/OFES-Retractable-Holder-Swivel-Alligator/dp/B07WPRJY9K/>`_.
es_mx: Aunque se trata de una técnica poco común, un portacredenciales autorretráctil puede ayudar a gestionar el cableado en una extensión. Son artículos comunes; `aquí hay uno de Amazon <https://www.amazon.com/OFES-Retractable-Holder-Swivel-Alligator/dp/B07WPRJY9K/>`_.
fr_ca: Bien qu'il s'agisse d'une technique peu courante, un porte-badge d'identification auto-rétractable peut aider à gérer le câblage d'une extension. Il s'agit d'articles courants ; en voici un sur Amazon <https://www.amazon.com/OFES-Retractable-Holder-Swivel-Alligator/dp/B07WPRJY9K/>`_.
zh_cn: 虽然这种技术并不常见，但可自动伸缩支架可以帮助管理外部连接件上的接线。这些都是常见的物品； ` 这里有一个来自亚马逊的购买链接。 <https://www.amazon.com/OFES-Retractable-Holder-Swivel-Alligator/dp/B07WPRJY9K/>`_。

source: This really only works for vertical or near-vertical slides, as there is still some sag in the cable which can easily get entangled if it extends outside of the robot frame.
es_mx: En realidad, esto sólo funciona para rieles verticales o casi verticales, ya que el cable sigue teniendo una cierta inflexion que puede enredarse fácilmente si se extiende fuera de la estructura del robot.
fr_ca: Cela ne fonctionne vraiment que pour les glissières verticales ou quasi-verticales, car il y a toujours une certaine flèche dans le câble qui peut facilement s'emmêler s'il sort du cadre du robot.
zh_cn: 这实际上只适用于垂直或接近垂直的滑动，因为缆线仍会有一些下垂，如果延伸到机器人框架之外，就很容易缠绕在一起。

source: To rig a self-retracting badge holder to a wire, mount the hard plastic part of the badge holder to the base of the slides, and mount end of the holder's string to the wire. The wires should be hard-mounted (using zip ties or whatever your team uses) towards the top of the retracted slide with plenty of slack. For best results, the badge holder should be almost completely retracted (leave a centimeter or two to allow for some slack) when the slide is retracted.
es_mx: Para fijar un portacredenciales autorretráctil a un cable, monte la parte de plástico duro del portacredenciales a la base de las rieles y monte el extremo de la cuerda del portacredenciales al cable. Los cables deben fijarse (con cinchos o lo que utilice su equipo) hacia la parte superior de la guía retráctil con suficiente holgura. Para obtener los mejores resultados, el portacredenciales debe estar casi completamente retraído (deje uno o dos centímetros para permitir cierta holgura) cuando la corredera esté retraída.
fr_ca: Pour fixer un porte-badge autorétractable à un fil, fixez la partie en plastique dur du porte-badge à la base de la glissière et fixez l'extrémité de la ficelle du porte-badge au fil. Les fils doivent être fixés (à l'aide d'attaches zip ou de tout autre moyen utilisé par votre équipe) vers le haut de la glissière rétractée, avec beaucoup de mou. Pour de meilleurs résultats, le porte-badge doit être presque complètement rétracté (laissez un centimètre ou deux de mou) lorsque la glissière est rétractée.
zh_cn: 要将自动伸缩式证章套安装到电线缆上，可将证章套的硬塑料部分安装到滑梯底座上，然后将证章套的线缆末端安装到电线缆上。电线缆应硬性安装（使用拉链或团队使用的其他工具）到缩回滑轨的顶部，并留有足够的松弛空间。为了达到最佳效果，当滑梯缩回时，证章套应几乎完全缩回（留出一两厘米的松弛空间）。

source: Extremely simple and easy to implement
es_mx: Extremadamente sencillo y fácil de aplicar
fr_ca: Extrêmement simple et facile à mettre en œuvre
zh_cn: 极其简单，易于实施

source: Similar to a coil, self-retracting cable management strings can get tangled more easily, as it is less stiff than drag chain
es_mx: Al igual que una bobina, la cadena autorretráctil puede enredarse más fácilmente, ya que es menos rígida que la cadena de arrastre.
fr_ca: Semblables à une bobine, les cordes de gestion des câbles auto-rétractables peuvent s'emmêler plus facilement, car elles sont moins rigides que les chaînes de traînage.
zh_cn: 与线圈类似，自动伸缩式线缆管理绳更容易缠绕在一起，因为它没有拖链那么硬

source: Does not work well on long slides (over 2 stages) without substantial engineering work
es_mx: No funciona bien en rieles largos (más de 2 etapas) sin un trabajo sustancial de ingeniería.
fr_ca: Ne fonctionne pas bien sur les longues glissières (plus de 2 étages) sans travaux d'ingénierie importants.
zh_cn: 在没有大量工程设计的情况下，对长滑道（超过2级）效果不佳

source: 248's robot's badge retractor cable management
es_mx: Gestión de cables del retractor de portacredenciales del robot 248
fr_ca: Gestion du câble de l'enrouleur du badge du robot 248
zh_cn: 248 号队伍的机器人徽章伸缩器电缆管理

source: 248 Fatal Error, Freight Frenzy: Badge retractor cable management on extension mechanism
es_mx: 248 Fatal Error, Freight Frenzy: Gestión del cable del retractor del portacredenciales en el mecanismo de extensión
fr_ca: 248 Fatal Error, Freight Frenzy : Gestion du câble du rétracteur de badge sur le mécanisme d'extension
zh_cn: 248 Fatal Error, Freight Frenzy: Badge retractor cable management on extension mechanism 扩展装置上的徽章伸缩器电缆管理

source: Rigging
fr_ca: Gréement
ro_ro: Ancorare
zh_cn: 传动结构
