Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/arms/index.po
Languages: ro_ro

source: Arms
ro_ro: Brațe Mecanice

source: Arms are another way to achieve extension past the 18” x 18” dimension of the robot. Unlike linear extensions, arms require lots of torque - a standard 40:1 or even 60:1 gearbox will not be suitable in most applications. For example, many teams will run a 256:1 gearbox for their rotation motor.
ro_ro: Brațele mecanice sunt o altă metodă de a obține o extindere dincolo de dimensiunea maximă de 45 x 45 cm a robotului. Spre deosebire de extensiile lineare, brațele mecanice au nevoie de mult cuplu: un raport standard de 40:1 sau chiar 60:1 nu vor satisface această nevoie. De exemplu, multe echipe vor folosi un angrenaj de 256:1 pentru motorul de rotire.

source: Such motors must be very well supported, or else the motor may torque itself free from its mount.
ro_ro: Aceste motoare trebuie să fie montate bine, altfel se vor dezmembra singure din cauza cuplului.

source: Rarely should an arm be directly mounted to the driving motor. Instead, torque should be transferred via gear, chain, or belt. Large arms can also be hard to control (with the addition of momentum adding load to the gearbox, it is hard to stop a three-foot arm that weighs five pounds quickly without breaking a gearbox). In many cases, this issue can be mitigated with software (see the :doc:`/docs/software/concepts/control-loops` section).
ro_ro: Un braț mecanic ar trebui foarte rar să fie montat diirect pe motorul responsabil de mișcare. În schimb, cuplul ar trebui transferat prin angrenaje, curele de distribuție sau lanț. Brațele mari pot de asemenea să fie greu de controlat (cu atat mai mult din cauza inerției care pune presiune pe angrenaj, drept pentru care e greu să încetinești un braț mecanic de 2 kilograme fără să distrugi un angrenaj). În multe cazuri, problema poate fi rezolvată prin software (citește secțiunea :doc:`/docs/software/concepts/control-loops`).

source: Depending on the application and implementation, arms can be either faster or slower than extension options.
ro_ro: În funcție de aplicare și implementare, brațele mecanice pot fi mai rapide sau mai lente decât alte variante de extindere.

source: The different types of arms in FTC include single arm, chain bar and multi-axis arms.
ro_ro: Diversele tipuri de brațe mecanice FTC includ brațul unic, bară pe lanț și brațe mecanice multi-axiale.

source: Advantages
ro_ro: Avantaje

source: Single bar arms can be relatively simple to build.
ro_ro: Brațele mecanice pe o singură bară sunt relativ simplu de construit.

source: Arms can be useful in low-load applications; however, most mechanisms in FTC are not very light.
ro_ro: Brațele mecanice pot fi folositoare în aplicații de sarcină ușoară, însă, majoritatea mecanismelor FTC nu sunt prea ușoare.

source: Disadvantages
ro_ro: Dezavantaje

source: Arms require an insane amount of torque, and in order to do so, teams must purchase high-torque gearboxes, such as `UltraPlanetary gearbox from REV <https://www.revrobotics.com/rev-41-1600/>`_, or the more expensive VersaPlanetary (potentially Lite) and NeveRest Sport. One can also use the high gear ratio `goBILDA planetary gearbox motors <https://www.gobilda.com/yellow-jacket-planetary-gear-motors>`_.
ro_ro: Brațele presupun o cantitate imensă de cuplu, iar ca să obții acest lucru, echipele trebuie să achiziționeze angrenaje de cuplu inalt, precum `Angrenajul UltraPlanetary de la REV <https://www.revrobotics.com/rev-41-1600/>`_, sau varianta mult mai scumpă VersaPlanetary (potential Lite) și NeveRest Sport. Se poate folosi și de raportul mare al `motorului cu angrenaje planetare goBILDA <https://www.gobilda.com/yellow-jacket-planetary-gear-motors>`_.

source: While single arms may be more simple, they cannot provide enough extension for most games.
ro_ro: Deși brațele mecanice unice pot fi mai simple, nu pot realiza suficientă extensie pentru majoritatea jocurilor.

source: Types of Arms
ro_ro: Tipuri de Brațe Mecanice
