Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/turrets/full-turret.po
Languages: es_mx, fr_ca, zh_cn

source: Full Turrets
es_mx: Torretas completas
fr_ca: Tourelles complètes
zh_cn: 全方位发射结构

source: Listed below are different techniques to implement a full turret. These mechanisms are commonly located at the base of a robot and rotate slide, arm, or shooter assemblies mounted to them.
es_mx: A continuación se enumeran diferentes técnicas para implementar una torreta completa. Estos mecanismos se encuentran comúnmente en la base de un robot y giran, montan ensamblajes de brazo, rieles o disparador sobre ellos.
fr_ca: Vous trouverez ci-dessous différentes techniques pour mettre en œuvre une tourelle complète. Ces mécanismes sont généralement situés à la base d'un robot et font tourner des ensembles de glissières, de bras ou de tireurs montés sur eux.

source: Lazy Susan Turrets
es_mx: Torreta Lazy Susan
fr_ca: Tourelles de type Lazy Susan
zh_cn: 转盘发射结构

source: Lazy susan turrets are based around a type of turntable called a lazy susan, which are available off the shelf.
es_mx: Las torretas de Lazy Susan se basan en un tipo de plato giratorio llamado lazy susan, que están disponibles en el mercado.
fr_ca: Les tourelles "lazy susan" sont basées sur un type de plateau tournant appelé "lazy susan", qui est disponible dans le commerce.
zh_cn: 转盘发射结构以一种称为转盘的转台为基础，这种转台是买的到的的。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Lazy susans come prebuilt, meaning you don't need to design or manufacture your own platform for your turret.
es_mx: Las Lazy susans vienen preconstruidas, lo que significa que no necesitas diseñar ni fabricar tu propia plataforma para tu torreta.
fr_ca: Les lazy susans sont préfabriqués, ce qui signifie que vous n'avez pas besoin de concevoir ou de fabriquer votre propre plate-forme pour votre tourelle.
zh_cn: 转盘是为您制作好的，这意味着您无需为发射件设计或制造自己的平台。

source: Decent lazy susans are relatively cheap.
es_mx: Las lazy susans decentes son relativamente baratas.
fr_ca: Les lazy suzans de paresse de bonne qualité sont relativement bon marché.
zh_cn: 一个好的转盘事实上相当便宜。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Lazy susans are prebuilt, meaning they're generally harder to customize than other options.
es_mx: Las Lazy susans están preconstruidas, lo que significa que generalmente son más difíciles de personalizar que otras opciones.
fr_ca: Les lazy suzans sont préfabriqués, ce qui signifie qu'il est généralement plus difficile de les personnaliser que d'autres options.
zh_cn: 转盘是标准件，这意味着它们通常比其他选择更难定制。

source: Lazy susans aren't designed to handle lateral forces, which means that e.g. the reaction force from a shooter could damage it.
es_mx: Las Lazy susans no están diseñadas para manejar fuerzas laterales, lo que significa que, por ejemplo, la fuerza de reacción de un tirador podría dañarla.
fr_ca: Les lazy susans ne sont pas conçus pour supporter des forces latérales, ce qui signifie que la force de réaction d'un tireur, par exemple, pourrait les endommager.
zh_cn: 转盘的设计不能承受侧向力，这意味着，例如，射击件的反作用力可能会损坏转盘。

source: 19818 Jade Innovations' Lazy Susan Turret
es_mx: 19818 Lazy Susan Torreta de Jade Innovations
zh_cn: 19818 Jade Innovations' 转盘转塔

source: 19818 Jade Innovations, Power Play, **lazy susan turret rotating slides**
es_mx: 19818 Jade Innovations, Power Play, **torreta de lazy susan rotando rieles**
zh_cn: 19818 Jade Innovations, Power Play, **转盘发射结构 **

source: Bearing Stack Turret
es_mx: Torreta de Pila de Rodamientos
fr_ca: Tourelle à pile de roulements
zh_cn: 轴承组转盘

source: Bearing stacks are stacks of bearings, usually consisting of a small bearing sandwiched between two large bearings on a screw shaft or standoff. A bearing stack turret has a disc that rotates smoothly because it is tangent to the small bearing on many bearing stacks, while the bigger bearings constrain the disc vertically. Usually, the small bearing is a radial bearing, while the big bearings may be thrust or radial bearings, depending on which loads the turret experiences.
es_mx: Las pilas de rodamientos son pilas de rodamientos, generalmente compuestas por un rodamiento pequeño intercalado entre dos rodamientos grandes en un eje de tornillo o soporte. Una torreta de pila de rodamientos tiene un disco que gira suavemente porque es tangente al rodamiento pequeño en muchas pilas de rodamientos, mientras que los rodamientos más grandes limitan el disco verticalmente. Por lo general, el rodamiento pequeño es un rodamiento radial, mientras que los rodamientos grandes pueden ser rodamientos axiales o radiales, dependiendo de las cargas que experimente la torreta.
fr_ca: Les empilages de roulements à billes sont des piles de roulements, généralement constitués d'un petit roulement pris en sandwich entre deux grands roulements sur un arbre fileté ou une butée. Une tourelle à empilement de roulements possède un disque qui tourne en douceur parce qu'il est tangent au petit roulement sur de nombreux empilements de roulements, tandis que les roulements plus grands contraignent le disque verticalement. En général, le petit roulement est un roulement radial, tandis que les grands roulements peuvent être des roulements de butée ou des roulements radiaux, en fonction des charges subies par la tourelle.
zh_cn: 轴承组是轴承的组合，通常由夹在螺旋轴或支座上两个大轴承之间的一个小轴承组成。轴承堆转塔有一个圆盘，由于与许多轴承堆上的小轴承相切，圆盘可以平稳旋转，而大轴承则垂直限制圆盘。通常，小轴承是径向轴承，而大轴承可能是推力轴承或径向轴承，具体取决于转盘承受的载荷。

source: A sample bearing stack
es_mx: Una pila de rodamientos de muestra
fr_ca: Un exemple de pile de roulements à billes
zh_cn: 轴承组样本

source: A sample bearing stack, with a radial bearing sandwiched between 2 thrust bearings on a shoulder screw. A plate (not pictured) rides on the radial bearing while being supported by the thrust bearings.
es_mx: Una pila de rodamientos de muestra, con un rodamiento radial intercalado entre 2 rodamientos axiales en un tornillo de hombro. Una placa (no mostrada) se desliza sobre el rodamiento radial mientras es soportada por los rodamientos axiales.
fr_ca: Un exemple d'empilement de roulements à billes, avec un roulement radial pris en sandwich entre 2 roulements de butée sur une vis à épaulement. Une plaque (non illustrée) repose sur le roulement radial tout en étant soutenue par les paliers de butée.
zh_cn: 轴承组样本，一个向心轴承夹在肩螺杆上的两个推力轴承之间。一块板（图中未标出）位于径向轴承上，由推力轴承支撑。

source: Highly customizable, as the assembly can be designed specifically for your robot and mechanisms.
es_mx: Altamente personalizable, ya que el ensamblaje puede ser diseñado específicamente para tu robot y mecanismos.
fr_ca: Hautement personnalisable, car l'assemblage peut être conçu spécifiquement pour votre robot et ses mécanismes.
zh_cn: 可高度定制，因为该组件可专门针对机器人和机械装置进行设计。

source: Requires a lot of design work and precision manufacturing capabilities to build.
es_mx: Requiere mucho trabajo de diseño y capacidades de fabricación de precisión para construir.
fr_ca: Sa construction nécessite un important travail de conception et des capacités de fabrication de précision.
zh_cn: 这需要大量的设计工作和精密制造能力。

source: Many potential points of failure, though some bearing stacks can fail without the entire turret failing with redundancy.
es_mx: Muchos puntos potenciales de falla, aunque algunas pilas de rodamientos pueden fallar sin que toda la torreta falle con redundancia.
fr_ca: Nombreux points de défaillance potentiels, bien que certaines piles de roulements puissent tomber en panne sans que l'ensemble de la tourelle ne tombe en panne grâce à la redondance.
zh_cn: 潜在的故障点很多，但一些轴承组可以在不影响整个发射结构的情况下发生故障。

source: 18219 Primitive Data's Bearing Stack Turret
es_mx: 18219 Primitive Data's Torreta de Pila de Rodamientos
fr_ca: 18219 Tourelle d'empilage de roulements de données primitives
zh_cn: 18219 原始数据队的轴承组转盘

source: 18219 Primitive Data, Ultimate Goal, **bearing stack turret**
es_mx: 18219 Primitive Data, Ultimate Goal, **Torreta de pila de rodamiento**
fr_ca: 18219 Données primitives, but ultime, **tourelle à palier**
zh_cn: 18219 原始数据，终极目标，**轴承组发射部**

source: Center-Bearing Turrets
es_mx: Torretas de rodamiento central
fr_ca: Tourelles à portée centrale
zh_cn: 中心轴承发射部

source: Center-bearing turrets are based on a bearing (or bearings) coaxial with the turret's axis of rotation.
es_mx: Los torretas con rodamientos centrales se basan en un rodamiento (o rodamientos) coaxial con el eje de rotación de la torreta.
fr_ca: Les tourelles à palier central reposent sur un (ou plusieurs) palier(s) coaxial(aux) avec l'axe de rotation de la tourelle.
zh_cn: 中心轴承发射部基于一个（或多个）与转盘旋转轴同轴的轴承。

source: These turrets are generally simpler than others, as they rotate similarly to any other mechanism on an axle.
es_mx: Estas torretas son generalmente más simples que otras, ya que rotan de manera similar a cualquier otro mecanismo en un eje.
fr_ca: Ces tourelles sont généralement plus simples que les autres, car elles tournent comme n'importe quel autre mécanisme sur un axe.
zh_cn: 这些发射部通常比其他发射部简单，因为它们的旋转方式与轴上的任何其他机构类似。

source: Do not require complex or custom-manufactured components.
es_mx: No requiera componentes complejos o fabricados a medida.
fr_ca: Ne nécessitent pas de composants complexes ou fabriqués sur mesure.
zh_cn: 不需要复杂或定制的组件。

source: If a radial bearing is used, thrust loads can cause significant problems. Thrust or x-contact bearings may be better suited for this task, especially in high load situations.
es_mx: Si se utiliza un rodamiento radial, las cargas axiales pueden causar problemas significativos. Los rodamientos axiales o de contacto en x pueden ser más adecuados para esta tarea, especialmente en situaciones de carga alta.
fr_ca: Si un roulement radial est utilisé, les charges de poussée peuvent causer des problèmes importants. Les roulements de butée ou à contact X peuvent être mieux adaptés à cette tâche, en particulier dans les situations de charge élevée.
zh_cn: 如果使用径向轴承，推力载荷可能会导致严重问题。推力轴承或 x 接触轴承可能更适合这项任务，尤其是在高负载情况下。

source: Due to a bearing being in the center, unless you buy large diameter bearings (which can be very expensive), it may be hard to pass game elements (or other things) through the center. This is often relevant for shooters, where it may be desirable to load them in any orientation.
es_mx: Debido a que un rodamiento se encuentra en el centro, a menos que compres rodamientos de gran diámetro (que pueden ser muy costosos), puede ser difícil pasar elementos del juego (u otras cosas) a través del centro. Esto suele ser relevante para los tiradores, donde puede ser deseable cargarlos en cualquier orientación.
fr_ca: En raison de la présence d'un roulement au centre, à moins d'acheter des roulements de grand diamètre (qui peuvent être très coûteux), il peut être difficile de faire passer des éléments de jeu (ou d'autres choses) par le centre. Cela s'applique souvent aux tireurs, pour lesquels il peut être souhaitable de les charger dans n'importe quelle orientation.
zh_cn: 由于轴承位于中心，除非购买大直径轴承（可能非常昂贵），否则可能很难将比赛道具（或其他东西）穿过中心。这通常与操作手有关，因为操作手可能希望以任何方向装载。

source: 16379 KookyBotz's Turret
es_mx: 16379 KookyBotz's Torreta
fr_ca: La tourelle de KookyBotz 16379
zh_cn: 16379 KookyBotz 的发射部

source: 16379 KookyBotz, Freight Frenzy, **center-bearing turret using an x-contact bearing**
es_mx: 16379 KookyBotz, Freight Frenzy, **torreta con rodamiento central usando un rodamiento de contacto en x**
fr_ca: 16379 KookyBotz, Freight Frenzy, **tourelle à palier central utilisant un palier à contact x**.
zh_cn: 16379 KookyBotz, Freight Frenzy, **使用 x 接触轴承的中心轴承转盘**
