Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/turrets/mini-turret.po
Languages: es_mx, fr_ca, zh_cn

source: Mini Turrets
es_mx: Mini Torretas
fr_ca: Mini-tourelles
zh_cn: 小关节

source: Mini turrets are turrets that pivot something small, typically an end effector. These are often at the end of a linear extension or arm. These are much simpler than full turrets, because they are physically smaller and deal with much smaller loads. There are many ways to implement a mini turret, and generally any of the methods mentioned on the :doc:`./full-turret` page will work, but the center-bearing technique is the most common, as it is the simplest.
es_mx: Mini torretas son torretas que pivotan algo pequeño, típicamente un efector final. Estas suelen estar al final de una extensión lineal o brazo. Son mucho más simples que las torretas completas, ya que son físicamente más pequeñas y manejan cargas mucho más pequeñas. Hay muchas formas de implementar una mini torreta, y en general cualquiera de los métodos mencionados en la página :doc:`./torretas-completas` funcionará, pero la técnica del rodamiento central es la más común, ya que es la más simple.
fr_ca: Les mini-tourelles sont des tourelles qui font pivoter un petit objet, généralement un effecteur terminal. Elles se trouvent souvent à l'extrémité d'une extension ou d'un bras linéaire. Elles sont beaucoup plus simples que les tourelles complètes, car elles sont physiquement plus petites et traitent des charges beaucoup plus faibles. Il existe de nombreuses façons d'implémenter une mini-tourelle, et généralement toutes les méthodes mentionnées sur la page :doc:`./full-turret` fonctionneront, mais la technique du palier central est la plus courante, car c'est la plus simple.
zh_cn: 小关节是一种可以驱动小型物体（通常是功能机构）的关节。它们通常位于伸缩结构或机械臂的末端。这些小关节比大云台简单得多，因为它们的物理尺寸更小，处理的负载也小得多。实现小关节的方法有很多，一般来说，:doc:`./full-turret` 页面上提到的任何方法都可以使用，但中心轴承技术是最常见的，因为它是最简单的。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Allows for accurate mechanism rotation, without drivetrain movement.
es_mx: Permite una rotación precisa del mecanismo, sin movimiento del chasis.
fr_ca: Permet une rotation précise du mécanisme, sans mouvement de la transmission.
zh_cn: 可在不移动传动系统的情况下实现精确的机构旋转。

source: Much simpler than a full turret.
es_mx: Mucho más simple que una torreta completa.
fr_ca: Beaucoup plus simple qu'une tourelle complète.
zh_cn: 比大云台简单得多。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 劣势

source: Heavier than just an end effector, which is especially important on the end of slides/arms because of mechanism speed and center of gravity.
es_mx: Más pesado que solo un efector final, lo cual es especialmente importante en el extremo de los deslizadores/brazos debido a la velocidad del mecanismo y al centro de gravedad.
fr_ca: Plus lourd qu'un simple effecteur, ce qui est particulièrement important à l'extrémité des glissières/bras en raison de la vitesse du mécanisme et du centre de gravité.
zh_cn: 比单纯的功能结构更重，这对滑轨/机械臂的末端尤为重要，因为机械装置的速度和重心决定了这一点。

source: More complex than no turret.
es_mx: Más complejo que sin torreta.
fr_ca: Plus complexe que l'absence de tourelle.
zh_cn: 比没有关节更复杂。

source: Provide fairly limited range compared to full turrets.
es_mx: Proporcionar un rango bastante limitado en comparación con las torretas completas.
fr_ca: Leur portée est relativement limitée par rapport à celle des tourelles complètes.
zh_cn: 与大云台相比，能够驱动的结构长度相当有限。

source: 12518 Almond Robotics' Mini Turret
es_mx: 12518 Almond Robotics' Mini Torreta
fr_ca: 12518 Almond Robotics' La mini-tourelle
zh_cn: 12518 Almond Robotics 的迷你转塔

source: 12518 Almond Robotics, Freight Frenzy, a **center-bearing mini turret** on the end of slides used to rotate a scoring mechanism with a servo
es_mx: 12518 Almond Robotics, Freight Frenzy, un **mini torreta con rodamiento central** en el extremo de los deslizadores utilizados para girar un mecanismo de puntuación con un servo
fr_ca: 12518 Almond Robotics, Freight Frenzy, une **tourelle à palier central** sur l'extrémité des glissières utilisée pour faire tourner un mécanisme d'incision à l'aide d'un servo
zh_cn: 12518 Almond Robotics，Freight Frenzy，滑轨末端的 **中心轴承小关节** ，用于利用舵机旋转得分结构
