Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/adv-control-system/control-system-internals.po
Languages: es_mx, fr_ca, zh_cn

source: Control System Electronics
es_mx: Electrónica del sistema de control
fr_ca: Électronique des systèmes de contrôle
zh_cn: 控制系统电子设备

source: This page contains a breakdown of the known electronics in the control system, as well as any notes regarding them.
es_mx: Esta página contiene un desglose de los componentes electrónicos conocidos del sistema de control, así como cualquier nota relativa a los mismos
fr_ca: Cette page contient une liste des composants électroniques connus du système de contrôle, ainsi que toute note les concernant.
zh_cn: 本页包含控制系统中已知电子设备的故障，以及有关它们的任何注释。

source: Expansion Hub Internals
es_mx: Componentes internos del Expansion Hub
fr_ca: Éléments Internes du Expansion Hub
zh_cn: Expansion Hub 内部

source: Don't take apart a Control or Expansion Hub unless you really know what you are doing. They can be damaged in the process, especially if one does not know how to properly reassemble it.
es_mx: No desmonte un Centro de Control o Expansión a menos que realmente sepa lo que está haciendo. Pueden resultar dañados en el proceso, especialmente si no se sabe cómo volver a montarlos correctamente.
fr_ca: Ne démontez pas un Control Hub ou un Expansion Hub si vous ne savez pas vraiment ce que vous faites. Ils peuvent être endommagés au cours du processus, surtout si l'on ne sait pas comment les remonter correctement.
zh_cn: 除非你真的知道你在做什么，否则不要拆开 Control Hub 或 Expansion Hub 。它们可能会在这个过程中损坏，尤其是如果你不知道如何正确地重新组装它。

source: Lynx Board
es_mx: Tablero Lynx
fr_ca: Carte Lynx
zh_cn: Lynx 板

source: "Lynx" is the codename of the board within the Expansion Hub and Control Hub that interacts with hardware. References to "Lynx" are made in the FTC\ |reg| SDK refer to this board. It appears to have been developed by both REV and `DEKA <https://dekaresearch.com/>`_ (Dean Kamen's company), possibly for use in *FIRST*\ |reg| Global (judging by the *FIRST* Global silkscreen on the PCB).
es_mx: "Lynx" es el nombre en clave de la placa dentro del Expansión y Control Hub que interactúa con el hardware. Las referencias a "Lynx" que se hacen en el SDK de FTC |reg| se refieren a esta placa. Parece haber sido desarrollada tanto por REV como por `DEKA <https://dekaresearch.com/>`_ (la empresa de Dean Kamen), posiblemente para su uso en *FIRST* |reg| Global (a juzgar por la serigrafía de *FIRST* Global en la PCB).
fr_ca: "Lynx" est le nom de code de la carte à l'intérieur du Expansion Hub et du Control Hub qui interagit avec le matériel. Les références à "Lynx" dans le SDK de FTC font référence à cette carte. Elle semble avoir été développée à la fois par REV et `DEKA <https://dekaresearch.com/>`_ (la société de Dean Kamen), peut-être pour être utilisée dans *FIRST*\ |reg| Global (à en juger par la sérigraphie *FIRST* Global sur le PCB).

source: A Lynx board that was removed from its case
es_mx: Una placa Lynx sacada de su caja
fr_ca: Une carte Lynx qui a été enlevé de son boîtier
zh_cn: 一块取出的 Lynx 电路板

source: Processor
es_mx: Procesador
fr_ca: Processeur
zh_cn: 处理器

source: The main processor of the Expansion Hub is a Texas Instruments ARM Cortex M4 running at 80 MHZ.
es_mx: El procesador principal del Expansion Hub es un ARM Cortex M4 de Texas Instruments que funciona a 80 MHZ.
fr_ca: Le processeur principal du Expansion Hub est un Texas Instruments ARM Cortex M4 fonctionnant à 80 MHZ.
zh_cn: Expansion Hub 的主处理器是 Texas Instruments ARM Cortex M4，运行频率为 80 MHZ。

source: Ports
es_mx: Puertos
zh_cn: 端口

source: The expansion hub has the following ports
es_mx: El expansion hub dispone de los siguientes puertos
fr_ca: L'Expansion Hub possède les ports suivants
zh_cn: Expansion hub 有以下端口：

source: Two UART Debug Ports
es_mx: Dos puertos de depuración UART
fr_ca: Deux UART Debug Ports
zh_cn: 两个通用异步收发设备调试端口

source: The top port outputs a continuous high speed CSV stream of data from the various subsystems in the hub.
es_mx: El puerto superior emite un flujo continuo de datos CSV de alta velocidad procedentes de los distintos subsistemas del hub.
fr_ca: Le port supérieur émet un flux CSV continu et à grande vitesse de données provenant des différents sous-systèmes du concentrateur.
zh_cn: 顶部端口从集线器中的各个子系统输出连续的高速 CSV 数据流。

source: The bottom port outputs data at a baud rate of 115200 at a user specified verbosity.
es_mx: El puerto inferior emite datos a una velocidad en baudios de 115200 con una verbosidad especificada por el usuario.
fr_ca: Le port inférieur émet des données à une vitesse de transmission de 115200 bauds à un niveau de verbosité spécifié par l'utilisateur.
zh_cn: 底部端口以用户指定的详细程度以 115200 的波特率输出数据。

source: Four I2C Ports
es_mx: Cuatro puertos I2C
fr_ca: Quatre Ports I2C
zh_cn: 四个 I2C 端口

source: These ports are 100/400 kHz compliant and are connected to a separate bus so there is no need to be concerned about address collisions
es_mx: Estos puertos son compatibles con 100/400 kHz y están conectados a un bus independiente, por lo que no hay que preocuparse por las colisiones de direcciones.
fr_ca: Ces ports sont conformes à 100/400 kHz et sont connectés à un bus séparé, il n'y a donc pas lieu de se préoccuper des collisions d'adresses.
zh_cn: 这些端口符合 100/400 kHz 标准，并连接到单独的总线，因此无需担心地址冲突

source: There are integrated pull up resistors on this port
es_mx: Hay resistencias de pull up integradas en este puerto.
fr_ca: Ce port est équipé de résistances pull up intégrées.
zh_cn: 此端口上有集成上拉电阻

source: Eight DIO Ports
es_mx: Ocho puertos DIO
fr_ca: Huit Ports DIO
zh_cn: 八个 DIO 端口

source: 3.3V only, current limited, can briefly supply more than the rated current spec. Pulled up internally.
es_mx: Sólo 3,3 V, corriente limitada, puede suministrar brevemente más corriente que la especificada. Tirado hacia arriba internamente.
fr_ca: 3,3V seulement, courant limité, peut brièvement fournir plus que le courant nominal spécifié. Tiré vers le haut en interne.
zh_cn: 仅 3.3V，电流有限，可短暂提供超过额定电流规格的电流。内部拉起。

source: Four Analog Ports
es_mx: Cuatro puertos analógicos
fr_ca: Quatre Ports Analogiques
zh_cn: 四个模拟端口

source: 5V compliant, you can use a level shifter to supply 5v to the sensor, but take care the analog line bypasses the level shifter. The VIN and GND lines must pass through the level shifter for it to work however.
es_mx: 5V, puedes utilizar un variador de nivel para suministrar 5v al sensor, pero ten cuidado de que la línea analógica no pase por el variador de nivel. Sin embargo, las líneas VIN y GND deben pasar por el conmutador de nivel para que funcione.
fr_ca: Compatible 5V, vous pouvez utiliser un convertisseur de niveau pour alimenter le capteur en 5V, mais attention, la ligne analogique contourne le convertisseur de niveau. Les lignes VIN et GND doivent cependant passer par le convertisseur de niveau pour que cela fonctionne.
zh_cn: 5V 兼容，你可以使用电平转换器向传感器供电 5v ，但要注意模拟线绕过电平转换器。然而，VIN 和 GND 线必须通过电平转换器才能工作。

source: Six Servo Ports
es_mx: Seis servopuertos
fr_ca: Six Ports Servo
zh_cn: 六个舵机端口

source: The 5V supply on the servo ports is default OFF, and will only enable once a servo is used. All six 5V pins are switched on and off together, and disabling PWM on one port will switch all of the ports off unless another servo is used.
es_mx: El suministro de 5V en los puertos de servo está apagado por defecto, y sólo se activará una vez que se utilice un servo. Los seis pines de 5V se activan y desactivan juntos, y desactivar PWM en un puerto desactivará todos los puertos a menos que se utilice otro servo.
fr_ca: L'alimentation 5V sur les ports de servo est désactivée par défaut et ne s'active que lorsqu'un servo est utilisé. Les six broches 5V sont allumées et éteintes ensemble, et la désactivation du PWM sur un port éteindra tous les ports, sauf si un autre servo est utilisé.
zh_cn: 舵机端口上的 5V 电源默认关闭，仅在使用舵机时启用。所有六个 5V 引脚一起打开和关闭，禁用一个端口上的 PWM 将关闭所有端口，直到再次使用其他舵机。

source: Two 5V Power Ports
es_mx: Dos puertos de alimentación de 5 V
fr_ca: Deux Ports d'Alimentation 5V
zh_cn: 两个 5V 电源端口

source: The 5V supply is shared with the servos
es_mx: La alimentación de 5V se comparte con los servos
fr_ca: L'alimentation 5V est partagée avec les servos.
zh_cn: 5V 电源与舵机共享

source: Four Motor Ports
es_mx: Cuatro puertos de motor
fr_ca: Quatre Ports Moteur
zh_cn: 四个电机端口

source: Current limited and have overtemperature protection on the chip. The output does not brake the h-bridge during the PWM off cycle. What this means is that there might be linearity issues while deaccelerating, because of momentum in the motor.
es_mx: Corriente limitada y protección contra sobretemperatura en el chip. La salida no frena el puente h durante el ciclo de apagado del PWM. Lo que esto significa es que podría haber problemas de linealidad durante la desaceleración, debido al impulso en el motor.
fr_ca: Le courant est limité et la puce est dotée d'une protection contre la surchauffe. La sortie ne freine pas le pont en H pendant le cycle d'arrêt du PWM. Cela signifie qu'il peut y avoir des problèmes de linéarité lors de la décélération, à cause de l'élan du moteur.
zh_cn: 电流受限，芯片上有过温保护。在PWM关闭周期期间，输出不会制动h桥。这意味着由于电机中的动量，在减速时可能会出现线性问题。

source: The motor driver is a ST Microelectronics VNH5050 motor driver IC, which is capabile of handling well over the maximum amount of current an FTC motor can draw. It has integrated current sensing and has been used since the Modern Robotics era. It has built in thermal and current safety limits. This motor controller has been used for years, and may even date back to the early HiTechnic based control system.
es_mx: El controlador del motor es un ST Microelectronics VNH5050 motor driver IC, que es capaz de manejar mucho más que la cantidad máxima de corriente de un motor FTC puede aguantar. Tiene un sensor de corriente integrado y se ha utilizado desde la era de la robótica moderna. Incorpora límites de seguridad térmicos y de corriente. Este controlador de motor se ha utilizado durante años, y puede incluso remontarse a los primeros sistemas de control basados en HiTechnic.
fr_ca: Le pilote du moteur est un circuit intégré ST Microelectronics VNH5050, qui est capable de gérer bien plus que la quantité maximale de courant qu'un moteur FTC peut tirer. Il dispose d'une détection de courant intégrée et est utilisé depuis l'ère de la robotique moderne. Il possède des limites de sécurité thermique et de courant intégrées. Ce contrôleur de moteur est utilisé depuis des années et peut même remonter aux premiers systèmes de contrôle basés sur HiTechnic.
zh_cn: 电机驱动器采用 ST Microelectronics VNH5050 电机驱动器集成电路 IC ，能够处理远远超过 FTC 电机所能消耗的最大电流。它集成了电流检测功能，自现代机器人时代以来一直在使用。它具有内置的热和电流安全限制。这种电机控制器已使用多年，甚至可以追溯到早期基于 HiTechnic 的控制系统。

source: Four Encoder Ports
es_mx: Cuatro puertos de codificador
fr_ca: Quatre Ports d'Encodeur
zh_cn: 四个编码器端口

source: **IMPORTANT: Only two of the encoder ports (Ports 0 and 3) appear to be connected via hardware and are reliable at high speeds**. There are two methods of connecting an encoder internally to the Texas Instruments microprocessor, through hardware and software. Hardware ports use the integrated quadrature decoder chip and are extremely accurate at high speeds, whereas encoders decoded in software are not reliable at high speeds. As a result, high Count per Revolution (CPR) encoders (those with more than around 4000 counts per revolution) should NOT be used on ports 1 and 2.
es_mx: **IMPORTANTE: Sólo dos de los puertos de encoder (Puertos 0 y 3) parecen estar conectados vía hardware y son fiables a altas velocidades**. Existen dos métodos para conectar un codificador internamente al microprocesador de Texas Instruments, mediante hardware y software. Los puertos hardware utilizan el chip decodificador de cuadratura integrado y son extremadamente precisos a altas velocidades, mientras que los codificadores decodificados en software no son fiables a altas velocidades. Como resultado, los codificadores de alto conteo por revolución (CPR) (aquellos con más de alrededor de 4000 conteos por revolución) NO deben ser utilizados en los puertos 1 y 2.
fr_ca: **IMPORTANT : seuls deux des ports de codeur (ports 0 et 3) semblent être connectés par le biais du matériel et sont fiables à des vitesses élevées**. Il existe deux méthodes pour connecter un encodeur en interne au microprocesseur Texas Instruments, par le biais du matériel et du logiciel. Les ports matériels utilisent la puce de décodage en quadrature intégrée et sont extrêmement précis à des vitesses élevées, alors que les codeurs décodés par logiciel ne sont pas fiables à des vitesses élevées. Par conséquent, les codeurs à nombre élevé de coups par tour (CPR) (ceux qui ont plus de 4000 coups par tour) ne doivent PAS être utilisés sur les ports 1 et 2.
zh_cn: **重要提示：只有两个编码器端口（端口 0 和 3 ）似乎是通过硬件连接的，并且在高速下是可靠的** 有两种方法可以通过硬件和软件将编码器内部连接到 Texas Instruments 仪器的微处理器。硬件端口使用集成的正交解码器芯片，在高速下非常准确，而在软件中解码的编码器在高速下并不可靠。因此，每转计数超过 4000 次的高计数（CPR）编码器不应用于软件连接的端口 1 和 2 。

source: Two XT30 Connectors
es_mx: Dos conectores XT30
fr_ca: Deux Connecteurs XT30
zh_cn: 两个 XT30 连接器

source: Care should be taken when moving around cables as these connectors have been known to fail and break off the board.
es_mx: Hay que tener cuidado al mover los cables, ya que se sabe que estos conectores fallan y se desprenden de la placa.
fr_ca: Il convient d'être prudent lorsque l'on déplace des câbles, car il est arrivé que ces connecteurs soient défectueux et se détachent de la carte.
zh_cn: 在电缆周围移动时应小心，因为已知这些连接器会出现故障并从电路板上脱落。

source: In addition, XT30s will wear and get loose with time. See `XT30 Pins are Compressed - Expansion Hub Troubleshooting <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_ for details on the issue and how to fix it.
es_mx: Además, los XT30 se desgastan y se aflojan con el tiempo. Consulte `XT30 Pins are Compressed - Expansion Hub Troubleshooting <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_ para obtener más detalles sobre el problema y cómo solucionarlo.
fr_ca: En outre, les XT30 s'usent et se détachent avec le temps. Voir ``Les broches XT30 sont comprimées - Dépannage du Expansion Hub <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_ pour plus de détails sur le problème et la façon de le résoudre.
zh_cn: 此外，XT30 会随着时间的推移而磨损和松动。请参阅 `XT30 引脚被压缩 - 扩展集线器故障排除 <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_，了解有关该问题的详细信息和修复方法。

source: USB Mini-B Connector
es_mx: Conector USB Mini-B
fr_ca: Connecteur USB Mini-B
zh_cn: USB Mini-B 连接器

source: Capable of full speed USB 2.0, and 5V output to charge a phone. The 5v output may be unreliable, it depends on the hub.
es_mx: Capacidad de USB 2.0 a toda velocidad y salida de 5 V para cargar un teléfono. La salida de 5 V puede ser poco fiable, depende del hub.
fr_ca: Capable d'une vitesse complète d'USB 2.0, et d'une sortie de 5V pour charger un téléphone. La sortie 5v peut ne pas être fiable, cela dépend du hub.
zh_cn: 能够全速 USB 2.0 和 5V 输出为手机充电。5v 输出可能不可靠，取决于集线器。

source: Internal Connector
es_mx: Conector interno
fr_ca: Connecteurs Interne
zh_cn: 内部连接器

source: This connector is what is used to connect to the compute daughterboard. It has a UART connection, as well as power and ground. All Expansion Hubs have this connector, whether or not they are a Control Hub.
es_mx: Este conector es el que se utiliza para conectarse a la placa hija de computación. Tiene una conexión UART, así como alimentación y tierra. Todos los Expansion Hubs tienen este conector, sean o no un Control Hub.
fr_ca: Ce connecteur est utilisé pour se connecter à la carte fille de calcul. Il possède une connexion UART, ainsi qu'une alimentation et une mise à la terre. Tous les Expansion Hubs ont ce connecteur, qu'ils soient ou non un Control Hub.

source: The Control Hub is an Expansion Hub with an embedded single-board compute daughterboard connected to it. This enables it to not need a separate Robot Controller phone, as the compute board functions as the Robot Controller. Internally, LynxCommands are sent over from the daughterboard to the Lynx board over an internal UART connection.
es_mx: El Control Hub es un Expansion Hub con una tarjeta hija de computación integrada conectada a él. Esto le permite no necesitar un teléfono Controlador de Robot separado, ya que la placa de cómputo funciona como el Controlador de Robot. Internamente, los comandos Lynx se envían desde la placa hija a la placa Lynx a través de una conexión UART interna.
fr_ca: Le Control Hub est un Expansion Hub auquel est connectée une carte fille de calcul monocarte intégrée. Cela lui permet de ne pas avoir besoin d'un téléphone de contrôleur de robot séparé, car la carte de calcul fonctionne comme le contrôleur de robot. En interne, les commandes Lynx sont envoyées de la carte fille à la carte Lynx via une connexion UART interne.
zh_cn: Control Hub 是一个带有嵌入式 Android 单板计算机子板的 Expansion Hub 。由于内置了 Android 子板，所以它不再需要单独的手机作为 RC 。在其内部，通过内置的 UART 连接从 Android 子板发送 LynxCommand 到 Lynx 板。

source: The compute board's physical layout is based on the 96Boards CE spec, and is visibly extremely similar to the `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_.
es_mx: La disposición física de la placa de cálculo se basa en la especificación CE de 96Boards, y es visiblemente muy similar a la `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_.
fr_ca: La disposition physique de la carte de calcul est basée sur les spécifications 96Boards CE, et est visiblement très similaire à la `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_.
zh_cn: 该计算板的物理布局基于 96Boards CE 规格，与 `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_ 极为相似。

source: The original version of the Control Hub (REV-31-1152) used in FIRST Global actually used a `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_ as the compute board.
es_mx: La versión original del Control Hub (REV-31-1152) utilizado en FIRST Global en realidad utilizaba una `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_ como placa de cálculo.
fr_ca: La version originale du Control Hub (REV-31-1152) utilisée dans FIRST Global utilisait en fait une `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_ comme carte de calcul.
zh_cn: FIRST Global 使用的最初版本的 Control Hub（REV-31-1152）实际上使用了 `Dragonboard 410c <https://www.96boards.org/product/dragonboard410c/>`_ 作为计算板。

source: The Control Hub compute board runs a customized version of Android 7.1. It does not have a proper heatsink on the SOC, only an exremely small and thin heat spreader, which can cause thermal throttling when heavy processes such as vision pipelines are used.
es_mx: La placa de cálculo Control Hub ejecuta una versión personalizada de Android 7.1. No dispone de un disipador térmico adecuado en el SOC, solo un disipador extremadamente pequeño y fino, lo que puede provocar un estrangulamiento térmico cuando se utilizan procesos pesados como los pipelines de visión.
fr_ca: La carte de calcul Control Hub fonctionne avec une version personnalisée d'Android 7.1. Le SOC n'est pas équipé d'un dissipateur thermique digne de ce nom, mais seulement d'un diffuseur de chaleur extrêmement petit et fin, ce qui peut provoquer un étranglement thermique lorsque des processus lourds, tels que les pipelines de vision, sont utilisés.

source: The device tree in the official kernel seems to indicate that the CPU can clock up to 1.5 GHz
es_mx: El árbol de dispositivos del kernel oficial parece indicar que la CPU puede alcanzar hasta 1,5 GHz.
fr_ca: L'arborescence du noyau officiel semble indiquer que le processeur peut atteindre 1,5 GHz.
zh_cn: 官方内核中的设备树似乎表明，CPU 的主频可达 1.5 GHz

source: HDMI 2.0 support for 4k @ 60Hz
es_mx: Compatible con HDMI 2.0 para 4k a 60 Hz
fr_ca: Prise en charge HDMI 2.0 pour 4k @ 60Hz
zh_cn: HDMI 2.0 支持 4k @ 60Hz 频率

source: Storage: 8 to 16GB of eMMC flash memory
es_mx: Almacenamiento: de 8 a 16 GB de memoria flash eMMC
fr_ca: Stockage : 8 à 16 Go de mémoire flash eMMC
zh_cn: 存储：8 至 16GB eMMC 闪存

source: "8GB eMMC 4.51" is the spec officially listed by REV, but multiple real-world units that were checked all had 16GB eMMC chips found on their boards.
es_mx: "8GB eMMC 4.51" es la especificación oficial de REV, pero varias unidades reales que se comprobaron tenían chips eMMC de 16GB en sus placas.
fr_ca: "8GB eMMC 4.51" est la spécification officiellement listée par REV, mais plusieurs unités réelles vérifiées avaient toutes des puces eMMC de 16GB sur leurs cartes.
zh_cn: REV 官方列出的规格是 “8GB eMMC 4.51”，但检查的多台实际设备的电路板上都有 16GB eMMC 芯片。

source: According to REV, in a support email: **"Original builds of the Control Hub were manufactured with 8GB eMMC chips. However, some 16GB versions were made due to supply chain constraints. Recent Control Hubs (purchased after 2022) are more likely to have the 16GB eMMC chip."**
es_mx: Según REV, en un correo electrónico de soporte: **"Las versiones originales del Control Hub se fabricaron con chips eMMC de 8 GB. Sin embargo, algunas versiones de 16 GB se hicieron debido a las limitaciones de la cadena de suministro. Es más probable que los Control Hubs recientes (comprados después de 2022) tengan el chip eMMC de 16 GB "**.
fr_ca: Selon REV, dans un courriel d'assistance : **Les versions originales du Control Hub ont été fabriquées avec des puces eMMC de 8 Go. Cependant, certaines versions de 16 Go ont été fabriquées en raison de contraintes de la chaîne d'approvisionnement. Les Control Hubs récents (achetés après 2022) sont plus susceptibles d'être équipés d'une puce eMMC de 16 Go.
zh_cn: REV 在一封支持电子邮件中称**“最初生产的 Control Hub 使用的是 8GB eMMC 芯片。但是，由于供应链的限制，生产了一些 16GB 版本。最近的 Control Hub（2022 年后购买）更有可能采用 16GB eMMC 芯片。”**

source: USB: 1x USB 3.0, 1x USB 2.0, 1x internal USB 2.0 used to connect the Wi-Fi chip
es_mx: USB: 1x USB 3.0, 1x USB 2.0, 1x USB 2.0 interno utilizado para conectar el chip Wi-Fi
fr_ca: USB : 1x USB 3.0, 1x USB 2.0, 1x USB 2.0 interne utilisé pour connecter la puce Wi-Fi
zh_cn: USB：1 个 USB 3.0、1 个 USB 2.0、1 个内部 USB 2.0，用于连接 Wi-Fi 芯片

source: IEEE 802.11a/b/g/n/ac Wi-Fi (Dual Band 2.4 & 5 GHz)
es_mx: Wi-Fi IEEE 802.11a/b/g/n/ac (doble banda 2,4 y 5 GHz)
fr_ca: Wi-Fi IEEE 802.11a/b/g/n/ac (double bande 2,4 et 5 GHz)
zh_cn: IEEE 802.11a/b/g/n/ac Wi-Fi（双频 2.4 和 5 GHz）

source: 802.11w Protected Management Frames standard supported for preventing `deauthentication attacks <https://en.wikipedia.org/wiki/Wi-Fi_deauthentication_attack>`_
es_mx: 802.11w Protected Management Frames estándar apoyado para prevenir `ataques de autenticación <https://en.wikipedia.org/wiki/Wi-Fi_deauthentication_attack>`_
fr_ca: La norme 802.11w Protected Management Frames est prise en charge pour prévenir les attaques par désauthentification <https://en.wikipedia.org/wiki/Wi-Fi_deauthentication_attack>`_
zh_cn: 支持 802.11w 保护管理帧标准，以防止 `身份验证攻击 <https://en.wikipedia.org/wiki/Wi-Fi_deauthentication_attack>`_

source: Bluetooth 4.2 (Bluetooth 4.1 listed by REV)
es_mx: Bluetooth 4.2 (Bluetooth 4.1 listado por REV)
fr_ca: Bluetooth 4.2 (Bluetooth 4.1 listé par REV)
zh_cn: 蓝牙 4.2（蓝牙 4.1 由 REV 列出）

source: Debugging UART: 3 pin header (TX left, RX middle, Ground right), 1500000 baud
es_mx: UART de depuración: cabezal de 3 pines (TX izquierda, RX centro, tierra derecha), 1500000 baudios
fr_ca: UART de débogage : en-tête à 3 broches (TX à gauche, RX au milieu, Ground à droite), 1500000 bauds
zh_cn: 调试 UART：3 针接头（左侧 TX、中间 RX、右侧接地），1500000baud
