Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/adv-control-system/control-system-internals.po
Languages: es_mx, fr_ca, zh_cn

source: It is possible to install an Armbian Linux build from https://forum.armbian.com/topic/26978-csc-armbian-for-rk3318rk3328-tv-box-boards/ and have it work on the Control Hub. Enable the `rk3318-box-led-conf3` board type using the ``rk3318-config`` command to allow Wi-FI and all USB ports to work. Enable the ``rk3328-uart1`` overlay using ``armbian-config`` to allow communicating with the Lynx board over the internal UART connection using ``/dev/ttyS1``.
es_mx: Es posible instalar una versión de Armbian Linux desde https://forum.armbian.com/topic/26978-csc-armbian-for-rk3318rk3328-tv-box-boards/ y hacer que funcione en el Control Hub. Habilita el tipo de placa ``rk3318-box-led-conf3`` usando el comando ``rk3318-config`` para que funcionen Wi-FI y todos los puertos USB. Habilita el overlay ``rk3328-uart1`` usando ``armbian-config`` para permitir la comunicación con la placa Lynx a través de la conexión UART interna usando ``/dev/ttyS1``.
fr_ca: Il est possible d'installer une version d'Armbian Linux depuis https://forum.armbian.com/topic/26978-csc-armbian-for-rk3318rk3328-tv-box-boards/ et de la faire fonctionner sur le Control Hub. Activez le type de carte `rk3318-box-led-conf3` en utilisant la commande `rk3318-config` pour permettre au Wi-FI et à tous les ports USB de fonctionner. Activez la surcouche ``rk3328-uart1`` en utilisant la commande ``armbian-config`` pour permettre la communication avec la carte Lynx via la connexion UART interne en utilisant ``dev/ttyS1``.
zh_cn: 可以从https://forum.armbian.com/topic/26978-csc-armbian-for-rk3318rk3328-tv-box-boards/ 安装 Armbian Linux 版本，并使其在 Control Hub上运行。使用 ``rk3318-config`` 命令启用 `rk3318-box-led-conf3` 板类型，以允许 Wi-FI 和所有 USB 端口工作。使用 ``armbian-config`` 启用 ``rk3328-uart1`` 覆盖，允许使用 ``/dev/ttyS1`` 通过内部 UART 连接与 Lynx 板通信。

source: **YOU SHOULDN'T BE DOING THIS FOR FTC!**
es_mx: **¡NO DEBERÍAS ESTAR HACIENDO ESTO PARA FTC!**
fr_ca: **VOUS NE DEVRIEZ PAS FAIRE CA EN FTC!**
zh_cn: **在 FTC 赛事里你不应该这样做！**

source: The single board computer and Lynx board from a Control Hub
es_mx: El ordenador monoplaca y la placa Lynx de un Control Hub
fr_ca: L'ordinateur à carte unique et la carte Lynx à partir d'un Control Hub
zh_cn: Control Hub 的单板计算机和 Lynx 板

source: The compute board, removed from a Control Hub
es_mx: La placa de cálculo, desmontada de un Control Hub
fr_ca: La carte de calcul, retirée d'un Control Hub
zh_cn: 从 Control Hub 移除的计算板

source: CPU: Quad-core ARM\ |reg| Cortex-A53
fr_ca: CPU : Quadruple cœur ou Quad-core ARM Cortex-A53
