Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/adv-control-system/lynx-module.po
Languages: es_mx, fr_ca, zh_cn

source: Lynx Module
es_mx: Módulo Lynx
fr_ca: Module Lynx
zh_cn: Lynx 模块

source: The Lynx Module is an object that represents the Control Hub and Expansion Hub. One Lynx Module object is created per connected hub.
es_mx: El Módulo Lynx es un objeto que representa el Control Hub y el Expansion Hub. Se crea un objeto Módulo Lynx por cada hub conectado.
fr_ca: Le Module Lynx est un objet qui représente le Control Hub et l'Expansion Hub. Un objet Lynx Module est créé par hub connecté.
zh_cn: Lynx 模块是一个代表 Control Hub 和 Expansion Hub 的对象。每个连接的 hub 创建一个Lynx模块对象。

source: General Explanation
es_mx: Explicación general
fr_ca: Explication générale
zh_cn: 一般解释

source: Obtaining Lynx Module Object
es_mx: Obtención del objeto del módulo Lynx
fr_ca: Obtention de l'Objet du Module Lynx
zh_cn: 获取Lynx模块对象

source: A list of connected Lynx Module objects can be obtained using ``hardwareMap.getAll(LynxModule.class);``. The Control Hub or the Expansion Hub connected to the phone via USB will have ``isMaster()`` set to true, and the hub connected over RS-485 will have it set to false.
es_mx: Se puede obtener una lista de los objetos Lynx Module conectados utilizando ``hardwareMap.getAll(LynxModule.class);``. El Control Hub o el Expansion Hub conectado al teléfono a través de USB tendrá ``isMaster()`` establecido en true, y el concentrador conectado a través de RS-485 lo tendrá establecido en false.
fr_ca: Une liste des objets Lynx Module connectés peut être obtenue en utilisant ``hardwareMap.getAll(LynxModule.class);``. Le Control Hub ou l'Expansion Hub connecté au téléphone via USB aura ``isMaster()`` fixé à true, et le hub connecté via RS-485 l'aura fixé à false.
zh_cn: 可以使用 ``hardwareMap.getAll(LynxModule.class);`` 获取连接的 Lynx 模块对象列表。Control Hub 或 Expansion Hub 通过USB连接到手机将 ``isMaster()`` 设置为 true ，通过 RS-485 连接的集线器将其设置为false。

source: The REV hub's LED can be set using ``setConstant()`` or ``setPattern()``. ``setConstant()`` sets a constant color to the LED, and ``setPattern()`` allows the user to define a pattern of colors for the REV hub to follow.
es_mx: El LED del cubo REV puede configurarse mediante ``setConstant()`` o ``setPattern()``. Con ``setConstant()`` se establece un color constante para el LED, y con ``setPattern()`` el usuario puede definir un patrón de colores para el REV hub.
fr_ca: La LED du hub REV peut être réglée à l'aide de ``setConstant()`` ou de ``setPattern()``. ``setConstant()` fixe une couleur constante à la LED, et ``setPattern()` permet à l'utilisateur de définir un modèle de couleurs que le hub REV doit suivre.
zh_cn: REV hub 的 LED 可以使用 ``setConstant()`` 或 ``setPattern()`` 设置。``setConstant()`` 为LED设置一个恒定的颜色， ``setPattern()`` 允许用户定义 REV hub 遵循的颜色模式。

source: Power
es_mx: Energía
fr_ca: Puissance
zh_cn: 电源

source: The total amount of current that the REV hub is pulling can be measured using ``getCurrent()``. This is the current pull of the 12V input in the specified units, so it includes everything connected to the hub as well as the hub itself. In addition, the input voltage to the expansion hub can be measured using ``getInputVoltage()``, which returns the battery voltage in the specified units.
es_mx: La cantidad total de corriente que el REV hub está tirando se puede medir usando ``getCurrent()``. Esta es la corriente de la entrada de 12V en las unidades especificadas, por lo que incluye todo lo conectado al hub, así como el propio hub. Además, el voltaje de entrada al Expansion Hub puede medirse usando ``getInputVoltage()``, que devuelve el voltaje de la batería en las unidades especificadas.
fr_ca: La quantité totale de courant que le hub REV tire peut être mesurée en utilisant ``getCurrent()``. Il s'agit du courant tiré de l'entrée 12V dans les unités spécifiées, ce qui inclut tout ce qui est connecté au concentrateur ainsi que le concentrateur lui-même. De plus, la tension d'entrée du concentrateur d'expansion peut être mesurée en utilisant ``getInputVoltage()``, qui retourne la tension de la batterie dans les unités spécifiées.
zh_cn: REV hub上的总电流可以使用 ``getCurrent()`` 测量。这是指定单位12V输入的电流，因此它包括连接到集线器的所有内容以及集线器本身。此外，expansion hub 的输入电压可以使用 ``getInputVoltage()`` 测量，它返回指定单位的电池电压。

source: Bulk Reads
es_mx: Lecturas masivas
fr_ca: Lectures en Bloc
zh_cn: 批量读取

source: Bulk reads can also be managed through the lynx module object. See :doc:`/docs/software/tutorials/bulk-reads` for more information on this.
es_mx: Las lecturas masivas también pueden gestionarse a través del objeto módulo lynx. Véase :doc:`/docs/software/tutoriaels/lecturas-masivas` para más información al respecto.
fr_ca: Les lectures en masse peuvent également être gérées par l'objet module lynx. Voir :doc:`/docs/software/tutorials/bulk-reads` pour plus d'informations à ce sujet.
zh_cn: 批量读取也可以通过lynx模块对象进行管理。有关详细信息，请参阅 :doc:`/docs/software/tutorials/bulk-reads` 。
