Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/adv-control-system/sdk-sensors.po
Languages: es_mx, fr_ca, zh_cn

source: SDK Sensors
es_mx: Sensores SDK
fr_ca: Capteurs SDK
zh_cn: SDK 传感器

source: The SDK offers several methods of controlling and communicating with sensors.
es_mx: El SDK ofrece varios métodos de control y comunicación con los sensores.
fr_ca: Le SDK propose plusieurs méthodes de contrôle et de communication avec les capteurs.
zh_cn: SDK 提供多种控制传感器和与传感器通信的方法。

source: General Explanation
es_mx: Explicación general
fr_ca: Explication générale
zh_cn: 一般说明

source: I2C Explanation
es_mx: I2C Explicación
fr_ca: ExplicationI2C
zh_cn: I2C 说明

source: I2C is a two wire serial communication bus that is designed to communicate with multiple devices. The two wires are the SCL, or clock line, and SDA, or data line. The REV hub connector also contains two more pins for 3.3v and GND. The protocol can address multiple devices using addresses, where the master device sends the address it is communicating with, then the data it wants to send. The device it is talking to then responds. This means any number of devices can be connected to one I2C port, so long as no two devices have the same I2C addresses.
es_mx: I2C es un bus de comunicación serie de dos hilos que está diseñado para comunicarse con múltiples dispositivos. Los dos hilos son SCL, o línea de reloj, y SDA, o línea de datos. El REV hub connector también contiene dos pines más para 3,3v y GND. El protocolo puede dirigirse a varios dispositivos mediante direcciones, en las que el dispositivo maestro envía la dirección con la que se comunica y, a continuación, los datos que desea enviar. El dispositivo con el que se comunica responde. Esto significa que cualquier número de dispositivos pueden ser conectados a un puerto I2C, siempre y cuando no haya dos dispositivos con las mismas direcciones I2C.
fr_ca: I2C est un bus de communication série à deux fils conçu pour communiquer avec plusieurs appareils. Les deux fils sont le SCL, ou ligne d'horloge, et le SDA, ou ligne de données. Le connecteur du hub REV contient également deux autres broches pour 3,3 V et GND. Le protocole peut s'adresser à plusieurs appareils en utilisant des adresses, où l'appareil maître envoie l'adresse avec laquelle il communique, puis les données qu'il veut envoyer. L'appareil auquel il s'adresse répond ensuite. Cela signifie que n'importe quel nombre d'appareils peut être connecté à un port I2C, tant que deux appareils n'ont pas les mêmes adresses I2C.
zh_cn: I2C 是一种双线串行通信总线，设计用于与多个设备通信。这两根线分别是 SCL（时钟线）和 SDA（数据线）。REV 集线器连接器上还有两个针脚，分别用于连接 3.3V 和 GND。该协议可使用地址寻址多个设备，主设备发送与之通信的地址，然后发送要发送的数据。与之通话的设备随后做出响应。这意味着一个 I2C 端口可以连接任意数量的设备，只要没有两个设备的 I2C 地址相同即可。

source: I2C has multiple speed specifications, but the REV hub supports both 100khz and 400khz communication standards. The specification also requires the lines to be pulled up, so the REV hub has dual 2.49 k\ |Omega| pull up resistors, negating the need for external pull up resistors.
es_mx: I2C tiene múltiples especificaciones de velocidad, pero el hub REV soporta los estándares de comunicación de 100khz y 400khz. La especificación también requiere que las líneas sean pull up, por lo que el hub REV tiene resistencias pull up duales de 2,49 k\ |Omega|, negando la necesidad de resistencias pull up externas.
fr_ca: L'I2C a plusieurs spécifications de vitesse, mais le hub REV prend en charge les normes de communication de 100 kHz et de 400 kHz. La spécification exige également que les lignes soient tirées vers le haut, de sorte que le hub REV dispose de deux résistances tirées vers le haut de 2,49 kilos, ce qui élimine la nécessité d'utiliser des résistances tirées vers le haut externes.
zh_cn: I2C 有多种速度规格，但 REV 集线器同时支持 100khz 和 400khz 通信标准。该规格还要求线路上拉，因此 REV 集线器具有双 2.49 k\ |Omega| 上拉电阻，无需外部上拉电阻。

source: Devices generally have their I2C addresses hard coded, meaning they cannot be changed. Check the devices data sheet to make sure addresses will not conflict if connecting multiple I2C devices together.
es_mx: Los dispositivos suelen tener sus direcciones I2C codificadas, lo que significa que no se pueden cambiar. Comprueba la hoja de datos del dispositivo para asegurarte de que las direcciones no entran en conflicto si conectas varios dispositivos I2C.
fr_ca: Les adresses I2C des appareils sont généralement codées en dur, ce qui signifie qu'elles ne peuvent pas être modifiées. Vérifiez la fiche technique de l'appareil pour vous assurer que les adresses n'entreront pas en conflit si vous connectez plusieurs appareils I2C ensemble.
zh_cn: 设备的 I2C 地址一般都是硬编码，即无法更改。请查阅设备数据表，确保将多个 I2C 设备连接在一起时地址不会冲突。

source: I2C is often called slower than other forms of sensors. It is not inherently slower, but due to the way I2C communication works in the SDK it takes multiple commands to read one I2C sensor, which means one I2C read can take 2-3x longer than one digital or analog read.
es_mx: A menudo se dice que I2C es más lento que otras formas de sensores. No es intrínsecamente más lento, pero debido a la forma en que funciona la comunicación I2C en el SDK se necesitan varios comandos para leer un sensor I2C, lo que significa que una lectura I2C puede tardar 2-3 veces más que una lectura digital o analógica.
fr_ca: La technologie I2C est souvent considérée comme plus lente que d'autres formes de capteurs. Il n'est pas intrinsèquement plus lent, mais en raison de la façon dont la communication I2C fonctionne dans le SDK, il faut plusieurs commandes pour lire un capteur I2C, ce qui signifie qu'une lecture I2C peut prendre 2-3x plus de temps qu'une lecture numérique ou analogique.
zh_cn: I2C 通常被称为比其他形式的传感器慢。它本身并不慢，但由于 SDK 中 I2C 通信的工作方式，读取一个 I2C 传感器需要多条命令，这意味着 I2C 读取一次的时间可能比数字或模拟读取一次的时间长 2-3 倍。

source: Analog Input
es_mx: Entrada analógica
fr_ca: Entrée analogique
zh_cn: 模拟输入

source: Reads the input voltage to the expansion hub. These ports are the ONLY sensor ports that are 5v tolerant.
es_mx: Lee el voltaje de entrada al expansion hub. Estos puertos son los ÚNICOS puertos de sensor que toleran 5v.
fr_ca: Lit la tension d'entrée du expansion hub. Ces ports sont les SEULS ports de capteurs qui sont tolérants à 5V.
zh_cn: 读取扩展集线器的输入电压。这些端口是唯一能承受 5V 电压的传感器端口。

source: Digital I/O
fr_ca: E/S numériques
zh_cn: 数字输入/输出

source: Digital I/O can be configured to either act as an INPUT, reading whether the port is HIGH or LOW, or an OUTPUT, sending HIGH or LOW signals. The digital input is pulled HIGH to prevent floating.
es_mx: Los digital I/O pueden configurarse para actuar como un INPUT, leyendo si el puerto está HIGH o LOW, o como un OUTPUT, enviando señales HIGH o LOW. La entrada digital se pone en HIGH para evitar la flotación.
fr_ca: Les I/O numériques peuvent être configurées pour agir soit comme une ENTREE, en lisant si le port est HAUT ou BAS, soit comme une SORTIE, en envoyant des signaux HAUT ou BAS. L'entrée numérique est tirée vers le haut pour éviter le flottement.
zh_cn: 数字输入/输出可配置为输入（读取端口的高电平或低电平）或输出（发送高电平或低电平信号）。数字输入为高电平，以防止浮动。

source: Floating occurs when you attempt to read from a digital input pin but the signal is disconnected or not pulled HIGH or to ground. As a result, the pin is considered "floating" and can have inconsistent results. To prevent this, a resistor bridges between the port and 3.3V, so that instead of floating the pin instead reads HIGH when nothing is connected.
es_mx: La flotación se produce cuando se intenta leer desde una entrada digital pero la señal está desconectada o no está en HIGH o a tierra. Como resultado, el pin se considera "flotante" y puede tener resultados inconsistentes. Para evitar esto, una resistencia puentea entre el puerto y 3.3V, de modo que en lugar de flotar, el pin se lee en HIGH cuando no hay nada conectado.
fr_ca: Il y a flottement lorsque vous essayez de lire un signal à partir d'une broche d'entrée numérique, mais que le signal est déconnecté ou n'est pas tiré vers le haut ou vers la terre. Par conséquent, la broche est considérée comme "flottante" et les résultats peuvent être incohérents. Pour éviter cela, une résistance fait le pont entre le port et 3,3 V, de sorte qu'au lieu de flotter, la broche lit HAUT lorsque rien n'est connecté.
zh_cn: 当试图从数字输入引脚读取信号，但信号断开或没有拉高或接地时，就会出现浮动。因此，该引脚被认为是 "浮动" 的，结果可能不一致。为了避免这种情况，需要在端口和 3.3V 之间桥接一个电阻，这样当没有任何连接时，引脚就不会浮动，而是读取高电平。

source: When wiring limit switches or other digital devices, DO NOT connect the limit switch to 3.3V and the digital port, like most datasheets recommend. Instead, the REV hub expects a connection between GROUND and the digital pin. **Connecting between 3.3V and the digital pin may cause instability or the hub to die.**
es_mx: Cuando cablee límites de switches u otros dispositivos digitales, NO conecte el límite del switch al 3,3V y al puerto digital, como recomiendan la mayoría de las hojas de datos. En su lugar, el REV hub espera una conexión entre TIERRA y el pin digital. **Conectar entre 3.3V y el pin digital puede causar inestabilidad o la muerte del hub.
fr_ca: Lors du câblage des interrupteurs de fin de course ou d'autres dispositifs numériques, NE PAS connecter l'interrupteur de fin de course à 3,3 V et au port numérique, comme le recommandent la plupart des fiches techniques. Au lieu de cela, le hub REV attend une connexion entre la MASSE et la broche numérique. **La connexion entre 3,3V et la broche numérique peut provoquer une instabilité ou la mort du hub.
zh_cn: 在为限位开关或其他数字设备布线时，切勿像大多数数据手册建议的那样，将限位开关连接到 3.3V 和数字端口。相反，REV 集线器希望在接地和数字引脚之间建立连接。 **在 3.3V 和数字引脚之间连接可能会导致不稳定或集线器死机。**
