Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/adv-control-system/sdk-servos.po
Languages: es_mx, fr_ca, zh_cn

source: SDK Servos
fr_ca: SDK Servomoteurs
zh_cn: SDK 舵机

source: The SDK offers several methods of controlling and communicating with servos, as well as a couple of hidden methods that can be easily accessed.
es_mx: El SDK ofrece varios métodos de control y comunicación con servos, así como un par de métodos ocultos que se pueden acceder fácilmente.
fr_ca: Le SDK propose plusieurs méthodes de contrôle et de communication avec les servos, ainsi que quelques méthodes cachées auxquelles il est facile d'accéder.
zh_cn: SDK提供了几种控制和与舵机系统通信的方法，以及一些可以轻松访问的隐藏方法。

source: General Explanation
es_mx: Explicación general
fr_ca: Explication générale
zh_cn: 通用说明

source: PWM Explanation
es_mx: Explicación de PWM (Modulación de Ancho de Pulso)
fr_ca: PWM Explication
zh_cn: PWM说明

source: Servos are controlled via a PWM signal. PWM signal is one where the signal turns on for a number of microseconds, then off for a number of microseconds. Servos are controlled by sending variable length pulses every 20 ms, with the length of the pulses dictating what angle the servo should move to (or with CR servos, what speed it should move at). This length of the pulse, expressed in microseconds, is called the PWM pulse width. By default, the sdk generates signals from 600 to 2400 microseconds (with SDK 0 being 600 microseconds, and SDK 1 being 2400 microseconds). However, the expansion hub can actually generate between 500 and 2500 microseconds if the range is set manually.
es_mx: Los servos se controlan mediante una señal PWM. La señal PWM es aquella en la que la señal se enciende durante un número de microsegundos y luego se apaga durante un número de microsegundos. Los servos se controlan enviando pulsos de longitud variable cada 20 ms, siendo la longitud de los pulsos la que dicta a qué ángulo debe moverse el servo (o, en el caso de los servos CR, a qué velocidad debe moverse). Esta longitud del pulso, expresada en microsegundos, se llama ancho de pulso PWM. Por defecto, el sdk genera señales de 600 a 2400 microsegundos (siendo 600 microsegundos el SDK 0 y 2400 microsegundos el SDK 1). Sin embargo, el expansion hub puede generar entre 500 y 2500 microsegundos si se establece el rango manualmente.
fr_ca: Les servos sont commandés par un signal PWM. Un signal PWM est un signal qui s'allume pendant un certain nombre de microsecondes, puis s'éteint pendant un certain nombre de microsecondes. Les servos sont commandés par l'envoi d'impulsions de longueur variable toutes les 20 ms, la longueur des impulsions déterminant l'angle auquel le servo doit se déplacer (ou, pour les servos CR, la vitesse à laquelle il doit se déplacer). La longueur de l'impulsion, exprimée en microsecondes, est appelée largeur d'impulsion PWM. Par défaut, le sdk génère des signaux de 600 à 2400 microsecondes (SDK 0 correspondant à 600 microsecondes et SDK 1 à 2400 microsecondes). Cependant, l'expansion hub peut en fait générer entre 500 et 2500 microsecondes si la plage est définie manuellement.
zh_cn: 舵机通过PWM信号进行控制。PWM信号是信号开启若干微秒，然后关闭若干微秒的信号。舵机通过每20毫秒发送可变长度的脉冲来控制，脉冲的长度决定舵机应该移动到什么角度（或者CR舵机，它应该以什么速度移动）。脉冲的长度，以微秒表示，称为PWM脉冲宽度。默认情况下，sdk生成600到2400微秒的信号（SDK0是600微秒，SDK1是2400微秒）。然而，如果手动设置范围，扩展集线器实际上可以生成500到2500微秒之间的信号。

source: 5V Power
es_mx: 5V Energía
fr_ca: Alimentation 5V
zh_cn: 5V电源

source: All servos require a minimum of 5V to operate, and so the expansion hub generates 5V to power the servos. The 5V power is shared between pairs of ports (0-1, 2-3, 4-5). By default, this 5V power is OFF, and doesn't provide power. However, doing any servo operation, such as setting the position of a servo, will turn ON the 5V power to both shared ports. Calling disable PWM seems to turn OFF shared power, however if another servo is used or is active the 5V power will remain ON instead.
es_mx: Todos los servos requieren un mínimo de 5V para funcionar, por lo que el expansion hub genera 5V para alimentar los servos. La alimentación de 5V se comparte entre pares de puertos (0-1, 2-3, 4-5). Por defecto, esta alimentación de 5V está APAGADA y no proporciona energía. Sin embargo, cualquier operación de servo, como establecer la posición de un servo, activará la alimentación de 5V en ambos puertos compartidos. Llamar a disable PWM parece apagar la alimentación compartida, sin embargo, si se utiliza otro servo o está activo, la alimentación de 5V permanecerá ENCENDIDA en su lugar.
fr_ca: Tous les servos ont besoin d'un minimum de 5V pour fonctionner, et l'expansion hub génère donc 5V pour alimenter les servos. L'alimentation 5V est partagée entre les paires de ports (0-1, 2-3, 4-5). Par défaut, cette alimentation 5V est désactivée et ne fournit pas de courant. Cependant, toute opération sur les servos, comme le réglage de la position d'un servo, activera l'alimentation 5V sur les deux ports partagés. Désactiver le PWM semble désactiver l'alimentation partagée, mais si un autre servo est utilisé ou actif, l'alimentation 5V restera activée.
zh_cn: 所有舵机系统都需要至少5V才能运行，因此扩展集线器产生5V来为舵机系统供电。5V电源在成对端口（0-1、2-3、4-5）之间共享。默认情况下，此5V电源关闭，不提供电源。但是，执行任何舵机操作，例如设置舵机的位置，将打开两个共享端口的5V电源。调用禁用PWM似乎关闭了共享电源，但是如果使用另一个舵机或激活，5V电源将保持打开状态。

source: An example of a PWM wave for a made up servo.
es_mx: Un ejemplo de una onda PWM para un servo inventado.
fr_ca: Un exemple d'onde PWM pour un servo fabriqué.
zh_cn: 一个控制舵机的 PWM 波形示例。

source: An example of servo PWM waves. NOTE: Servo angles are arbitrarily selected and will not be accurate to all servos
es_mx: Un ejemplo de ondas PWM de servo. NOTA: Los ángulos del servo se seleccionan arbitrariamente y no serán precisos para todos los servos.
fr_ca: Exemple d'ondes PWM de servo. REMARQUE : les angles des servos sont choisis arbitrairement et ne seront pas exacts pour tous les servos.
zh_cn: 舵机 PWM 波形示例。注意：舵机角度是任意选择的，并非对所有舵机都准确无误。

source: Every pair of **two ports**, (0-1, 2-3, 4-5) share the SAME 2 amp limitation, so care should be taken that pairs of servos do not pull more than 2 amps. Putting servos in every other port is recommended when possible.
es_mx: Cada par de **dos puertos**, (0-1, 2-3, 4-5) comparten la MISMA limitación de 2 amperios, así que se debe tener cuidado de que los pares de servos no consuman más de 2 amperios. Se recomienda colocar los servos en cada otro puerto cuando sea posible.
fr_ca: Chaque paire de **deux ports** (0-1, 2-3, 4-5) partage la MÊME limitation de 2 ampères, il faut donc veiller à ce que les paires de servos ne tirent pas plus de 2 ampères. Il est recommandé de placer des servos dans un port sur deux lorsque c'est possible.
zh_cn: 每对两个端口（0-1,2-3,4-5）共享相同的2安培限制，因此应注意舵机对的拉力不要超过2安培。建议尽可能将舵机放在每个其他端口。

source: Hidden Methods
es_mx: Métodos Ocultos
fr_ca: Méthodes cachées
zh_cn: 隐藏方法

source: All REV hub servos are instances of ``ServoImplEx``, which exposes some more methods to the user, such as setting the servo PWM range.
es_mx: Todos los servos REV hub son instancias de "ServoImplEx", que expone algunos métodos adicionales al usuario, como establecer el rango PWM del servo.
fr_ca: Tous les servos du hub REV sont des instances de ``ServoImplEx``, qui expose quelques méthodes supplémentaires à l'utilisateur, comme le réglage de la plage PWM du servo.
zh_cn: 所有REV集线器舵机系统都是ServoInfEx的实例，它向用户公开了更多方法，例如设置舵机PWM范围。

source: There is no downside to using ``ServoImplEx``, in order to convert a ``Servo`` to a ``ServoImplEx`` the user simply just needs to cast the ``Servo`` returned by the ``hardwareMap`` to a ``ServoImplEx``.
es_mx: No hay ninguna desventaja en usar "ServoImplEx", para convertir un "Servo" a "ServoImplEx" el usuario simplemente necesita hacer un cast del "Servo" devuelto por "hardwareMap" a "ServoImplEx".
fr_ca: Il n'y a pas d'inconvénient à utiliser ``ServoImplEx``, pour convertir un ``Servo`` en un ``ServoImplEx``, l'utilisateur doit simplement convertir le ``Servo`` retourné par le ``hardwareMap` en un ``ServoImplEx``.
zh_cn: 使用ServoImpEx没有缺点，为了将Servo转换为ServoImpEx，用户只需将hardwareMap返回的Servo转换为ServoImpEx。

source: **Tips:**
es_mx: **Consejos:**
fr_ca: **Conseils:**
zh_cn: 提示：

source: You can use ``setPwmRange()`` to increase the servo range to a maximum of 500 to 2500 microseconds. This changes the SDK mapping, with 0 becoming the minimum microseconds and 1 becoming the maximum microseconds. **Increasing the range to 500-2500 can give more range when controlling servos that use 500-2500 PWM Range, such as goBILDA servos and REV Smart Robot Servo**
es_mx: Puedes usar ``setPwmRange()`` para aumentar el rango del servo a un máximo de 500 a 2500 microsegundos. Esto cambia el mapeo del SDK, con 0 convirtiéndose en el mínimo de microsegundos y 1 convirtiéndose en el máximo de microsegundos. **Aumentar el rango a 500-2500 puede proporcionar más rango al controlar servos que utilizan un rango de PWM de 500-2500, como los servos goBILDA y el REV Smart Robot Servo**
fr_ca: Vous pouvez utiliser ``setPwmRange()`` pour augmenter la plage du servo jusqu'à un maximum de 500 à 2500 microsecondes. Cela modifie la cartographie du SDK, 0 devenant la microseconde minimale et 1 la microseconde maximale. **L'augmentation de la plage à 500-2500 peut donner plus de portée lors du contrôle de servos qui utilisent une plage PWM de 500-2500, tels que les servos goBILDA et REV Smart Robot Servo**.
zh_cn: 你可以使用 ``setPwmRange()`` 将舵机范围增加到最大 500 至 2500 微秒。这将改变 SDK 映射，0 变为最小微秒，1 变为最大微秒。 **当控制使用 500-2500 PWM 范围的舵机系统（如 goBILDA 舵机系统和 REV 智能机器人舵机系统）时，将范围增加到 500-2500 可以提供更大的范围** 。

source: ``setPwmDisable()`` and ``setPwmEnable()`` can be used to turn on and off the PWM signal to a servo. On some servos, this will cause the servo to de-energize and "turn off" with no holding power. Other servos may stay on and hold their position. Behavior will vary from servo manufacturer to servo manufacturer. It will also disable 5V power if the servo is the only one in its group of ports.
es_mx: ``setPwmDisable()`` y ``setPwmEnable()`` se pueden utilizar para encender y apagar la señal PWM a un servo. En algunos servos, esto hará que el servo se desenergice y se "apague" sin potencia de retención. Otros servos pueden permanecer encendidos y mantener su posición. El comportamiento variará de un fabricante de servo a otro. También desactivará la alimentación de 5V si el servo es el único en su grupo de puertos.
fr_ca: ``setPwmDisable()`` et ``setPwmEnable()`` peuvent être utilisés pour activer et désactiver le signal PWM d'un servo. Sur certains servos, cela aura pour effet de les mettre hors tension et de les "éteindre" sans qu'ils ne conservent leur puissance. D'autres servos peuvent rester sous tension et maintenir leur position. Le comportement varie d'un fabricant de servos à l'autre. Cela désactivera également l'alimentation 5V si le servo est le seul dans son groupe de ports.
zh_cn: setPwmDisable()和setPwmEnable()可用于打开和关闭舵机的PWM信号。在某些舵机上，这将导致舵机断电并“关闭”而没有保持电源。其他舵机可能会保持开启并保持其位置。行为因舵机制造商而异。如果舵机是其端口组中唯一的一个，它还将禁用5V电源。

source: Both REV Smart Robot Servos and goBILDA servos will stop holding their position when ``setPwmDisable`` is called, regardless of if the 5v power is still on or not.
es_mx: Ambos servos REV Smart Robot y goBILDA dejarán de mantener su posición cuando se llame a "setPwmDisable", sin importar si la alimentación de 5v está encendida o no.
fr_ca: Les servos REV Smart Robot et les servos goBILDA cesseront de maintenir leur position lorsque ``setPwmDisable`` sera appelé, que l'alimentation 5v soit encore allumée ou non.
zh_cn: 当调用setPwmDisable时，REV智能机器人舵机和goBILDA舵机都将停止保持其位置，无论5v电源是否仍然打开。
