Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/adv-control-system/sdk-motors.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: SDK Motors
es_mx: Motores SDK
fr_ca: Moteurs SDK
zh_cn: SDK电机

source: The SDK offers several methods of controlling and communicating with motors, as well as a couple of hidden methods that can be easily accessed.
es_mx: El SDK ofrece varios métodos de control y comunicación con los motores, así como un par de métodos ocultos a los que se puede acceder fácilmente.
fr_ca: Le SDK propose plusieurs méthodes de contrôle et de communication avec les moteurs, ainsi que quelques méthodes cachées auxquelles il est facile d'accéder.
ru_ru: SDK предлагает несколько методов управления моторами и обмена данными с ними, а также пару скрытых методов, к которым можно легко получить доступ.
zh_cn: SDK提供了几种控制和与电机通信的方法，以及一些可以轻松访问的隐藏方法。

source: General Explanation
es_mx: Explicación general
fr_ca: Explication générale
ru_ru: Общее Объяснение
zh_cn: 一般解释

source: Motor Controller
es_mx: Controlador del motor
fr_ca: Contrôleur de moteur
ru_ru: Драйвер Мотора
zh_cn: 电机控制器

source: All motor ports are controlled with what is called an H-bridge motor controller, a circuit that can be used to vary the output voltage as well as signage (negative or positive) of the voltage. Negative voltage through a DC Motor reverses a motor, whereas positive motor will make the motor go forward. SDK Motor power (from -1 to 1), represents a multiplier of the input voltage that is output through the motor port. The different voltages are created via PWM, where the port is turned on and off rapidly to create a lower average voltage.
es_mx: Todos los puertos de motor se controlan con lo que se llama un controlador de motor de puente H, un circuito que se puede utilizar para variar la tensión de salida, así como la señalización (negativa o positiva) de la tensión. Un voltaje negativo a través de un motor DC invierte un motor, mientras que uno positivo hará que el motor vaya hacia delante. La potencia del Motor SDK (de -1 a 1), representa un multiplicador del voltaje de entrada que se emite a través del puerto del motor. Los diferentes voltajes son creados vía PWM, donde el puerto es encendido y apagado rápidamente para crear un voltaje promedio más bajo.
fr_ca: Tous les ports de moteur sont contrôlés par ce que l'on appelle un contrôleur de moteur à pont en H, un circuit qui peut être utilisé pour faire varier la tension de sortie ainsi que le signe (négatif ou positif) de la tension. Une tension négative dans un moteur à courant continu inverse le mouvement du moteur, tandis qu'une tension positive le fait avancer. La puissance du moteur SDK (de -1 à 1) représente un multiplicateur de la tension d'entrée qui est émise par le port du moteur. Les différentes tensions sont créées par PWM, où le port est activé et désactivé rapidement pour créer une tension moyenne plus faible.
ru_ru: Все порты моторов управляются с помощью так называемого Н-мостового драйвера (H-bridge) – схемой, которая может использоваться для изменения как выходного напряжения, так и его полярности (отрицательной или положительной). Отрицательное напряжение, подаваемое на DC Motor, заставляет его вращаться в обратном направлении, тогда как положительное напряжение приводит к вращению вперёд. Мощность SDK Motor (от -1 до 1) представляет собой коэффициент входного напряжения, подаваемого на порт мотора. Различные уровни напряжения создаются с помощью ШИМ (PWM), быстрого включения и отключения порта для создания пониженного среднего напряжения.
zh_cn: 所有电机端口都由所谓的H桥电机控制器控制，该电路可用于改变输出电压以及电压的标志（负或正）。通过DC的负电压使电机反转，而正电机将使电机前进。SDK电机功率（从-1到1）表示通过电机端口输出的输入电压的乘数。不同的电压通过PWM创建，其中端口快速打开和关闭以创建较低的平均电压。

source: In addition, the zero power behavior of the motor, that is the behavior of the motor when no power is applied, can be configured. In FLOAT mode, the motor controller simply turns off, providing minimal additional resistance. In BRAKE mode, the two motor leads are shorted together internally. Due to the inherent property that all DC brushed motors generate electricity when the shaft spins, shorting the leads causes a reverse power that stops the motor quickly and is resistant to external forces.
es_mx: Además, se puede configurar el comportamiento de potencia cero del motor, es decir, el comportamiento del motor cuando no se aplica potencia. En modo FLOAT, el controlador del motor simplemente se apaga, proporcionando una resistencia adicional mínima. En modo BRAKE, los dos cables del motor se cortocircuitan internamente. Debido a la propiedad inherente de que todos los motores de DC con escobillas generan electricidad cuando el eje gira, el cortocircuito de los cables provoca una potencia inversa que detiene el motor rápidamente y es resistente a las fuerzas externas.
fr_ca: En outre, il est possible de configurer le comportement du moteur à puissance nulle, c'est-à-dire le comportement du moteur lorsqu'il n'est pas alimenté. En mode FLOAT, le contrôleur de moteur s'éteint simplement, fournissant une résistance supplémentaire minimale. En mode FREIN, les deux fils du moteur sont court-circuités en interne. En raison de la propriété inhérente à tous les moteurs à courant continu à balais de générer de l'électricité lorsque l'arbre tourne, le fait de court-circuiter les fils provoque une inversion de puissance qui arrête le moteur rapidement et résiste aux forces extérieures.
zh_cn: 此外，可以配置电机的零功率行为，即电机在没有施加电源时的行为。在FLOAT模式下，电机控制器简单地关闭，提供最小的附加电阻。在BRAKE模式下，两个电机引线在内部一起短路。由于所有DC有刷电机在轴旋转时都产生电力的固有特性，短路引线会导致反向功率，从而快速停止电机并抵抗外力。

source: The motor controller uses the input voltage, this means on a 13 volt battery, setting the power to 1 will create an output voltage of 13 volts. Similarly, on an 11 volt battery, a power of 1 will create an output voltage of 11 volts.
es_mx: El controlador del motor utiliza la tensión de entrada, lo que significa que en una batería de 13 voltios, ajustar la potencia a 1 creará una tensión de salida de 13 voltios. Del mismo modo, en una batería de 11 voltios, una potencia de 1 creará una tensión de salida de 11 voltios.
fr_ca: Le contrôleur de moteur utilise la tension d'entrée, ce qui signifie que sur une batterie de 13 volts, une puissance de 1 créera une tension de sortie de 13 volts. De même, sur une batterie de 11 volts, une puissance de 1 créera une tension de sortie de 11 volts.
ru_ru: Драйвер мотора использует входное напряжение; это означает, что при использовании аккумулятора напряжением 13 вольт установка мощности на 1 создаст обратное напряжение в 13 вольт. Аналогично, при использовании аккумулятора напряжением 11 вольт установка мощности на 1 создаст выходное напряжение в 11 вольт.
zh_cn: 电机控制器使用输入电压，这意味着在13伏电池上，将功率设置为1将产生13伏的输出电压。类似地，在11伏电池上，功率为1将产生11伏的输出电压。

source: Motor Encoder
es_mx: Codificador del motor
fr_ca: Encodeur de moteur
ru_ru: Энкодер Мотора
zh_cn: 电机编码器

source: There is no real standardized terminology when dealing with quadrature encoders. Here, we use the terms "count" and "tick" to represent a single rising or falling action in the quadrature wave. You may also see some datasheets list "pulses", which can indicate anything from 1 "count" to 4 "counts". Be careful when reading datasheets!
es_mx: No existe una terminología estandarizada real al tratar con codificadores de cuadratura. Aquí, usamos los términos "conteo" y "tick" para representar una sola acción ascendente o descendente en la onda de cuadratura. También puedes ver en algunas hojas de datos "pulsos", lo cual puede indicar desde 1 "conteo" hasta 4 "conteos". ¡Ten cuidado al leer hojas de datos!
fr_ca: Il n'existe pas vraiment de terminologie normalisée pour les encodeurs en quadrature. Nous utilisons ici les termes "count" et "tick" pour représenter une seule action ascendante ou descendante dans l'onde en quadrature. Certaines fiches techniques mentionnent également des "impulsions", qui peuvent aller de 1 "compte" à 4 "comptes". Soyez prudent lorsque vous lisez des fiches techniques !
ru_ru: Единой стандартизованной терминологии для квадратурных энкодеров не существует. Здесь мы используем термины "count" и "tick" (тик) для обозначения одного нарастающего или спадающего перехода в квадратурной волне. В некоторых технических документациях (datasheets) вы также можете встретить термин "пульс" ("pulses"), который может обозначать от 1 "count" до 4 "counts". Будьте внимательны при изучении технических документаций!
zh_cn: 在处理正交编码器时，没有真正标准化的术语。在这里，我们使用术语“count”和“tick”来表示正交波中的单个上升或下降动作。你可能还会看到一些数据表列出了“pulse”，它可以表示从1个“count”到4个“count”的任何内容。阅读数据表时要小心！

source: FTC\ |reg| Encoders use the two wire quadrature format for transmitting relative encoder information. In quadrature, there are two signal wires, A and B. When moving, both A and B generate square waves that are 90 degrees apart, that is one square wave starts half way through the other square wave, and ends half way through the other square wave. When traveling in one direction, the A wire square wave leads the B wire square wave, and in the other direction the B wire square wave leads the A wire square wave. The two waves are combined in XOR to produce the output wave, where each rising and falling action is one "tick", and the faster the wave the faster the encoder is moving.
es_mx: Los FTC\ |reg| codificadores utilizan el formato de cuadratura de dos hilos para transmitir información relativa del codificador. En cuadratura, hay dos cables de señal, A y B. Al moverse, tanto A como B generan ondas cuadradas que están separadas por 90 grados, es decir, una onda cuadrada comienza a la mitad de la otra onda cuadrada y termina a la mitad de la otra onda cuadrada. Al viajar en una dirección, la onda cuadrada del cable A precede a la onda cuadrada del cable B, y en la otra dirección, la onda cuadrada del cable B precede a la onda cuadrada del cable A. Las dos ondas se combinan en XOR para producir la onda de salida, donde cada acción de subida y bajada es un "tick", y cuanto más rápido sea la onda, más rápido se mueve el codificador.
fr_ca: Les encodeurs FTC\ |reg| utilisent le format quadrature à deux fils pour transmettre les informations relatives de l'encodeur. En quadrature, il y a deux fils de signal, A et B. Lorsqu'ils se déplacent, A et B génèrent tous deux des ondes carrées à 90 degrés l'une de l'autre, c'est-à-dire qu'une onde carrée commence à mi-chemin de l'autre onde carrée et se termine à mi-chemin de l'autre onde carrée. Dans une direction, l'onde carrée du fil A précède l'onde carrée du fil B, et dans l'autre direction, l'onde carrée du fil B précède l'onde carrée du fil A. Les deux ondes sont combinées dans la fonction XOR. Les deux ondes sont combinées en XOR pour produire l'onde de sortie, où chaque action montante et descendante correspond à un "tick", et plus l'onde est rapide, plus l'encodeur se déplace rapidement.
ru_ru: Энкодеры в FTC\ |reg| используют двухпроводной квадратурный формат для передачи относительных данных о позициях. В квадратурной схеме задействуются два сигнальных провода: A и B. При движении оба провода генерируют квадратные волны, сдвинутые друг относительно друга на 90 градусов по фазе. Это означает, что одна квадратная волна начинается и заканчивается ровно на середине другой. При движении в одном направлении квадратная волна с провода A опережает волну с провода B, а при обратном движении волна с провода B опережает волну с провода A. Оба сигнала объединяются с помощью логической операции исключающее ИЛИ (XOR), так что каждое нарастание и спад результирующего сигнала соответствует одному "tick" - чем выше частота сигнала, тем быстрее вращается энкодер.
zh_cn: FTC\ |reg| 编码器使用双线正交格式传输相对编码器信息。在正交格式中，有两根信号线 A 和 B。移动时，A 和 B 产生相距 90 度的方波，即一个方波从另一个方波的一半处开始，到另一个方波的一半处结束。向一个方向移动时，A 线方波领先于 B 线方波，向另一个方向移动时，B 线方波领先于 A 线方波。这两个波通过 XOR 组合产生输出波，其中每个上升和下降动作为一个 "tick"，波速越快，编码器的移动速度越快。

source: The REV hub counts the pulses and calculates velocity by using a 5 value "ring buffer", which has a new value added to it every 10 ms. These 5 values are then used to calculate the current velocity.
es_mx: El concentrador REV cuenta los pulsos y calcula la velocidad utilizando un "buffer de anillo" de 5 valores, al cual se le agrega un nuevo valor cada 10 ms. Estos 5 valores se utilizan para calcular la velocidad actual.
fr_ca: Le hub REV compte les impulsions et calcule la vitesse en utilisant un "tampon circulaire" de 5 valeurs, auquel une nouvelle valeur est ajoutée toutes les 10 ms. Ces 5 valeurs sont ensuite utilisées pour calculer la vitesse actuelle.
ru_ru: REV контроллер считает импульсы и вычисляет скорость используя "кольцевой буфер" из 5 значений, куда каждые 10 мс добавляется новое значение. На основе этих 5 значений рассчитывается текущая скорость.
zh_cn: REV集线器通过使用5值“环形缓冲区（ring buffer）”来计算脉冲和速度，该缓冲区每10毫秒添加一个新值。然后使用这5个值来计算当前速度。

source: It is recommended that quadrature encoders be hooked up to special hardware decoded ports to allow them to be read correctly. The expansion hub contains special hardware for reading quadrature encoders, but because there are only two of those controllers, two of the pins are hooked up in "software" instead (the ports are decoded in software instead of in hardware). Effectively, this means that ports 0 and 3, the two ports connected to the special quadrature ports, will always read accurately. **Ports 1 and 2 are connected to the less accurate "software" ports, meaning that with high CPR encoders (encoders that produce more than 4000 counts per revolution, such as the REV Through Bore Encoder or Talon SRX Encoder) they can "lose steps" and drift.**
es_mx: Se recomienda que los codificadores de cuadratura se conecten a puertos decodificados de hardware especial para permitir que se lean correctamente. El expansion hub contiene hardware especial para leer codificadores de cuadratura, pero debido a que solo hay dos de esos controladores, dos de los pines están conectados en "software" en su lugar (los puertos se decodifican en software en lugar de en hardware). Esto significa efectivamente que los puertos 0 y 3, los dos puertos conectados a los puertos de cuadratura especiales, siempre se leerán con precisión. **Los puertos 1 y 2 están conectados a los puertos "software" menos precisos, lo que significa que con codificadores de alta CPR (codificadores que producen más de 4000 cuentas por revolución, como el codificador REV Through Bore o el codificador Talon SRX), pueden "perder pasos" y desviarse.**
fr_ca: Il est recommandé de connecter les encodeurs en quadrature à des ports spéciaux décodés par le matériel pour qu'ils puissent être lus correctement. L'expansion hub contient du matériel spécial pour lire les encodeurs en quadrature, mais comme il n'y a que deux de ces contrôleurs, deux des broches sont connectées en "logiciel" à la place (les ports sont décodés en logiciel au lieu d'être décodés en matériel). Cela signifie que les ports 0 et 3, les deux ports connectés aux ports spéciaux en quadrature, liront toujours avec précision. **Les ports 1 et 2 sont connectés aux ports "logiciels" moins précis, ce qui signifie qu'avec les codeurs CPR élevés (encodeurs qui produisent plus de 4000 coups par tour, tels que l'encodeur à alésage traversant REV ou le codeur SRX Talon), ils peuvent "perdre des pas" et dériver**.
ru_ru: Рекомендуется подключать квадратурные энкодеры к портам с механическим декодированием для их корректного считывания. Expansion hub содержит специальное аппаратное обеспечение для считывания квадратурных энкодеров, но поскольку таких портов всего два, два порта подключены "программно", а не аппаратно. Фактически, это означает, что порты 0 и 3, подключенные к специальным аппаратным квадратурным портам, всегда будут считывать данные точно. **Порты 1 и 2 подключены к менее точным "программным" портам, что означает: с энкодерами с высоким CPR (энкодеры, которые выдают более 4000 тиков на оборот (CPR), такие как REV Through Bore Encoder или Talon SRX Encoder), могут пропускать значения и накапливать ошибку.
zh_cn: 建议将正交编码器连接到特殊的硬件解码端口，以允许正确读取它们。扩展集线器包含用于读取正交编码器的特殊硬件，但由于只有其中两个控制器，因此其中两个引脚连接在“软件”中（端口在软件中而不是在硬件中解码）。实际上，这意味着端口0和3，连接到特殊正交端口的两个端口，将始终准确读取。**端口1和2连接到不太准确的“软件”端口，这意味着使用高CPR编码器（每转产生超过4000个计数的编码器，例如REV直通孔编码器或Talon SRX编码器），它们可以“失步”和漂移。**

source: An example of a quadrature wave, with the A channel, B channel. The wave is broken up into four sections, where each section constitutes a tick.
es_mx: Un ejemplo de una onda de cuadratura, con el canal A, canal B. La onda se divide en cuatro secciones, donde cada sección constituye un tick.
fr_ca: Exemple d'onde en quadrature, avec le canal A et le canal B. L'onde est divisée en quatre sections, chaque section constituant une coche.
ru_ru: Пример квадратурной волны с каналами A и B. Волна разбита на четыре части, каждая из которых представляет собой тик.
zh_cn: 正交波的一个示例，包括 A 频道和 B 频道。波被分成四段，每段为一个tick。

source: An example of a quadrature wave, with channel A leading channel B. Each count is a "count" or "tick"
es_mx: Un ejemplo de una onda de cuadratura, con el canal A adelantando al canal B. Cada cuenta es un "count" o "tick".
fr_ca: Exemple d'onde en quadrature, avec le canal A précédant le canal B. Chaque compte est un "compte" ou un "tic"
ru_ru: Пример квадратурной волны, в которой канал A опережает канал B. Каждое деление — это "count" или "tick"
zh_cn: 正交波的一个例子，C形梁 A 领先于C形梁 B，每个计数都是一个 "count "或 "tick"。

source: Hidden Methods
es_mx: Métodos Ocultos
fr_ca: Méthodes cachées
ru_ru: Скрытые Методы
zh_cn: 隐藏方法

source: All REV hub DC motors are instances of ``DcMotorEx``, which exposes some more methods to the user, such as velocity control and current draw measurement.
es_mx: Todos los motores de DC de REV hub son instancias de "DcMotorEx", que expone algunos métodos adicionales al usuario, como el control de velocidad y la medición de la corriente consumida.
fr_ca: Tous les moteurs DC du hub REV sont des instances de ``DcMotorEx``, qui exposent quelques méthodes supplémentaires à l'utilisateur, telles que le contrôle de la vitesse et la mesure de la consommation de courant.
ru_ru: Все DC motors подключаемые в REV контроллер являются экземплярами класса ``DcMotorEx``, который предоставляет пользователю расширенные методы, такие как управление скоростью и измерение потребляемого тока.
zh_cn: 所有REV轮毂DC电机都是DcMotorEx的实例，它向用户提供了更多方法，例如速度控制和电流消耗测量。

source: There is no downside to using DcMotorEx, in order to convert a DcMotor to a DcMotorEx the user simply just needs to cast the DcMotor returned by the ``hardwareMap`` to a DcMotorEx.
es_mx: No hay ninguna desventaja en usar DcMotorEx, para convertir un DcMotor a un DcMotorEx, el usuario simplemente necesita convertir el DcMotor devuelto por "hardwareMap" a un DcMotorEx.
fr_ca: Il n'y a pas d'inconvénient à utiliser DcMotorEx, pour convertir un DcMotor en DcMotorEx, l'utilisateur doit simplement convertir le DcMotor retourné par le ``hardwareMap`` en un DcMotorEx.
ru_ru: Использование DcMotorEx не имеет недостатков. Чтобы преобразовать DcMotor в DcMotorEx, пользователю нужно просто привести DcMotor, возвращаемый функцией ``hardwareMap``, к типу DcMotorEx.
zh_cn: 使用DcMotorEx没有缺点，为了将DcMotorEx转换为DcMotorEx，用户只需将hardwareMap返回的DcMotorEx转换为DcMotorEx。

source: Tips
es_mx: Consejos
fr_ca: Conseils
ru_ru: Советы
zh_cn: 提示

source: While current readings are not bulk read, current alerts (``isMotorOverCurrent()``) is bulk read.
es_mx: Mientras las lecturas actuales no se lean masivamente, las alertas actuales (``isMotorOverCurrent()``) se leen masivamente.
fr_ca: Les relevés de courant ne sont pas lus en masse, mais les alertes de courant (``isMotorOverCurrent()``) sont lues en masse.
ru_ru: В отличие от показаний тока, оповещения перегрузки по току (``isMotorOverCurrent()``) считываются bulk read (в составе групповых данных).
zh_cn: 虽然当前读数不是批量读取，但当前警报（isMotorOverCurrent()）是批量读取。

source: PID/PIDF coefficients use internal units for the output, a two byte short from -32767 to 32767, instead of the user -1 to 1.
es_mx: Los coeficientes PID/PIDF utilizan unidades internas para la salida, un short de dos bytes de -32767 a 32767, en lugar del -1 a 1 del usuario.
fr_ca: Les coefficients PID/PIDF utilisent des unités internes pour la sortie, une valeur courte de deux octets allant de -32767 à 32767, au lieu des valeurs utilisateur de -1 à 1.
ru_ru: Коэффициенты PID/PIDF используют для вывода внутренние единицы измерения — двухбайтовое короткое число от -32767 до 32767, а не пользовательские значения от -1 до 1.
zh_cn: PID/PIDF系数使用内部单位作为输出，从-32767到32767短两个字节，而不是用户-1到1。

source: The default ``getVelocity()`` method returns the encoder velocity in ticks per second.
es_mx: El método predeterminado ``getVelocity()`` devuelve la velocidad del codificador en ticks por segundo.
fr_ca: La méthode par défaut ``getVelocity()`` renvoie la vitesse de l'encodeur en ticks par seconde.
ru_ru: Метод ``getVelocity()`` по умолчанию возвращает скорость энкодера в тиках в секунду.
zh_cn: 默认的getVelocity()方法以每秒刻度为单位返回编码器速度。

source: The ``RunMode`` ``STOP_AND_RESET_ENCODERS`` is not actually a run mode. Instead, it just sets the power to zero and sends a ``LynxResetMotorEncoderCommand``. This command can be issued manually if one wants to easy reset a motor encoder without changing the run mode.
es_mx: El ``RunMode`` ``STOP_AND_RESET_ENCODERS`` en realidad no es un modo de ejecución. En cambio, simplemente establece la potencia en cero y envía un ``LynxResetMotorEncoderCommand``. Este comando se puede emitir manualmente si se desea restablecer fácilmente un codificador de motor sin cambiar el modo de ejecución.
fr_ca: Le ``RunMode`` `STOP_AND_RESET_ENCODERS`` n'est pas réellement un mode de fonctionnement. Au lieu de cela, il met simplement l'alimentation à zéro et envoie une ``LynxResetMotorEncoderCommand``. Cette commande peut être émise manuellement si l'on souhaite réinitialiser facilement un encodeur de moteur sans changer le mode de fonctionnement.
ru_ru: Режим ``RunMode`` ``STOP_AND_RESET_ENCODERS`` на самом деле не является режимом работы. Вместо этого он просто устанавливает мощность на ноль и посылает команду ``LynxResetMotorEncoderCommand``. Эту команду можно подать вручную, если нужно просто сбросить энкодер мотора без изменения режима работы.
zh_cn: 该RunMode STOP_AND_RESET_ENCODERS实际上并不是运行模式。相反，它只是将功率设置为零并发送一个LynxResetMotorEncoderCommand。如果想要在不改变运行模式的情况下轻松重置电机编码器，可以手动发出此命令。
