Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/award-types.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: This award requires a separate submission sheet which is a condensed summary of a team's software. Check your region's rules, some require `the traditional (in person) <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-traditional.pdf>`_ or `remote <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-remote.pdf>`_ form, but some accept custom forms. Check with your affiliate partner or judges if you are unsure. **Do not directly put code into your portfolio, control award sheet or notebook, the judges will not care**. Instead, focus on explaining key algorithms that you use, and explain the software in an easy to understand way. Remember, your control award judges may not be software engineers or programmers, so make sure you can explain everything to someone without a software background.
es_mx: Este premio requiere una hoja de presentación separada que es un resumen condensado del software de un equipo. Consulta las normas de tu región, algunas exigen el formulario `tradicional (en persona) <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-traditional.pdf>`_ o `a distancia <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-remote.pdf>`_, pero otras aceptan formularios personalizados. Consulta con tu socio afiliado o con los jueces si no estás seguro. **No pongas directamente código en tu portafolio, hoja de premio de Control o cuaderno, a los jueces no les importará**. En su lugar, céntrate en explicar los algoritmos clave que utilizas, y explica el software de una manera fácil de entender. Recuerda que es posible que los jueces del premio de Control no sean ingenieros de software o programadores, así que asegúrate de que puedes explicárselo todo a alguien que no tenga conocimientos de software.
zh_cn: 该奖项要求提交一份单独的表格，该表格是团队软件的浓缩摘要。请查看您所在地区的规则，有些地区要求使用 `传统（本人） <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-traditional.pdf>`_或 `远程 <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-remote.pdf>`_表格，但有些地区接受自定义表格。如果您不确定，请咨询您的联盟合作伙伴或裁判。 **不要直接将代码写入作品集、控制奖表或笔记本，评委不会在意** 。相反，请重点解释您使用的关键算法，并以通俗易懂的方式解释软件。请记住，控制奖评委可能不是软件工程师或程序员，因此请确保您能向没有软件背景的人解释一切。
