Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/award-types.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: Be prepared for judges to ask you how your outreaches were meaningful, and try to avoid doing STEM outreaches just for the sake of saying you did a STEM outreach. Successful STEM outreaches are those that are undertaken for a specific purpose and have a clear intent and goal, such as meeting with an expert on computer vision to ask for advice on a vision task for the game. If you are struggling to find STEM outreaches, local colleges and businesses are a good start.
es_mx: Prepárate para que los jueces te pregunten por el significado de tus actividades de divulgación e intenta evitar hacer actividades de divulgación STEM por el mero hecho de decir que las has hecho. Las actividades de divulgación STEM que tienen éxito son las que se llevan a cabo con un propósito específico y tienen una intención y un objetivo claros, como reunirse con un experto en visión por ordenador para pedirle consejo sobre una tarea de visión para el juego. Si te cuesta encontrar actividades de divulgación STEM, las escueles y empresas locales son un buen comienzo.
fr_ca: Préparez-vous à ce que les juges vous demandent en quoi vos activités de sensibilisation ont été utiles, et essayez d'éviter de faire des activités de sensibilisation aux STIM juste pour le plaisir de dire que vous avez fait une activité de sensibilisation aux STIM. Les actions de sensibilisation aux STIM réussies sont celles qui sont entreprises dans un but précis et dont l'intention et l'objectif sont clairs, comme la rencontre avec un expert en vision par ordinateur pour lui demander des conseils sur une tâche de vision pour le jeu. Si vous avez du mal à trouver des activités de sensibilisation aux STIM, les établissements d'enseignement supérieur et les entreprises locales sont un bon point de départ.
ro_ro: Pregătiți-vă ca juriul să vă întrebe în ce fel au fost semnificative acțiunile de promovare și încercați să evitați să faceți acțiuni de promovare STEM doar de dragul de a spune că ați făcut o astfel de acțiune. Activitățile STEM de succes sunt cele care au un scop specific și au o intenție și un obiectiv clar, cum ar fi întâlnirea cu un expert în viziune computerizată pentru a cere sfaturi cu privire la o sarcină de viziune pentru joc. Dacă vă străduiți să găsiți outreach-uri STEM, facultățile și întreprinderile locale sunt un bun început.
ru_ru: Будьте готовы к тому, что эксперты спросят, в чем заключалась значимость вашей работы с сообществом. Старайтесь избегать мероприятий в STEM-сфере только ради того, чтобы отметить их наличие в отчетности. Успешными считаются те STEM-инициативы, которые имеют конкретную цель и четкую задачу — например, консультация со специалистом по компьютерному зрению для получения рекомендаций по решению игровой задачи. Если у вас возникают трудности с поиском STEM-активностей, обратите внимание на местные вузы и компании — это хорошая отправная точка.
zh_cn: 准备好让评委问你的外展有什么意义，尽量避免仅仅为了说你做了STEM外展而做STEM外展。成功的STEM外展是为特定目的进行的，有明确的意图和目标，例如会见计算机视觉专家，就游戏的视觉任务征求建议。如果你很难找到STEM外展，当地的大学和企业是一个好的开始。

source: This judged award is given to the Team that most connects with their local science, technology, engineering, and math (STEM) community. A true *FIRST* team is more than a sum of its parts and recognizes that engaging their local STEM community plays an essential part in their success. The recipient of this award is recognized for helping the community understand *FIRST*, the *FIRST* Tech Challenge, and the Team itself. The Team that wins the Connect Award aggressively seeks and recruits engineers and explores the opportunities available in the world of engineering, science and technology. This Team has a clear Team plan and has identified steps to achieve their goals.
es_mx: Este premio juzgado se otorga al Equipo que más se conecta con su comunidad local de ciencia, tecnología, ingeniería y matemáticas (STEM). Un verdadero equipo *FIRST* es más que la suma de sus partes y reconoce que involucrar a su comunidad local de STEM juega un papel esencial en su éxito. El receptor de este premio es reconocido por ayudar a la comunidad a comprender *FIRST*, el *FIRST* Tech Challenge y el propio Equipo. El Equipo que gana el Premio Connect busca y recluta energéticamente ingenieros y explora las oportunidades disponibles en el mundo de la ingeniería, la ciencia y la tecnología. Este Equipo tiene un plan claro y ha identificado pasos para alcanzar sus objetivos.
fr_ca: Ce prix est décerné à l'équipe qui se rapproche le plus de la communauté locale des sciences, de la technologie, de l'ingénierie et des mathématiques (STIM). Une véritable équipe *FIRST* est plus que la somme de ses parties et reconnaît que l'engagement de la communauté STIM locale joue un rôle essentiel dans sa réussite. Le lauréat de ce prix est reconnu pour avoir aidé la communauté à comprendre *FIRST*, le Défi Techno *FIRST* et l'Équipe elle-même. L'équipe qui remporte le Prix Connexion recherche et recrute activement des ingénieurs et explore les possibilités offertes dans le monde de l'ingénierie, des sciences et de la technologie. Cette Équipe dispose d'un plan d'Équipe clair et a identifié les étapes à suivre pour atteindre ses objectifs.
zh_cn: 该奖项授予与当地科学、技术、工程和数学（STEM）社区联系最紧密的团队。真正的*FIRST*团队不仅仅是各部分的总和，他们认识到与当地 STEM 社区的联系对其成功至关重要。该奖项的获得者因帮助社区了解 *FIRST* 、 *FIRST* 科技挑战赛和团队本身而受到表彰。获得 "连接奖 "的团队会积极寻找和招募工程师，并探索工程、科学和技术领域的机会。该团队有明确的团队计划，并确定了实现目标的步骤。

source: Innovate Award
es_mx: Premio Innovate
fr_ca: Prix Innovation
ro_ro: Premiul Innovate
ru_ru: Награда Инновационное Решение
zh_cn: 创新奖

source: The Innovate award is what it sounds like - it's for teams with innovative robots or robot mechanisms.
es_mx: El premio Innovate es lo que parece: es para equipos con robots o mecanismos innovadores.
fr_ca: Le prix Innovation est ce qu'il semble être - il est destiné aux équipes qui proposent des robots ou des mécanismes robotiques innovants.
zh_cn: 创新奖就是它听起来的样子——它是针对具有创新机器人或机器人机制的团队。

source: The Innovate award is mainly for hardware, but some teams have been able to also present software as innovative. Some judges think it's great to present software as part of innovation, but others feel that software only fits under Control.
es_mx: El premio Innovate se concede principalmente al hardware, pero algunos equipos han conseguido presentar también software como algo innovador. A algunos jueces les parece estupendo presentar software como parte de la innovación, pero otros opinan que el software solo encaja en el premio Control.
fr_ca: Le prix Innovation est principalement destiné au matériel, mais certaines équipes ont réussi à présenter des logiciels comme étant innovants. Certains juges pensent que c'est une bonne chose de présenter des logiciels dans le cadre de l'innovation, mais d'autres estiment que les logiciels ne peuvent être présentés que dans le cadre du contrôle.
zh_cn: 创新奖主要针对硬件，但一些团队也能够将软件展示为创新。一些评委认为展示软件作为创新的一部分很棒，但其他人认为软件只适合控制。

source: While it may be tempting to sell your entire robot as innovative, it is often much more effective to focus on one or two aspects of your robot instead. Judges will often ask what the most innovative part of your robot is, and this is your opportunity to focus in on the one or two mechanisms that you can sell.
es_mx: Aunque puede resultar tentador vender todo el robot como innovador, a menudo es mucho más eficaz centrarse en uno o dos aspectos del mismo. Los jueces suelen preguntar cuál es la parte más innovadora de su robot, y esta es su oportunidad para centrarse en uno o dos mecanismos que puedan vender.
fr_ca: Bien qu'il puisse être tentant de vendre l'ensemble de votre robot comme étant innovant, il est souvent beaucoup plus efficace de se concentrer sur un ou deux aspects de votre robot. Les juges vous demanderont souvent quelle est la partie la plus innovante de votre robot, et c'est l'occasion de vous concentrer sur un ou deux mécanismes que vous pouvez vendre.
ro_ro: Deși ar putea fi tentant să vă referiți la întregul robot ca fiind inovator, este adesea mult mai eficient să vă concentrați asupra unuia sau a două aspecte ale robotului. Jurații vă vor întreba adesea care este cea mai inovatoare parte a robotului dvs. și aceasta este ocazia dvs. de a vă axa pe unul sau două mecanisme pe care le puteți prezenta.
zh_cn: 虽然把你的整个机器人作为创新展示可能很诱人，但专注于机器人的一两个方面通常更有效。评委经常会问你的机器人最具创新性的部分是什么，这是你专注于你可以展示的一两个机制的机会。

source: The engineering portfolio should contain information on your robot's mechanisms, and your presentation should also mention the innovative parts of your robot. However, refrain from over describing the mechanisms you intend to sell as innovative, as you want to leave room for the judges to ask questions, which gives you more opportunities and time to sell your mechanisms. In addition, practice what aspects of the mechanisms you want to sell as innovative, and make sure you are able to thoroughly describe why they are innovative when asked.
es_mx: El portafolio de ingeniería debe contener información sobre los mecanismos de tu robot, y tu presentación también debe mencionar las partes innovadoras de tu robot. Sin embargo, evita describir en exceso los mecanismos que se pretende vender como innovadores, ya que se quiere dejar espacio para que los jueces hagan preguntas, lo que le dará más oportunidades y tiempo para vender sus mecanismos. Además, practica qué aspectos de los mecanismos quieres vender como innovadores, y asegúrate de ser capaz de describir a fondo por qué son innovadores cuando pregunten.
fr_ca: Le dossier technique doit contenir des informations sur les mécanismes de votre robot, et votre présentation doit également mentionner les parties innovantes de votre robot. Toutefois, évitez de trop décrire les mécanismes que vous souhaitez vendre comme étant innovants, car vous voulez laisser aux juges la possibilité de poser des questions, ce qui vous donne plus d'occasions et de temps pour vendre vos mécanismes. En outre, entraînez-vous à décrire les aspects des mécanismes que vous souhaitez vendre comme étant innovants et assurez-vous d'être en mesure d'expliquer en détail pourquoi ils sont innovants lorsqu'on vous le demande.
ro_ro: Portofoliul de inginerie trebuie să conțină informații despre mecanismele robotului, iar prezentarea trebuie să menționeze, de asemenea, părțile inovatoare ale robotului dumneavoastră. Cu toate acestea, abțineți-vă să descrieți prea mult mecanismele pe care intenționați să le prezentați ca fiind inovatoare, deoarece doriți să lăsați loc juriului să pună întrebări, ceea ce vă oferă mai multe oportunități și timp pentru a vă prezenta mecanismele. În plus, analizați ce aspecte ale mecanismelor doriți să le prezentați ca fiind inovatoare și asigurați-vă că sunteți în măsură să descrieți amănunțit de ce sunt inovatoare atunci când sunteți întrebați.
zh_cn: 工程作品集应该包含关于你的机器人机制的信息，你的演讲也应该提到你的机器人的创新部分。但是，不要过度描述你打算展示的机制是创新的，因为你想给评委留下提问的空间，这给了你更多的机会和时间来展示你的机制。此外，练习你想展示的机制的哪些方面是创新的，并确保你能够在被问到时彻底描述它们为什么是创新的。

source: The Innovate Award celebrates a Team that thinks imaginatively and has the ingenuity, creativity, and inventiveness to make their designs come to life. This judged award is given to the Team that has the most innovative and creative Robot design solution to any specific components in the *FIRST* Tech Challenge game. Elements of this award include elegant design, robustness, and 'out of the box' thinking related to design. This award may address the design of the whole Robot or of a sub-assembly attached to the Robot. The creative component must work consistently, but a Robot does not have to work all the time during Matches to be considered for this award. The Team's engineering portfolio must include a summary of the design of the component or components and the Team's Robot to be eligible for this award. Entries must describe how the Team arrived at their solution.
es_mx: El Premio Innovate celebra a un Equipo que piensa de manera imaginativa y tiene el ingenio, creatividad e innovación para dar vida a sus diseños. Este premio juzgado se otorga al Equipo que tiene la solución de diseño de Robot más innovadora y creativa para cualquier componente específico en el juego *FIRST* Tech Challenge. Los elementos de este premio incluyen un diseño elegante, robustez y pensamiento "fuera de lo común" relacionado con el diseño. Este premio puede abordar el diseño del Robot completo o de un subconjunto adjunto al Robot. El componente creativo debe funcionar de manera consistente, pero un Robot no tiene que funcionar todo el tiempo durante los Partidos para ser considerado para este premio. El portafolio de ingeniería del Equipo debe incluir un resumen del diseño del componente o componentes y del Robot del Equipo para ser elegible para este premio. Los segmentos deben describir cómo el Equipo llegó a su solución.
fr_ca: Le prix Inovation récompense une équipe qui fait preuve d'imagination et d'ingéniosité, de créativité et d'inventivité pour donner vie à ses conceptions. Ce prix est décerné à l'équipe qui a proposé la solution de conception de robot la plus innovante et la plus créative pour un composant spécifique du jeu Défi Techno *FIRST* . Les éléments de ce prix comprennent une conception élégante, la robustesse et une réflexion originale sur la conception. Ce prix peut concerner la conception du robot entier ou d'un sous-ensemble fixé au robot. Le composant créatif doit fonctionner en permanence, mais il n'est pas nécessaire que le robot fonctionne tout le temps pendant les matchs pour être pris en considération pour ce prix. Le dossier technique de l'équipe doit comprendre un résumé de la conception du ou des composants et du robot de l'équipe pour être éligible à ce prix. Les candidatures doivent décrire comment l'équipe est parvenue à sa solution.
zh_cn: 创新奖旨在表彰那些具有想象力、聪明才智、创造力和发明创造力，能够将自己的设计变为现实的团队。该评审奖项授予在 *FIRST* 科技挑战赛游戏中针对任何特定组件设计出最具创新性和创造性的机器人设计方案的团队。该奖项的要素包括优雅的设计、坚固性以及与设计相关的 "发散性" 思维。本奖项可针对整个机器人或机器人附属子组件的设计。创造性组件必须持续工作，但机器人不一定要在比赛中一直工作才能获得该奖项。参赛队的工程设计作品集必须包括一个或多个组件和参赛队机器人的设计概要，才有资格获得该奖项。参赛作品必须说明参赛队是如何找到解决方案的。

source: Control Award
es_mx: Premio Control
fr_ca: Prix du contrôle
ro_ro: Premiul Control
ru_ru: Награда Система Управления
zh_cn: 控制奖

source: The Control award is meant to recognize a team that has a good software solution to make their robot "intelligent". It's known as the "software award" and is for the team with the best or most innovative software and sensor solution for the game.
es_mx: El premio Control está destinado a reconocer al equipo que tenga una buena solución de software para hacer que su robot sea "inteligente". Se conoce como el "premio del software" y es para el equipo con la mejor o más innovadora solución de software y sensores para el juego.
fr_ca: Le prix du contrôle est destiné à récompenser une équipe qui dispose d'une bonne solution logicielle pour rendre son robot "intelligent". Il est connu sous le nom de "prix du logiciel" et est destiné à l'équipe qui a la meilleure ou la plus innovante solution logicielle et de capteurs pour le jeu.
zh_cn: 控制奖旨在表彰拥有良好软件解决方案的团队，使他们的机器人“智能”。它同样被称为“软件奖”，是为拥有最佳或最具创新性的比赛软件和传感器解决方案的团队设立的。

source: Don't be tempted to overlook the control award even though it doesn't advance at most competitions. The control award counts for the inspire award, and strong performance in control counts towards inspire ranking.
es_mx: No caigas en la tentación de pasar por alto el premio de Control aunque no avance en la mayoría de las competencias. El premio de Control cuenta para el premio Inspire, y una buena actuación en control cuenta para la clasificación Inspire.
fr_ca: Ne soyez pas tenté de négliger le prix de contrôle, même s'il ne permet pas de progresser dans la plupart des compétitions. Le prix de contrôle compte pour le prix d'inspiration, et une bonne performance au contrôle compte pour le classement d'inspiration.
ru_ru: Не стоит недооценивать Награду Система Управления, даже если эта награда не даёт преимуществ в большинстве соревнований. Награда Система Управления учитывается при присуждении Награды Абсолютный Победитель, а высокие показатели в области управления роботом влияют на позиции в рейтинге Абсолютного Победителя.
zh_cn: 不要被诱惑忽视控制奖，即使它在大多数比赛中没有进步。控制奖计入激励奖，控制方面的强劲表现计入激励排名。

source: This award requires a separate submission sheet which is a condensed summary of a team's software. Check your region's rules, some require `the traditional (in person) <https://web.archive.org/web/20240417142400/https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-traditional.pdf>`_ or `remote <https://web.archive.org/web/20240417142511/https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-remote.pdf>`_ form, but some accept custom forms. Check with your affiliate partner or judges if you are unsure. **Do not directly put code into your portfolio, control award sheet or notebook, the judges will not care**. Instead, focus on explaining key algorithms that you use, and explain the software in an easy to understand way. Remember, your control award judges may not be software engineers or programmers, so make sure you can explain everything to someone without a software background.
fr_ca: Ce prix nécessite une fiche de soumission distincte, qui est un résumé condensé du logiciel d’une équipe. Vérifiez les règles de votre région : certaines exigent le formulaire traditionnel (en personne) <https://web.archive.org/web/20240417142400/https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-traditional.pdf>_ ou à distance <https://web.archive.org/web/20240417142511/https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-remote.pdf>_, tandis que d’autres acceptent des formulaires personnalisés. Consultez votre partenaire affilié ou les juges si vous avez un doute. Ne mettez pas directement le code dans votre portfolio, votre fiche de contrôle ou votre carnet de bord, les juges ne s’en soucieront pas. Concentrez-vous plutôt sur l’explication des algorithmes clés que vous utilisez et présentez le logiciel de manière facile à comprendre. N’oubliez pas que les juges du prix de contrôle ne sont pas nécessairement des ingénieurs en logiciel ou des programmeurs, donc assurez-vous de pouvoir tout expliquer à quelqu’un sans expérience en programmation.

source: In addition, control award software is more then just your autonomous mode programs. Driver assistance, feedback, and automation all are vital to the control award.
es_mx: Además, el software Control Award es mucho más que sus programas de modo autónomo. La asistencia al conductor, la retroalimentación y la automatización son vitales para el premio de Control.
fr_ca: En outre, le prix du Contrôle ne se limite pas aux programmes de mode autonome. L'assistance au conducteur, le retour d'information et l'automatisation sont des éléments essentiels du prix du Contrôle.
ro_ro: În plus, software-ul de atribuire a comenzilor este mai mult decât doar programele de autonomie. Asistența driver-ului, feedback-ul și automatizarea, toate acestea sunt vitale pentru premiul de control.
zh_cn: 此外，控制奖励软件不仅仅是您的自主模式程序。驾驶员辅助、反馈和自动化对于控制奖励都至关重要。

source: The Control Award celebrates a Team that uses sensors and software to increase the Robot's functionality in the field. This award is given to the Team that demonstrates innovative thinking to solve game challenges such as autonomous operation, improving mechanical systems with intelligent control, or using sensors to achieve better results. The control component should work consistently in the field. The Team's engineering portfolio must contain a summary of the software, sensors, and mechanical control, but would likely not include copies of the code itself.
es_mx: El Premio al Control celebra al Equipo que utiliza sensores y software para aumentar la funcionalidad del robot sobre la cancha. Este premio es concedido al equipo que demuestre un pensamiento innovador para resolver los retos del juego, como el funcionamiento del autónomo, la mejora de los sistemas mecánicos con controles inteligente o el uso de sensores para lograr mejores resultados. El componente de control debe funcionar de forma consistente sobre el terreno. El portafolio de ingeniería del equipo debe contener un resumen del software, los sensores y el control mecánico, pero preferentemente no debe incluir copias del código en sí.
fr_ca: Le prix du Contrôle récompense une équipe qui utilise des capteurs et des logiciels pour améliorer les fonctionnalités du robot sur le terrain. Ce prix est décerné à l'équipe qui fait preuve d'un esprit novateur pour relever les défis du jeu, tels que le fonctionnement autonome, l'amélioration des systèmes mécaniques grâce à un contrôle intelligent ou l'utilisation de capteurs pour obtenir de meilleurs résultats. Le composant de contrôle doit fonctionner de manière cohérente sur le terrain. Le dossier d'ingénierie de l'équipe doit contenir un résumé du logiciel, des capteurs et de la commande mécanique, mais n'inclura probablement pas de copies du code lui-même.
zh_cn: 控制奖表彰在比赛中利用传感器和软件来加强机器人功能的队伍。这支队伍展现出控制系统的创新思维，以解决比赛中象是自动性的任务、以高明的控制方式加强机械系统、或利用传感器在比赛中取得更好的成绩。控制物件必须在场地上一致工作。队伍的工程笔记摘要必须包含软件、传感器、及机械控制的摘要，但可以不包括代码的副本。

source: Some examples of control award sheets are:
es_mx: Algunos ejemplos de hojas del premio de Control son:
fr_ca: Voici quelques exemples de fiches du prix du Contrôle :
ro_ro: Câteva exemple de fișe de atribuire a Control Award-ului sunt:
zh_cn: 控制奖励工作表的一些例子是：

source: Motivate Award
es_mx: Premio Motivate
fr_ca: Prix de la motivation
ro_ro: Premiul Motivate
ru_ru: Награда Развитие Сообщества
zh_cn: 激励奖

source: The Motivate Award is one of the two outreach awards. It's for teams that work with their local and *FIRST* community. Unfortunately, the line between the :term:`connect award <Connect Award>` and motivate award can be vague, and most judges don't know how to differentiate which outreach falls under which award.
es_mx: El Premio Motivate es uno de los dos premios de divulgación. Es para equipos que trabajan con su comunidad local y *FIRST*. Desafortunadamente, la línea entre el :termino:`premio Connect<Connect Award>` y el premio Motivate puede ser vaga, y la mayoría de los jueces no saben cómo diferenciar qué divulgación corresponde a cada premio.
fr_ca: Le prix de la Motivation est l'un des deux prix de sensibilisation. Il récompense les équipes qui travaillent avec leur communauté locale et *FIRST*. Malheureusement, la limite entre le :term:`connect award <Connect Award>` et le prix de la Motivation peut être vague, et la plupart des juges ne savent pas comment différencier les activités de sensibilisation qui relèvent de tel ou tel prix.
zh_cn: 激励奖是两个外联奖之一。它针对的是与当地和 *FIRST* 社区合作的团队。遗憾的是，:term:`connect award<Connect Award>`与激励奖之间的界限可能比较模糊，大多数评委不知道如何区分哪些外联活动属于哪个奖项。
