Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/award-types.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: `Team 5795 in 2017 <https://www.youtube.com/watch?v=8gn-URpmXVA>`_
es_mx: `Equipo 5795 en 2017 <https://www.youtube.com/watch?v=8gn-URpmXVA>`_
fr_ca: `Équipe 5795 en 2017 <https://www.youtube.com/watch?v=8gn-URpmXVA>`_
ro_ro: `Echipa 5795 în 2017 <https://www.youtube.com/watch?v=8gn-URpmXVA>``_
ru_ru: `Команда 5795 в 2017 году <https://www.youtube.com/watch?v=8gn-URpmXVA>`_

source: `Team 4924 in 2016 <https://www.youtube.com/watch?v=lYaKEnutiR4>`_
es_mx: `Equipo 4924 en 2016 <https://www.youtube.com/watch?v=lYaKEnutiR4>`_
fr_ca: `Équipe 4924 en 2016 <https://www.youtube.com/watch?v=lYaKEnutiR4>`_
ro_ro: `Echipa 4924 în 2016 <https://www.youtube.com/watch?v=lYaKEnutiR4>`_
ru_ru: `Команда 4924 в 2016 году <https://www.youtube.com/watch?v=lYaKEnutiR4>`_

source: Some good Compass award submissions include:
es_mx: Algunas buenas candidaturas al premio Compass incluyen:
fr_ca: Parmi les bonnes candidatures au prix Compass, on peut citer
ro_ro: Câteva nominalizări bune pentru premiul Compass includ:
zh_cn: 一些优秀的罗盘奖项提交包括：

source: `Team 4855 in 2017 <https://www.youtube.com/watch?v=r3zK2l7K8Fo>`_
es_mx: `Equipo 4855 en 2017 <https://www.youtube.com/watch?v=r3zK2l7K8Fo>`_
fr_ca: `Équipe 4855 en 2017 <https://www.youtube.com/watch?v=r3zK2l7K8Fo>`_
ro_ro: `Echipa 4855 în 2017 <https://www.youtube.com/watch?v=r3zK2l7K8Fo>`_
ru_ru: `Команда 4855 в 2017 году <https://www.youtube.com/watch?v=r3zK2l7K8Fo>`_

source: `Team 3595 in 2017 <https://www.youtube.com/watch?v=EKKaMAcAfXE>`_
es_mx: `Equipo 3595 en 2017 <https://www.youtube.com/watch?v=EKKaMAcAfXE>`_
fr_ca: Équipe 3595 en 2017 <https://www.youtube.com/watch?v=EKKaMAcAfXE>`_
ro_ro: `Echipa 3595 în 2017 <https://www.youtube.com/watch?v=EKKaMAcAfXE>`_
ru_ru: `Команда 3595 в 2017 году <https://www.youtube.com/watch?v=EKKaMAcAfXE>`_

source: `Team 9879 in 2017 <https://www.youtube.com/watch?v=z6M6UYMLujo>`_
es_mx: `Equipo 9879 en 2017 <https://www.youtube.com/watch?v=z6M6UYMLujo>`_
fr_ca: `Équipe 9879 en 2017 <https://www.youtube.com/watch?v=z6M6UYMLujo>`_
ro_ro: `Echipa 9879 în 2017 <https://www.youtube.com/watch?v=z6M6UYMLujo>`_
ru_ru: `Команда 9879 в 2017 году <https://www.youtube.com/watch?v=z6M6UYMLujo>`_

source: `Team 6510 in 2015 <https://www.youtube.com/watch?v=E76ij2H3YF4>`_
es_mx: `Equipo 6510 en 2015 <https://www.youtube.com/watch?v=E76ij2H3YF4>`_
fr_ca: `Équipe 6510 en 2015 <https://www.youtube.com/watch?v=E76ij2H3YF4>`_
ro_ro: `Echipa 6510 în 2015 <https://www.youtube.com/watch?v=E76ij2H3YF4>`_
ru_ru: 'Команда 6510 в 2015 году <https://www.youtube.com/watch?v=E76ij2H3YF4>`_

source: For more information on these awards, take a look at the specific section for each award in |gm1|.
es_mx: Para más información sobre estos premios, consulte la sección específica de cada premio en |gm1|.
fr_ca: Pour plus d'informations sur ces prix, consultez la section spécifique à chaque prix dans |gm1|.
ro_ro: Pentru mai multe informații despre aceste premii, consultați secțiunea specifică pentru fiecare premiu din |gm1|.
ru_ru: Для получения дополнительной информации об этих наградах ознакомьтесь с конкретным разделом, посвященным каждой награде, в |gm1|.
zh_cn: 有关这些奖项的更多信息，请查看游戏手册第1部分中每个奖项的具体部分。

source: There are 7 awards for FTC teams (excluding optional awards). For more information on the exact requirements for these awards, see |gm1|. In order of advancement priority, these are:
ro_ro: Există 7 premii pentru echipele FTC (excluzând premiile opționale). Pentru mai multe informații despre cerințele exacte ale acestor premii, consultați |gm1|. În ordinea priorității de avansare, acestea sunt:

source: This judged award is given to the team that best embodies the ‘challenge’ of the *FIRST*\ |reg| Tech Challenge program. The Team that receives this award is a strong ambassador for *FIRST*\ |reg| programs and a role model *FIRST*\ |reg| Team. This Team is a top contender for many other judged awards and is a gracious competitor. The Inspire Award winner is an inspiration to other Teams, acting with Gracious Professionalism® both on and off the playing field. This Team shares their experiences, enthusiasm and knowledge with other teams, sponsors, their community, and the Judges. Working as a unit, this Team will have shown success in performing the task of designing and building a Robot.
ro_ro: Acest premiu este acordat echipei care întruchipează cel mai bine "provocarea" programului *FIRST*\ |reg| Tech Challenge. Echipa care primește acest premiu este un bun ambasador al programelor *FIRST* |reg| și un model de urmat pentru echipele *FIRST* |reg|. Această echipă este un candidat de top pentru multe alte premii și este un concurent de încredere. Câștigătorul premiului Inspire Award este o sursă de inspirație pentru alte echipe, acționând cu Gracious Professionalism® atât pe terenul de joc, cât și în afara lui. Această echipă își împărtășește experiențele, entuziasmul și cunoștințele cu alte echipe, sponsori, comunitatea lor și cu judecătorii. Lucrând ca o unitate, această echipă va fi demonstrat succes în îndeplinirea sarcinii de proiectare și construcție a unui robot.

source: This judged award is given to the Team that best reflects the journey the Team took as they experienced the engineering design process during the build season. The engineering content within the portfolio is the key reference for judges to help identify the most deserving Team. The Teams engineering content must focus on the design and build stage of the Team’s Robot.
ro_ro: Acest premiu este acordat echipei care reflectă cel mai bine călătoria pe care a parcurs-o echipa de-a lungul procesului de proiectare tehnică în timpul perioadei de construcție. Conținutul legat de inginerie din cadrul portofoliului este punctul cheie pentru juriu în vederea identificării echipei care merită cel mai mult să câștige. Conținutul legat de inginerie al echipei trebuie să se concentreze pe etapa de proiectare și construcție a robotului echipei.

source: This judged award is given to the Team that most connects with their local science, technology, engineering, and math (STEM) community. A true *FIRST*\ |reg| team is more than a sum of its parts and recognizes that engaging their local STEM community plays an essential part in their success. The recipient of this award is recognized for helping the community understand *FIRST*\ |reg|, the *FIRST*\ |reg| Tech Challenge, and the Team itself. The Team that wins the Connect Award aggressively seeks and recruits engineers and explores the opportunities available in the world of engineering, science and technology. This Team has a clear Team plan and has identified steps to achieve their goals.
ro_ro: Acest premiu este acordat echipei care se conectează cel mai bine cu comunitatea locală de știință, tehnologie, inginerie și matematică (STEM). O adevărată echipă *FIRST*\ |reg| este mai mult decât suma părților sale și recunoaște că implicarea comunității locale STEM joacă un rol esențial în succesul său. Beneficiarul acestui premiu este recunoscut pentru că a ajutat comunitatea să înțeleagă *FIRST* |reg|, *FIRST* |reg| Tech Challenge și echipa însăși. Echipa care câștigă premiul Connect caută și recrutează în mod agresiv ingineri și explorează oportunitățile disponibile în lumea ingineriei, științei și tehnologiei. Această echipă are un plan de echipă clar și a identificat pașii pentru a-și atinge obiectivele.

source: The Innovate award is what it sounds like - it’s for teams with innovative robots or robot mechanisms.
ro_ro: Premiul Innovate este ceea ce pare a fi - este destinat echipelor cu roboți sau mecanisme robotice inovatoare.

source: The Innovate award is mainly for hardware, but some teams have been able to also present software as innovative. Some judges think it’s great to present software as part of innovation, but others feel that software only fits under Control.
ro_ro: Premiul Innovate se acordă în principal pentru hardware, dar unele echipe au reușit să prezinte și software-ul ca fiind inovator. Unii jurați consideră că este minunat să prezinți software-ul ca parte a inovației, dar alții consideră că software-ul se încadrează doar în categoria Control.

source: The Innovate Award celebrates a Team that thinks imaginatively and has the ingenuity, creativity, and inventiveness to make their designs come to life. This judged award is given to the Team that has the most innovative and creative Robot design solution to any specific components in the FIRST Tech Challenge game. Elements of this award include elegant design, robustness, and ‘out of the box’ thinking related to design. This award may address the design of the whole Robot or of a sub-assembly attached to the Robot. The creative component must work consistently, but a Robot does not have to work all the time during Matches to be considered for this award. The Team’s engineering portfolio must include a summary of the design of the component or components and the Team’s Robot to be eligible for this award. Entries must describe how the Team arrived at their solution.
ro_ro: Premiul Innovate felicită o echipă care gândește cu imaginație și care are ingeniozitatea, creativitatea și inventivitatea necesare pentru a da viață proiectelor sale. Acest premiu jurizat este acordat echipei care are cea mai inovatoare și creativă soluție de proiectare a robotului pentru orice componentă specifică din jocul FIRST Tech Challenge. Elementele acestui premiu includ designul elegant, duritatea și gândirea "out of the box" legată de design. Acest premiu poate viza proiectarea întregului robot sau a unui subansamblu atașat acestuia. Componenta creativă trebuie să funcționeze în mod constant, dar un Robot nu trebuie să funcționeze tot timpul pe parcursul meciurilor pentru a fi luat în considerare pentru acest premiu. Portofoliul de inginerie al echipei trebuie să includă un rezumat al proiectării componentei sau componentelor și a robotului echipei pentru a fi eligibil pentru acest premiu. Lucrările trebuie să descrie modul în care echipa a ajuns la soluția sa.

source: The Control award is meant to recognize a team that has a good software solution to make their robot "intelligent". It’s known as the "software award" and is for the team with the best or most innovative software and sensor solution for the game.
ro_ro: Premiul Control este menit să recunoască o echipă care are o soluție software bună pentru a-și face robotul "inteligent". Este cunoscut sub numele de "premiul pentru software" și este destinat echipei care are cea mai bună sau cea mai inovatoare soluție legată de software și de senzori pentru joc.

source: Don’t be tempted to overlook the control award even though it doesn’t advance at most competitions. The control award counts for the inspire award, and strong performance in control counts towards inspire ranking.
ro_ro: Nu fiți tentați să treceți cu vederea premiul Control, chiar dacă acesta nu avansează la majoritatea concursurilor. Premiul Control contează pentru premiul Inspire, iar o performanța solidă la Control contează pentru clasamentul Inspire.

source: This award requires a separate submission sheet which is a condensed summary of a team’s software. Check your region's rules, some require `the traditional (in person) <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-traditional.pdf>`_ or `remote <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-remote.pdf>`_ form, but some accept custom forms. Check with your affiliate partner or judges if you are unsure. **Do not directly put code into your portfolio, control award sheet or notebook, the judges will not care**. Instead, focus on explaining key algorithms that you use, and explain the software in an easy to understand way. Remember, your control award judges may not be software engineers or programmers, so make sure you can explain everything to someone without a software background.
ro_ro: Acest premiu necesită o fișă de prezentare separată, care reprezintă un rezumat condensat al software-ului folosit de echipă. Verificați regulile regiunii dumneavoastră, unele necesită `formularul tradițional (în persoană) <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-traditional.pdf>`_ sau `de la distanță <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-award-submission-form-remote.pdf>`_, dar unele acceptă formulare personalizate. Verificați cu partenerul dvs. afiliat sau cu jurații dacă nu sunteți sigur. **Nu puneți codul direct în portofoliul dumneavoastră, în fișa pentru premiul Control sau în caiet, juraților nu le va păsa**. În schimb, concentrați-vă pe explicarea algoritmilor cheie pe care îi utilizați și explicați software-ul într-un mod ușor de înțeles. Nu uitați că este posibil ca cei care jurizează premiul Control să nu fie ingineri de software sau programatori, așa că asigurați-vă că puteți explica totul unei persoane care nu are cunoștințe de software.

source: The Control Award celebrates a Team that uses sensors and software to increase the Robot’s functionality in the field. This award is given to the Team that demonstrates innovative thinking to solve game challenges such as autonomous operation, improving mechanical systems with intelligent control, or using sensors to achieve better results. The control component should work consistently in the field. The Team’s engineering portfolio must contain a summary of the software, sensors, and mechanical control, but would likely not include copies of the code itself.
ro_ro: Premiul Control recompensează o echipă care utilizează senzori și software pentru a spori funcționalitatea robotului pe teren. Acest premiu este acordat echipei care demonstrează o gândire inovatoare pentru a rezolva provocările jocului, cum ar fi funcționarea autonomă, îmbunătățirea sistemelor mecanice cu control inteligent sau utilizarea senzorilor pentru a obține rezultate mai bune. Componenta de control trebuie să funcționeze în mod constant pe teren. Portofoliul de inginerie al echipei trebuie să conțină un rezumat al software-ului, al senzorilor și al controlului mecanic, dar probabil că nu va include copii ale codului propriu-zis.

source: The Motivate Award is one of the two outreach awards. It’s for teams that work with their local and *FIRST*\ |reg| community. Unfortunately, the line between the :term:`connect award <Connect Award>` and motivate award can be vague, and most judges don’t know how to differentiate which outreach falls under which award.
ro_ro: Premiul Motivate este unul dintre cele două premii ce vizează implicarea în comunitate. Este destinat echipelor care colaborează cu comunitatea locală și cu comunitatea locală *FIRST* |reg| . Din păcate, este o diferență vagă între :term:`connect award <Connect Award>` și motivate award, iar majoritatea juraților nu știu cum să stabilească ce activități aparțin fiecărui premiu.

source: This Team embraces the culture of *FIRST*\ |reg| and clearly shows what it means to be a team. This judged award celebrates the Team that represents the essence of the *FIRST*\ |reg| Tech Challenge competition through Gracious Professionalism and general enthusiasm for the overall philosophy of *FIRST*\ |reg| and what it means to be a *FIRST*\ |reg| Tech Challenge Team. This is a Team who makes a collective effort to make *FIRST*\ |reg| known throughout their school and community, and sparks others to embrace the culture of *FIRST*\ |reg|.
ro_ro: Această echipă îmbrățișează cultura *FIRST*\ |reg| și arată clar ce înseamnă să fii o echipă. Acest premiu, acordat de un juriu, felicită echipa care reprezintă esența competiției *FIRST* |reg| Tech Challenge prin Gracious Professionalism și entuziasm general pentru filozofia de ansamblu a *FIRST* |reg| și pentru ceea ce înseamnă să fii o echipă *FIRST* |reg| Tech Challenge . Aceasta este o echipă care depune un efort colectiv pentru a face cunoscută *FIRST* |reg| în școala și în comunitate și îi determină și pe alții să îmbrățișeze cultura *FIRST* |reg|.

source: In order to be considered for the Design Award, it’s recommended that your team uses CAD and designs the robot before it is built, with engineering portfolio sections about the development of the robot through iterations of the engineering design process. Its important to include CAD screenshots and drawings in your portfolio, and your design should be consistent with any team goals listed.
ro_ro: Pentru a fi luată în considerare pentru premiul Design, se recomandă ca echipa dumneavoastră să utilizeze CAD și să proiecteze robotul înainte de a-l construi, cu secțiuni din portofoliul de inginerie despre dezvoltarea robotului prin versiuni ale procesului de proiectare tehnică. Este important să includeți în portofoliu capturi de ecran și desene CAD, iar designul dumneavoastră trebuie să fie în concordanță cu obiectivele echipei enumerate.

source: This judged award recognizes design elements of the Robot that are both functional and aesthetic. The Design Award is presented to Teams that incorporate industrial design elements into their solution. These design elements could simplify the Robot’s appearance by giving it a clean look, be decorative in nature, or otherwise express the creativity of the Team. The Robot should be durable, efficiently designed, and effectively address the game challenge.
ro_ro: Acest premiu este acordat în urma unei jurizări și recunoaște elementele de design ale robotului care sunt atât funcționale, cât și estetice. Premiul Design este acordat echipelor care încorporează elemente de design industrial în soluția lor. Aceste elemente de design ar putea simplifica aspectul robotului, conferindu-i un aspect curat, pot fi de natură decorativă sau pot exprima în alt mod creativitatea echipei. Robotul trebuie să fie durabil, proiectat eficient și să abordeze în mod eficient provocarea jocului.

source: Both outreach awards can be hard to differentiate, as the official descriptions are super vague, and most judges don’t know the difference perfectly. Since the descriptions are very vague, it is up to you to determine what goes towards which award. Oftentimes, teams will put more outreach in :term:`Connect <Connect Award>` than :term:`Motivate <Motivate Award>`, as Connect is fairly high up on the advancement list unlike Motivate, so putting more into Connect and winning Connect may advance, though make sure to do your research before trying a strategy like this.
ro_ro: Ambele premii ce vizează contactul cu comunitatea pot fi greu de diferențiat, deoarece descrierile oficiale sunt foarte vagi, iar cei mai mulți jurați nu cunosc perfect diferența. Deoarece descrierile sunt foarte vagi, depinde de dumneavoastră să stabiliți ce merge către ce premiu. De multe ori, echipele vor pune mai mult outreach în :term:`Connect <Connect Award>` decât în :term:`Motivate <Motivate Award>`, deoarece Connect este destul de sus pe lista de avansare, spre deosebire de Motivate, așa că punând mai mult în Connect și câștigând Connect pot avansa, deși asigurați-vă că faceți cercetări înainte de a încerca o astfel de strategie.

source: Starting/Mentoring *FIRST*\ |reg| Teams
ro_ro: Inițierea / îndrumarea *FIRST*\ |reg| echipelor

source: Present numbers, but only emphasize them if they’re large with a wow factor
ro_ro: Prezentați cifrele, dar puneți-le în evidență doar dacă sunt mari, cu un factor wow

source: For a bigger impact make sure you have more resources then just your team's information at an event, having details for *FIRST*\ |reg| Lego League teams in addition to your *FIRST*\ |reg| Tech Challenge information can broaden how many people you reach.
ro_ro: Pentru un impact mai mare, asigurați-vă că aveți mai multe resurse decât doar informațiile despre echipa dvs. la un eveniment, având detalii pentru echipele *FIRST*\ |reg| Lego League în plus față de informațiile despre *FIRST*\ |reg| Tech Challenge, puteți mări numărul de persoane care sunt interesate.

source: The Judges Choice Award is meant to recognize a team that doesn’t fit into any of the existing award categories, but the judges still felt the team deserved to win an award for their outstanding effort or other experience. This award is very subjective, and doesn’t advance teams. It is also optional to give at every competition, but in some regions given at every competition unless the judges don’t find a deserving team.
ro_ro: Premiul Judges Choice este menit să recompenseze o echipă care nu se încadrează în niciuna dintre categoriile de premii existente, dar juriul a considerat totuși că echipa merită să câștige un premiu pentru efortul lor remarcabil sau pentru alte experiențe. Acest premiu este foarte subiectiv și nu califică echipele la etapa următoare. De asemenea, este opțional să se acorde la fiecare competiție, dar în unele regiuni se acordă la fiecare competiție, cu excepția cazului în care juriul nu găsește o echipă care să îl merite.

source: The Promote and Compass awards are optional awards that are usually given only at state championships and world championships. These awards do not require an engineering notebook to win, but do not advance teams. They are submitted as a video no longer than 1 minute. The Promote award is for creating a PSA for *FIRST*\ |reg| with a specific video prompt. This prompt changes every year, and is found in |gm1|. The Compass award is for recognizing an outstanding mentor. Submitting these awards is usually done on a case-by-case basis, where the event organizer sends teams instructions on how to submit.
ro_ro: Premiile Promote și Compass sunt premii opționale care se acordă, de obicei, doar la campionatele de stat și la campionatele mondiale. Aceste premii nu necesită un caiet tehnic pentru a fi câștigate, dar nu asigură calificarea echipelor. Acestea sunt prezentate sub forma unui videoclip cu o durată maximă de 1 minut. Premiul Promote se acordă pentru crearea unui PSA pentru *FIRST*\ |reg| cu un anumit prompt video. Acest prompt se schimbă în fiecare an și se găsește în |gm1|. Premiul Compass se acordă pentru recunoașterea unui mentor remarcabil. Acordarea acestor premii se face, de obicei, de la caz la caz, organizatorul evenimentului trimițând echipelor instrucțiuni privind înscrierea.
