Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/award-types.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: Award Categories
es_mx: Categorías de Premios
fr_ca: Catégories de prix
ja_jp: 賞のカテゴリー
ro_ro: Categorii de premii
ru_ru: Категории Наград
zh_cn: 奖项类别

source: Advancing Awards
es_mx: Premios que dan Pase
fr_ca: Prix de progression
ro_ro: Premiile Advancing
ru_ru: Продвигающие Награды
zh_cn: 晋级奖

source: There are 7 awards for FTC\ |reg| teams (excluding optional awards). For more information on the exact requirements for these awards, see |gm1|. In order of advancement priority, these are:
es_mx: Hay 7 premios para los equipos de FTC (excluyendo los premios opcionales). Para obtener más información sobre los requisitos exactos de estos premios, consulta |gm1|. En orden de prioridad de avance, estos son:
fr_ca: Il existe 7 prix pour les équipes FTC\ |reg| (à l'exception des prix optionnels). Pour plus d’informations sur les critères exacts de ces prix, consultez |gm1|. Par ordre de priorité d'avancement, ils sont :
ja_jp: FTC｜reg｜チームには7つの賞があります。（オプション賞を除く）これらの賞の正確な要件については、｜gm1｜を参照のしてください。昇格の優先順位は以下の通りです：
ru_ru: Существует 7 наград для команд FTC\ |reg| (за исключением дополнительных наград). Для получения дополнительной информации о точных требованиях к этим наградам смотрите |gm1|. Награды в порядке от самой лучшей к менее престижным:
zh_cn: FTC\ |reg| 团队有 7 个奖项（不包括可选奖项）。有关这些奖项具体要求的详细信息，请参阅 |gm1| 。按晋级优先顺序排列，它们是

source: Inspire Award
es_mx: Premio Inspire
fr_ca: Prix Inspiration
ro_ro: Premiile Inspire
ru_ru: Награда Абсолютный Победитель
zh_cn: 启发奖

source: The Inspire Award is the top award for an FTC team. It is given to a team that consistently rises to the top in other awards categories. It is also (barring host team advancement), the first advancement slot on the advancement list. This means the winner is guaranteed to advance to the next level in most scenarios, unlike the winning alliance captain in some states.
es_mx: El Premio Inspire es el máximo galardón para un equipo de FTC. Se concede a un equipo que se sitúa sistemáticamente en lo más alto en otras categorías de premios. También es (salvo que el equipo anfitrión avance) el primer puesto de la lista de ascenso. Esto significa que el ganador tiene garantizado el avance al siguiente nivel en la mayoría de los casos, a diferencia del capitán de la alianza ganadora en algunos estados.
fr_ca: Le prix d'Inspiration est le prix le plus prestigieux pour une équipe FTC. Il est attribué à une équipe qui se distingue constamment dans les autres catégories de prix. Il représente également (à l'exception de l'avancement de l'équipe hôte) la première place d'avancement sur la liste d'avancement. Cela signifie que le gagnant est garanti de progresser vers le niveau suivant dans la plupart des scénarios, contrairement au capitaine de l'alliance gagnante dans certains états.
ja_jp: Inspire Awardは、FTCで最高の賞です。他の賞のカテゴリーで常に上位にいるチームに与えられる。また、（ホストチームの昇格がない限り）昇格リストの最初の昇格枠でもあります。つまり、州によっては優勝したアライアンス・キャプテンとは異なり、ほとんどのシナリオにおいて、受賞者は次のレベルに進むことが保証されています。
ro_ro: Inspire Award este cel mai important premiu pentru o echipă FTC. Acesta este acordat unei echipe care se situează în mod constant în fruntea altor categorii de premii. Este, de asemenea (cu excepția avansării echipei gazdă), primul loc de avansare de pe listă. Acest lucru înseamnă că echipa câștigătoare este garantată să avanseze în etapa următoare în majoritatea scenariilor, spre deosebire de căpitanul alianței câștigătoare în unele state.
ru_ru: Награда Абсолютный Победитель - это высшая награда для команды FTC. Команда, получившая ее, является главным претендентом на многие другие награды и является благородным соперником. Кроме того, (за исключением продвижения принимающей команды), она занимает первое место в списке достижений. Это означает, что победитель гарантированно переходит на следующий уровень в большинстве сценариев, в отличие от капитана победившего альянса в некоторых регионах.
zh_cn: 启发奖是FTC团队的最高奖项。它授予在其他奖项类别中持续上升到顶部的团队。它也是（除非东道主团队晋级），晋级列表中的第一个晋级位置。这意味着在大多数情况下，获胜者可以保证晋级到下一个级别，这与某些州的获胜联盟队长不同。

source: In order to win the Inspire Award, your team should focus on every other award category, and perform well in the robot game. In the past, the Inspire Award has given much more weight to awards performance, but it seems as if the judges are now taking robot performance into consideration more.
es_mx: Para ganar el Premio Inspire, tu equipo debe centrarse en todas las demás categorías de premios y tener un buen rendimiento en el juego del robot. En el pasado, el Premio Inspire concedía mucha más importancia a la actuación en los premios, pero parece que ahora los jueces tienen más en cuenta el desempeño del robot.
fr_ca: Pour remporter le prix d'Inspiration, votre équipe doit se concentrer sur toutes les autres catégories de prix et bien performer dans le jeu de robot. Par le passé, le prix d'Inspiration accordait beaucoup plus d'importance à la performance dans les catégories de prix, mais il semble que les juges prennent désormais davantage en compte la performance du robot.
ja_jp: Inspire Awardを受賞するためには、チームは他のすべてのカテゴリーの賞にも注力し、ロボットの試合でも良い成績を収める必要があります。以前は、Inspire Awardはアワードのパフォーマンスに重きを置いていましたが、審査員はロボットのパフォーマンスをより考慮するようになったようです。
ro_ro: Pentru a câștiga Inspire Award, echipa ta trebuie să se concentreze pe toate celelalte categorii de premii și să obțină rezultate bune în meciuri. În trecut, Inspire Award a acordat o pondere mult mai mare performanțelor obținute în cadrul altor premii, dar se pare că judecătorii iau acum în considerare mai mult performanța robotului.
zh_cn: 为了赢得激励奖，你的团队应该专注于其他所有奖项类别，并在机器人游戏中表现出色。过去，激励奖对奖项表现的重视程度要高得多，但现在评委似乎更多地考虑机器人的表现。

source: Of all the awards, this one is arguably the most subjective, as it is about how good does a team does overall, including and how much they weigh outreach as compared to robot performance along with documentation.
es_mx: De todos los premios, este es posiblemente el más subjetivo, ya que se trata de lo bien que lo hace un equipo en general, incluyendo el peso que tiene su impacto en comparación con el rendimiento del robot junto con la documentación.
fr_ca: Parmi tous les prix, celui-ci est sans doute le plus subjectif, car il évalue la performance globale d'une équipe, y compris l'importance qu'elle accorde à la sensibilisation par rapport à la performance du robot, ainsi qu'à la qualité de la documentation.
ja_jp: すべての賞の中で、これはおそらく最も主観的なものであり、ロボットのパフォーマンスとドキュメントを比較したアウトリーチを含めて、チームが全体的にどれだけ優れた成果を上げているかを評価する物です。
ro_ro: Dintre toate premiile, acesta este, fără îndoială, cel mai subiectiv, deoarece este vorba despre cât de bine se descurcă o echipă în general, incluzând și cât de mult prețuiește contactul cu comunitatea în comparație cu performanța robotului împreună cu documentația.
ru_ru: Из всех наград эта, пожалуй, самая субъективная, так как она оценивает общие достижения команды, включая то, насколько хорошо она сочетает агитационно-информационную деятельность с выступлением робота на поле, а также документацию.
zh_cn: 在所有奖项中，这个可以说是最主观的，因为它是关于一个团队整体做得有多好，包括与机器人表现和留档相比，他们在多大程度上权衡了外展。

source: Official Game Manual Description
es_mx: Descripción del Manual Oficial del Juego
fr_ca: La Description du Manuel Officiel du Jeu
ja_jp: 公式ゲームマニュアルの説明
ro_ro: Descrierea manualului oficial al jocului
ru_ru: Официальное Описание Правил Игры
zh_cn: 官方游戏手册说明

source: This judged award is given to the team that best embodies the 'challenge' of the *FIRST*\ |reg| Tech Challenge program. The Team that receives this award is a strong ambassador for *FIRST* programs and a role model *FIRST* Team. This Team is a top contender for many other judged awards and is a gracious competitor. The Inspire Award winner is an inspiration to other Teams, acting with Gracious Professionalism\ |reg| both on and off the playing field. This Team shares their experiences, enthusiasm and knowledge with other teams, sponsors, their community, and the Judges. Working as a unit, this Team will have shown success in performing the task of designing and building a Robot.
es_mx: Este premio juzgado se otorga al equipo que mejor representa el 'desafío' del programa *FIRST* Tech Challenge. El equipo que recibe este premio es un fuerte embajador de los programas *FIRST* y un modelo a seguir para el equipo *FIRST*. Este equipo es un fuerte contendiente para muchos otros premios juzgados y es un competidor amable. El ganador del Premio Inspire es una inspiración para otros equipos, actuando con Profesionalismo Amable tanto dentro como fuera del campo de juego. Este equipo comparte sus experiencias, entusiasmo y conocimiento con otros equipos, patrocinadores, su comunidad y los jueces. Trabajando como un equipo, este equipo habrá demostrado éxito al realizar la tarea de diseñar y construir un Robot.
fr_ca: Ce prix, attribué par les juges, est décerné à l'équipe qui incarne le mieux le « challenge » du programme Défi Techno *FIRST*\ |reg|. L'équipe qui reçoit ce prix est un ambassadeur solide des programmes FIRST et un modèle pour les autres équipes *FIRST*. Cette équipe est un concurrent de premier plan pour de nombreux autres prix jugés et est un compétiteur courtois. Le lauréat du prix d'Inspiration est une source d'inspiration pour les autres équipes, agissant avec Gracious Professionalism\ |reg| tant sur le terrain de jeu qu'en dehors. Cette équipe partage ses expériences, son enthousiasme et ses connaissances avec d'autres équipes, sponsors, sa communauté et les juges. Travaillant comme une unité, cette équipe aura démontré du succès dans la conception et la construction d'un robot.
ja_jp: この審査された賞は、*FIRST*｜reg｜Tech・Challenge・Programの「Challenge」を最もよく体現したチームに与えられます。この賞を受賞したチームは、*FIRST*プログラムの強力な大使であり、他の*FIRST*チームの模範です。このチームは、他の多くの審査賞の最有力候補であり、優れた競争相手です。Inspire Award 受賞チームは、他のチームにインスピレーションを与える存在であり、競技場内外でGracious Professionalism｜reg｜（親切なプロフェッショナリズム）を持って行動しています。このチームは、自分たちの経験、熱意、知識を他のチーム、スポンサー、地域社会、審査員と共有する。チーム一丸となって、ロボットの設計と製作に成功した。
zh_cn: 这个评审类奖项颁给最能体现FIRST科技挑战赛项目的“挑战”的队伍。获得这个奖项的队伍是FIRST项目的强有力的推广大使，是一支模范FIRST队伍。这支队伍是许多其他评审类奖项的有力争夺者，也是一个高尚的竞争者。启发奖的获奖者可以启发其他球队，在赛场内外都能表现高尚的专业精神的。这支队伍会向其他队伍、赞助商、他们的社区和评委分享他们的经验、热情和知识。通过团队合作，这支队伍展现了其在设计和建造机器人任务上的成功的一面。

source: Think Award
es_mx: Premio Think
fr_ca: Prix de la Réflexion
ro_ro: Premiul Think
ru_ru: Награда Инженерный Подход
zh_cn: 思维奖

source: The Think Award is based entirely on the |EN| and Engineering Portfolio. In order to have a chance at winning, the |EN| should include as much math and physics as possible, document the entire journey of the robot through iterations, and other documentation of design and game strategy.
es_mx: El premio Think se basa por completo en la |EN| y en el portafolio de ingeniería. Para tener posibilidades de ganar, el |EN| debe incluir tantas matemáticas y física como sea posible, documentar todo el recorrido del robot a través de iteraciones, y otra documentación de diseño y estrategia de juego.
fr_ca: Le prix Rélexion est basé entièrement sur le |EN| et le Portfolio d'Ingénierie. Pour avoir une chance de gagner, le |EN| doit inclure autant de mathématiques et de physique que possible, documenter l'ensemble du parcours du robot à travers les itérations, ainsi que d'autres éléments de documentation concernant la conception et la stratégie de jeu.
ja_jp: Think Award は、EN|とエンジニアリング・ポートフォリオに基づいて選考されます。受賞のチャンスを得るためには、「EN|」にできるだけ多くの数学と物理学を盛り込み、反復を経たロボットの全行程を記録し、設計とゲーム戦略に関するその他の文書を作成する必要があります。
ro_ro: Premiul Think se bazează în întregime pe Portofoliul de Inginerie și pe Caietul Tehnic. Pentru a avea o șansă de câștig, Caietul Tehnic trebuie să includă cât mai multă matematică și fizică, să documenteze întregul parcurs al robotului prin versiuni și alte documente de proiectare și strategie de joc.
ru_ru: Награда Инженерный Подход присуждается исключительно на основе Инженерной Книги |EN| и Инженерного Портфолио. Чтобы иметь шанс на победу, |EN| должен включать как можно больше математики и физики, документировать весь процесс разработки робота через итерации, а также содержать другую информацию по дизайну и игровой стратегии.
zh_cn: 思维奖完全基于工程笔记本和工笔摘要。为了有机会获胜，工程笔记本应该包括尽可能多的数学和物理，记录机器人通过迭代的整个旅程，以及设计和游戏策略的其他文档。

source: In addition, the portfolio should be well laid out and contain information on various non-technical aspects of the team, such as sustainability (recruitment of new team member and mentors), training, outreach (especially the impact of the outreach and what was learned from it), and team structure. While these categories aren't as strictly important as robot documentation, they are generally recommended for a strong engineering portfolio.
es_mx: Además, el portafolio debe estar bien estructurada y contener información sobre diversos aspectos no técnicos del equipo, como la sostenibilidad (reclutamiento de nuevos miembros del equipo y mentores), el entrenamiento, la divulgación (especialmente el impacto de la divulgación y lo que se aprendió de ella) y la estructura del equipo. Aunque estas categorías no son tan estrictamente importantes como la documentación sobre el robot, en general se recomiendan para un sólido portfolio de ingeniería.
fr_ca: De plus, le portfolio doit être bien structuré et contenir des informations sur divers aspects non techniques de l’équipe, tels que la durabilité (recrutement de nouveaux membres et mentors), la formation, la sensibilisation (notamment l’impact des actions de sensibilisation et les leçons tirées), ainsi que la structure de l’équipe. Bien que ces catégories ne soient pas aussi strictement importantes que la documentation sur le robot, elles sont généralement recommandées pour un portfolio d’ingénierie solide.
ja_jp: さらに、ポートフォリオは、よくレイアウトされ、持続可能性（新しいチームメンバーやメンターの採用）、トレーニング、アウトリーチ（特にアウトリーチの影響とそこから学んだこと）、チーム構造など、チームのさまざまな非技術的側面に関する情報が含まれている必要があります。これらのカテゴリーは、ロボットのドキュメントほど厳密には重要ではありませんが、強力なエンジニアリング・ポートフォリオのためには一般的に推奨されます。
ro_ro: În plus, portofoliul ar trebui să fie bine structurat și să conțină informații despre diverse aspecte non-tehnice ale echipei, cum ar fi sustenabilitatea (recrutarea de noi membri ai echipei și mentori), formarea, activitățile de informare (în special impactul acestora și ce s-a învățat din ele) și structura echipei. Deși aceste categorii nu sunt la fel de importante ca documentația robotului, ele sunt în general recomandate pentru un portofoliu ingineresc bine structurat.
ru_ru: Кроме того, портфолио должно быть хорошо организовано и содержать информацию о различных нетехнических аспектах команды, таких как устойчивое развитие (привлечение новых членов команды и наставников), обучение, взаимодействие с сообществом (особенно влияние этого взаимодействия и извлеченные уроки) и структура команды. Хотя эти категории не так строго важны, как документация по роботу, они обычно рекомендуются для сильного инженерного портфолио.
zh_cn: 此外，团队应该布局良好，并包含有关团队各种非技术方面的信息，例如可持续性（招聘新团队成员和导师）、培训、外展（特别是外展的影响以及从中学到的东西）和团队结构。虽然这些类别并不像机器人留档那样严格重要，但通常建议它们用于强大的工笔摘要。

source: This judged award is given to the Team that best reflects the journey the Team took as they experienced the engineering design process during the build season. The engineering content within the portfolio is the key reference for judges to help identify the most deserving Team. The Teams engineering content must focus on the design and build stage of the Team's Robot.
es_mx: Este premio se otorga al equipo que mejor refleje su experiencia en el proceso de diseño durante el periodo de construcción. El contenido de ingeniería del portafolio es la referencia clave para que los jueces ayuden a identificar al equipo más merecedor. El contenido de ingeniería del equipo debe centrarse en la fase de diseño y construcción del robot del equipo.
fr_ca: Ce prix des juges est décerné à l’équipe qui reflète le mieux le parcours qu’elle a suivi en expérimentant le processus de conception technique pendant la saison de construction. Le contenu technique du portfolio est la référence principale pour les juges afin d’identifier l’équipe la plus méritante. Le contenu technique de l’équipe doit se concentrer sur les étapes de conception et de construction du robot.
ja_jp: この賞は、ビルディングシーズン中にエンジニアリング・デザイン・プロセスを経験したチームの歩みを最もよく反映したチームに贈られます。ポートフォリオ内のエンジニアリングコンテンツは、審査員が最もふさわしいチームを特定するための重要な参考資料となります。チームのエンジニアリング・コンテンツは、チームのロボットの設計・製作段階に焦点を当てなければなりません。
zh_cn: 这个评审类奖项将颁发给最能反映出他们赛季期间所经历的工程设计过程等各种“旅程”的队伍。评委将利用检查记录本中的工程单元来选出最有资格得奖的队伍。队伍的工程记录本必须着重在队伍机器人的设计和组装阶段上。

source: The Team must be able to share or provide additional detailed information that is helpful for the judges. This could include descriptions of the underlying science and mathematics of the Robot design and game strategies, the designs, redesigns, successes, and opportunities for improvement. A Team is not a candidate for this award if their portfolio does not include engineering content.
es_mx: El equipo debe ser capaz de compartir o proporcionar información adicional detallada que sea útil para los jueces. Esto podría incluir descripciones de la ciencia y las matemáticas subyacentes en el diseño del Robot y las estrategias de juego, los diseños, los rediseños, los éxitos y las oportunidades de mejora. Un equipo no es candidato a este premio si su portafolio no incluye contenidos de ingeniería.
fr_ca: L'équipe doit être en mesure de partager ou de fournir des informations détaillées supplémentaires utiles aux juges. Il peut s'agir de descriptions de la science et des mathématiques sous-jacentes à la conception du Robot et des stratégies de jeu, des conceptions, des reconceptions, des réussites et des possibilités d'amélioration. Une équipe n'est pas candidate à ce prix si son dossier ne contient pas de contenu technique.
ja_jp: チームは、審査員にとって有益な詳細情報を共有または提供できなければなりません。これには、ロボット設計の基礎となる科学と数学、ゲーム戦略、設計、再設計、成功、改善の機会についての説明が含まれます。ポートフォリオに工学的な内容が含まれていないチームは、この賞の候補とはなりません。
ro_ro: Echipa trebuie să fie capabilă să împărtășească sau să furnizeze informații suplimentare detaliate care să fie utile pentru juriu. Acestea ar putea include descrieri ale științei și matematicii care stau la baza proiectării robotului și a strategiilor de joc, ale proiectelor, reproiectărilor, succeselor și oportunităților de îmbunătățire. O echipă nu este candidată pentru acest premiu dacă portofoliul său nu include conținut legat de ingineria robotului.
zh_cn: 队伍必须能分享和提供对评委有帮助的更多细节信息。这些信息包括机器人设计和比赛策略、设计、重新设计、成功的案例。如果队伍尚未完成工程笔记摘要的工程部分，则该队伍将不得角逐本奖项。

source: Connect Award
es_mx: Premio Connect
fr_ca: Prix Connexion
ro_ro: Premiul Connect
ru_ru: Награда Установление Научных Связей
zh_cn: 联结奖

source: The Connect Award is one of the two outreach awards. This award is for teams that work with their local STEM community and corporate community. Unfortunately, the line between the Connect and Motivate award can be vague, and judges may not differentiate which outreach falls under which award.
es_mx: El premio Connect es uno de los dos premios de divulgación. Este premio se concede a los equipos que trabajan con la comunidad STEM local y la comunidad empresarial. Por desgracia, la línea que separa los premios Connect y Motivate puede ser imprecisa, y los jueces pueden no diferenciar qué actividades de divulgación corresponden a cada premio.
fr_ca: Le Prix Connexion est l'un des deux prix de sensibilisation. Il récompense les équipes qui travaillent avec la communauté STIM locale et les entreprises. Malheureusement, la ligne de démarcation entre le prix Connexion et le prix Motivation peut être vague, et les juges peuvent ne pas différencier les activités de sensibilisation qui relèvent de tel ou tel prix.
ro_ro: Premiul Connect Award este unul dintre cele două premii de popularizare. Acest premiu se acordă echipelor care lucrează cu comunitatea locală STEM și cu comunitatea corporatistă. Din păcate, linia de separare între premiul Connect și premiul Motivate poate fi vagă, iar juriul poate să nu facă diferența între ce activități de promovare se încadrează în fiecare premiu.
ru_ru: Награда Установление Научных Связей является одной из двух наград за работу с сообществом в FIRST Tech Challenge. Она присуждается командам, которые активно взаимодействуют с научно-техническим сообществом и коммерческими организациями в своем регионе. Следует отметить, что различие между наградами Установление Научных Связей и Развитие Сообщества может быть неочевидным. Это иногда приводит к сложностям при оценке, когда экспертам требуется определить, к какой из этих двух номинаций следует отнести конкретную социальную инициативу команды.
zh_cn: 联结奖是两个外展奖之一。该奖项授予与当地STEM社区和企业社区合作的团队。不幸的是，连接奖和激励奖之间的界限可能很模糊，评委可能无法区分哪些外展属于哪个奖项。

source: Look at the section about differentiating connect and motivate for more advice on this. For both outreach awards, a Team Plan is required. Refer to the section about writing a team plan for advice.
es_mx: Consulte la sección sobre la diferencia entre el Connect y el Motivate para obtener más consejos al respecto. Para ambos premios de divulgación se requiere un plan de equipo. Consulta la sección sobre cómo redactar un plan de equipo para obtener más consejos.
fr_ca: Pour plus de conseils à ce sujet, reportez-vous à la section relative à la distinction entre connecter et motiver. Pour les deux prix de sensibilisation, un Plan d'Équipe est nécessaire. Reportez-vous à la section sur la rédaction d'un plan d'équipe pour obtenir des conseils.
ro_ro: Pentru mai multe sfaturi în acest sens, consultați secțiunea referitoare la diferențierea interacțiunii și a motivării. Pentru ambele premii de popularizare, este necesar un plan de echipă. Consultați secțiunea despre redactarea unui plan de echipă pentru sfaturi.
ru_ru: Для получения дополнительных рекомендаций по разграничению критериев наград Установление Научных Связей и Развитие Сообщества обратитесь к соответствующему разделу руководства. Для участия в обеих номинациях за работу с сообществом команда обязана предоставить План Работы Команды. Требования к его составлению подробно изложены в разделе, посвященном разработке таких планов.
zh_cn: 查看有关区分连接和激励的部分，以获取更多相关建议。对于两个外展奖项，都需要团队计划。请参阅有关编写团队计划的部分以获取建议。

source: A portfolio is also required for this award, and should contain descriptions of the outreach as well as what the team gained from the outreach. In addition, the portfolio should also contain information on plans for recruitment of mentors as well as how the team plans to meaningfully develop their STEM connections.
es_mx: También se requiere un portafolio para este premio, que debe contener descripciones de las actividades de divulgación, así como lo que el equipo obtuvo de las mismas. Además, la carpeta también debe contener información sobre los planes para la contratación de mentores, así como la forma en que el equipo planea desarrollar significativamente sus conexiones STEM.
fr_ca: Un portfolio est également requis pour ce prix et doit contenir des descriptions de la sensibilisation ainsi que ce que l'équipe a retiré de cette sensibilisation. En outre, le dossier doit aussi contenir des informations sur les plans de recrutement de mentors ainsi que sur la manière dont l'équipe prévoit de développer de manière significative ses relations dans le domaine des STIM.
ro_ro: De asemenea, pentru acest premiu va fi necesar un portofoliu, care trebuie să conțină descrieri ale activităților de informare, precum și ce a obținut echipa în urma acestora. În plus, portofoliul ar trebui să conțină și informații despre planurile de recrutare a mentorilor, precum și despre modul în care echipa intenționează să își dezvolte în mod semnificativ legăturile STEM.
ru_ru: Для этой награды также требуется портфолио, которое должно содержать описание работы с сообществом, а также то, что команда получила от этой работы. Кроме того, в портфолио должна быть информация о планах по привлечению наставников, а также о том, как команда планирует значимо развивать свои STEM-связи.
zh_cn: 该奖项还需要一个工笔摘要，并应包含对外联的描述以及团队从外联中获得的收获。此外，工笔摘要还应包含有关招聘导师计划以及团队计划如何有意义地发展其STEM联系的信息。
