Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/award-types.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: The key aspects to include in your portfolio and presentation for motivate is showing how all team members contribute to the success of the team, how your team is recruiting members from non-stem areas, as well as plans for fundraising, funding, sustainability, and recruitment.
es_mx: Los aspectos clave que debes incluir en tu portafolio y presentación para el Motivate es mostrar cómo todos los miembros del equipo contribuyen al éxito del mismo, cómo tu equipo está reclutando miembros de áreas no STEM, así como planes de recaudación de fondos, financiación, sostenibilidad y reclutamiento.
fr_ca: Les aspects clés à inclure dans votre portfolio et votre présentation pour la motivation sont de montrer comment tous les membres de l'équipe contribuent au succès de l'équipe, comment votre équipe recrute des membres issus de domaines non techniques, ainsi que des plans pour la collecte de fonds, le financement, la durabilité et le recrutement.
ro_ro: Aspectele cheie pe care trebuie să le includeți în portofoliu și în prezentarea pentru Motivate este să arătați modul în care toți membrii echipei contribuie la succesul echipei, modul în care echipa dumneavoastră recrutează membri din alte domenii decât cel de bază, precum și planurile de strângere de fonduri, finanțare, durabilitate și recrutare.
zh_cn: 在你的工笔摘要和演示中，激励的关键方面是展示所有团队成员如何为团队的成功做出贡献，你的团队如何从非干领域招募成员，以及筹款、融资、可持续性和招聘计划。

source: This Team embraces the culture of *FIRST* and clearly shows what it means to be a team. This judged award celebrates the Team that represents the essence of the *FIRST* Tech Challenge competition through Gracious Professionalism and general enthusiasm for the overall philosophy of *FIRST* and what it means to be a *FIRST* Tech Challenge Team. This is a Team who makes a collective effort to make *FIRST* known throughout their school and community, and sparks others to embrace the culture of *FIRST*.
es_mx: Este equipo abraza la cultura de *FIRST* y muestra claramente lo que significa ser un equipo. Este premio juzgado celebra al equipo que representa la esencia de la competencia *FIRST* Tech Challenge a través de la Profesionalidad Graciosa y el entusiasmo general por la filosofía global de *FIRST* y lo que significa ser un equipo *FIRST* Tech Challenge. Este es un equipo que hace un esfuerzo colectivo para dar a conocer *FIRST* en su escuela y comunidad, e inspira a otros a abrazar la cultura de *FIRST*.
fr_ca: Cette équipe adhère à la culture de *FIRST* et montre clairement ce que signifie être une équipe. Ce prix récompense l'équipe qui représente l'essence du Défi Techno *FIRST* par son professionnalisme coopératif et son enthousiasme général pour la philosophie globale de *FIRST* et ce que signifie être une équipe du Défi Techno *FIRST*. Il s'agit d'une équipe qui fait un effort collectif pour faire connaître *FIRST* dans son école et sa communauté, et qui incite les autres à adopter la culture de *FIRST*.
zh_cn: 该团队接受了 *FIRST* 的文化，并清楚地展示了团队的意义。该评审奖项旨在表彰通过亲切的专业精神和对 *FIRST* 整体理念的普遍热情，以及作为*FIRST*技术挑战赛团队的意义，代表 *FIRST* 技术挑战赛精髓的团队。该团队通过集体努力，让 *FIRST* 在学校和社区广为人知，并带动其他人接受 *FIRST* 文化。

source: Design Award
es_mx: Premio Desing
fr_ca: Prix du design
ro_ro: Premiul Design
ru_ru: Награда Дизайн
zh_cn: 设计奖

source: The Design Award is one of the robot awards that primarily focuses on the hardware aspect of the robot. It is for robots that are both functional, aesthetic, and use good design practices, including CAD.
es_mx: El Premio Desing es uno de los premios para robots que se centra principalmente en el aspecto hardware del robot. Se concede a robots funcionales, estéticos y que utilicen buenas prácticas de diseño, incluido el CAD.
fr_ca: Le prix du design est l'un des prix décernés aux robots qui se concentre principalement sur l'aspect matériel du robot. Il récompense les robots qui sont à la fois fonctionnels et esthétiques et qui utilisent de bonnes pratiques de conception, y compris la CAD.
ro_ro: Premiul Design este unul dintre premiile pentru roboți care se concentrează în primul rând pe aspectul hardware al robotului. Acesta este destinat roboților care sunt atât funcționali, cât și estetici și care utilizează bune practici de proiectare, inclusiv CAD.
zh_cn: 设计奖是主要关注机器人硬件方面的机器人奖项之一。它适用于功能性、美观性和使用良好设计实践（包括CAD）的机器人。

source: In order to be considered for the Design Award, it's recommended that your team uses CAD and designs the robot before it is built, with engineering portfolio sections about the development of the robot through iterations of the engineering design process. Its important to include CAD screenshots and drawings in your portfolio, and your design should be consistent with any team goals listed.
es_mx: Para optar al premio Desing, se recomienda que el equipo utilice CAD y diseñe el robot antes de construirlo, con secciones del portafolio de ingeniería sobre el desarrollo del robot a través de iteraciones del proceso de diseño de ingeniería. Es importante incluir capturas de pantalla y dibujos de CAD en el portafolio, y el diseño debe ser coherente con los objetivos del equipo.
fr_ca: Afin d'être pris en considération pour le prix du design, il est recommandé que votre équipe utilise la CAD et conçoive le robot avant qu'il ne soit construit, avec des sections de portfolio d'ingénierie sur le développement du robot à travers les itérations du processus de conception d'ingénierie. Il est important d'inclure des captures d'écran et des dessins de CAD dans votre dossier et votre conception doit être cohérente avec les objectifs de l'équipe.
zh_cn: 为了被考虑获得设计奖，建议您的团队使用计算机辅助设计并在机器人建造前对其进行设计，并通过工程设计过程的迭代对机器人的开发进行工笔摘要部分。在您的作品集中包含计算机辅助设计屏幕截图和图纸很重要，您的设计应与列出的任何团队目标保持一致。

source: While functionality is what most teams focus on, the Design Award also takes into account aesthetics, and most judges will generally be turned off by an ugly robot for this award (no cardboard on the robot!), so make sure your robot looks presentable.
es_mx: Aunque la mayoría de los equipos se centran en la funcionalidad, el premio al diseño también tiene en cuenta la estética, y a la mayoría de los jueces no les suele gustar un robot feo para este premio (¡sin cartón en el robot!), así que asegúrate de que tu robot tenga un aspecto presentable.
fr_ca: La plupart des équipes se concentrent sur la fonctionnalité, mais le prix du design tient également compte de l'esthétique. La plupart des juges seront généralement rebutés par un robot laid pour ce prix (pas de carton sur le robot !), alors assurez-vous que votre robot est présentable.
ro_ro: În timp ce majoritatea echipelor se concentrează pe funcționalitate, Premiul Design ia în considerare și aspectul estetic, iar majoritatea juraților vor fi, în general, descurajați de un robot urât pentru acest premiu (fără carton pe robot!), așa că asigurați-vă că robotul dvs. arată prezentabil.
zh_cn: 虽然功能是大多数团队关注的，但设计奖也考虑了美学，大多数评委通常会被这个奖项的丑陋机器人拒之门外（机器人上没有纸板！），所以确保你的机器人看起来像样。

source: This judged award recognizes design elements of the Robot that are both functional and aesthetic. The Design Award is presented to Teams that incorporate industrial design elements into their solution. These design elements could simplify the Robot's appearance by giving it a clean look, be decorative in nature, or otherwise express the creativity of the Team. The Robot should be durable, efficiently designed, and effectively address the game challenge.
es_mx: Este premio reconoce los elementos de diseño del robot que son tanto funcionales como estéticos. El premio Design se concede a los equipos que incorporan elementos de diseño industrial a su solución. Estos elementos de diseño pueden simplificar la apariencia del Robot dándole un aspecto limpio, ser de naturaleza decorativa o expresar de otro modo la creatividad del equipo. El robot debe ser duradero, tener un diseño eficiente y abordar eficazmente el desafío del juego.
fr_ca: Ce prix récompense les éléments de conception du robot qui sont à la fois fonctionnels et esthétiques. Le prix du design est décerné aux équipes qui intègrent des éléments de design industriel dans leur solution. Ces éléments peuvent simplifier l'apparence du robot en lui donnant un aspect propre, être de nature décorative ou exprimer la créativité de l'équipe. Le robot doit être durable, bien conçu et répondre efficacement au défi du jeu.
zh_cn: 该奖项旨在表彰机器人的功能融合美学设计元素。设计奖颁发给将工业设计元素纳入其解决方案的队伍。这些设计元素可以简化机器人的外观，具有自然装饰性或表达队伍的创造力，使其外观简洁且耐用，进而有效的在比赛场上发挥作用和执行任务。

source: Connect vs Motivate
fr_ca: Connecter vs Motiver
ro_ro: Premiile Connect vs Motivate
ru_ru: Награда Установление Научных Связей vs Награда Развитие Сообщества
zh_cn: 联结vs激励

source: Both outreach awards can be hard to differentiate, as the official descriptions are super vague, and most judges don't know the difference perfectly. Since the descriptions are very vague, it is up to you to determine what goes towards which award. Oftentimes, teams will put more outreach in :term:`Connect <Connect Award>` than :term:`Motivate <Motivate Award>`, as Connect is fairly high up on the advancement list unlike Motivate, so putting more into Connect and winning Connect may advance, though make sure to do your research before trying a strategy like this.
es_mx: Ambos premios de divulgación pueden ser difíciles de diferenciar, ya que las descripciones oficiales son muy vagas y la mayoría de los jueces no conocen perfectamente la diferencia. Dado que las descripciones son muy vagas, te corresponde a ti determinar qué corresponde a cada premio. A menudo, los equipos ponen más alcance en :term:`Connect <Connect Award>` que en :term:`Motivate <Motivate Award>`, ya que el Connect está bastante arriba en la lista de avance a diferencia del Motivate, por lo que poner más en Connect y ganar Connect puede avanzar, aunque asegúrate de hacer tu investigación antes de intentar una estrategia como esta.
fr_ca: Les deux prix de sensibilisation peuvent être difficiles à différencier, car les descriptions officielles sont très vagues et la plupart des juges ne connaissent pas parfaitement la différence. Comme les descriptions sont très vagues, c'est à vous de déterminer ce qui est pris en compte pour chaque prix. Souvent, les équipes mettent plus d'efforts dans :term:`Connection <Connect Award>` que dans :term:`Motivation <Motivate Award>`, car le prix Connexion est assez haut sur la liste d'avancement contrairement au prix Motivation, donc mettre plus dans la connexion et gagner le prix Connexion peut faire avancer, mais assurez-vous de faire vos recherches avant d'essayer une stratégie comme celle-ci.
zh_cn: 这两个外联奖项可能很难区分，因为官方的描述非常模糊，大多数评委并不完全清楚其中的区别。由于描述非常含糊，因此要由您来决定哪些内容可以获得哪个奖项。通常，参赛队会在:term:`Connect <Connect Award>`中投入更多的外联活动，而不是:term:`Motivate <Motivate Award>`，因为 "Connect "在晋级名单上的排名与 "Motivate "不同，"Connect "在晋级名单上的排名相当靠前，因此，在 "Connect "中投入更多并赢得 "Connect "的参赛队可能会晋级。

source: What Falls Under Connect?
es_mx: ¿Qué Entra Dentro del Connect?
fr_ca: Qu'est-ce qui relève de Connexion ?
ro_ro: Ce se încadrează la Connect?
zh_cn: 什么属于Connect？

source: Developing relationships with companies
es_mx: Desarrollar relaciones con las empresas
fr_ca: Développer les relations avec les entreprises
ro_ro: Dezvoltarea relațiilor cu companiile
ru_ru: Развитие отношений с компаниями
zh_cn: 发展与公司的关系

source: Getting external mentors (not parents)
es_mx: Conseguir mentores externos (no padres)
fr_ca: Trouver des mentors externes (pas des parents)
ro_ro: Obținerea de mentori externi (nu părinți)
zh_cn: 聘请外部导师（不能是父母）

source: Fundraising from companies (other methods may fall under motivate on a case by case basis)
es_mx: Recaudación de fondos de empresas (otros métodos pueden entrar en el Motivate en función de cada caso)
fr_ca: Collecte de fonds auprès d'entreprises (d'autres méthodes peuvent être motivées au cas par cas)
ro_ro: Strângerea de fonduri de la companii (alte metode pot fi încadrate la Motivate de la caz la caz)
zh_cn: 从公司筹集资金（其他方法可能根据具体情况属于激励）

source: What Falls Under Motivate?
es_mx: ¿Qué se Incluye en el Motivate?
fr_ca: Qu'est-ce qui relève de la motivation ?
ro_ro: Ce se încadrează la Motivare?
zh_cn: 什么是Motivate？

source: Starting/Mentoring *FIRST* Teams
es_mx: Iniciando/Mentoreando equipos *FIRST*
fr_ca: Création/encadrement d'équipes *FIRST
zh_cn: 启动/指导 *FIRST* 团队

source: Community Demos
es_mx: Demostración a la Comunidad
fr_ca: Démonstrations communautaires
ro_ro: Demo-uri comunitare
zh_cn: 社区演示

source: Tips for Both
es_mx: Consejos para Ambos
fr_ca: Conseils pour les deux
ro_ro: Sfaturi pentru ambele
zh_cn: 两方面的提示

source: Present numbers, but only emphasize them if they're large with a wow factor
es_mx: Presentar cifras, pero sólo destacarlas si son grandes con un factor sorpresa
fr_ca: Présentez des chiffres, mais ne les mettez en valeur que s'ils sont importants et qu'ils font sensation.
zh_cn: 展示数字，但只有在它们很大且有令人惊叹的因素时才强调它们

source: Make sure your numbers are somewhat accurate! If you are at a large event, you can get a rough headcount from the organizers, but its generally better to know roughly how many people actually stopped and looked at your team.
es_mx: Asegúrate de que tus cifras sean exactas. Si se trata de un acto multitudinario, los organizadores pueden facilitarte un recuento aproximado, pero en general es mejor saber cuántas personas se han parado a mirar a tu equipo.
fr_ca: Veillez à ce que vos chiffres soient assez précis ! Si vous participez à un grand événement, vous pouvez obtenir un décompte approximatif de la part des organisateurs, mais il est généralement préférable de savoir approximativement combien de personnes se sont arrêtées et ont regardé votre équipe.
ro_ro: Asigurați-vă că cifrele dvs. sunt cât mai exacte! Dacă participați la un eveniment de amploare, puteți obține o estimare aproximativă de la organizatori, dar, în general, este mai bine să știți cu aproximație câte persoane s-au oprit și s-au uitat la echipa dumneavoastră.
zh_cn: 确保你的数字有些准确！如果你参加了一个大型活动，你可以从组织者那里得到一个粗略的人数统计，但是通常最好知道大约有多少人真正停下来看着你的团队。

source: Present stories to the judges, not just overviews. Tell personal stories.
es_mx: Presenta historias a los jueces, no sólo resúmenes. Cuenta historias personales.
fr_ca: Présentez des histoires aux juges, pas seulement des aperçus. Racontez des histoires personnelles.
ro_ro: Prezentați judecătorilor povești, nu doar prezentări generale. Spuneți povești personale.
zh_cn: 向评委展示故事，而不仅仅是概述。讲述个人故事。

source: Log all your outreach events, with who went and how many hours each person did in its own place separate from the engineering notebook. This makes it easier to compile total numbers and shows the judges every outreach activity/event in one place.
es_mx: Registra todos tus eventos de divulgación, con quién fue y cuántas horas hizo cada persona en un lugar propio separado del Engineering Notebook. Esto facilita la recopilación de las cifras totales y muestra a los jueces todas las actividades/eventos de divulgación en un mismo lugar.
fr_ca: Enregistrez tous vos événements de sensibilisation, avec les noms des participants et le nombre d'heures consacrées par chaque personne, dans un endroit distinct du carnet d'ingénierie. Il est ainsi plus facile de compiler les chiffres totaux et de montrer aux juges chaque activité/événement de sensibilisation en un seul endroit.
ro_ro: Înregistrați toate evenimentele de informare, cu precizarea persoanelor care au participat și câte ore a făcut fiecare persoană, într-un loc separat de caietul tehnic. Acest lucru facilitează compilarea cifrelor totale și arată judecătorilor fiecare activitate/eveniment de informare într-un singur loc.
zh_cn: 记录你所有的外展活动，与谁一起去，每个人在自己的地方做了多少小时，与工程笔记本分开。这使得汇编总数变得更加容易，并在一个地方向评委展示每个外展活动/事件。

source: For a bigger impact make sure you have more resources then just your team's information at an event, having details for *FIRST* Lego League teams in addition to your *FIRST* Tech Challenge information can broaden how many people you reach.
es_mx: Para tener un impacto mayor, asegúrate de tener más recursos además de la información de tu equipo en un evento, tener detalles de los equipos de *FIRST* Lego League además de tu información de *FIRST* Tech Challenge puede ampliar la cantidad de personas a las que llegas.
fr_ca: Pour un impact plus important, assurez-vous de disposer de plus de ressources que les seules informations relatives à votre équipe lors d'un événement. Le fait d'avoir des informations sur les équipes de la ligue lego *FIRST* en plus de vos informations sur le Défi Techno *FIRST* peut permettre d'élargir le nombre de personnes que vous atteignez.
zh_cn: 为了扩大影响，请确保在活动中提供更多的资源，而不仅仅是你的团队信息，除了 *FIRST* 科技挑战赛的信息外，还有 *FIRST* 乐高联盟团队的详细信息，这可以扩大你的影响范围。

source: Follow up, follow up, follow up! If a person gives you a business card or a student expresses interest, it doesn't hurt to follow up if they don't reach out as promised. People can forget or get busy, sometimes a reminder is useful!
es_mx: ¡Seguimiento, seguimiento, seguimiento! Si una persona te da una tarjeta de visita o un estudiante muestra interés, no está de más hacer un seguimiento si no se ponen en contacto como prometieron. La gente puede olvidarse o estar ocupada, así que a veces es útil un recordatorio.
fr_ca: Suivez, suivez, suivez ! Si une personne vous donne une carte de visite ou si un étudiant exprime son intérêt, il n'est pas inutile de faire un suivi si la personne n'a pas pris contact avec vous comme elle l'avait promis. Les gens peuvent oublier ou être occupés, un rappel est parfois utile !
ro_ro: Urmăriți, urmăriți, urmăriți! Dacă o persoană vă dă o carte de vizită sau un student își exprimă interesul, nu strică să continuați dacă nu vă contactează așa cum a promis. Oamenii pot uita sau pot fi ocupați, uneori un memento este util!
zh_cn: 跟进，跟进，跟进！如果一个人给你名片或学生表示感兴趣，如果他们没有如约伸出手，跟进也无妨。人们可以忘记或忙碌，有时提醒是有用的！

source: Optional Awards
es_mx: Premios Opcionales
fr_ca: Prix optionnels
ro_ro: Premii opționale
ru_ru: Необязательные Награды
zh_cn: 可选奖项

source: There are some awards that events are not required to present; these do not advance teams.
es_mx: Hay algunos premios que en los eventos no están obligados a presentar; estos no hacen avanzar a los equipos.
fr_ca: Certaines récompenses ne doivent pas être remises lors des événements ; elles ne font pas progresser les équipes.
ro_ro: Există unele premii pe care evenimentele nu sunt obligate să le prezinte; aceste premii nu fac ca echipele să avanseze.
ru_ru: Есть некоторые награды, которые не обязательно вручать на соревнованиях; они не продвигают команды вперед.
zh_cn: 有些奖项是活动不需要颁发的；这些不会推进团队。

source: Judges Choice Award
es_mx: Premio Judges Choice
fr_ca: Prix des juges
ro_ro: Premiul Judges Choice
ru_ru: Награда Выбор Экспертов
zh_cn: 评审奖

source: The Judges Choice Award is meant to recognize a team that doesn't fit into any of the existing award categories, but the judges still felt the team deserved to win an award for their outstanding effort or other experience. This award is very subjective, and doesn't advance teams. It is also optional to give at every competition, but in some regions given at every competition unless the judges don't find a deserving team.
es_mx: El Judges Choices es un reconocimiento a un equipo que no encaja en ninguna de las categorías de premios existentes, pero que los jueces consideran que merece ganar un premio por su extraordinario esfuerzo u otra experiencia. Este premio es muy subjetivo y no hace progresar a los equipos. También es opcional otorgarlo en todas las competiciones, pero en algunas regiones se otorga en todas las competiciones a menos que los jueces no encuentren un equipo merecedor.
fr_ca: Le prix des juges est destiné à récompenser une équipe qui n'entre dans aucune des catégories de prix existantes, mais dont les juges ont estimé qu'elle méritait de recevoir un prix pour son effort exceptionnel ou pour une autre expérience. Ce prix est très subjectif et ne fait pas progresser les équipes. Il est également facultatif de le décerner à chaque compétition, mais dans certaines régions, il est décerné à chaque compétition, à moins que les juges ne trouvent pas d'équipe méritante.
zh_cn: 评委选择奖旨在表彰一个不适合任何现有奖项类别的团队，但评委仍然认为该团队应该因其杰出的努力或其他经验而获奖。这个奖项非常主观，不会提升团队。在每场比赛中给予也是可选的，但在某些地区，除非评委没有找到一个值得的团队。

source: Promote Award and Compass Award
es_mx: Premio Promote y Premio Compass
fr_ca: Prix Promotion et Prix Compass
ro_ro: Premiul Promote și Premiul Compass
zh_cn: 促进奖和指南针奖

source: The Promote and Compass awards are optional awards that are usually given only at state championships and world championships. These awards do not require an engineering notebook to win, but do not advance teams. They are submitted as a video no longer than 1 minute. The Promote award is for creating a PSA for *FIRST* with a specific video prompt. This prompt changes every year, and is found in |gm1|. The Compass award is for recognizing an outstanding mentor. Submitting these awards is usually done on a case-by-case basis, where the event organizer sends teams instructions on how to submit.
es_mx: Los premios Promote y Compass son premios opcionales que generalmente se otorgan solo en los campeonatos estatales y mundiales. Estos premios no requieren un cuaderno de ingeniería para ganar, pero no hacen avanzar a los equipos. Se envían como un video de no más de 1 minuto. El premio Promote es para crear un Anuncio de Servicio Público para *FIRST* con una indicación de video específica. Esta indicación cambia cada año y se encuentra en |gm1|. El premio Compass es para reconocer a un mentor sobresaliente. La presentación de estos premios generalmente se realiza caso por caso, donde el organizador del evento envía instrucciones a los equipos sobre cómo presentarlos.
fr_ca: Les prix Promotion et Compass sont des prix facultatifs qui ne sont généralement décernés que lors des championnats d'État et des championnats du monde. Ces prix ne nécessitent pas de cahier d'ingénierie pour être remportés, mais ne font pas progresser les équipes. Ils sont présentés sous la forme d'une vidéo d'une durée maximale d'une minute. Le prix Promotion récompense la création d'un message d'intérêt public pour *FIRST* à partir d'un message vidéo spécifique. Ce message change chaque année et se trouve dans |gm1|. Le prix Compass récompense un mentor exceptionnel. La soumission de ces prix se fait généralement au cas par cas, lorsque l'organisateur de l'événement envoie aux équipes des instructions sur la manière de soumettre leur projet.
zh_cn: 促进奖和指南针奖是可选奖项，通常只在州锦标赛和世界锦标赛上颁发。这些奖项不需要工程笔记本，但不能晋级。获奖者需提交不超过 1 分钟的视频。推广奖是根据特定的视频提示为 *FIRST* 创作公益广告。该提示每年都会更改，可在 |gm1| 中找到。指南针奖用于表彰杰出的导师。提交这些奖项通常是根据具体情况进行的，活动组织者会向参赛团队发送如何提交奖项的说明。

source: Some good Promote award submissions include:
es_mx: Algunas buenas candidaturas a los premios Promote son:
fr_ca: Parmi les bonnes candidatures au prix de la promotion, on peut citer
ro_ro: Câteva propuneri bune pentru premiile Promote includ:
zh_cn: 一些好的推广奖提交包括：

source: `Team 3595 in 2014 <https://www.youtube.com/watch?v=yYFxuJwtCu0>`_
es_mx: `Equipo 3595 en 2014 <https://www.youtube.com/watch?v=yYFxuJwtCu0>`_
fr_ca: L'équipe 3595 en 2014 <https://www.youtube.com/watch?v=yYFxuJwtCu0>`_
ro_ro: `Echipa 3595 în 2014 <https://www.youtube.com/watch?v=yYFxuJwtCu0>`_
ru_ru: `Команда 3595 в 2014 году <https://www.youtube.com/watch?v=yYFxuJwtCu0>`_

source: `Team 8808 in 2017 <https://www.youtube.com/watch?v=7yjGMYbtKU0>`_
es_mx: `Equipo 8808 en 2017 <https://www.youtube.com/watch?v=7yjGMYbtKU0>`_
fr_ca: Équipe 8808 en 2017 <https://www.youtube.com/watch?v=7yjGMYbtKU0>`_
ro_ro: `Echipa 8808 în 2017 <https://www.youtube.com/watch?v=7yjGMYbtKU0>`_
ru_ru: `Команда 8808 в 2017 году <https://www.youtube.com/watch?v=7yjGMYbtKU0>`_
