Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/judging-presentation.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: The Judging Process and Presentation
es_mx: Proceso de Evaluación y Presentación
fr_ca: Le Processus de Jugement et la Présentation
ro_ro: Procesul de Jurizare și Prezentarea
zh_cn: 评审过程和演示

source: At the beginning of a competition, teams will have a 5 minute presentation followed by a brief Q&A period where judges can ask questions about the portfolio and presentation. Following this, judges may sometimes do follow up interviews in the pits where they ask teams more questions about specific things to help in their deliberations. This process is as important as your written documentation when it comes to the success of your team in awards.
es_mx: Al principio de cada competencia, los equipos tendrán que realizar una presentación de 5 minutos ante los jueces, seguida de un breve periodo de preguntas y respuestas en el que los jueces podrán hacer preguntas sobre la portafolio y la presentación. A continuación, los jueces pueden realizar entrevistas de seguimiento en los pits, en las que hacen más preguntas a los equipos sobre aspectos más concretos para ayudarles en sus deliberaciones. Este proceso es tan importante como la documentación escrita, el engineering portfolio, a la hora de determinar el éxito del equipo en la premiación.
fr_ca: Au début de la compétition, les équipes font une présentation de 5 minutes, suivie d'une brève période de questions-réponses au cours de laquelle les juges peuvent poser des questions sur le dossier et la présentation. Ensuite, les juges peuvent parfois organiser des entretiens de suivi dans les stands, au cours desquels ils posent aux équipes des questions supplémentaires sur des points spécifiques afin de les aider dans leurs délibérations. Ce processus est tout aussi important que votre documentation écrite lorsqu'il s'agit du succès de votre équipe lors de la remise des prix.
ro_ro: La începutul concursului, echipele vor avea o prezentare de 5 minute, urmată de o scurtă perioadă de întrebări în care juriul poate pune întrebări despre portofoliu și prezentare. După aceasta, juriul poate, uneori, să organizeze interviuri, în cadrul cărora le pune echipelor mai multe întrebări despre anumite lucruri specifice pentru a îi ajuta în decizia lor. Acest proces este la fel de important ca și documentația scrisă atunci când vine vorba de succesul echipei tale la obținerea premiilor.
zh_cn: 评审环节开始时，参赛队将进行 5 分钟的陈述演示，随后是简短的问答时间，评委可就工笔摘要和陈述演示提问。之后，评委有时会在pit区进行后续采访，就具体问题向参赛队提出更多问题，以帮助他们进行审议。这个过程与参赛队的书面材料一样重要，关系到团队能否成功获奖。

source: Overall Tips
es_mx: Consejos Generales
fr_ca: Conseils généraux
ro_ro: Sfaturi Generale
zh_cn: 总体提示

source: **You are a team, act like one**. You should practice multiple times with each other and act as a team. Don't talk over each other, let everyone have a chance to respond. You should know each other's scripts and also how to answer a broad range of questions.
es_mx: **Son un equipo, actúen como uno**. Deberán practicar varias veces entre ustedes y actuar como un equipo. No hablen por encima de los demás, dejen que todos tengan la oportunidad de responder. Deberán conocer los guiones de los demás y también cómo responder a una amplia gama de preguntas.
fr_ca: **Vous êtes une équipe, agissez comme telle**. Vous devez répéter plusieurs fois ensemble et agir en équipe. Ne parlez pas tous en même temps, laissez à chacun la chance de répondre. Vous devez connaître les scripts de chacun et aussi comment répondre à une large gamme de questions.
ro_ro: **Sunteți o echipă, acționați ca atare**. Ar trebui să vă antrenați de mai multe ori unul cu celălalt și să acționați ca o echipă. Nu vorbiți unul peste altul, lăsați pe toată lumea să aibă șansa de a răspunde. Ar trebui să vă cunoașteți reciproc scenariile și, de asemenea, să știți cum să răspundeți la o gamă largă de întrebări.
zh_cn: **你们是一个团队，所以要表现得像一个团队。** 你们应该在相互间多练习几次，表现出你们是一个团队的样子。不要交头接耳，让每个人都有机会回答。你们应该了解对方的讲稿，也应该知道如何回答各种问题。

source: Be professional. Always assume a judge is watching you. While you don't have to abstain from fun, be careful of how you act. When you encounter judges, be on your best behavior and be as professional as you can.
es_mx: Se profesional. Siempre asume que un juez te estara observando. Aunque no tienes por qué abstenerte de divertirte, ten cuidado con tu forma de actuar. Cuando te encuentres con jueces, compórtate lo mejor que puedas y sé lo más profesional que puedas.
fr_ca: Soyez professionnels. Supposez toujours qu'un juge vous observe. Bien que vous ne soyez pas obligé de vous abstenir de vous amuser, faites attention à votre comportement. Lorsque vous rencontrez des juges, soyez sur votre meilleur comportement et soyez aussi professionnel que possible.
ro_ro: Fiți profesioniști. Presupuneți întotdeauna că un membru al juriului vă privește. Deși nu trebuie să vă abțineți de la distracție, fiți atenți la modul în care vă comportați. Atunci când vă întâlniți cu juriul, comportați-vă cât mai bine și fiți cât se poate de profesioniști.
zh_cn: 要专业。总是设想有一个评委在看着你。虽然你不必讳疾忌医（译者注：过于严肃不展示出任何笑容），但也要注意自己的言行举止。遇到评委时，要表现出最好的一面，尽可能专业。

source: **Be Consistent!** If you say something during the beginning Q&A, make sure you say the same thing during pit judging. If you call out one specific mechanism as innovative, don't talk about a different mechanism when questioned. Always be consistent.
es_mx: **¡Se Constante!** Si dices algo al principio de las preguntas y respuestas, asegúrese de decir lo mismo durante el jueceo en pits. Si destacas un mecanismo específico como innovador, no hables de otro mecanismo cuando te pregunten. Siempre se coherente.
fr_ca: **Soyez consistent** Si vous dites quelque chose au début des questions et réponses, assurez-vous de dire la même chose avec les juges dans les stands. Si vous qualifiez un mécanisme spécifique d'innovant, ne parlez pas d'un autre mécanisme lorsque vous êtes interrogé. Soyez toujours cohérent.
ro_ro: **Fii consecvent!** Dacă spui ceva în timpul întrebărilor și răspunsurilor de la început, asigură-te că spui același lucru și în timpul jurizării la pit. Dacă numiți un anumit mecanism ca fiind inovator, nu vorbiți despre un mecanism diferit atunci când sunteți întrebat. Fiți întotdeauna consecvenți.
zh_cn: **保持一致！** 如果你在开始问答时说了什么，确保你在pit区时说了同样的话。如果你称一个特定的结构为创新，那么在接受提问时就不要谈论另一个结构。始终保持一致性。

source: Vary who answers the questions. **Make sure everybody has an opportunity to speak.**
es_mx: Varía quién responde las preguntas. **Asegúrate de que todos tengan la oportunidad de hablar.**
fr_ca: Variez les personnes qui répondent aux questions.** Assurez-vous que tout le monde ait l'opportunité de parler.**
ro_ro: Alternați cine răspunde la întrebări. **Asigurați-vă că toată lumea are ocazia să vorbească.
zh_cn: 由不同的人回答问题。 **确保每个人都有机会发言。**

source: Use your portfolio! You can use it to reference things or point to various sections, especially if you can't remember something in the moment.
es_mx: Utilicen su portafolio. Puedes utilizarlo para hacer referencia a cosas o señalar varias secciones, sobre todo si no puedes recordar algo en el momento.
fr_ca: Utilisez votre portfolio ! Vous pouvez l'utiliser pour faire référence à des éléments ou pointer vers différentes sections, surtout si vous ne vous souvenez pas de quelque chose sur le moment.
ro_ro: Folosește-ți portofoliul! Îl puteți folosi pentru a face referințe sau pentru a indica diverse secțiuni, mai ales dacă nu vă puteți aminti ceva pe moment.
zh_cn: 使用你的工笔摘要！你可以用它来参考事物或指出各个部分，尤其是当你一时想不起来的时候。

source: Don't ramble but also don't cut it short. Answer questions fully, but there is no benefit to wasting judges time. **Most of the time, judges have a set time allotment with each team so wasting time may decrease the number of questions you can answer.**
es_mx: No divagues, pero tampoco te quedes corto. Responde a todas las preguntas, pero no pierdas el tiempo de los jueces. **La mayoría de las veces, los jueces tienen un tiempo asignado para cada equipo, así que perder el tiempo puede reducir el número de preguntas que puedes responder.**
fr_ca: Ne divaguez pas, mais ne soyez pas trop concis non plus. Répondez complètement aux questions, mais il n'y a aucun intérêt à perdre le temps des juges. **La plupart du temps, les juges ont un temps limité avec chaque équipe, donc perdre du temps peut réduire le nombre de questions auxquelles vous pouvez répondre.**
ro_ro: Nu vă lungiți, dar nici nu o scurtați. Răspundeți complet la întrebări, dar nu este benefic să pierdeți timpul juriului. **De cele mai multe ori, juriul are un anumit timp alocat fiecărei echipe, astfel încât pierderea de timp poate reduce numărul de întrebări la care puteți răspunde.**
zh_cn: 不要漫无边际，但也不要缩短时间。充分回答问题，但浪费评委的时间没有任何好处。 **大多数时候，评委对每个团队都有固定的时间分配，所以浪费时间可能会减少你能回答的问题数量。**

source: Try not to go off topic. If a judge asks about outreach, don't talk about robot design too much. Judges are usually asking things for a specific purpose and other information may get wasted.
es_mx: Intenta no salirte del tema. Si un juez te pregunta por el impacto, no hables demasiado del diseño del robot. Los jueces suelen preguntar cosas con un propósito concreto y puede que cierta información no se use.
fr_ca: Essayez de ne pas vous égarer du sujet. Si un juge vous pose une question sur la communication, ne parlez pas trop de la conception du robot. Les juges posent généralement des questions dans un but précis, et d'autres informations risquent d'être inutiles.
ro_ro: Încercați să nu vă abateți de la subiect. Dacă un membru al juriului vă întreabă despre outreach, nu vorbiți prea mult despre design-ul robotului. De obicei, juriul întreabă lucruri cu un scop precis și alte informații pot fi irosite.
zh_cn: 尽量不要跑题。如果评委询问外联方面事务，不要过多谈论机器人设计。评委通常会出于特定目的询问事物，其他信息可能会被浪费。

source: The Presentation
es_mx: La Presentación
fr_ca: La Présentation
ro_ro: Prezentarea
zh_cn: 陈述演示

source: The presentation is a 5 minute presentation during which judges are not allowed to interrupt. At the end of 5 minutes, you will either be asked to stop or be interrupted by the judges. There is no set format for this period, so your team can figure out how they want to present. Generally, most teams will do scripted formal presentations, often with each student tackling a different part of information about the team, robot, outreaches, etc. Its recommended teams cover topics from every award topic.
es_mx: La presentación durará 5 minutos, durante los cuales los jueces no podrán interrumpirle. Al final de los 5 minutos, se te pedirá que te detengas o serás interrumpido por los jueces. No hay un formato establecido para este periodo, por lo que su equipo puede decidir cómo quiere hacer la presentación. Por lo general, la mayoría de los equipos harán presentaciones formales con un guión, en las que cada estudiante abordará una parte diferente de la información sobre el equipo, el robot, las actividades de impacto, etc. Se recomienda que los equipos traten todos los temas de cada uno de los premios.
fr_ca: La présentation est une présentation de 5 minutes durant laquelle les juges ne peuvent pas interrompre. À la fin des 5 minutes, on vous demandera soit d'arrêter, soit vous serez interrompus par les juges. Il n'y a pas de format défini pour cette période, donc votre équipe peut décider comment elle veut présenter. En général, la plupart des équipes feront des présentations formelles et scriptées, souvent avec chaque étudiant abordant une partie différente des informations concernant l'équipe, le robot, les actions de sensibilisation, etc. Il est recommandé que les équipes couvrent des sujets pour chaque catégorie de prix
ro_ro: Prezentarea este de 5 minute, timp în care juriul nu are voie să te întrerupă. La finalul celor 5 minute, vi se va cere să vă opriți sau veți fi întrerupt de către juriu. Nu există un format prestabilit pentru această perioadă, așa că echipa ta își poate da seama cum dorește să prezinte. În general, cele mai multe echipe vor face prezentări formale cu scenariu, adesea fiecare elev abordând o parte diferită de informații despre echipă, robot, activități de outreach, etc. Se recomandă ca echipele să abordeze subiecte din fiecare temă de premiere.
zh_cn: 陈述演示的时间为 5 分钟，期间评委不得打断。5 分钟结束时，评委要么要求你们停止，要么打断你们。这段时间没有固定格式，因此您的团队可以自行决定展示方式。一般来说，大多数参赛队都会按脚本（译者注：陈述演讲稿）进行正式陈述，通常每个学生都会介绍有关参赛队、机器人、外联活动等不同方面的信息。建议参赛队涵盖每个奖项的主题。

source: While it may be tempting to do something unique, like singing or performing your presentation, be aware that this is usually difficult for little benefit. Unless you know you can pull it off very well, you probably shouldn't try it.
es_mx: Aunque puede resultar tentador hacer algo diferente, como cantar o interpretar tu presentación, ten en cuenta que esto suele ser difícil y poco provechoso. A menos que sepas que puedes hacerlo muy bien, probablemente no deberías intentarlo.
fr_ca: Bien qu'il puisse être tentant de faire quelque chose d'unique, comme chanter ou interpréter votre présentation, sachez que cela est généralement difficile pour peu de bénéfice. À moins que vous ne soyez sûr de pouvoir bien le faire, vous ne devriez probablement pas essayer.
ro_ro: Deși ar putea fi tentant să faceți ceva unic, cum ar fi să cântați prezentarea, trebuie să știți că acest lucru este de obicei dificil pentru un beneficiu mic. Cu excepția cazului în care știți că vă puteți descurca foarte bine, probabil că nu ar trebui să încercați acest lucru.
zh_cn: 虽然做一些独特的事情可能很诱人，比如在陈述时唱歌或表演，但要意识到这通常很难有什么好处。除非你知道你能做得很好，否则你不应该尝试这么做。

source: There is generally no penalty for using scripts, so it is highly recommended they are used. In addition, you should practice the judging period repeatedly before the competition. Practice everything from walking in and giving your portfolio to the judges to the question and answer period. **Make sure you are comfortable with your script and with answering questions**.
es_mx: Por lo general, no se penaliza el uso de guiones, por lo que es muy recomendado que los utilizen. Además, debe practicar repetidamente el periodo de jueceo antes de cada competencia. Practiquen todo, desde la entrada y la entrega de su portafolio a los jueces, hasta el periodo de preguntas y respuestas. **Asegúrese de que se sientan cómodos con su guión y con las respuestas a las preguntas.**
fr_ca: Il n'y a généralement pas de pénalité pour l'utilisation des scripts, il est donc fortement recommandé de les utiliser. En outre, vous devez vous entraîner à plusieurs reprises à parler devant les juges avant la compétition. Entraînez-vous à tout, depuis l'entrée et la remise de votre portfolio aux juges jusqu'à la période de questions et réponses. **Assurez-vous d'être à l'aise avec votre texte et de pouvoir répondre aux questions**.
ro_ro: În general, nu există nicio penalizare pentru utilizarea scenariilor, așa că este foarte recomandat să le folosiți. În plus, ar trebui să exersați în mod repetat perioada de jurizare înainte de concurs. Exersați totul, de la intrarea în sală și predarea portofoliului dvs. către juriu până la perioada de întrebări și răspunsuri. **Asigură-te că te simți confortabil cu scenariul tău și cu răspunsul la întrebări**.
zh_cn: 使用脚本一般不会有问题，所以强烈建议使用它们。此外，你应该在比赛前反复练习评审阶段。从进场、向评委递交工笔摘要到提问和回答问题，都要进行练习。 **确保你能自如地使用讲稿和回答问题** 。

source: Presentation Tips
es_mx: Consejos para la Presentación
fr_ca: Conseils de présentation
ro_ro: Sfaturi de Prezentare
zh_cn: 陈述演示提示

source: Practice speaking clearly and precisely. You should practice multiple times and not only know your lines, but what people around you are going to say.
es_mx: Practica hablar con claridad y precisión. Debes practicar varias veces y no solo conocer tus líneas, sino también lo que van a decir las personas que te rodean.
fr_ca: Entraînez-vous à parler clairement et précisément. Vous devez vous entraîner plusieurs fois et connaître non seulement votre texte, mais aussi ce que les gens autour de vous vont dire.
ro_ro: Exersați să vorbiți clar și precis. Ar trebui să exersezi de mai multe ori și să știi nu numai replicile tale, ci și ce vor spune cei din jur.
zh_cn: 练习清晰准确地说话。你应该多次练习，不仅要知道自己的台词，还要知道周围的人要说什么。

source: Use the robot! Have other team members point and move things on the robot as you speak to demonstrate.
es_mx: ¡Utiliza el robot! Haz que otros miembros del equipo señalen y muevan cosas en el robot mientras hablas para poder demostrarlo.
fr_ca: Utilisez le robot ! Demandez à d'autres membres de l'équipe de pointer et de déplacer des objets sur le robot pendant que vous parlez pour faire une démonstration.
ro_ro: Folosiți robotul! Rugați alți membri ai echipei să arate și să mute lucruri pe robot în timp ce vorbiți pentru a demonstra.
zh_cn: 使用机器人！让其他团队成员在你陈述时指向并移动机器人上的东西进行演示。

source: While having a script won't be held against you, try to avoid gluing your eyes to your script and looking down. Looking at the judges occasionally will go a long way in making your presentation more professional
es_mx: Aunque tengan un guión no lo tengas en la cara, evita pegar los ojos al guión y mirar hacia abajo. Mira de vez en cuando a los jueces, contribuirá en gran medida a que su presentación sea más profesional.
fr_ca: Bien que le fait d'avoir un script ne soit pas retenu contre vous, essayez d'éviter d'avoir les yeux fixés sur votre script et de regarder vers le bas. Regarder les juges de temps en temps contribuera grandement à rendre votre présentation plus professionnelle.
ro_ro: Deși nu vi se va reproșa că aveți un scenariu, încercați să evitați să vă lipiți ochii de scenariu și să vă uitați în jos. Dacă vă uitați din când în când la juriu, prezentarea dumneavoastră va fi mult mai profesională.
zh_cn: 虽然有讲稿不会对你不利，但要尽量避免把眼睛盯着讲稿和低头看。偶尔看看评委会让你的演讲更加专业。

source: **Make sure everybody gets a chance to say something or answer a question**. Having students say nothing during judging can look bad.
es_mx: **Asegúrate de que todo el mundo tenga la oportunidad de decir algo o responder a una pregunta**. Si los alumnos no dicen nada durante la presentación, pueden verse mal.
fr_ca: **Veillez à ce que chacun ait la possibilité de dire quelque chose ou de répondre à une question**. Le fait que les élèves ne disent rien pendant le jugement peut être mal perçu.
ro_ro: **Asigură-te că toată lumea are șansa de a spune ceva sau de a răspunde la o întrebare**. Faptul că elevii nu spun nimic în timpul jurizării poate da o imagine proastă.
zh_cn: **确保每个人都有机会发言或回答问题。** 让学生在评审过程中一言不发会显得很糟糕。

source: Q&A Period
es_mx: Periodo de Preguntas y Respuestas
fr_ca: Période de questions et réponses
ro_ro: Perioada de Q&A
zh_cn: 问答环节

source: The Q&A period is just as important as the presentation and should be practiced multiple times until the team is comfortable answering impromptu questions. A good idea is to practice the `sample judges questions (Appendix B) <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/judge-manual.pdf>`_. Mentors should ask questions similar to those in the sample judges question, in addition to difficult to answer questions ("What award do you think you deserve?" is an example of a question that is incredibly difficult to answer on the spot).
es_mx: El periodo de preguntas y respuestas es tan importante como la presentación y debe practicarse varias veces hasta que el equipo se sienta cómodo respondiendo a preguntas improvisadas. Una buena idea es practicar las `preguntas de muestra de los jueces (Appendix B) <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/judge-manual.pdf>`_. Los mentores deben hacer preguntas similares a las del ejemplo de preguntas de los jueces, además de preguntas difíciles de responder ("¿Qué premio crees que mereces?" es un ejemplo de pregunta increíblemente difícil de responder en el acto).
fr_ca: La période de questions et réponses est tout aussi importante que la présentation et doit être répétée plusieurs fois jusqu'à ce que l'équipe soit à l'aise pour répondre à des questions impromptues. Une bonne idée est de pratiquer les "exemples de questions des juges" (annexe B) <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/judge-manual.pdf>`_. Les mentors doivent poser des questions similaires à celles de l'exemple de question des juges, ainsi que des questions auxquelles il est difficile de répondre ("Quel prix pensez-vous mériter ?" est un exemple de question à laquelle il est incroyablement difficile de répondre sur le champ).
zh_cn: 问答环节和陈述演示一样重要，应该多次练习，直到团队对回答即兴问题的效果感到满意为止。一个好主意是练习示例评委问题（附录B）。除了难以回答的问题（“你认为你应该得到什么奖项？”是现场难以回答的问题的一个例子）之外，导师还应该提出类似于示例评委问题中的问题。

source: Judges almost always ask something along the lines of "Is there anything else that you want us to know that was not covered?" Make sure you have a response to this question! The best strategy is usually to answer with something that wasn't asked about or covered as well, so pay attention to what topics have been covered during the Q&A.
es_mx: Los jueces casi siempre preguntan algo parecido a "¿Hay algo más que quieran que sepamos que no se haya cubierto?". Asegúrese de tener una respuesta a esta pregunta. La mejor estrategia suele ser responder con algo que no se haya preguntado o que no se haya tratado también, así que presta atención a los temas que se han tratado durante el turno de preguntas y respuestas.
fr_ca: Les juges demandent presque toujours quelque chose du genre "Y a-t-il autre chose que vous voulez que nous sachions et qui n'a pas été couvert ?". Assurez-vous d'avoir une réponse à cette question ! La meilleure stratégie consiste généralement à répondre par quelque chose qui n'a pas été demandé ou qui n'a pas été couvert également, alors soyez attentif aux sujets qui ont été couverts pendant les questions-réponses.
ro_ro: Juriștii întreabă aproape întotdeauna ceva de genul "Mai este ceva ce doriți să știm și care nu a fost acoperit?". Asigurați-vă că aveți un răspuns la această întrebare! Cea mai bună strategie este, de obicei, să răspundeți cu ceva despre care nu a fost întrebat sau acoperit la fel de bine, așa că fiți atenți la ce subiecte au fost abordate în timpul întrebărilor.
zh_cn: 评委们几乎总是会问一些类似“你还有什么想让我们知道的没有涵盖的吗？”确保你对这个问题有回应！最好的策略通常是回答一些没有被问到或也没有被覆盖的问题，所以要注意问答中涵盖了哪些主题。

source: Pit Judging
es_mx: Entrevistas en los Pits
fr_ca: Visite des juges dans les puits
ro_ro: Jurizarea la Standuri
zh_cn: Pit区评审

source: During the competition, secondary groups of judges may be walking around pits to ask more questions about specific components of the team, robot, or outreach. These questions are an important part of judging deliberation, and should be treated similarly to the Q&A in the beginning of the competition.
es_mx: Durante la competencia, es posible que grupos secundarios de jueces se paseen por los pits para hacer más preguntas sobre componentes específicos del equipo, el robot o el impacto. Estas preguntas son una parte importante de la deliberación de los jueces y deben tratarse de forma similar a las preguntas y respuestas del principio de la competencia.
fr_ca: Pendant la compétition, des groupes secondaires de juges peuvent circuler autour des stands pour poser des questions sur des éléments spécifiques de l'équipe, du robot ou de la sensibilisation. Ces questions constituent une part importante des délibérations des juges et doivent être traitées de la même manière que les questions-réponses au début de la compétition.
ro_ro: În timpul competiției, este posibil ca grupuri secundare de jurați să se plimbe în jurul standurilor pentru a pune mai multe întrebări cu privire la anumite elemente ale echipei, ale robotului sau ale activităților de informare. Aceste întrebări reprezintă o parte importantă a deliberării juriului și ar trebui să fie tratate în mod similar cu întrebările și răspunsurile de la începutul competiției.
zh_cn: 在比赛过程中，二级组评委可能会在pit区里走来走去，询问更多关于团队、机器人或外联的特定方面的问题。这些问题是评判审议的重要组成部分，应该像评审时的问答一样对待。
