Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/judging-presentation.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Pit judging can be difficult sometimes since judges might want to talk to your team as you are heading out to a match. While some judges may offer to come back at a different time, often it is better to have your teammates not driving talk to the judge if possible. This can ensure they don't run out of time to talk to you.
es_mx: El jueceo en pits puede ser difícil a veces, ya que los jueces pueden querer hablar con tu equipo mientras te diriges a una partida. Aunque algunos jueces pueden ofrecerse a volver en otro momento, a menudo es mejor que tus compañeros de equipo no conduzcan la conversación con el juez si es posible. Esto puede asegurar que no se queden sin tiempo para hablar contigo.
fr_ca: La visite des juges dans les puit peut parfois être difficile, car les juges peuvent vouloir parler à votre équipe alors que vous vous rendez à un match. Bien que certains juges puissent proposer de revenir à un autre moment, il est souvent préférable que vos coéquipiers qui ne conduisent pas parle au juge, si possible. Cela permet de s'assurer qu'ils ne manquent pas de temps pour vous parler.
ro_ro: Jurizarea la standuri poate fi dificilă uneori, deoarece juriul ar putea dori să vorbească cu echipa ta în timp ce te îndrepți spre un meci. În timp ce unii jurați se pot oferi să revină la o altă oră, de multe ori este mai bine ca coechipierii tăi care nu conduc robotul să vorbească cu aceștia, dacă este posibil. Acest lucru asigura că nu rămân fără timp pentru a vorbi cu voi.
zh_cn: 有时，pit区评审可能会很难做，因为裁判可能会在你前往比赛时与你的团队交谈。虽然有些裁判可能会提出换个时间再来，但如果可能的话，最好还是让不操作机器的队友和评委谈谈通常会更好。这样可以确保他们不会没有时间与你交谈。

source: When pit judges arrive, one should try to determine roughly what they are there for. Judges will make it clear pretty quickly if they are there for control, robot-based awards, outreach, etc. If a judge is there to talk to you about the robot, don't waste their time with outreach. Similarly, if a judge is asking about your outreach don't divert to talking about the robot. Judges are there for a specific purpose, other information may essentially be discarded by them.
es_mx: Cuando lleguen los jueces de pits, hay que intentar determinar a grandes rasgos para qué están ahí. Los jueces dejarán claro rápidamente si están allí para controlar, para los premios basados en el robot, para aquellos del impacto, etc. Si un juez está ahí para preguntarte del robot, no le hagas perder el tiempo hablando de impacto. Del mismo modo, si un juez te pregunta por tus actividades de impacto, no te desvíes para hablar del robot. Los jueces están allí para un propósito específico, otra información puede ser esencialmente descartada por ellos.
fr_ca: Lorsque les juges arrivent dans votre puit, il faut essayer de déterminer approximativement ce pour quoi ils sont là. Les juges indiqueront assez rapidement s'ils sont là pour le contrôle, les récompenses liées au robot, la sensibilisation, etc. Si un juge est là pour vous parler du robot, ne lui faites pas perdre son temps avec de la sensibilisation. De même, si un juge vous interroge sur vos activités de sensibilisation, ne vous détournez pas de votre sujet pour parler du robot. Les juges sont là dans un but précis, et toute autre information peut être rejetée par eux.
ro_ro: Atunci când sosesc juriștii la standuri, ar trebui să încercăm să determinăm cu aproximație pentru ce sunt acolo. Jurații vor clarifica destul de repede dacă se află acolo pentru control, pentru premii bazate pe robot, pentru comunicare, etc. Dacă un judecător este acolo pentru a vorbi cu tine despre robot, nu-i irosi timpul cu outreach. În mod similar, dacă un judecător vă întreabă despre activitățile de outreach, nu vă abateți la discuții despre robot. Judecătorii sunt acolo pentru un scop specific, alte informații pot fi în esență aruncate de către ei.
zh_cn: 当评委到达时，应尽量确定他们的大致目的。评委们会很快明确他们是来控制比赛、颁发机器人奖项还是进行宣传等。如果评委是来和您讨论机器人的，那就不要浪费他们的时间进行外延。同样的，如果评委询问您的外联活动，也不要转而谈论机器人。评委的目的很明确，其他信息可能会被他们弃之不顾。

source: When judges come near your pits, STAND UP and PUT THE PHONES DOWN. Uninterested students can cause a judge's opinion of your team to quickly sour. All students should try to look interested and should participate, get as many different people speaking as you can.
es_mx: Cuando los jueces se acerquen a tus pits, PÁRATE y BAJEN SUS TELÉFONOS. Los alumnos desinteresados pueden hacer que la opinión del juez sobre tu equipo se deteriore rápidamente. Todos los alumnos deben de parecer interesados y deben participar, haz que hablen tantas personas diferentes como puedas.
fr_ca: Lorsque les juges s'approchent de vos stands, LEVEZ-VOUS et POSEZ VOTRE TÉLÉPHONE. Des élèves qui ne s'intéressent pas à votre équipe peuvent faire en sorte que l'opinion d'un juge sur votre équipe se détériore rapidement. Tous les élèves doivent essayer d'avoir l'air intéressés et doivent participer, en faisant parler autant de personnes différentes que possible.
ro_ro: Când juriul se apropie de standurile voastre, ridicați-vă și lăsați telefoanele jos. Elevii dezinteresați pot forma o părere proastă despre echipă. Toți elevii ar trebui să încerce să pară interesați și să participe, să vorbească cât mai mulți oameni.
zh_cn: 当评委走近你的座位时， **站起来放下手机。** 不在意评委的学生会导致评委对你的团队失去好感。所有学生都应尽量表现出感兴趣的样子，并参与其中，让尽可能多的人发言。

source: Pit Judging Tips
es_mx: Consejos para el Jueceo en Pits
fr_ca: Conseils pour la visite des juges au puit
ro_ro: Sfaturi pentru jurizarea la standuri
zh_cn: Pit区评审提示

source: Judges have limited amounts of time, don't waste it! Answer questions thoroughly but consciously.
es_mx: Los jueces disponen de un tiempo limitado, ¡no lo malgasten! Responda a las preguntas de forma exhaustiva pero consciente.
fr_ca: Les juges disposent d'un temps limité, ne le gaspillez pas ! Répondez aux questions de manière exhaustive, mais consciente.
ro_ro: Jurații au un timp limitat, nu-l irosiți! Răspundeți la întrebări în mod complet, dar conștient.
zh_cn: 评委的时间有限，不要浪费时间！回答问题要全面，但要有意识。

source: Have a portfolio or notebook ready for quick reference as needed.
es_mx: Ten a mano el portafolio o el notebook para consultarlos cuando sea necesario.
fr_ca: Préparez un portfolio ou un carnet de notes pour pouvoir vous y référer rapidement en cas de besoin.
ro_ro: Pregătiți un portofoliu sau un caiet pentru consultări rapide, la nevoie.
zh_cn: 准备好工笔摘要或工程笔记本，以便根据需要快速参考。

source: Try to vary who answers questions, getting everyone involved.
es_mx: Intenta variar quién responde a las preguntas, haciendo que todos participen.
fr_ca: Essayez de varier les personnes qui répondent aux questions, afin d'impliquer tout le monde.
ro_ro: Încercați să variați persoanele care răspund la întrebări, implicându-i pe toți.
zh_cn: 尽量让不同的人回答问题，让每个人都参与进来。
