Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/notebook.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Notebook Designs and Decisions
es_mx: Diseños de Cuadernos y Decisiones
fr_ca: Conception et décisions relatives aux cahiers d'ingénierie
ro_ro: Modele și decizii pentru caiet
zh_cn: 工程笔记本设计和决策

source: This section will cover both what needs to be in the notebook and the decisions you need to make about it affecting both individual sections and it as a whole.
es_mx: Esta sección tratará tanto de lo que hay que incluir en el cuaderno como de las decisiones que hay que tomar al respecto afectando tanto a las secciones individuales como al cuaderno en su conjunto.
fr_ca: Cette section couvre à la fois ce qui doit figurer dans le cahier et les décisions que vous devez prendre à son sujet, qu'il s'agisse de sections individuelles ou de l'ensemble du cahier.
ro_ro: Această secțiune se va referi atât la ceea ce trebuie să conțină caietul, cât și la deciziile pe care trebuie să le luați cu privire la acesta, care afectează atât secțiunile individuale, cât și caietul în ansamblu.
zh_cn: 本节将涵盖工程笔记本中需要包含的内容以及您需要做出的影响各个部分和整个工笔的决定。

source: The engineering notebook is completely OPTIONAL. Having a notebook is NOT a requirement for any award. However, judges can technically still ask for the notebook for more information, so some teams still choose to make one. **This article remains here for legacy reasons for teams that wish to make engineering notebooks, even though it is completely optional and not required for teams to still have a shot at awards**. There have been several instances of teams winning high level awards like Inspire and Think while having no engineering notebook.
es_mx: El cuaderno de ingeniería es completamente OPCIONAL. Tener un cuaderno NO es un requisito para ningún premio. Sin embargo, técnicamente los jueces pueden pedir el cuaderno para obtener más información, por lo que algunos equipos deciden hacer uno. **Este artículo permanece aquí por razones de legado para los equipos que deseen hacer cuadernos de ingeniería, a pesar de que es completamente opcional y no es necesario para que los equipos todavía tengan una oportunidad para los premios**. Ha habido varios casos de equipos que han ganado premios de alto nivel como Inspire y Think sin tener un cuaderno de ingeniería.
fr_ca: Le cahier d'ingénierie est totalement FACULTATIF. La possession d'un cahier n'est PAS une condition pour l'obtention d'un prix. Cependant, les juges peuvent techniquement toujours demander le cahier pour plus d'informations, c'est pourquoi certaines équipes choisissent toujours d'en faire un. **Cet article reste ici pour des raisons d'héritage pour les équipes qui souhaitent réaliser des cahiers d'ingénierie, même si c'est complètement optionnel et non requis pour que les équipes aient encore une chance d'obtenir des récompenses**. Il est arrivé à plusieurs reprises que des équipes gagnent des prix de haut niveau comme Inspire et Think alors qu'elles n'avaient pas de cahier d'ingénierie.
ro_ro: Caietul tehnic este complet OPȚIONAL. Existența unui caiet NU este o cerință pentru niciun premiu. Cu toate acestea, din punct de vedere tehnic, juriul poate solicita în continuare caietul pentru mai multe informații, așa că unele echipe aleg totuși să facă unul. **Acest articol rămâne aici din motive de moștenire pentru echipele care doresc să realizeze caiete tehnice, chiar dacă este complet opțional și nu este obligatoriu pentru ca echipele să aibă totuși o șansă la premii**. Au existat mai multe cazuri de echipe care au câștigat premii de nivel înalt, cum ar fi Inspire și Think, deși nu aveau niciun caiet tehnic.
zh_cn: 工笔是完全可选的。拥有工笔不是任何奖项的要求。但是，从技术上讲，评委仍然可以要求工笔提供更多信息，因此一些团队仍然选择制作一个。本文保留在这里是出于希望制作工程笔记本的团队的遗留原因，即使它是完全可选的，并且不需要团队仍然有机会获得奖项。有几个团队在没有工程笔记本的情况下赢得了像激励和思考这样的高级别奖项。

source: Whole Notebook Decisions
es_mx: Decisiones del Cuaderno Entero
fr_ca: Décisions du cahier complet
ro_ro: Decizii pentru întregul caiet
zh_cn: 整个工笔决定

source: Condensed vs Long
es_mx: Condensado vs Largo
fr_ca: Condensé ou détaillé
ro_ro: Condensat vs Lung
zh_cn: 精简vs详细

source: A trap many teams fall into is that a longer notebook is a better notebook, especially if it's actually quality writing. Unfortunately, that is not necessarily true.
es_mx: Una trampa en la que caen muchos equipos es que un cuaderno más largo es un cuaderno mejor, sobre todo si se trata de escritura de calidad. Por desgracia, eso no es necesariamente cierto.
fr_ca: Un piège dans lequel tombent de nombreuses équipes est qu'un carnet plus long est un meilleur carnet, surtout s'il s'agit d'une écriture de qualité. Malheureusement, ce n'est pas nécessairement vrai.
ro_ro: O capcană în care cad multe echipe este aceea că un caiet mai lung este un caiet mai bun, mai ales dacă este vorba de un scris de calitate. Din păcate, acest lucru nu este neapărat adevărat.
zh_cn: 许多团队会陷入的误区是，工程笔记越长越好，尤其是如果它实际上是高质量的写作。不幸的是，这不一定是真的。

source: At a lot of competitions, especially with the notebook being completely optional, judges don't have a lot of time to read your notebooks. They will likely take a cursory scan at a few pages and take a more detailed look at certain pages. Thus, even if you do write a great but long notebook, they might miss the highlights and rank you lower than you should have. The solution to this is to create a condensed notebook.
es_mx: En muchas competiciones, especialmente cuando el cuaderno es totalmente opcional, los jueces no tienen mucho tiempo para leer los cuadernos. Lo más probable es que echen un vistazo superficial a algunas páginas y se fijen con más detalle en otras. Por lo tanto, aunque escribas un cuaderno estupendo pero largo, es posible que no vean lo más destacado y te clasifiquen más bajo de lo que deberías. La solución es crear un cuaderno resumido.
fr_ca: Lors de nombreux concours, en particulier lorsque le cahier d'ingénierie est totalement facultatif, les juges n'ont pas beaucoup de temps pour lire vos cahiers. Ils jetteront probablement un coup d'œil superficiel sur quelques pages et examineront plus en détail certaines d'entre elles. Par conséquent, même si vous rédigez un excellent, mais long carnet, ils risquent de ne pas voir les points forts et de vous classer moins bien que vous ne l'auriez dû. La solution consiste à créer un carnet condensé.
ro_ro: La multe concursuri, mai ales caietul fiind complet optional, arbitrii nu au prea mult timp să-ți citească caietul. Probabil că vor efectua o scanare superficială la câteva pagini și vor arunca o privire mai detaliată asupra anumitor pagini. Astfel, chiar dacă scrieți un caiet grozav, dar lung, s-ar putea să rateze cele mai importante momente și să vă claseze mai jos decât ar trebui să aveți. Soluția la aceasta problemă este crearea unui caiet condensat.
zh_cn: 在很多比赛中，尤其是当工程笔记完全只是可选选项时，评委没有太多时间阅读你的工笔。他们可能会粗略地浏览几页，然后更详细地查看某些其他页面。因此，即使你写了一个很棒但很长的工笔，他们也可能会错过亮点，并把你排在低于你应该有的位置。解决这个问题的方法是创建一个精简的工笔。

source: This is where you make a purposeful effort to get rid of redundancies and make sure everything written in the notebook serves the purpose of being read and getting things checked off of awards.
es_mx: Aquí es donde se hace un esfuerzo decidido por deshacerse de las redundancias y asegurarse de que todo lo que se escribe en el cuaderno sirve para ser leído y para que se marquen cosas en las adjudicaciones.
fr_ca: C'est ici que vous faites un effort délibéré pour vous débarrasser des redondances et vous assurer que tout ce qui est écrit dans le carnet a pour but d'être lu et de faire en sorte que des éléments soient utile pour les prix que vous essayer de gagner .
ro_ro: Aici este momentul în care faceți un efort intenționat pentru a elimina redundanțele și pentru a vă asigura că tot ceea ce scrieți în caiet servește scopului de a fi citit și de a obține lucruri bifate din premii.
zh_cn: 这是你有目的地努力摆脱冗余的地方，并确保工笔上写的所有东西都符合被阅读和被检查的目的。

source: So if you know your state competitions are going to be more than a couple of days, write a long, detailed filled notebook. But if it is only a day long, write with every section having a purpose.
es_mx: Así que si sabes que tus competiciones estatales van a durar más de un par de días, escribe un cuaderno largo y lleno de detalles. Pero si solo dura un día, escribe con cada sección que tenga un propósito.
fr_ca: Ainsi, si vous savez que vos concours d'État vont durer plus de deux jours, rédigez un cahier long et détaillé. Mais s'il ne dure qu'une journée, écrivez en veillant à ce que chaque section ait un objectif.
ro_ro: Așa că, dacă știți că concursurile naționale vor dura mai mult de câteva zile, scrieți un caiet lung și detaliat. Dar dacă este vorba doar de o zi, scrieți cu fiecare secțiune având un scop.
zh_cn: 因此，如果你知道你的州比赛将超过几天，写一个长长的、详细的工笔。但是如果只有一天，请有目的性地写每个部分。

source: Handwritten vs Typed
es_mx: Escrito a mano vs A máquina
fr_ca: Écriture manuscrite ou sur ordinateur
ro_ro: Scris de mână vs tehnoredactat
zh_cn: 手写vs打字

source: This one is a team decision. Some teams swear judges prefer handwritten notebooks, but there is no proof for that. But if you're a small team or you would prefer to write, do that. Be sure that the handwriting is consistent and legible! Typed notebooks are a lot easier to organize, and judges will definitely be able to read them.
es_mx: Esta es una decisión del equipo. Algunos equipos juran que los jueces prefieren los cuadernos escritos a mano, pero no hay pruebas de ello. Pero si eres un equipo pequeño o prefieres escribir, hazlo. ¡Asegúrate de que la letra es consistente y legible! Los cuadernos mecanografiados son mucho más fáciles de organizar, y los jueces sin duda podrán leerlos.
fr_ca: Il s'agit d'une décision de l'équipe. Certaines équipes jurent que les juges préfèrent les carnets manuscrits, mais rien ne le prouve. Mais si vous êtes une petite équipe ou si vous préférez écrire, faites-le. Veillez à ce que l'écriture soit cohérente et lisible ! Les carnets sur ordinateur sont beaucoup plus faciles à organiser et les juges pourront certainement les lire.
ro_ro: Aceasta este o decizie de echipă. Unele echipe jură că juriul preferă caietele scrise de mână, dar nu există nicio dovadă în acest sens. Dar dacă sunteți o echipă mică sau dacă preferați să scrieți, faceți asta. Asigurați-vă că scrisul de mână este consistent și lizibil! Caietele tehnoredactare sunt mult mai ușor de organizat, iar jurizații vor putea cu siguranță să le citească.
zh_cn: 这是一个团队的决定。一些团队坚信评委更喜欢手写工笔，但没有证据证明这一点。但是如果你是一个小团队或者你更喜欢写作，那就这样做。确保笔迹一致且清晰！打印工笔更容易组织，评委肯定能够阅读它们。

source: Serious vs Charming
es_mx: Serio vs Encantador
fr_ca: Sérieux ou plus relaxe
ro_ro: Serios vs Atrăgător
zh_cn: 严肃vs魅力

source: A team's notebook is an extension of its personality and branding. Some teams try to come across as an engineering firm or at least very serious, while others act the opposite.
es_mx: El cuaderno de un equipo es una extensión de su personalidad y su marca. Algunos equipos intentan mostrarse como una empresa de ingeniería o, al menos, muy serios, mientras que otros actúan de forma opuesta.
fr_ca: Le cahier d'ingénierie d'une équipe est une extension de sa personnalité et de son image de marque. Certaines équipes essaient de se présenter comme une société d'ingénierie ou du moins comme très sérieuse, tandis que d'autres agissent à l'opposé.
ro_ro: Caietul unei echipe este o extensie a personalității și a brandingului acesteia. Unele echipe încearcă să se prezinte ca o firmă de inginerie sau cel puțin ca fiind foarte serioase, în timp ce altele acționează invers.
zh_cn: 团队的工笔是其个性和品牌的延伸。一些团队试图给人以工程公司或至少非常严肃的印象，而另一些团队则相反。

source: You should try and reflect that in your notebook. Neither way is better, but it's good early on to figure out your team's way of acting and writing in a manner that fits it.
es_mx: Deberías intentar reflejarlo en tu cuaderno. Ninguna de las dos formas es mejor, pero es bueno que desde el principio descubras la forma de actuar y escribir de tu equipo de manera que se adapte a ella.
fr_ca: Vous devez essayer de refléter cela dans votre cahier d'ingénierie. Aucune des deux méthodes n'est meilleure que l'autre, mais il est bon, dès le début, de déterminer la façon dont votre équipe agit et d'écrire d'une manière qui lui corresponde.
ro_ro: Ar trebui să încercați să reflectați acest lucru în caietul vostru. Niciuna dintre cele două modalități nu este mai bună, dar este bine să vă dați seama din timp de modul de acțiune al echipei voastre și să scrieți într-un mod care să se potrivească.
zh_cn: 你应该试着在你的工笔上反映这一点。两种方式都不好，但是尽早找出你的团队以适合它的方式行事和写作是件好事。

source: Generally, humor is acceptable, but try to keep jokes down to a minimum (after all, the engineering notebook is meant to be a professional-grade document).
es_mx: Generalmente, el humor es aceptable, pero procura que las bromas sean mínimas (al fin y al cabo, el cuaderno de ingeniería está pensado para ser un documento de nivel profesional).
fr_ca: En général, l'humour est acceptable, mais essayez de limiter les plaisanteries au minimum (après tout, le cahier d'ingénierie est censé être un document de qualité professionnelle).
ro_ro: În general, umorul este acceptabil, dar încercați să reduceți glumele la minimum (la urma urmei, caietul tehnic este menit să fie un document de calitate profesională).
zh_cn: 一般来说，幽默是可以接受的，但是尽量把笑话控制在最低限度（毕竟，工笔是专业级的文件）。

source: Having a consistent team brand is important so judges remember you. A large amount of winning awards is being remembered and advocated for by the judges.
es_mx: Tener una marca de equipo coherente es importante para que los jueces te recuerden. Una gran parte de ganar premios consiste en ser recordado y defendido por los jueces.
fr_ca: Avoir une image d’équipe cohérente est important pour que les juges se souviennent de vous. Une grande partie du succès lors des remises de prix repose sur le fait d’être mémorisé et soutenu par les juges.
ro_ro: Este important să aveți un brand de echipă coerent pentru ca juriul să vă țină minte. O mare parte din câștigarea premiilor constă în a fi ținut minte și susținut de către juriu.
zh_cn: 拥有一个一致的团队品牌很重要，这样评委才能记住你。大量的获奖奖项被评委记住和倡导。

source: Therefore, having consistent branding helps judges know what team they are talking to and what they know about you.
es_mx: Por lo tanto, tener una marca coherente ayuda a los jueces a saber con qué equipo están hablando y qué saben de ti.
fr_ca: Par conséquent, une image de marque cohérente permet aux juges de savoir à quelle équipe ils s'adressent et ce qu'ils savent de vous.
ro_ro: Prin urmare, un branding coerent ajută juriul să știe cu ce echipă vorbesc și ce știu despre voi.
zh_cn: 因此，拥有一致的品牌有助于评委了解他们在与哪个团队交谈，以及他们对你的了解。

source: Individual sections
es_mx: Secciones individuales
fr_ca: Sections individuelles
ro_ro: Secțiuni individuale
zh_cn: 个别部分

source: Section 9.2.2 of |gm1| lists out the type of things that are expected to see in your notebook.
es_mx: La sección 9.2.2 de |gm1| enumera el tipo de cosas que se espera ver en tu cuaderno.
fr_ca: La section 9.2.2 de |gm1| énumère le type d'éléments que l'on s'attend à trouver dans votre carnet.
ro_ro: Secțiunea 9.2.2 din |gm1| enumeră tipul de lucruri pe care se așteaptă să le vedeți în caietul tău.
zh_cn: 游戏手册第1部分的第9.2.2节列出了预期在工笔中看到的内容类型。

source: They are listed here:
es_mx: Se enumeran aquí:
fr_ca: Ils sont énumérés ci-dessous :
ro_ro: Acestea sunt enumerate aici:
zh_cn: 它们列在这里：

source: Problem Definition
es_mx: Definición del Problema
fr_ca: Définition du problème
ro_ro: Definirea problemei
zh_cn: 问题定义

source: Information Gathering
es_mx: Recopilación de Información
fr_ca: Collecte d'informations
ro_ro: Colectarea de informații
zh_cn: 信息收集

source: Brainstorming Solutions
es_mx: Lluvia de Ideas
fr_ca: Remue-méninges pour trouver des solutions
ro_ro: Brainstorming de soluții
zh_cn: 头脑风暴解决方案

source: Concept Design
es_mx: Diseño conceptual
fr_ca: Conception
ro_ro: Design conceptual
zh_cn: 概念设计

source: System Level Design
es_mx: Diseño a Nivel de Sistema
fr_ca: Conception au niveau du système
ro_ro: Proiectare la nivel de sistem
zh_cn: 系统级设计

source: Testing
es_mx: Pruebas
fr_ca: La phase de test
ro_ro: Testare
zh_cn: 测试

source: Design Improvement
es_mx: Mejora del Diseño
fr_ca: Amélioration de la conception
ro_ro: Îmbunătățirea designului
zh_cn: 设计改进

source: Production
es_mx: Producción
ro_ro: Producție
zh_cn: 生产

source: Promotion
es_mx: Promoción
ro_ro: Promovare
zh_cn: 晋升

source: Budgeting
es_mx: Presupuestos
fr_ca: Budgétisation
ro_ro: Bugetare
zh_cn: 预算编制

source: Planning
es_mx: Planificación
fr_ca: Planification
ro_ro: Planificare
zh_cn: 规划

source: Outreach
es_mx: Divulgación
fr_ca: Sensibilisation
zh_cn: 外联

source: Specific sections named in |gm1|, the Judges Manual, and Notebook Guidelines are not plentiful. They include a team plan, which is pretty much all non-robot writing---a sustainability plan, a strategic plan, and a business plan all fall into it, and doing one of these sections is required for Inspire award, and telling us what they want in the notebook (listed above). It falls to the individual notebook writers to figure out what they specifically want to call each section and what to put in each section.
es_mx: Las secciones específicas nombradas en |gm1|, el Manual de Jueces y las Directrices del Cuaderno no son abundantes. Incluyen un plan de equipo, que es más o menos todo lo que no está escrito sobre robots: un plan de sostenibilidad, un plan estratégico y un plan de negocio, y hacer una de estas secciones es obligatorio para el premio Inspire, y decirnos lo que quieren en el cuaderno (enumerado anteriormente). Corresponde a los autores de cada cuaderno decidir cómo quieren llamar específicamente a cada sección y qué poner en cada una de ellas.
fr_ca: Les sections spécifiques nommées dans |gm1|, le manuel des juges et les lignes directrices du cahier de notes ne sont pas nombreuses. Elles comprennent un plan d'équipe, qui est à peu près tout ce qui ne concerne pas les robots - un plan de développement durable, un plan stratégique et un plan d'affaires en font partie, et la réalisation de l'une de ces sections est requise pour l'obtention du prix Inspire, ainsi que le fait de nous dire ce qu'ils veulent dans le cahier (énuméré plus haut). Il appartient à chaque rédacteur de cahier de déterminer le nom qu'il souhaite donner à chaque section et ce qu'il veut y mettre.
ro_ro: Secțiunile specifice numite în |gm1|, Manualul juriului și Ghidul pentru notebook-uri nu sunt numeroase. Acestea includ un plan de echipă, care reprezintă în mare parte tot ceea ce nu este scris pentru roboț - un plan de sustenabilitate, un plan strategic și un plan de afaceri, toate acestea se încadrează în această categorie, iar realizarea uneia dintre aceste secțiuni este obligatorie pentru premiul Inspire, și să ne spună ce își doresc în caiet (enumerate mai sus). Este la latitudinea fiecărui scriitor la caietul tehnic să își dea seama cum vor să numească în mod specific fiecare secțiune și ce să pună în fiecare secțiune.
zh_cn: 《游戏手册》第1部分、《评委手册》和《工笔指南》中提到的具体部分并不多。它们包括一个团队计划，几乎都是非机器人写作——可持续发展计划、战略计划和商业计划都属于其中，激励奖需要做其中一个部分，并告诉我们他们想要在工笔中写什么（上面列出）。这取决于个人工笔作者来弄清楚他们特别想给每个部分起什么名字，以及在每个部分中写什么。

source: Daily Logs and Other Ways of Documenting
es_mx: Registros Diarios y Otras Formas de Documentación
fr_ca: Journaux de bord et autres moyens de documentation
ro_ro: Jurnale zilnice și alte modalități de documentare
zh_cn: 日志和其他记录方式

source: This might be the most common way of documenting in notebooks. Even teams that are so-so about attempting to write a notebook have a couple months worth of logs because overall they are not that hard to do.
es_mx: Quizá sea la forma más habitual de documentarse en cuadernos. Incluso los equipos que no se esfuerzan demasiado por escribir un cuaderno tienen un par de meses de registros porque, en general, no son tan difíciles de hacer.
fr_ca: C'est peut-être la façon la plus courante de documenter les cahiers. Même les équipes qui ne parviennent pas à rédiger un cahier de notes ont des journaux de quelques mois parce que, dans l'ensemble, ils ne sont pas si difficiles à réaliser.
ro_ro: Acesta ar putea fi cel mai frecvent mod de a documenta în caiete. Chiar și echipele care nu se străduiesc prea mult să redacteze un caiet au jurnale de câteva luni, deoarece, în general, acestea nu sunt atât de greu de realizat.
zh_cn: 这可能是在工笔中记录的最常见方式。即使是那些试图写工笔的团队也有几个月的日志，因为总的来说它们并不难做到。

source: Each team approaches it differently, but a standard approach is as follows.
es_mx: Cada equipo lo enfoca de forma diferente, pero un enfoque estándar es el siguiente.
fr_ca: Chaque équipe l'aborde différemment, mais l'approche standard est la suivante.
ro_ro: Fiecare echipă o abordează diferit, dar o abordare standard este următoarea.
zh_cn: 每个团队的做法各不相同，但标准做法如下。

source: Date
es_mx: Fecha
ro_ro: Data
zh_cn: 日期

source: Members of Team Present
es_mx: Miembros del Equipo Presentes
fr_ca: Membres de l'équipe présents
ro_ro: Membri ai echipei prezenți
zh_cn: 出席会议的小组成员

source: Tasks & Pictures
es_mx: Tareas e Imágenes
fr_ca: Tâches et quelques photos
ro_ro: Sarcini și imagini
zh_cn: 任务和图片

source: More Information, if the Task Was Completed
es_mx: Más Información, si se ha Completado la Tarea
fr_ca: Plus d'informations, si la tâche a été accomplie
ro_ro: Mai multe informații, dacă sarcina a fost finalizată
zh_cn: 更多信息，如果任务已完成

source: There are other methods such as weekly, pure goals, or other engineering based methods such as agile (if you pursue the latter you can use those hard won mentors you have gotten). Weekly or bi-weekly is the same as above, but the date becomes a range and you talk about what happened over that period of time. This is better for a team that has only a couple of people doing the logs because overall logs get more and more tedious.
es_mx: Existen otros métodos, como el semanal, el de objetivos puros u otros métodos basados en la ingeniería, como el ágil (si sigues este último, puedes utilizar esos mentores que tanto te ha costado conseguir). Semanal o quincenal es lo mismo que lo anterior, pero la fecha se convierte en un intervalo y se habla de lo que ha ocurrido en ese periodo de tiempo. Esto es mejor para un equipo que sólo tiene un par de personas que hacen los registros porque los registros en general se vuelven más y más tediosos.
fr_ca: Il existe d'autres méthodes telles que les méthodes hebdomadaires, les objectifs purs, ou d'autres méthodes basées sur l'ingénierie telles que les méthodes agiles (si vous optez pour ces dernières, vous pouvez utiliser les mentors que vous avez durement gagnés). La méthode hebdomadaire ou bihebdomadaire est identique à la précédente, mais la date devient une fourchette et vous parlez de ce qui s'est passé au cours de cette période. Cette méthode est préférable pour une équipe qui n'a que quelques personnes qui font les comptes rendus, car les comptes rendus généraux deviennent de plus en plus fastidieux.
ro_ro: Există și alte metode, cum ar fi cele săptămânale, obiectivele pure sau alte metode bazate pe inginerie, cum ar fi agile (dacă o urmăriți pe cea din urmă, puteți folosi acei mentori pe care i-ați obținut cu greu). Săptămânal sau bisăptămânal este la fel ca mai sus, dar data devine un interval și vorbiți despre ce s-a întâmplat în acea perioadă de timp. Acest lucru este mai bun pentru o echipă care are doar câteva persoane care fac jurnalele, deoarece jurnalele generale devin din ce în ce mai plictisitoare.
zh_cn: 还有其他方法，例如每周，纯目标，或其他基于工程的方法，例如敏捷（如果你追求后者，你可以使用那些来之不易的导师）。每周或双周与上述相同，但日期成为一个范围，你谈论这段时间发生的事情。这对于只有几个人做日志的团队来说更好，因为整体日志变得越来越乏味。

source: Pure goals is simply as follows.
es_mx: Los objetivos puros son simplemente los siguientes.
fr_ca: Les objectifs purs sont simplement les suivants.
ro_ro: Obiectivele pure sunt pur și simplu următoarele.
zh_cn: 纯目标简单如下

source: Goal and Goal Date
es_mx: Objetivo y Fecha del Objetivo
fr_ca: Objectif et date de l'objectif
ro_ro: Obiectiv și data obiectivului
zh_cn: 目标和目标日期
