Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/notebook.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Was the Goal Completed in Time?
es_mx: ¿Se ha Cumplido el Objetivo a Tiempo?
fr_ca: L'objectif a-t-il été atteint dans les délais ?
ro_ro: Obiectivul a fost îndeplinit la timp?
zh_cn: 目标是否及时完成？

source: Exercitation ullamco
es_mx: Ejercicio ullamco

source: Building Section and Documenting the Robot
es_mx: Sección de Construcción y Documentación del Robot
fr_ca: Section de construction et documentation du robot
ro_ro: Secțiunea de construcție și documentarea robotului
zh_cn: 构建部分和记录机器人

source: You have spent a bunch of time reading the rest of this manual to learn about the robot and how to build it. The building section is about how your robot fulfills the challenge, and what the driving factors were in building your robot.
es_mx: Has pasado mucho tiempo leyendo el resto de este manual para aprender sobre el robot y cómo construirlo. La sección de construcción trata sobre cómo tu robot cumple el desafío y cuáles fueron los factores que te impulsaron a construirlo.
fr_ca: Vous avez passé beaucoup de temps à lire le reste de ce manuel pour en savoir plus sur le robot et sur la manière de le construire. La section consacrée à la construction traite de la manière dont votre robot relève le défi et des facteurs qui ont motivé la construction de votre robot.
ro_ro: Ați petrecut o grămadă de timp citind restul acestui manual pentru a învăța despre robot și despre cum să îl construiți. Secțiunea de construcție se referă la modul în care robotul vostru îndeplinește provocarea și care au fost factorii determinanți în construirea robotului.
zh_cn: 您已经花了很多时间阅读本手册的其余部分以了解机器人以及如何构建它。构建部分是关于您的机器人如何完成挑战，以及构建机器人的驱动因素是什么。

source: Information about parts and materials, as well as pictures of every mechanism (plus captions) will help the judges piece together how the robot works mechanically. Explanations of the components will illustrate the thought processes behind the design.
es_mx: La información sobre piezas y materiales, así como las imágenes de cada mecanismo (con leyenda) ayudarán a los jueces a reconstruir el funcionamiento mecánico del robot. Las explicaciones de los componentes ilustrarán el proceso de reflexión que hay detrás del diseño.
fr_ca: Les informations sur les pièces et les matériaux, ainsi que les photos de chaque mécanisme (accompagnées de légendes) aideront les juges à reconstituer le fonctionnement mécanique du robot. Les explications sur les composants illustreront le processus de réflexion de l'équipe pendant la conception.
ro_ro: Informațiile despre piese și materiale, precum și fotografiile fiecărui mecanism (plus legendele) vor ajuta juriul să reconstituie modul în care funcționează mecanic robotul. Explicațiile privind componentele vor ilustra procesele de gândire din spatele proiectului.
zh_cn: 关于零件和材料的信息，以及每个机构的图片（加上标题）将帮助评委拼凑出机器人是如何机械工作的。组件的解释将说明设计背后的思维过程。

source: Ample graphics (CAD screenshots/renders, pictures, etc.) will help judges understand how it works and why it is useful. **However, make sure that each graphic has a caption or explanation. Do not expect judges to understand how your robot works through pictures only.**
es_mx: Amplios gráficos (capturas de pantalla/renders de CAD, fotos, etc.) ayudarán a los jueces a entender cómo funciona y por qué es útil. **Sin embargo, asegúrese de que cada gráfico tenga una leyenda o explicación. No espere que los jueces entiendan cómo funciona tu robot sólo con imágenes.
fr_ca: De nombreux graphiques (captures d'écran, images, etc.) aideront les juges à comprendre comment cela fonctionne et pourquoi c'est utile. **Toutefois, veillez à ce que chaque graphique soit accompagné d'une légende ou d'une explication. Ne vous attendez pas à ce que les juges comprennent le fonctionnement de votre robot uniquement à l'aide d'images**.
ro_ro: Grafica amplă (capturi de ecran/rezultate CAD, imagini etc.) va ajuta juriul să înțeleagă cum funcționează și de ce este util. **Asemenea, asigurați-vă că fiecare grafic are o legendă sau o explicație. Nu vă așteptați ca judecătorii să înțeleagă cum funcționează robotul dvs. doar prin intermediul imaginilor.**
zh_cn: 充足的图形（CADscreenshots/renders,图片等）将帮助评委理解它是如何工作的，以及它为什么有用。但是，请确保每个图形都有标题或解释。不要指望评委只通过图片来了解你的机器人是如何工作的。

source: As with most documentation, using actual CAD screenshots or real world photos is generally better then high quality renders. While renders are interesting from a technological and aesthetic perspective, they usually take more time and effort and also don't convey your engineering process as well. CAD screenshots tend to make the document more like an actual engineering process documentation and can look much more professional, even if they aren't as aesthetically pleasing.
es_mx: Como ocurre con la mayoría de la documentación, es mejor utilizar capturas de pantalla CAD reales o fotos del mundo real que renders de alta calidad. Aunque los renders son interesantes desde el punto de vista tecnológico y estético, suelen requerir más tiempo y esfuerzo y no transmiten tan bien el proceso de ingeniería. Las capturas de pantalla CAD tienden a hacer que el documento se parezca más a la documentación de un proceso de ingeniería real y pueden parecer mucho más profesionales, aunque no sean tan agradables estéticamente.
fr_ca: Comme pour la plupart des documents, il est généralement préférable d'utiliser des captures d'écran ou des photos du monde réel plutôt que des rendus de haute qualité. Si les rendus sont intéressants d'un point de vue technologique et esthétique, ils demandent généralement plus de temps et d'efforts et ne traduisent pas aussi bien votre processus d'ingénierie. Les captures d'écran tendent à faire ressembler le document à une véritable documentation de processus d'ingénierie et peuvent paraître beaucoup plus professionnelles, même si elles ne sont pas aussi agréables sur le plan esthétique.
ro_ro: La fel ca în cazul majorității documentației, utilizarea de capturi de ecran CAD reale sau de fotografii din lumea reală este, în general, mai bună decât randările de înaltă calitate. Deși randările sunt interesante din punct de vedere tehnologic și estetic, acestea necesită de obicei mai mult timp și efort și, de asemenea, nu transmit la fel de bine procesul de inginerie. Capturile de ecran CAD tind să facă documentul să semene mai mult cu o documentație reală a procesului de inginerie și pot avea un aspect mult mai profesional, chiar dacă nu sunt la fel de plăcute din punct de vedere estetic.
zh_cn: 与大多数留档一样，使用实际的计算机辅助设计屏幕截图或真实世界的照片通常比高质量的渲染要好。虽然从技术和美学的角度来看，渲染很有趣，但它们通常需要更多的时间和精力，也不能传达您的工程过程。计算机辅助设计屏幕截图往往使文档更像实际的工程过程留档，看起来更专业，即使它们在美学上不那么令人愉悦。

source: Additionally, use math in these explanations to target the Think award.
es_mx: Además, utilice las matemáticas en estas explicaciones para orientar el premio Think.
fr_ca: En outre, utilisez des statistique dans les explications pour augmenter les chances de gagner un prix.
ro_ro: În plus, folosiți matematica în aceste explicații pentru a viza premiul Think.
zh_cn: 此外，在这些解释中使用数学来瞄准思考奖。

source: The second part is much more documentation and writing heavy, but in some ways it is easier. As you are building a robot, you will not get your final bot in the first attempt.
es_mx: La segunda parte es mucho más pesada en cuanto a documentación y escritura, pero en cierto modo es más fácil. Como estás construyendo un robot, no conseguirás tu bot final en el primer intento.
fr_ca: La deuxième partie est beaucoup plus lourde en termes de documentation et d'écriture, mais elle est d'une certaine manière plus facile. Comme vous construisez un robot, vous n'obtiendrez pas votre robot final du premier coup.
ro_ro: Cea de-a doua parte este mult mai grea din punct de vedere al documentației și al scrierii, dar, într-un fel, este mai ușoară. Deoarece construiți un robot, nu veți obține robotul final din prima încercare.
zh_cn: 第二部分更留档，写得更重，但在某些方面更容易。当你正在构建一个机器人时，你不会在第一次尝试中得到你的最终机器人。

source: Think about telling a story of how your team progressed from brainstorm and idea conception to prototyping and final design. The judges *love* to follow a logical sequence of steps as it shows how the team thought through mistakes and improved upon successes.
es_mx: Piensa en contar cómo ha progresado tu equipo desde la lluvia de ideas y la concepción de la idea hasta la creación del prototipo y el diseño final. A los jueces les *encanta* seguir una secuencia lógica de pasos, ya que demuestra cómo el equipo resolvió los errores y mejoró los éxitos.
fr_ca: Pensez à raconter comment votre équipe est passée du brainstorming et de la conception de l'idée au prototypage et à la conception finale. Les juges *préfèrent* suivre une séquence logique d'étapes, car cela montre comment l'équipe a réfléchi à ses erreurs et amélioré ses réussites.
ro_ro: Gândiți-vă să povestiți cum a progresat echipa voastră de la brainstorming și de la conceperea ideii până la prototipuri și designul final. Juriul *iubește* să urmărească o succesiune logică a etapelor, deoarece arată modul în care echipa s-a gândit la greșeli și a îmbunătățit succesele.
zh_cn: 考虑讲述一个你的团队如何从头脑风暴和想法构思到原型设计和最终设计的故事。评委们喜欢遵循逻辑顺序的步骤，因为它展示了团队是如何克服错误并在成功的基础上改进的。

source: Each time you iterate upon a part of your robot or move a step further in the engineering design process, document it. Important questions to ask while writing this section are below.
es_mx: Cada vez que itere sobre una parte de su robot o avance un paso más en el proceso de diseño de ingeniería, documéntalo. A continuación encontrarás preguntas importantes que debes plantearte al redactar esta sección.
fr_ca: Chaque fois que vous modifiez une partie de votre robot ou que vous avancez d'un pas dans le processus de conception technique, documentez-le. Vous trouverez ci-dessous les questions importantes à poser lors de la rédaction de cette section.
ro_ro: De fiecare dată când modificați o parte a robotului dumneavoastră sau faceți un pas înainte în procesul de proiectare tehnică, documentați acest lucru. Întrebările importante pe care trebuie să vi le puneți atunci când redactați această secțiune sunt prezentate mai jos.
zh_cn: 每次您迭代机器人的一部分或在工程设计过程中更进一步时，请将其记录下来。编写本节时要问的重要问题如下。

source: What prompted this change/why was this change made?
es_mx: ¿Qué motivó este cambio/por qué se hizo?
fr_ca: Qu'est-ce qui a motivé ce changement / pourquoi ce changement a-t-il été effectué ?
ro_ro: Ce a determinat această schimbare / de ce a fost făcută această schimbare?
zh_cn: 是什么促使了这一变化/为什么做出这一变化？

source: What was the change?
es_mx: ¿Cuál ha sido el cambio?
fr_ca: Quel a été le changement ?
ro_ro: Care a fost schimbarea?
zh_cn: 变化是什么？

source: How was the modification enacted?
es_mx: ¿Cómo se promulgó la modificación?
fr_ca: Comment la modification a-t-elle été mise en œuvre ?
ro_ro: Cum a fost promulgată modificarea?
zh_cn: 修改是如何实施的？

source: What were the results (good and bad)?
es_mx: ¿Cuáles fueron los resultados (buenos y malos)?
fr_ca: Quels ont été les résultats (bons et mauvais) ?
ro_ro: Care au fost rezultatele (bune și rele)?
zh_cn: 结果是什么（好的和坏的）？

source: How can this design be further improved?
es_mx: ¿Cómo puede mejorarse este diseño?
fr_ca: Comment cette conception peut-elle être améliorée ?
ro_ro: Cum poate fi îmbunătățit în continuare acest design?
zh_cn: 如何进一步改进这种设计？

source: This also includes your first unrealized ideas that your team talked about right when the team came together after the season was released.
es_mx: Esto también incluye las primeras ideas no realizadas de las que habló el equipo justo cuando se reunió tras el estreno de la temporada.
fr_ca: Cela inclut également vos premières idées non réalisées dont votre équipe a parlé dès qu'elle s'est réunie après la sortie de la saison.
ro_ro: Aceasta include, de asemenea, primele idei nerealizate despre care echipa ta a vorbit chiar atunci când s-a reunit după lansarea sezonului.
zh_cn: 这也包括你的团队在赛季发布后团队聚在一起时谈论的第一个未实现的想法。

source: Notebook Gallery
es_mx: Galería de cuadernos
fr_ca: Galerie des cahiers d'ingénierie
ro_ro: Galeria Caietelor
zh_cn: 工笔图库

source: Relic Recovery
es_mx: Recuperación de reliquias

source: `8813 Design Notebook <https://docs.google.com/document/d/1GedNbBgpffHRdZdgFTL2-qsATb4Zrg9NDpWnJrWLZ-M/edit>`_
es_mx: `8813 Cuaderno de diseño <https://docs.google.com/document/d/1GedNbBgpffHRdZdgFTL2-qsATb4Zrg9NDpWnJrWLZ-M/edit>`_

source: `9656 Technical Binder <https://docs.google.com/document/d/1vNHSydZbP434VDVAdoqnoWFLOlDnErbDbVGmIFsGc58/edit>`_
es_mx: `9656 Carpeta técnica <https://docs.google.com/document/d/1vNHSydZbP434VDVAdoqnoWFLOlDnErbDbVGmIFsGc58/edit>`_

source: `9656 Non-Technical Binder <https://docs.google.com/document/d/1qCutM4_qDffwtt5spxjaUO4TVgqlh0ORxaIAm079_a4/edit>`_
es_mx: `9656 Carpeta no técnica <https://docs.google.com/document/d/1qCutM4_qDffwtt5spxjaUO4TVgqlh0ORxaIAm079_a4/edit>`_
