Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/portfolio.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: Engineering Portfolio
es_mx: Portafolio de Ingeniería
fr_ca: Portfolio d'ingénierie
ru_ru: Инженерное Портфолио
zh_cn: 工程笔记

source: The engineering portfolio is a concise but detailed overview of your team and season. **It is required for all awards and is a critical part of the judging process**.
es_mx: El portafolio de ingeniería es una descripción concisa pero detallada de tu equipo y temporada. **Es requerido para todos los premios y es una parte crítica del proceso de evaluación**.
fr_ca: Le dossier d'ingénierie est un aperçu concis mais détaillé de votre équipe et de votre saison. **Il est requis pour tous les prix et constitue un élément essentiel du processus d'évaluation**.
ru_ru: Инженерное портфолио представляет собой краткий, но подробный обзор вашей команды и сезона. **Оно требуется для всех наград и является важной частью процесса оценки**.
zh_cn: 工程笔记摘要是对团队和赛季的简明而详细的概述。 **它是所有奖项所必需的，也是评审过程的重要组成部分。**

source: Portfolio Requirements
es_mx: Requisitos del portafolio
fr_ca: Exigences du portfolio
ru_ru: Требования к Портфолио
zh_cn: 工笔摘要要求

source: A detailed list of the requirements is listed in section 9.3 of |gm1|
es_mx: Una lista detallada de los requisitos se encuentra en la sección 9.3 de |gm1|
fr_ca: Une liste détaillée des exigences figure à la section 9.3 de |gm1|.
ru_ru: Подробный список требований приведен в разделе 9.3 |gm1|
zh_cn: |gm1| 第9.3节列出了需求的详细列表

source: The engineering portfolio is a 15 page document consisting of standard A4 or letter sized pages and a minimum 10 point font. However, despite the small number of pages, there is a lot of information that needs to be packed into the document to meet the requirements for all awards.
es_mx: El portafolio de ingeniería es un documento de 15 páginas que consiste en páginas de tamaño estándar A4 o carta y una fuente mínima de 10 puntos. Sin embargo, a pesar del pequeño número de páginas, hay mucha información que debe ser incluida en el documento para cumplir con los requisitos de todos los premios.
fr_ca: Le dossier d'ingénierie est un document de 15 pages composé de pages standard de format A4 ou lettre et d'une police de 10 points au minimum. Cependant, malgré le petit nombre de pages, le document doit contenir beaucoup d'informations pour répondre aux exigences de tous les prix.
zh_cn: 工笔摘要是一份15页的文档，由标准A4或字母大小的页面和至少10号字体组成。然而，尽管页数很少，但仍有大量信息需要打包到文档中，以满足所有奖项的要求。

source: Overall Tips
es_mx: Consejos generales
fr_ca: Conseils généraux
ru_ru: Общие Советы
zh_cn: 总体提示

source: Organize your portfolio clearly and carefully! Sections should be easy to follow and read, and have clear headings and explanations. Having your team number somewhere on the page is helpful for judges quickly reviewing portfolios.
es_mx: Organiza tu portafolio de manera clara y cuidadosa. Las secciones deben ser fáciles de seguir y leer, y tener encabezados y explicaciones claras. Tener el número de equipo en alguna parte de la página es útil para que los jueces revisen rápidamente los portafolios.
fr_ca: Organisez votre portfolio de manière claire et soignée ! Les sections doivent être faciles à suivre et à lire, et comporter des titres et des explications clairs. Le numéro de votre équipe doit figurer quelque part sur la page, ce qui permet aux juges d'examiner rapidement les dossiers.
ru_ru: Структурируйте свое портфолио четко и аккуратно! Разделы должны быть понятными и удобными для чтения, с четкими заголовками и пояснениями. Указание номера вашей команды где-нибудь на странице поможет экспертам быстро ознакомиться с портфолио.
zh_cn: 清晰仔细地整理你的工笔！章节应该易于理解和阅读，并且有清晰的标题和解释。在页面上的某个地方有你的团队编号有助于评委快速审阅工笔摘要。

source: Keep formatting and branding consistent, don't vary your design a ton from one page to another. Similar layouts can help with reading the portfolio.
es_mx: Mantén la consistencia del formato y la marca, no varíes mucho tu diseño de una página a otra. Diseños similares pueden ayudar a leer el portafolio.
fr_ca: Veillez à la cohérence de la mise en forme et de l'image de marque, ne variez pas beaucoup votre conception d'une page à l'autre. Des mises en page similaires peuvent faciliter la lecture du portfolio.
zh_cn: 保持格式和设计语言一致，不要从一个页面到另一个页面大量改变你的设计。类似的布局有助于阅读工笔摘要。

source: Make sure your text is readable! Color choices matter a lot, try to avoid similar color text on a background.
es_mx: Asegúrate de que tu texto sea legible. La elección de colores es muy importante, trata de evitar texto de colores similares al fondo.
fr_ca: Veillez à ce que votre texte soit lisible ! Le choix des couleurs a une grande importance. Essayez d'éviter un texte de couleur similaire sur un arrière-plan.
ru_ru: Убедитесь, что ваш текст читаем! Выбор цвета имеет большое значение, старайтесь избегать использования текста похожего по цвету на фон.
zh_cn: 确保你的文本读起来通顺流畅！颜色选择很重要，尽量避免背景上类似颜色的文本。

source: **Do not exceed 15 pages total, 16 with the cover page.**
es_mx: **No exceder las 15 páginas en total, 16 con la página de portada.**
fr_ca: **Ne pas dépasser 15 pages au total, 16 avec la page de couverture.
zh_cn: **总共不超过15页，与封面合计不超过16页。**

source: Less is more: Judges are going to lose interest in large unbroken blocks of text.
es_mx: Menos es más: Los jueces perderán interés en grandes bloques de texto sin interrupciones.
fr_ca: Moins on en fait, mieux ça vaut : Les juges vont se désintéresser des grands blocs de texte ininterrompus.
ru_ru: Меньше значит больше: эксперты потеряют интерес к большим непрерывным блокам текста.
zh_cn: 少即是多：评委会对大块完整的文本失去兴趣。

source: Images, Images, Images: CAD Drawings and screenshots can be useful tools, but also have actual pictures of mechanisms and components. While renders can look impressive in covers, a lot of judges prefer actual CAD screenshots or pictures.
es_mx: Imágenes, imágenes, imágenes: los dibujos CAD y las capturas de pantalla pueden ser herramientas útiles, pero también tener imágenes reales de mecanismos y componentes. Si bien las representaciones (renders) pueden lucir impresionantes en las portadas, muchos jueces prefieren capturas de pantalla CAD reales o imágenes.
fr_ca: Images, images, images : Les dessins de CAO et les captures d'écran peuvent être des outils utiles, mais il faut aussi avoir des images réelles des mécanismes et des composants. Bien que les rendus puissent être impressionnants dans les couvertures, de nombreux juges préfèrent les captures d'écran ou les images de CAO.
ru_ru: Изображения, изображения, изображения: чертежи CAD и скриншоты могут быть полезными инструментами, но также имейте реальные фотографии механизмов и компонентов. Хотя рендеры могут выглядеть впечатляюще на обложках, многие эксперты предпочитают реальные скриншоты CAD или фотографии.
zh_cn: 图像、图像、图像：CAD绘图和屏幕截图是有用的工具，但也要有结构和组件的实际图片。虽然渲染图在表面上看起来令人印象深刻，但许多评委更喜欢实际的CAD屏幕截图或图片。

source: **Make sure your team number is on the cover page of the portfolio.**
es_mx: Asegúrate de que el número de tu equipo esté en la página de portada del portafolio.
fr_ca: **Assurez-vous que votre numéro d'équipe figure sur la page de couverture du portfolio.
zh_cn: 确保你的团队编号在工笔摘要的封面上。

source: Don't over explain everything. You want to leave things for judges to ask questions about.
es_mx: No expliques todo en exceso. Quieres dejar cosas para que los jueces hagan preguntas al respecto.
fr_ca: N'expliquez pas tout à l'excès. Vous voulez laisser aux juges la possibilité de poser des questions.
ru_ru: Не объясняйте все слишком подробно. Лучше оставьте экспертам возможность задать вопросы.
zh_cn: 不要过度解释一切。把一些东西留给评委提问。

source: Remember that your portfolio isn't just for judges to read, its a good tool to have in judging as a quick reference to present to judges.
es_mx: Recuerda que tu portafolio no es solo para que los jueces lo lean, es una buena herramienta para tener al tiempo de ser juzgados como una referencia rápida para presentar a los jueces.
fr_ca: N'oubliez pas que votre portfolio n'est pas seulement destiné à être lu par les juges, mais qu'il s'agit d'un bon outil de référence rapide à présenter aux juges.
zh_cn: 记住，你的工笔摘要不仅仅是供评委阅读的，它是一个很好的判断工具，可以作为向评委展示的快速参考。

source: Cover Page
es_mx: Página de portada
fr_ca: Page de couverture
zh_cn: 封面页

source: In addition to the 15 pages, you are allowed one cover page. This should contain your team number and any relevant logos, and should also include a picture of your robot and/or team.
es_mx: Además de las 15 páginas, se permite una página de portada. Esta debe contener el número de equipo y cualquier logotipo relevante, y también debe incluir una imagen de tu robot y/o equipo.
fr_ca: En plus des 15 pages, vous avez droit à une page de couverture. Celle-ci doit contenir le numéro de votre équipe et tout logo pertinent, ainsi qu'une photo de votre robot et/ou de votre équipe.
zh_cn: 除了15页之外，您还可以有一页封面。这应该包含您的团队编号和任何相关徽标，还应该包括您的机器人和/或团队的图片。

source: Generally, the required information for an engineering portfolio can be split into one of 3 categories.
es_mx: Generalmente, la información requerida para un portafolio de ingeniería se puede dividir en una de 3 categorías.
fr_ca: En règle générale, les informations requises pour un portfolio d'ingénierie peuvent être classées dans l'une des 3 catégories suivantes.
ru_ru: Как правило, необходимая информация для инженерного портфолио может быть разделена на 3 категории.
zh_cn: 一般来说，工笔摘要所需的信息可以分为3类。

source: Robot Information
es_mx: Información del Robot
fr_ca: Informations sur le robot
zh_cn: 机器人信息

source: Team Information
es_mx: Información del equipo
fr_ca: Informations sur l'équipe
zh_cn: 团队信息

source: Outreach/Nontechnical Information
es_mx: Impacto/Información no técnica
fr_ca: Sensibilisation/information non technique
zh_cn: 外联/非技术信息

source: The season and robot overview is the core of your engineering portfolio. It contains an overview of your robot design, strategy, iterations, and shows off how your team has progressed so far throughout the season.
es_mx: La descripción de la temporada y del robot es el núcleo de tu portafolio de ingeniería. Contiene una visión general del diseño de tu robot, estrategia, iteraciones y muestra cómo tu equipo ha progresado hasta ahora a lo largo de la temporada.
fr_ca: L'aperçu de la saison et du robot est le cœur de votre portfolio d'ingénierie. Il contient une vue d'ensemble de la conception de votre robot, de la stratégie, des itérations et montre comment votre équipe a progressé jusqu'à présent au cours de la saison.
zh_cn: 赛季和机器人概述是您的工笔摘要的核心。它包含对您的机器人设计、策略、迭代的概述，并展示您的团队在整个赛季中迄今为止的进展情况。

source: Robot
ru_ru: Робот
zh_cn: 机器人

source: Your portfolio must contain an overview of your robot and its components. However, the portfolio should go a step beyond just describing the components of your robot. Generally, teams split up their robot into 3-4 parts, putting a different mechanism on a new page. The page should have pictures and descriptions of the mechanism, but should also have iterations and explanations of how the team arrived at that version of the mechanism or why that system was chosen, as well as why previous iterations didn't work and/or what was improved between iterations.
es_mx: Tu portafolio debe contener una descripción general de tu robot y sus componentes. Sin embargo, el portafolio debe ir más allá de solo describir los componentes de tu robot. Generalmente, los equipos dividen su robot en 3-4 partes, colocando un mecanismo diferente en una nueva página. La página debe tener imágenes y descripciones del mecanismo, pero también debe tener iteraciones y explicaciones de cómo el equipo llegó a esa versión del mecanismo o por qué se eligió ese sistema, así como también por qué las iteraciones anteriores no funcionaron y/o qué se mejoró entre iteraciones.
fr_ca: Votre dossier doit contenir un aperçu de votre robot et de ses composants. Cependant, le dossier doit aller plus loin que la simple description des composants de votre robot. En général, les équipes divisent leur robot en 3-4 parties, en plaçant un mécanisme différent sur une nouvelle page. La page doit contenir des images et des descriptions du mécanisme, mais aussi des itérations et des explications sur la manière dont l'équipe est parvenue à cette version du mécanisme ou sur la raison pour laquelle ce système a été choisi, ainsi que sur les raisons pour lesquelles les itérations précédentes n'ont pas fonctionné et/ou sur ce qui a été amélioré entre les itérations.
zh_cn: 你的作品集必须包含你的机器人及其组件的概述。但是，工笔摘要应该超越仅仅描述机器人的组件。通常，团队将他们的机器人分成3-4个部分，在新页面上放置不同的结构介绍。页面应该有结构的图片和描述，但也应该有迭代和解释团队如何达到该结构的版本或为什么选择该系统，以及为什么以前的迭代不起作用和/或迭代之间有什么改进。

source: Get in the habit of taking photos of everything! Whether its a quick jig meant to test something or a full on prototype, you should have pictures to put in the portfolio as iterations.
es_mx: ¡Acostúmbrate a tomar fotos de todo! Ya sea una reunión rápida destinada a probar algo o un prototipo completo, debes tener fotos para incluir en el portafolio como iteraciones.
fr_ca: Prenez l'habitude de tout photographier ! Qu'il s'agisse d'un bricolage rapide destiné à tester quelque chose ou d'un prototype complet, vous devriez avoir des photos à mettre dans le portfolio en tant qu'itérations.
ru_ru: Привыкайте фотографировать все! Будь то быстрые наброски для проверки чего-либо или полноценный прототип, у вас должны быть фотографии, которые можно будет поместить в портфолио в качестве итераций.
zh_cn: 养成拍照的习惯！无论是用来测试某样东西的快速夹具还是完整的原型，你都应该有图片作为迭代放入工笔摘要中。

source: As a quick reference, robot mechanism pages should contain the following:
es_mx: Como referencia rápida, las páginas de mecanismos de robots deben contener lo siguiente:
fr_ca: À titre de référence rapide, les pages relatives aux mécanismes des robots doivent contenir les éléments suivants :
zh_cn: 作为快速参考，机器人机构页面应包含以下内容：

source: Explanation of why that mechanism was needed
es_mx: Explicación de por qué se necesitaba ese mecanismo
fr_ca: Explication de la nécessité de ce mécanisme
ru_ru: Объяснение, почему этот механизм был необходим
zh_cn: 解释为何需要该机械结构

source: Explanation of what the mechanism is
es_mx: Explicación de lo que es el mecanismo
fr_ca: Explication du mécanisme
ru_ru: Объяснение сути механизма
zh_cn: 解释此机械结构的用途

source: Description of iterations the mechanism went through (and a quick few words on WHY it had to go through those iterations)
es_mx: Descripción de las iteraciones que el mecanismo atravesó (y unas pocas palabras sobre POR QUÉ tuvo que pasar por esas iteraciones)
fr_ca: Description des itérations par lesquelles le mécanisme est passé (et quelques mots rapides sur la raison pour laquelle il a dû passer par ces itérations).
ru_ru: Описание итераций, которые прошел механизм (и несколько слов о том, ПОЧЕМУ он должен был пройти эти стадии)
zh_cn: 描述该机械结构经历的迭代（并简要说明为什么要经历这些迭代）

source: Math/equations/sensors used with that mechanism
es_mx: Matemáticas/ecuaciones/sensores utilizados con ese mecanismo
fr_ca: Mathématiques/équations/capteurs utilisés avec ce mécanisme
ru_ru: Математика/уравнения/датчики, используемые в этом механизме
zh_cn: 该机械结构使用的数学知识/方程式/传感器

source: Pictures and/or CAD screenshots of the mechanism
es_mx: Imágenes y/o capturas de pantalla CAD del mecanismo
fr_ca: Images et/ou captures d'écran CAO du mécanisme
ru_ru: Изображения и/или скриншоты CAD механизма
zh_cn: 机械结构的图片和/或CAD屏幕截图

source: In addition to mechanism-specific pages, a page or two dedicated to a high level overview of your bot and sensors can be beneficial as a quick reference, especially in judging.
es_mx: Además de las páginas específicas del mecanismo, una o dos páginas dedicadas a una descripción general de tu bot y sensores pueden ser beneficiosas como una referencia rápida, especialmente al ser juzgado.
fr_ca: Outre les pages spécifiques aux mécanismes, une ou deux pages consacrées à une vue d'ensemble de votre robot et de vos capteurs peuvent être utiles en tant que référence rapide, en particulier lors d'un jugement.
zh_cn: 除了特定于机械结构的页面之外，一两页专门介绍您的机器人和传感器的高级概述作为快速参考也是有益的，尤其是在判断方面。

source: Season
es_mx: Temporada
fr_ca: Saison
ru_ru: Сезон
zh_cn: 赛季

source: Your season overview is a higher level explanation of your robot design and how you have proceeded with the season. This doesn't have to be completely separated from mechanism pages, but should still provide an explanation of your overall approach to the season as well as your approach to robot design in general. This section should aim to cover the following:
es_mx: Tu resumen de la temporada es una explicación a un nivel más alto de tu diseño de robot y cómo has procedido con la temporada. Esto no tiene que estar completamente separado de las páginas de mecanismos, pero aún así debe proporcionar una explicación de tu enfoque general para la temporada, así como tu enfoque para el diseño de robots en general. Esta sección debe cubrir lo siguiente:
fr_ca: Votre aperçu de la saison est une explication de haut niveau de la conception de votre robot et de la manière dont vous avez procédé au cours de la saison. Il n'est pas nécessaire de la séparer complètement des pages sur les mécanismes, mais elle doit fournir une explication de votre approche globale de la saison ainsi que de votre approche de la conception du robot en général. Cette section doit couvrir les points suivants :
ru_ru: Обзор сезона — это более общее описание конструкции вашего робота и того, как вы прошли сезон. Он не обязательно должен быть полностью отделен от страниц, посвященных механизму, но все же должен содержать объяснение вашего общего подхода к сезону, а также вашего подхода к проектированию роботов в целом. В этом разделе следует осветить следующие вопросы:
zh_cn: 您的赛季概述是对您的机器人设计以及您如何进行赛季的更高层次的解释。这不必与结构页面完全分开，但仍应解释您对赛季的整体方法以及一般机器人设计方法。本节应旨在涵盖以下内容：

source: The team's approach to game and strategy analysis
es_mx: El enfoque del equipo para el análisis de juegos y estrategias
fr_ca: L'approche de l'équipe en matière d'analyse du jeu et de la stratégie
ru_ru: Подход команды к анализу игры и стратегии
zh_cn: 团队的比赛和策略分析方法

source: Overall approach to robot design (engineering design process, iteration, etc.)
es_mx: Enfoque general para el diseño de robots (proceso de diseño de ingeniería, iteración, etc.)
fr_ca: Approche globale de la conception de robots (processus de conception technique, itération, etc.)
zh_cn: 机器人设计的总体方法（工程设计流程、迭代等）

source: Approach to problem solving and decision making
es_mx: Enfoque para resolver problemas y tomar decisiones
fr_ca: Approche de la résolution de problèmes et de la prise de décision
ru_ru: Подход к решению проблем и принятию решений
zh_cn: 解决问题和决策的方法

source: Having specific examples for these sections is generally recommended.
es_mx: Tener ejemplos específicos para estas secciones generalmente es recomendado.
fr_ca: Il est généralement recommandé de disposer d'exemples spécifiques pour ces sections.
ru_ru: Обычно рекомендуется приводить конкретные примеры для этих разделов.
zh_cn: 通常建议为这些部分提供具体示例。

source: An engineering portfolio needs to cover more then just the team's season and robot, it should cover details about the team itself. This doesn't just mean a list of team members. Topics covered in this section should include:
es_mx: Un portafolio de ingeniería debe abarcar más que solo la temporada y el robot del equipo, debe incluir detalles sobre el equipo en sí. Esto no significa simplemente una lista de miembros del equipo. Los temas cubiertos en esta sección deben incluir:
fr_ca: Un portfolio d'ingénierie ne doit pas se limiter à la saison et au robot de l'équipe, il doit également contenir des détails sur l'équipe elle-même. Il ne s'agit pas seulement d'une liste des membres de l'équipe. Les sujets abordés dans cette section doivent être les suivants
zh_cn: 工笔摘要需要涵盖的不仅仅是团队的赛季和机器人，它应该涵盖团队本身的详细信息。这不仅仅意味着团队成员的列表。本节涵盖的主题应包括：

source: Basic outline of team members and groups
es_mx: Esquema básico de los miembros del equipo y grupos
fr_ca: Schéma de base des membres de l'équipe et des groupes
zh_cn: 团队成员和小组的基本概况

source: Funding, sponsors, and expenses
es_mx: Financiamiento, patrocinadores y gastos
fr_ca: Financement, sponsors et dépenses
ru_ru: Финансирование, спонсоры и расходы
zh_cn: 资金、赞助商和费用

source: Sustainability plans
es_mx: Planes de sostenibilidad
fr_ca: Plans de développement durable
ru_ru: Планы устойчивого развития
zh_cn: 可持续性计划

source: Funding, Sponsors, and Expenses
es_mx: Financiamiento, Patrocinadores y Gastos
fr_ca: Financement, sponsors et dépenses
ru_ru: Финансирование, Спонсоры и Расходы
zh_cn: 资金、赞助商和费用

source: An important part of your team is where you get money from and how you spend your money. While perfectly precise numbers aren't required, having an awareness of what your expenses are, and where you get money from can be useful information to have in a portfolio. The portfolio should definitely include a list of sponsors, but can also include other information like team dues and a rough breakdown of expenses.
es_mx: Una parte importante de tu equipo es de dónde obtienes dinero y cómo gastas tu dinero. Si bien no se requieren números precisos, tener conciencia de cuáles son tus gastos y de dónde obtienes dinero puede ser información útil para tener en un portafolio. El portafolio definitivamente debe incluir una lista de patrocinadores, pero también puede incluir otra información como cuotas del equipo y un desglose aproximado de gastos.
fr_ca: Une partie importante de votre équipe est de savoir d'où vient l'argent et comment vous le dépensez. Bien qu'il ne soit pas nécessaire d'avoir des chiffres parfaitement précis, le fait de savoir quelles sont vos dépenses et d'où vient l'argent peut être une information utile à conserver dans un portefeuille. Le portefeuille doit absolument inclure une liste de sponsors, mais il peut aussi contenir d'autres informations telles que les cotisations de l'équipe et une répartition approximative des dépenses.
ru_ru: Важной частью вашей команды является то, откуда вы получаете деньги и как их тратите. Хотя не требуется предоставлять абсолютно точные цифры, знание о том, каковы ваши расходы и откуда вы получаете деньги, может быть полезной информацией для портфолио. Портфолио обязательно должно включать список спонсоров, но также может содержать и другую информацию, такую как взносы команды и приблизительную разбивку расходов.
zh_cn: 团队的一个重要组成部分是你从哪里得到钱以及如何花钱。虽然不需要完全精确的数字，但了解你的费用是多少，从哪里得到钱可能是工笔摘要中有用的信息。工笔摘要绝对应该包括赞助商名单，但也可以包括其他信息，如团队会费和费用的粗略分类。

source: Sustainability
es_mx: Sostenibilidad
fr_ca: Durabilité
zh_cn: 可持续性
