Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/awards/portfolio.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: Sustainability is a very important part of an organization, and it is also a major part of judged awards. Sustainability doesn't just mean funding, it includes plans for recruiting new students and mentors, maintaining and growing connections with the community, and securing new sponsors. It is important to have a sustainability plan or report, an outline of how the team plans to recruit new students, mentors, and sponsors, as well as the progress the team has made on that plan. Specifically pointing out new members, sponsors, and mentors that have joined is important, so judges can see the results your team has had.
es_mx: La sostenibilidad es una parte muy importante de una organización, y también es una parte importante de los premios juzgados. La sostenibilidad no solo significa financiamiento, incluye planes para reclutar nuevos estudiantes y mentores, mantener y fortalecer las conexiones con la comunidad y asegurar nuevos patrocinadores. Es importante tener un plan o informe de sostenibilidad, un resumen de cómo el equipo planea reclutar nuevos estudiantes, mentores y patrocinadores, así como el progreso que el equipo ha logrado en ese plan. Es importante señalar específicamente a los nuevos miembros, patrocinadores y mentores que se han unido, para que los jueces puedan ver los resultados que ha tenido tu equipo.
fr_ca: La durabilité est un élément très important d'une organisation, et c'est aussi un élément majeur des prix décernés. La durabilité ne se limite pas au financement, elle inclut des plans pour recruter de nouveaux étudiants et mentors, pour maintenir et développer les liens avec la communauté et pour trouver de nouveaux sponsors. Il est important de disposer d'un plan ou d'un rapport de viabilité, d'une description de la manière dont l'équipe prévoit de recruter de nouveaux étudiants, mentors et sponsors, ainsi que des progrès réalisés par l'équipe dans le cadre de ce plan. Il est important d'indiquer spécifiquement les nouveaux membres, parrains et mentors qui ont rejoint l'équipe, afin que les juges puissent voir les résultats obtenus par votre équipe.
zh_cn: 可持续发展是组织中非常重要的一部分，也是评判奖项的主要组成部分。可持续发展不仅仅意味着资金，它还包括招募新学生和导师、保持和发展与社区的联系以及确保新赞助商的计划。制定可持续发展计划或报告很重要，概述团队计划如何招募新学生、导师和赞助商，以及团队在该计划上取得的进展。具体指出新加入的成员、赞助商和导师很重要，因此评委可以看到你的团队取得的成果。

source: Outreach is the nontechnical aspect of your team, including connections with the general community, mentoring, and reaching out to the STEM Community. Due to how similar these things are, its tempting to combine them into one section, but there are distinctions that should be made between them.
es_mx: Impacto es el aspecto no técnico de tu equipo, incluyendo conexiones con la comunidad en general, mentoría y acercamiento a la comunidad STEM. Debido a lo similares que son estas cosas, es tentador combinarlas en una sección, pero hay distinciones que deben hacerse entre ellas.
fr_ca: La sensibilisation est l'aspect non technique de votre équipe, y compris les liens avec la communauté en général, le mentorat et les contacts avec la communauté des STIM. En raison de la similitude de ces éléments, il est tentant de les regrouper en une seule section, mais il convient de les distinguer.
ru_ru: Информационно-пропогандистская деятельность— это нетехнический аспект работы вашей команды, включающий связи с обществом в целом, наставничество и взаимодействие с сообществом STEM. Из-за сходства этих вещей возникает соблазн объединить их в один раздел, но между ними есть различия, которые следует учитывать.
zh_cn: 拓展是团队的非技术方面，包括与一般社区的联系、指导和接触STEM社区。由于这些事情是多么相似，很容易将它们合并成一个部分，但它们之间应该有所区别。

source: Connections with the STEM Community
es_mx: Conexiones con la comunidad STEM
fr_ca: Connexions avec la communauté STIM
zh_cn: 与STEM社区的联系

source: Connections with the STEM community are important to document. These should include basic details like who the person or organization is, and what they do. However, the portfolio should also explain what the team learned from the connection and why it was meaningful. Having a specific and applicable reason for a STEM connection is important, as in recent years judges have started becoming more critical of large numbers of connections that do not benefit the team.
es_mx: Las conexiones con la comunidad STEM son importantes para documentar. Estas deben incluir detalles básicos como quién es la persona u organización y qué hacen. Sin embargo, el portafolio también debe explicar lo que el equipo aprendió de la conexión y por qué fue significativa. Tener una razón específica y aplicable para una conexión STEM es importante, ya que en los últimos años los jueces han comenzado a ser más críticos con grandes cantidades de conexiones que no benefician al equipo.
fr_ca: Il est important de documenter les liens avec la communauté des STIM. Elles doivent inclure des détails de base tels que l'identité de la personne ou de l'organisation et ce qu'elle fait. Toutefois, le dossier doit également expliquer ce que l'équipe a appris de cette connexion et pourquoi elle était significative. Il est important d'avoir une raison spécifique et applicable pour une connexion STIM, car ces dernières années, les juges ont commencé à devenir plus critiques à l'égard d'un grand nombre de connexions qui ne profitent pas à l'équipe.
ru_ru: Важно документировать связи с сообществом STEM. Они должны включать основные сведения, такие как кто является этим человеком или организацией и чем они занимаются. Однако в портфолио также должно быть объяснено, чему команда научилась благодаря этой связи и почему она была значимой. Важно иметь конкретную и применимую причину для связи с STEM, поскольку в последние годы эксперты стали более критично относиться к большому количеству связей, которые не приносят пользы команде.
zh_cn: 记录与STEM社区的联系很重要。这些应该包括基本的细节，比如个人或组织是谁，他们做什么。但是，工笔摘要还应该解释团队从这种联系中学到了什么，以及为什么它有意义。有一个具体和适用的STEM联系原因很重要，因为近年来，评委们开始对大量不利于团队的联系提出越来越多的批评。

source: This should tie into your sustainability plan, as connections can often become mentors or sponsors.
es_mx: Esto debería integrarse en tu plan de sustentabilidad, ya que las conexiones a menudo pueden convertirse en mentores o patrocinadores.
fr_ca: Cela devrait être lié à votre plan de développement durable, car les relations peuvent souvent devenir des mentors ou des parrains.
ru_ru: Это должно быть связано с вашим планом устойчивого развития, поскольку связи часто могут стать наставниками или спонсорами.
zh_cn: 这应该与你的可持续发展计划相结合，因为人脉往往可以成为导师或赞助商。

source: Outreaches with the General Community
es_mx: Alcances con la Comunidad General
fr_ca: Actions de sensibilisation auprès de la communauté
zh_cn: 与普通社区的外联活动

source: Often teams will host events or outreaches with the intent of spreading the idea of *FIRST*\ |reg| and recruiting new members to their team. Documenting this correctly is important for some awards. Generally, these sections should contain details about the event such as when it took place, what your team did, and how many people you reached.
es_mx: A menudo los equipos organizan eventos o actividades con la intención de difundir la idea de *FIRST*\ |reg| y reclutar nuevos miembros para su equipo. Documentar esto correctamente es importante para algunos premios. En general, estas secciones deben contener detalles sobre el evento, como cuándo tuvo lugar, qué hizo tu equipo y cuántas personas alcanzaste.
fr_ca: Souvent, les équipes organisent des événements ou des actions de sensibilisation dans le but de diffuser l'idée de *FIRST*\ |reg| et de recruter de nouveaux membres pour leur équipe. Il est important de documenter correctement ces événements pour certaines récompenses. En général, ces sections doivent contenir des détails sur l'événement, tels que la date, ce que votre équipe a fait et le nombre de personnes que vous avez touchées.
zh_cn: 团队通常会举办活动或外展，目的是传播FIRST的理念并招募新成员加入他们的团队。正确记录这一点对于某些奖项很重要。通常，这些部分应该包含有关活动的详细信息，例如活动发生的时间、您的团队做了什么以及您接触了多少人。

source: Appendix F of |gm1| contains **very specific definitions of words like Mentored, Started, Reached, Ran, and more**. Misuse of these words can be held against you in judging, so make sure you meet the definitions of terms if you use them.
es_mx: El Apéndice F de |gm1| contiene **definiciones muy específicas de palabras como Mentorear, Comenzar, Acercarnos, Dirigir y más**. El mal uso de estas palabras puede ser utilizado en tu contra en la evaluación con los jueces, así que asegúrate de cumplir con las definiciones de los términos si las utilizas.
fr_ca: L'annexe F de |gm1| contient **des définitions très spécifiques de mots tels que Mentor, Started, Reached, Ran, et bien d'autres**. L'utilisation abusive de ces mots peut être retenue contre vous lors d'un jugement, alors assurez-vous que vous respectez les définitions des termes si vous les utilisez.
zh_cn: |gm1| 的附录F包含非常具体的单词定义，如指导、开始、达到、运行等。误用这些单词可能会对你造成损害，所以如果你使用它们，请确保你符合术语的定义。

source: When documenting how many people an event reached, it can be tempting to ask the organizers for an official head count and use that number. However, |gm1| specifically details that simply being at an event does not count someone as being reached by the team, they have to interact with your team in some way. Keeping a rough count of how many people you interact with can help you keep track of accurate numbers. **You may be questioned on how you know your numbers are accurate, so be ready to answer questions on how you kept track**.
es_mx: Cuando se documenta cuántas personas impacto un evento, puede ser tentador pedir a los organizadores un recuento oficial y utilizar ese número. Sin embargo, |gm1| detalla específicamente que simplemente estar en un evento no cuenta a alguien como impactado por el equipo, tienen que interactuar de alguna manera con su equipo. Mantener un recuento aproximado de cuántas personas interactúas puede ayudarte a llevar un registro de números precisos. **Es posible que te cuestionen sobre cómo sabes que tus números son precisos, así que prepárate para responder preguntas sobre cómo llevaste el registro**.
fr_ca: Lorsqu'il s'agit de documenter le nombre de personnes touchées par un événement, il peut être tentant de demander aux organisateurs un décompte officiel et d'utiliser ce chiffre. Cependant, |gm1| précise que le simple fait d'assister à un événement ne permet pas de considérer qu'une personne a été touchée par l'équipe, il faut qu'elle interagisse avec votre équipe d'une manière ou d'une autre. Garder un compte approximatif du nombre de personnes avec lesquelles vous interagissez peut vous aider à conserver des chiffres exacts. **Il se peut que l'on vous demande comment vous savez que vos chiffres sont exacts, alors soyez prêt à répondre à des questions sur la manière dont vous les avez suivis**.
zh_cn: 在记录一个活动接触了多少人时，向组织者询问官方人数并使用该数字可能很有诱惑力。然而，游戏手册第1部分特别详细说明，简单地参加一个活动并不会将某人算作团队接触到的人，他们必须以某种方式与您的团队互动。粗略统计您与之互动的人数可以帮助您跟踪准确的数字。 **您可能会被询问您如何知道您的数字是准确的，因此请准备好回答有关您如何跟踪的问题。**

source: Working with Other Teams
es_mx: Trabajando con otros equipos
fr_ca: Travailler avec d'autres équipes
zh_cn: 与其他团队合作

source: Mentoring, starting, and helping other teams is critical to the program itself as well as some awards. These interactions should be documented in the portfolio, as well as evidence that proves that you meet the definitions of Mentoring, Starting, and Assisting as outlined in |gm1|. In general, Mentoring requires regular, meaningful communication between you and a team, and Starting requires the new team agreeing that they were started by you.
es_mx: Mentoría, iniciar y ayudar a otros equipos es fundamental para el programa en sí, así como para algunos premios. Estas interacciones deben documentarse en el portafolio, así como la evidencia que demuestre que cumples con las definiciones de Mentoría, Inicio y Asistencia establecidas en |gm1|. En general, la Mentoría requiere una comunicación regular y significativa entre tú y un equipo, y el Iniciar un equipo requiere que el nuevo equipo esté de acuerdo en que fueron iniciados por ti.
fr_ca: Le mentorat, le démarrage et l'aide aux autres équipes sont essentiels pour le programme lui-même ainsi que pour l'obtention de certains prix. Ces interactions doivent être documentées dans le portfolio, ainsi que les preuves que vous répondez aux définitions du mentorat, du démarrage et de l'assistance telles qu'elles sont décrites dans |gm1|. En général, le mentorat exige une communication régulière et significative entre vous et une équipe, et le démarrage exige que la nouvelle équipe reconnaisse que c'est vous qui l'avez lancée.
zh_cn: 指导、开始和帮助其他团队对项目本身以及一些奖项至关重要。这些互动应该记录在作品集中，以及证明您符合 |gm1| 中概述的指导、开始和协助的定义的证据。一般来说，指导需要您和团队之间定期、有意义的沟通，而开始需要新团队同意他们是由您开始的。

source: An easy way to prove you met the definitions is to have screenshots of emails from mentors on the teams you helped stating that you Mentored, Started, or Assisted that team.
es_mx: Una forma fácil de demostrar que cumpliste con las definiciones es tener capturas de pantalla de correos electrónicos de mentores en los equipos a los que ayudaste, en los que se indique que mentoraste, iniciaste o asististe a ese equipo.
fr_ca: Un moyen facile de prouver que vous répondez aux définitions est d'avoir des captures d'écran des courriels des mentors des équipes que vous avez aidées, indiquant que vous avez encadré, démarré ou assisté l'équipe en question.
ru_ru: Простой способ доказать, что вы соответствуете этим определениям, — это предоставить скриншоты писем от наставников команд, которым вы помогали, с указанием, что вы были наставником, основателем или помощником этой команды.
zh_cn: 证明您符合定义的一种简单方法是提供来自您帮助的团队的导师的电子邮件截图，说明您指导、开始或协助了该团队。
