Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/drivetrain-gallery.po
Languages: es_mx, ro_ro, zh_cn

source: Sample Drivetrains
es_mx: Ejemplo de Chasis
ro_ro: Exemple de Șasiuri
zh_cn: 传动系统案例

source: In this section, we compile several sample drivetrains which you can use as a starting point for your own designs. You should also check the :doc:`gallery of robot designs </docs/appendix/gallery>` in the Appendix.
es_mx: En esta sección, recopilamos varios ejemplos de chasises que puedes utilizar como punto de partida para tus propios diseños. También deberías consultar la :doc:`galería de diseños de robots </docs/appendix/gallery>` en el Apéndice.
ro_ro: În această secțiune, am adunat mai multe exemple de șasiuri pe care le puteți folosi ca punct de plecare pentru propriile design-uri. De asemenea, ar trebui să consultați :doc:`galerie de design-uri de roboți </docs/appendix/gallery>` din anexă.
zh_cn: 在本节中，我们汇编了几个示例传动系统，您可以将其作为自己设计的起点。您还应该查看附录中的 :doc:`gallery of robot designs</docs/appendix/gallery>`。

source: `goBILDA strafer chassis <https://www.gobilda.com/strafer-chassis-kit-v4/>`_
es_mx: `goBILDA chasis strafer <https://www.gobilda.com/strafer-chassis-kit-v4/>`_
ro_ro: `goBILDA Strafer <https://www.gobilda.com/strafer-chassis-kit-v4/>`_

source: Basic mecanum chassis by goBILDA. Simple and easy to build chassis, providing an excellent starting point for robots built from goBILDA parts.
es_mx: Chasis mecanum básico de goBILDA. Chasis simple y fácil de construir, que proporciona un excelente punto de partida para los robots construidos a partir de piezas goBILDA.
ro_ro: Șasiu mecanum de la goBILDA. Șasiu simplu și ușor de asamblat, oferind un punct de plecare excelent pentru roboții construiți din piese goBILDA.
zh_cn: goBILDA 的基本麦克纳姆轮底盘。底盘简单易造，是使用 goBILDA 零件制造机器人的绝佳起点。

source: `goBILDA BeeLine Chassis <https://www.gobilda.com/beeline-chassis-kit/>`_
es_mx: `goBILDA BeeLine Chasis <https://www.gobilda.com/beeline-chassis-kit/>`_
ro_ro: `goBILDA BeeLine <https://www.gobilda.com/beeline-chassis- kit/>`_

source: Basic 6 wheel drive chassis by goBILDA. Simple and easy to build chassis, providing an excellent starting point for robots built from goBILDA parts.
es_mx: Chasis básico de 6 ruedas motrices de goBILDA. Chasis simple y fácil de construir, proporcionando un excelente punto de partida para los robots construidos a partir de piezas goBILDA.
ro_ro: Șasiu cu 6 roți de la goBILDA. Șasiu simplu și ușor de asamblat, oferind un punct de plecare excelent pentru roboții construiți din piese goBILDA.
zh_cn: goBILDA 的基本六轮驱动底盘。底盘简单易造，是使用 goBILDA 零件制造机器人的绝佳起点。

source: `Strafer chassis with Dead Wheels <https://drive.google.com/file/d/1R85u8nGGmBu5_6jIztOH3-5_W4XK08Mb/view?usp=drive_open>`_
es_mx: `Strafer chasis con ruedas muertas <https://drive.google.com/file/d/1R85u8nGGmBu5_6jIztOH3-5_W4XK08Mb/view?usp=drive_open>`_
ro_ro: `Șasiu Strafer cu Dead Wheels <https://drive.google.com/file/d/1R85u8nGGmBu5_6jIztOH3-5_W4XK08Mb/view?usp=drive_open>`_

source: Modification of goBILDA chassis by FTC\ |reg| 9794 Wizards.exe, which adds :term:`dead wheels <Dead Wheel>`. Also see their video tutorials: https://www.youtube.com/watch?v=OjNvAD350M4&list=PLICNg-rquurYgWAQGhu6iC0At75vgqFJp
es_mx: Modificación del chasis de goBILDA por FTC |reg| 9794 Wizards.exe, que añade :term:`ruedas muertas <Dead Wheel>`. También puedes ver sus tutoriales en vídeo: https://www.youtube.com/watch?v=OjNvAD350M4&list=PLICNg-rquurYgWAQGhu6iC0At75vgqFJp
zh_cn: 通过 FTC\ |reg| 9794 Wizards.exe 对 goBILDA 底盘进行修改，增加了 :term:`dead wheels<Dead Wheel>`。也可查看他们的视频教程：https://www.youtube.com/watch?v=OjNvAD350M4&list=PLICNg-rquurYgWAQGhu6iC0At75vgqFJp。

source: `REV Robotics 6 wheel drivetrain <https://docs.revrobotics.com/duo-build/channel-drivetrain-build-guide>`_
es_mx: `REV Robotics Chasis de 6 llantas <https://docs.revrobotics.com/duo-build/channel-drivetrain-build-guide>`_
ro_ro: `REV Robotics șasiu cu 6 roți <https://docs.revrobotics.com/duo-build/channel-drivetrain-build-guide>`_
zh_cn: `REV 机器人 6 轮传动系统 <https://docs.revrobotics.com/duo-build/channel-drivetrain-build-guide>`_

source: Sample 6 wheel drivetrain built using REV kit.
es_mx: Ejemplo de chasis de 6 ruedas construida con el kit REV.
ro_ro: Exemplu de șasiu cu 6 roți construit cu ajutorul kitului REV.
zh_cn: 使用 REV 套件制作的 6 轮传动系统案例。

source: `AndyMark Tile Runner chassis <https://andymark.com/products/configurable-tilerunner-chassis-options>`_
es_mx: `AndyMark Tile Runner (Corredor de baldosas) chasis <https://andymark.com/products/configurable-tilerunner-chassis-options>`_

source: A universal chassis kit sold by AndyMark. It is available in several modifications: 6 wheel, mecanum, tank tread. It is expensive, but using provided 3d models as inspiration for your own drivetrain is free.
es_mx: Un kit de chasis universal vendido por AndyMark. Está disponible en varias modificaciones: 6 ruedas, mecanum, banda de rodadura del tanque. Es caro, pero el uso de modelos 3d proporcionados como inspiración para su propio chasis es gratis.
ro_ro: Un kit de șasiu universal vândut de AndyMark. Este disponibil în mai multe variante de modificare: 6 roți, mecanum, tank. Este scump, dar folosirea modelelor 3d furnizate ca sursă de inspirație pentru propriul sistem de transmisie este gratuit.
zh_cn: AndyMark 销售的通用底盘套件。它有多种改装方式：6 轮、机械式、坦克胎面。虽然价格昂贵，但不用花费任何费用就可以使用他们的 3D 模型为自己传动系统提供灵感。

source: `Wizards.exe 6 wheel drive chassis <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_
es_mx: `Wizards.exe chasis de 6 ruedas motrices <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_
ro_ro: `Wizards.exe Șasiu cu 6 roți <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_
zh_cn: `Wizards.exe 6 轮驱动底盘 <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_

source: Another design by FTC 9794 Wizards.exe. Combines custom side panels with Actobotics parts (gears, chain sprockets).
es_mx: Otro diseño de FTC 9794 Wizards.exe. Combina paneles laterales personalizados con piezas de Actobotics (engranajes, piñones de cadena).
ro_ro: Un alt design de FTC 9794 Wizards.exe. Combină panouri laterale personalizate cu piese Actobotics (angrenaje, pinioane de lanț).
zh_cn: FTC 9794 Wizards.exe 的另一项设计。将定制侧板与 Actobotics 部件（齿轮、链轮）相结合。

source: `Custom drivetrain by FTC 14875 LightSpeed <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_
es_mx: `Chasis personalizado por FTC 14875 LightSpeed <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_
ro_ro: `Șasiu personalizat de FTC 14875 LightSpeed <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_
zh_cn: ` FTC 14875 LightSpeed 的自制传动系统 <https://drive.google.com/file/d/1iu2UUNlqoQ6bS1vnoRPtUI0Uv3lLjNec/view?usp=drive_open>`_

source: This design uses goBILDA mecanum wheels, motors, and some channels combined with custom side plates.
es_mx: Este diseño utiliza ruedas mecanum goBILDA, motores y algunos canales combinados con placas laterales personalizadas.
zh_cn: 该设计使用了 goBILDA 麦克纳姆轮、电机和一些与定制侧板相结合的通道。

source: Another custom drivetrain using goBILDA mecanum wheels, by redditor /u/nateless. Note that this design can be viewed but not downloaded---this is intentional; see his `original reddit post <https://www.reddit.com/r/FTC/comments/c8vlsj/cad_for_nx_vantageh_is_going_public/>`_.
es_mx: Otro chasis personalizado con ruedas mecanum de goBILDA, por el redditor /u/nateless. Ten en cuenta que este diseño puede verse pero no descargarse; esto es intencionado; consulta su `publicación original en reddit <https://www.reddit.com/r/FTC/comments/c8vlsj/cad_for_nx_vantageh_is_going_public/>`_.
ro_ro: Un alt șasiu personalizat folosind roți goBILDA mecanum, de către redditorul /u/nateless. Rețineți că acest design poate fi vizualizat, dar nu și descărcat - acest lucru este intenționat; vedeți postarea sa `originală pe reddit <https://www.reddit.com/r/FTC/comments/c8vlsj/cad_for_nx_vantageh_is_going_public/>`_.
zh_cn: 另一个使用 goBILDA 麦克纳姆轮的定制传动系统，由 redditor /u/nateless 制作。请注意，这个设计可以查看，但不能下载--这是故意的；请参阅他的 `原始 reddit 帖子<https://www.reddit.com/r/FTC/comments/c8vlsj/cad_for_nx_vantageh_is_going_public/>`_。
