Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/holonomic.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Holonomic Drivetrains
es_mx: Chasises holonómicos
fr_ca: Châssis Holonomiques
ro_ro: Șasiuri Holonomice
zh_cn: 整体工程学动力传动系统

source: Mecanum Drive
fr_ca: Châssis Mecanum
ro_ro: Șasiul Mecanum
zh_cn: 麦克纳姆轮传动系统

source: Mecanum drivetrains consist of four mecanum wheels which are powered independently by one motor. This configuration angles the velocity of each wheel, allowing the robot to strafe.
es_mx: Los chasises mecanum constan de cuatro ruedas mecánicas accionadas independientemente por un motor. Esta configuración angula la velocidad de cada rueda, lo que permite al robot derrapar.
fr_ca: Les systèmes de châssis Mecanum se composent de quatre roues Mecanum qui sont entraînées indépendamment par un seul moteur. Cette configuration oriente la vitesse de chaque roue, ce qui permet au robot de se déplacer latéralement.
ro_ro: Șasiurile mecanum sunt construite din patru roți mecanum care sunt puse în mișcare independent de câte un motor. Această configurație controlează velocitatea fiecărei roți, astfel robotul fiind capabil de a face strafe (a se mișca în lateral)
zh_cn: 麦克纳姆传动系统由四个麦克纳姆轮组成，它们由一个电机独立驱动。这种结构可以调整每个轮子的速度，使机器人能够进行平移。

source: Term
es_mx: Término
fr_ca: Définition
ro_ro: Termen
zh_cn: 提示

source: Mecanum Wheel
es_mx: Rueda Mecanum
fr_ca: Roue Mécanum
ro_ro: Roata Mecanum
zh_cn: 麦克纳姆轮

source: Mecanum wheels are a special type of wheel that enable maneuverability and holonomic strafing as opposed to traditional wheels. They consist of a series of rubber rollers rotated 45 degrees to either the left or right.
es_mx: Las ruedas Mecanum son un tipo especial de ruedas que permiten una maniobrabilidad y un ametrallamiento holonómico a diferencia de las ruedas tradicionales. Consisten en una serie de rodillos de goma girados 45 grados a izquierda o derecha.
fr_ca: Les roues Mecanum sont un type spécial de roues qui permettent la maniabilité et le déplacement latéral, contrairement aux roues traditionnelles. Elles sont constituées d'une série de rouleaux en caoutchouc tournés à 45 degrés vers la gauche ou la droite.
ro_ro: Roțile mecanum sunt un tip special de roți care permit manevrabilitatea și strafing-ul holonomic, față de roțile tradiționale. Acestea conțin o serie de role din cauciuc rotite la 45 de grade fie în stânga, fie în dreapta.
zh_cn: 麦克纳姆轮是一种特殊的车轮，与传统车轮相比，它具有机动性和整体扫射功能。它们由一系列向左或向右旋转 45 度的橡胶滚轮组成。

source: In a conventional mecanum drivetrain, running the wheels on one diagonal in the opposite direction to those on the other diagonal causes sideways movement. Combinations of these wheel motions allow for vehicle motion in any direction with any vehicle rotation (including no rotation at all).
es_mx: En un chasis mecanum convencional, el desplazamiento de las ruedas de una diagonal en dirección opuesta a las de la otra diagonal provoca un movimiento lateral. Las combinaciones de estos movimientos de las ruedas permiten el movimiento del vehículo en cualquier dirección con cualquier rotación del vehículo (incluida la ausencia total de rotación).
fr_ca: Dans un châssis mecanum classique, le fait de faire tourner les roues d'une diagonale dans le sens opposé à celles de l'autre diagonale provoque un mouvement latéral. La combinaison de ces mouvements de roues permet de déplacer le véhicule dans n'importe quelle direction avec n'importe quelle rotation du véhicule (y compris sans aucune rotation).
ro_ro: Într-un șasiu mecanum convențional, rotirea roților pe o diagonală în direcția opusă celor de pe cealaltă diagonală permite mișcarea în lateral. Combinarea acestor mișcări ale roților permit mișcarea în orice direcție cu orice rotație (inclusiv fără rotație).
zh_cn: 在传统的机械传动系统中，一个对角线上的车轮与另一个对角线上的车轮运行方向相反，会导致车辆侧向运动。这些车轮运动的组合可以使车辆在任何方向上以任何车辆旋转（包括完全不旋转）的方式运动。

source: The primary advantage to mecanum drive is the maneuverability it affords, especially because the robot can strafe instead of turn and drive. The rollers on mecanum wheels form a 45 degree angle with the wheel's axis of rotation, which means that mecanum drivetrains can't strafe as fast as they can drive forward.
es_mx: La principal ventaja del chasis mecanum es la maniobrabilidad que ofrece, sobre todo porque el robot puede ametrallar en lugar de girar y avanzar. Los rodillos de las ruedas mecanum forman un ángulo de 45 grados con el eje de rotación de la rueda, lo que significa que los chasises mecanum no pueden ametrallar tan rápido como pueden avanzar.
fr_ca: Le principal avantage du châssis mecanum est la maniabilité qu'il offre, en particulier parce que le robot peut faire des mouvements latéraux au lieu de tourner et de rouler. Les rouleaux des roues mecanums forment un angle de 45 degrés avec l'axe de rotation de la roue, ce qui signifie que les châssis mecanum ne peuvent pas rouler latéralement aussi rapidement qu'elles peuvent avancer.
zh_cn: 麦克纳姆传动系统的主要优势在于它的机动性，尤其是因为机器人可以平移而不是转弯行驶。麦柯纳姆车轮上的滚轮与车轮的旋转轴成 45 度角，这意味着麦柯纳姆传动系统的平移速度比不上前进速度。

source: This can be explained by discussing the forces involved. When each wheel rotates, it applies a friction force to the ground, which moves the robot. When moving forward, both sets of left wheels rotate in the same direction at the same speed, and both sets of right wheels rotate in the same direction at the same speed, meaning that the forces do not oppose each other. However, when strafing, neither the two left wheels nor the two right wheels are rotating at the same speed. In many cases, they even rotate in opposite directions.
es_mx: Esto puede explicarse analizando las fuerzas implicadas. Cuando cada rueda gira, aplica una fuerza de fricción al suelo, lo que mueve el robot. Cuando se mueve hacia delante, los dos conjuntos de ruedas izquierdas giran en la misma dirección a la misma velocidad, y los dos conjuntos de ruedas derechas giran en la misma dirección a la misma velocidad, lo que significa que las fuerzas no se oponen entre sí. Sin embargo, al ametrallar, ni las dos ruedas izquierdas ni las dos ruedas derechas giran a la misma velocidad. En muchos casos, incluso giran en sentidos opuestos.
fr_ca: Cela peut s'expliquer en examinant les forces en jeu. Lorsque chaque roue tourne, elle applique une force de frottement au sol, ce qui fait avancer le robot. Lorsqu'il avance, les deux roues gauches tournent dans le même sens et à la même vitesse, et les deux roues droites tournent dans le même sens et à la même vitesse, ce qui signifie que les forces ne s'opposent pas l'une à l'autre. Cependant, lors d'un déplacement latéral, ni les deux roues gauches ni les deux roues droites ne tournent à la même vitesse. Dans de nombreux cas, elles tournent même en sens inverse.
ro_ro: Acest fenomen poate fi explicat prin discutarea forțelor implicate. Când fiecare roată se rotește, aplică o forță de frecare cu pământul, care rotește robotul. Când te miști în față, ambele seturi din stânga de roți se rotesc în aceeași direcție la aceeași viteză, iar ambele seturi din dreapta de roți se rotesc în acceași direcție la aceeași viteză, aceea ce înseamnă că forțele nu se opun unele altora. Însă, când faci strafe, niciuna din roțile din stânga sau roțile din dreapta se rotesc la aceeași viteză. În multe cazuri, se rotesc în direcții opuse.
zh_cn: 这可以通过讨论相关的力来解释。每个轮子转动时，都会对地面产生摩擦力，从而推动机器人前进。前进时，两组左轮以相同的速度同方向旋转，两组右轮以相同的速度同方向旋转，这意味着力不会相互抵消。然而，在扫射时，两个左轮和两个右轮的旋转速度都不相同。在许多情况下，它们的旋转方向甚至相反。

source: These two opposing forces cause the rollers to slip more and more, which angles the robot's velocity at the expense of traction (more slipping results in a loss of speed). However, the wheels do still slip when moving forward but not as drastically as they do when strafing.
es_mx: Estas dos fuerzas opuestas hacen que los rodillos resbalen cada vez más, lo que angula la velocidad del robot a expensas de la tracción (más deslizamiento se traduce en una pérdida de velocidad). Sin embargo, las ruedas siguen patinando al avanzar, pero no tan drásticamente como al ametrallar.
fr_ca: Ces deux forces opposées font glisser les rouleaux de plus en plus, ce qui augmente la vitesse du robot au détriment de la traction (plus de glissement entraîne une perte de vitesse). Cependant, les roues glissent toujours lorsqu'elles avancent, mais pas aussi radicalement que lorsqu'elles font du déplacement latéral.
zh_cn: 这两种相反的力会导致滚轮打滑越来越多，从而以牺牲牵引力为代价（打滑越多，速度越低）使机器人的速度成角度变化。不过，在向前移动时，滚轮仍会打滑，但不会像扫射时那样剧烈。

source: This is the primary disadvantage to mecanum drivetrains: they tend not to have much pushing power and thus, are vulnerable to defense by a sturdy tank drive.
es_mx: Está es la principal desventaja de los chasises mecanum: no suelen tener mucha fuerza de empuje y, por tanto, son vulnerables a la defensa de un robusto tanque de tracción.
fr_ca: C'est le principal inconvénient des châssis mecanum : elles ont tendance à ne pas avoir beaucoup de force de poussée et sont donc vulnérables à la défense par un châssis de type tank.
ro_ro: Acesta este dezavantajul principal la șasiurile mecanum: ele tind să nu aibă prea multă putere de împingere și astfel, sunt vulnerabile la defensivă din partea unui șasiu tank robust.
zh_cn: 这是机械传动系统的主要缺点：它们往往没有太大的推动力，因此容易受到坚固的坦克驱动装置的攻击。

source: Due to the fact that mecanum wheels are more likely to slip because of the diagonal rollers, an optional addition to mecanum drives is a separate odometry mechanism in order to track the robot's location during autonomous.
es_mx: Debido al hecho de que las ruedas mecanum son más propensas a resbalar a causa de los rodillos diagonales, una adición opcional a los chasises mecanum es un mecanismo de odometría independiente con el fin de rastrear la ubicación del robot durante la autonomía.
fr_ca: Étant donné que les roues mecanum sont plus susceptibles de glisser en raison des rouleaux diagonaux, un mécanisme d'odométrie distinct peut être ajouté en option aux châssis mecanum afin de suivre l'emplacement du robot pendant qu'il est autonome.
zh_cn: 由于对角滚轮的存在，麦克纳姆轮更容易打滑，因此在麦克纳姆驱动装置上可选择增加一个单独的测距装置，以便在自主运行时跟踪机器人的位置。

source: It is important to note that in order to maximize the efficiency and stability of mecanum drives, when viewed from above, the rollers of each wheel should point towards the center of the robot, forming an X shape, rather than a rhombus.
es_mx: Es importante señalar que para maximizar la eficacia y la estabilidad de los accionamientos mecanum, vistos desde arriba, los rodillos de cada rueda deben apuntar hacia el centro del robot, formando una X, en lugar de un rombo.
fr_ca: Il est important de noter que pour maximiser l'efficacité et la stabilité des châssis mecanums, les rouleaux de chaque roue doivent être orientés vers le centre du robot, formant ainsi un X plutôt qu'un losange.
ro_ro: Este important de reținut faptul că, pentru a maximiza eficiența și stabilitatea șasiurilor mecanum, când sunt văzute de sus, rolele fiecărei roți ar trebui să fie îndreptate înspre centrul robotului, formând o formă de X, decât un romb.
zh_cn: 值得注意的是，为了最大限度地提高机械手驱动装置的效率和稳定性，从上面看，每个轮子的滚轴应指向机器人的中心，形成 X 形，而不是菱形。

source: The primary reason for this is that it allows the drivetrain to turn significantly faster than it would otherwise be able to. When using the suggested setup, when viewed from the robot's underside, the rollers form a rhombus. This allows the force applied by the wheels on the ground to act tangent to the turn radius, leading to faster turning.
es_mx: La razón principal es que permite al chasis girar mucho más rápido de lo que podría hacerlo de otro modo. Cuando se utiliza la configuración sugerida, si se mira desde la parte inferior del robot, los rodillos forman un rombo. Esto permite que la fuerza aplicada por las ruedas sobre el suelo actúe tangente al radio de giro, lo que se traduce en un giro más rápido.
fr_ca: La raison principale en est que cela permet au châssis de tourner beaucoup plus vite qu'il ne pourrait le faire autrement. Avec la configuration proposée, les rouleaux forment un losange lorsqu'ils sont vus de la face inférieure du robot. Cela permet à la force appliquée par les roues sur le sol d'agir de manière tangente au rayon de braquage, ce qui permet de tourner plus rapidement.
zh_cn: 这样做的主要原因是，它可以使传动系统的转动速度明显快于其他方式。使用建议的设置时，从机器人底部看，滚轮形成一个菱形。这使得车轮施加在地面上的力与转弯半径相切，从而加快了转弯速度。

source: See `this video <https://www.youtube.com/watch?v=xgWf_t8owI0&t=3152s>`_ and `this other video <https://youtu.be/YJaX3vQ6kHw?t=123>`_ for a more in depth explanation.
es_mx: Consulte `este vídeo <https://www.youtube.com/watch?v=xgWf_t8owI0&t=3152s>`_ y `este otro vídeo <https://youtu.be/YJaX3vQ6kHw?t=123>`_ para una explicación más detallada.
fr_ca: Voir `cette vidéo <https://www.youtube.com/watch?v=xgWf_t8owI0&t=3152s>`_ et `cette autre vidéo <https://youtu.be/YJaX3vQ6kHw?t=123>`_ pour une explication plus approfondie.
ro_ro: Vezi `acest video <https://www.youtube.com/watch?v=xgWf_t8owI0&t=3152s>`_ și `acest alt video <https://youtu.be/YJaX3vQ6kHw?t=123>`_ pentru o explicație mai detaliată.
zh_cn: 有关更深入的解释，请参阅 `此视频 <https://www.youtube.com/watch?v=xgWf_t8owI0&t=3152s>`_ 和 `此其他视频 <https://youtu.be/YJaX3vQ6kHw?t=123>`_ 。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
ro_ro: Avantaje
zh_cn: 优势

source: Fantastic maneuverability and agility due to strafing, can avoid defense very well
es_mx: Fantástica maniobrabilidad y agilidad gracias al ametrallamiento, puede evitar muy bien la defensa
fr_ca: Manœuvrabilité et agilité fantastiques grâce au déplacement latéral, peut très bien éviter les défenses.
ro_ro: Manevrabilitate fantastică și agilitate datorită strafing-ului, poate evita devensiva foarte ușor
zh_cn: 平移带来的出色机动性和敏捷性，可以很好地躲避防御

source: Good acceleration, can have high top speed
es_mx: Buena aceleración, puede tener una alta velocidad máxima
fr_ca: Bonne accélération, vitesse de pointe élevée
ro_ro: Accerelație bună, poate avea o viteză maximă mare
zh_cn: 加速性能好，最高速度高

source: Very versatile drivetrain for nearly any game
es_mx: Chasis muy versátil para casi cualquier juego
fr_ca: Une transmission très polyvalente pour presque tous les jeux
ro_ro: Un șasiu foarte versatil pentru aproape orice joc
zh_cn: 非常灵活的传动系统，几乎适用于任何比赛

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
ro_ro: Dezavantaje
zh_cn: 缺点

source: Suffers in traction, as mecanum rollers have a lower coefficient of friction than traction wheels; cannot traverse terrain
es_mx: Sufre en la tracción, ya que los rodillos mecanum tienen un coeficiente de fricción inferior al de las ruedas de tracción; no puede atravesar terrenos
fr_ca: Souffre en traction, car les rouleaux mecanum ont un coefficient de frottement plus faible que les roues de traction ; ne peut pas traverser le terrain.
ro_ro: Tracțiunea lasă de dorit, din moment ce rolele mecanum au un coeficient de frecare mai mic decât roțile de tracțiune, nu poate traversa teren în relief
zh_cn: 由于机械滚筒的摩擦系数低于牵引轮，因此牵引力较差；无法穿越地形

source: Able to be pushed around on defense
es_mx: Capaz de ser presionado en defensa
fr_ca: Capable de se faire bousculer en défense
ro_ro: Poate să fie împins ușor în defensivă
zh_cn: 可能会在防守中被推来推去

source: Wheels must be powered independently, so there is no redundancy
es_mx: Las ruedas deben alimentarse de forma independiente, por lo que no hay redundancia
fr_ca: Les roues doivent être alimentées indépendamment, il n'y a donc pas de redondance.
ro_ro: Roțile trebuie să fie puse în mișcare independent, deci nu există redundanță
zh_cn: 车轮必须独立供电，因此没有冗余

source: CAD Examples of Mecanum Drive (Click to expand)
es_mx: Ejemplos CAD de Mecanum Drive (Haga clic para ampliar)
fr_ca: Exemples CAD de Mecanum Drive (Cliquez pour agrandir)
ro_ro: Exemple CAD ale Șasiurilor Mecanum (apasă pentru a mări)
zh_cn: Mecanum Drive 的 CAD 示例（点击展开）

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/df9bcea72fcdd7e4aee4134b>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/df9bcea72fcdd7e4aee4134b>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/df9bcea72fcdd7e4aee4134b>`__
ro_ro: `Apasă aici pentru a explora online acest model CAD în OnShape <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/df9bcea72fcdd7e4aee4134b>`__
zh_cn: `点击此处在 OnShape 在线 CAD 中查看此模型 <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/df9bcea72fcdd7e4aee4134b>`__

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/b8d4a6cfe4f26c5170f40a6c>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/b8d4a6cfe4f26c5170f40a6c>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/b8d4a6cfe4f26c5170f40a6c>`__
ro_ro: `Apasă aici pentru a explora online acest model CAD în OnShape <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/b8d4a6cfe4f26c5170f40a6c>`__
zh_cn: `点击此处在 OnShape 在线 CAD 中查看此模型 <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/b8d4a6cfe4f26c5170f40a6c>`__

source: goBILDA Custom
es_mx: goBILDA Personalizado
fr_ca: goBILDA personnalisé
zh_cn: goBILDA 定制

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/cc2df2fbce0e9ca393696b54>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/cc2df2fbce0e9ca393696b54>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/cc2df2fbce0e9ca393696b54>`__
ro_ro: `Apasă aici pentru a explora online acest model CAD în OnShape <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/cc2df2fbce0e9ca393696b54>`__
zh_cn: `点击此处在 OnShape 在线 CAD 中查看此模型 <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/cc2df2fbce0e9ca393696b54>`__

source: REV Custom
es_mx: REV Personalizado
fr_ca: REV personnalisé

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/40c3266dab2e444011cce79c>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/40c3266dab2e444011cce79c>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/40c3266dab2e444011cce79c>`__
ro_ro: `Apasă aici pentru a explora online acest model CAD în OnShape <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/40c3266dab2e444011cce79c>`__
zh_cn: `点击此处在 OnShape 在线 CAD 中查看此模型 <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/40c3266dab2e444011cce79c>`__

source: Diagram of mecanum directions
es_mx: Diagrama de las direcciones de mecanum
fr_ca: Diagramme des directions du Mecanum
ro_ro: Diagramă a direcțiilor mecanum
zh_cn: 机械臂方向图

source: Configuration for mecanum wheels, courtesy goBILDA
es_mx: Configuración para ruedas mecanum, cortesía de goBILDA
fr_ca: Configuration des roues mecanums, avec l'aimable autorisation de goBILDA
ro_ro: Configurație pentru roți mecanum, din partea goBILDA
zh_cn: 麦克纳姆轮的配置，goBILDA 提供

source: Mecanum Wheels Miniguide
es_mx: Miniguía de ruedas Mecanum
fr_ca: Miniguide des roues Mecanum
zh_cn: 麦克纳姆轮·微指南

source: One of the most important features of a mecanum wheel is the mechanism that allows the roller to spin---either :term:`bushings <Bushing>` or :term:`ball bearings <Ball Bearing>`. Mecanums which use ball bearings strafe better than those which use bushings, as the rollers can spin with less friction.
es_mx: Una de las características más importantes de una rueda mecanum es el mecanismo que permite que el rodillo gire: :term:`casquillos <Bushing>` o :term:`rodamiento de bolas <Ball Bearing>`. Los mecanums que utilizan rodamientos de bolas traccionan mejor que los que utilizan casquillos, ya que los rodillos pueden girar con menos fricción.
fr_ca: L'une des caractéristiques les plus importantes d'une roue mecanum est le mécanisme qui permet au rouleau de tourner - soit les :term:`bagues <Bushing>`, soit les :term:`roulements à billes <Ball Bearing>`. Les mecanums qui utilisent des roulements à billes ont un meilleur comportement que ceux qui utilisent des bagues, car les rouleaux peuvent tourner avec moins de friction.
zh_cn: 麦克纳姆轮最重要的特征之一是让滚子旋转的装置-- :term:`bushings <Bushing>` 或 :term:`ball bearings <Ball Bearing>` 。使用滚珠轴承的机械轮比使用衬套的机械轮更能飞，因为滚轮旋转时的摩擦更小。

source: In the past, some teams have invested in 6 inch diameter mecanum wheels. These are generally much more expensive and generally do not provide significant performance benefits. We highly recommend sticking with wheels that are between 3 and 4 inches in diameter.
es_mx: En el pasado, algunos equipos han invertido en ruedas mecanum de 6 pulgadas de diámetro. Éstas suelen ser mucho más caras y, por lo general, no aportan ventajas significativas en cuanto al rendimiento. Recomendamos encarecidamente utilizar ruedas de entre 3 y 4 pulgadas de diámetro.
fr_ca: Dans le passé, certaines équipes ont investi dans des roues mecanum de 6 pouces de diamètre. Ces roues sont généralement beaucoup plus chères et n'offrent généralement pas d'avantages significatifs en termes de performances. Nous recommandons vivement de s'en tenir à des roues d'un diamètre de 3 à 4 pouces.
zh_cn: 过去，一些车队曾投资购买直径为 6 英寸的麦克纳姆轮。这些轮子通常要贵得多，而且一般不会带来明显的性能优势。我们强烈建议使用轮径在 3 到 4 英寸之间的轮子。

source: Recommended
es_mx: Recomendado
fr_ca: Recommandé
zh_cn: 推荐

source: These wheels are the gold standard of mecanum wheels, if you are buying new mecanum wheels there is very little reason to buy any mecanum wheels not from this section.
es_mx: Estas ruedas son el estándar de oro de las ruedas mecanum, si usted está comprando nuevas ruedas mecanum hay muy pocas razones para comprar cualquier rueda mecanum no de esta sección.
fr_ca: Ces roues sont l'étalon-or des roues Mecanum, si vous achetez de nouvelles roues Mecanum, il y a très peu de raisons d'acheter des roues Mecanum qui ne font pas partie de cette section.
zh_cn: 这些车轮是麦克纳姆轮的黄金标准，如果您要购买新的麦轮，几乎没有理由不从这部分购买任何麦轮。
