Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/holonomic.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: H-Drive is theoretically very easy to code, but most teams employ some sort of gyro correction to strafe straight, although it is not necessary with proper weight distribution.
es_mx: H-Drive es teóricamente muy fácil de codificar, pero la mayoría de los equipos emplean algún tipo de corrección giroscópica para derrapar en línea recta, aunque no es necesario con una distribución adecuada del peso.
fr_ca: Le H-Drive est théoriquement très facile à coder, mais la plupart des équipes utilisent une sorte de correction gyroscopique pour se diriger en ligne droite, bien que cela ne soit pas nécessaire avec une bonne répartition du poids.
zh_cn: H-Drive理论上非常容易编码，但大多数团队都会使用某种陀螺仪校正来进行直线扫射，尽管在重量分配合理的情况下并不需要这样做。

source: H-Drive has a number of possible motor configurations - 1 or 2 motors can be put on each forward drive pod, and one or two motors can be put on the strafe wheels. In the configuration with one motor on each forward drive pod, H-Drive has slightly reduced acceleration compared to mecanum drive.
es_mx: H-Drive tiene varias configuraciones de motor posibles: se pueden colocar 1 ó 2 motores en cada cápsula de propulsión delantera y uno o dos motores en las ruedas de ametrallamiento. En la configuración con un motor en cada cápsula de propulsión delantera, la aceleración de la propulsión H es ligeramente inferior a la de la propulsión mecanum.
fr_ca: H-Drive a plusieurs configurations de moteurs possibles - 1 ou 2 moteurs peuvent être placés sur chaque pod de propulsion avant, et un ou deux moteurs peuvent être placés sur les roues de mitraillage. Dans la configuration avec un moteur sur chaque nacelle avant, le H-Drive a une accélération légèrement réduite par rapport au châssis mecanum.
zh_cn: H-Drive有多种可能的电机配置--每个前进驱动舱可安装1或2个电机，扫射轮可安装1或2个电机。与机械传动相比，H-Drive在每个前驱动吊舱上安装一个电机的配置下，加速度略有降低。

source: For the highest possible reliability, many FRC\ |reg| teams will suspend their strafe wheels on a rocker system to ensure that all wheels are in contact with the ground while the robot is not strafing.
es_mx: Para la mayor fiabilidad posible, muchos equipos FRC |reg| suspenderán sus ruedas strafe en un sistema de balancín para asegurar que todas las ruedas están en contacto con el suelo mientras el robot no está ametrallando.
fr_ca: Pour une fiabilité maximale, beaucoup d'équipes FRC\ |reg| suspendent leurs roues de déplacement latéral sur un système de bascule pour s'assurer que toutes les roues sont en contact avec le sol lorsque le robot n'est pas en train de se déplacer latéralement.
zh_cn: 为了获得尽可能高的可靠性，许多FRC\ |reg| 团队会将它们的扫射轮悬挂在摇杆系统上，以确保机器人不扫射时所有轮子都与地面接触。

source: By far the biggest advantage of H-drive is its ability to accommodate multiple motor distributions. For instance, if you want to dedicate only 3 motors to your mechanisms and you have a motor left over, using a 1 strafe motor, 4 drive motor configuration is absolutely viable. Or if you dedicate 5 motors for your mechanisms, H-drive with 2 drive motors and 1 strafe motor is definitely optimal.
es_mx: La mayor ventaja de la tracción en H es, con diferencia, su capacidad para adaptarse a múltiples distribuciones de motores. Por ejemplo, si quieres dedicar sólo 3 motores a tus mecanismos y te sobra un motor, usar una configuración de 1 motor de ametrallamiento y 4 motores de accionamiento es absolutamente viable. O si dedicas 5 motores a tus mecanismos, H-drive con 2 motores de accionamiento y 1 motor de strafe es definitivamente óptimo.
fr_ca: Le plus grand avantage du H-drive est de loin sa capacité à s'adapter à de multiples distributions de moteurs. Par exemple, si vous souhaitez dédier seulement 3 moteurs à vos mécanismes et qu'il vous reste un moteur, une configuration avec 1 moteur de déplacement latéral et 4 moteurs d'entraînement est tout à fait viable. Ou si vous consacrez 5 moteurs à vos mécanismes, la configuration H-drive avec 2 moteurs d'entraînement et 1 moteur de déplacement latéral est tout à fait optimale.
zh_cn: 到目前为止，H-drive的最大优势在于它能够适应多种电机分布。例如，如果您只想将3个电机专用于您的机械装置，而且还有一个电机剩余，那么使用1个扫瞄电机、4个驱动电机的配置绝对可行。或者，如果您想为机械装置分配 5个电机，那么使用2个驱动电机和1个扫瞄电机的H-drive绝对是最佳选择。

source: Combines tank and holonomic drivetrain advantages
es_mx: Combina las ventajas del tanque y el chasis holonómico
fr_ca: Combine les avantages du réservoir et de la transmission holonomique
zh_cn: 兼具油箱和整体式动力传动系统的优势

source: Can be used with 3 or 5 motors
es_mx: Puede utilizarse con 3 ó 5 motores
fr_ca: Peut être utilisé avec 3 ou 5 moteurs
zh_cn: 可与3或5个电机一起使用

source: Good traction and top speed
es_mx: Buena tracción y velocidad máxima
fr_ca: Bonne traction et bonne vitesse de pointe
zh_cn: 良好的牵引力和最高速度

source: Great maneuverability and agility
es_mx: Gran maniobrabilidad y agilidad
fr_ca: Grande maniabilité et agilité
zh_cn: 出色的机动性和灵活性

source: Strafing is slightly less effective than mecanum
es_mx: Ametrallamiento ligeramente menos eficaz que mecanum
fr_ca: Le déplacement latéral est légèrement moins efficace que le mecanum
zh_cn: 扫射的效果略逊于麦克纳姆轮

source: Complex suspension occasionally needed, depending on design
es_mx: Suspensión compleja ocasionalmente necesaria, dependiendo del diseño
fr_ca: Une suspension complexe est parfois nécessaire, en fonction de la conception
zh_cn: 偶尔需要复杂的悬挂系统，视设计而定

source: 9804 Bomb Squad's H-Drive
fr_ca: Le H-Drive de l'équipe Bomb Squad 9804
zh_cn: 9804 Bomb Squad队伍的H-Drive

source: Viable
zh_cn: 可行方案

source: `Andymark Heavy Duty Mecanum Wheels <https://www.andymark.com/products/4-in-hd-mecanum-wheel-set-options>`_ ($225): These are easily the most expensive mecanums on the list. These wheels are 4" in diameter and 1.65" wide. These are bushing based mecanums, so while they strafe decently they still perform worse than bearing based ones. They have a good amount of traction, more than the Nexus bearing or bushing wheels.
es_mx: `Andymark Heavy Duty Mecanum Wheels <https://www.andymark.com/products/4-in-hd-mecanum-wheel-set-options>`_ ($225 dólares): Estos son fácilmente los más caros mecanums en la lista. Estas ruedas son de 4 "de diámetro y 1,65" de ancho. Se trata de mecanums basado en casquillos, por lo que si bien ametralla decentemente todavía realizan peor que los basados en rodamientos. Tienen una buena cantidad de tracción, más que el cojinete Nexus o ruedas casquillos.

source: `Andymark Standard Duty Mecanum Wheels <https://www.andymark.com/products/4-in-standard-mecanum-wheel-set>`_ ($77.00): These wheels barely strafe and are super fragile.
es_mx: `Andymark Standard Duty Mecanum Wheels <https://www.andymark.com/products/4-in-standard-mecanum-wheel-set>`_ ($77.00 dólares): Estas ruedas apenas ametrallan y son super frágiles.

source: The primary advantage to mecanum drive is the maneuverability it affords, especially because the robot can strafe instead of turn and drive. The rollers on mecanum wheels form a 45 degree angle with the wheel’s axis of rotation, which means that mecanum drivetrains can’t strafe as fast as they can drive forward.
ro_ro: Avantajul principal al șasiului mecanum este manevrabilitatea pe care o permite, în special datorită faptului ca robotul poate să facă strafe, în loc să se întoarcă și să meargă în față. Rolele de pe roțile mecanum formează un unghi de 45 de grade cu axul de rotație al roții, ceea ce înseamnă că șasiul mecanum nu poate să facă strafe așa rapid precum pot merge în față.

source: These two opposing forces cause the rollers to slip more and more, which angles the robot’s velocity at the expense of traction (more slipping results in a loss of speed). However, the wheels do still slip when moving forward but not as drastically as they do when strafing.
ro_ro: Aceste două forțe opuse fac ca rolele să alunece din ce în ce mai mult, care cresc velocitatea robotului la costul tracțiunii (mai multă aluncare rezultă în o piedere a vitezei). Însă, roțile tot alunecă când se mișcă înainte dar nu la fel de drastic la fel cum fac în strafe.

source: Due to the fact that mecanum wheels are more likely to slip because of the diagonal rollers, an optional addition to mecanum drives is a separate odometry mechanism in order to track the robot’s location during autonomous.
ro_ro: Din cauza faptului că șasiurile mecanum au șanse mai mari să alunece din cauza rolelor diagonale, o adiție opțională la șasiurile mecanum sunt mecanismele de odometrie pentru a înregistra locația robotului în timpul perioadei autonome.

source: The primary reason for this is that it allows the drivetrain to turn significantly faster than it would otherwise be able to. When using the suggested setup, when viewed from the robot’s underside, the rollers form a rhombus. This allows the force applied by the wheels on the ground to act tangent to the turn radius, leading to faster turning.
ro_ro: Motivul principal pentru acest fapt este deoarece îi permite șasiului să se întoarcă mai rapid decât ar fi putut altfel. Când te folosești de recomandări, când este vazut de jos robotul, rolele formează un romb. Acestea permit forțelor aplicate de roți pe pământ să acționeze tangent față de raza întoarcerii, astfel rezultând o întoarcere mai rapidă.
