Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/holonomic.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: `goBILDA Mecanum Wheels v2 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ ($127.49 with team discount): The goBILDA v2 Mecanum Wheels are the gold standard for teams wanting a quality design in all aspects. They feature a 96mm diameter and a thickness of 38mm, with ball bearing supported, 70A durometer rollers that provide excellent strafing performance. With the use of recessed 16x16mm and 32x32mm holes, these wheels have the largest amount of mounting options and can fit all shaft styles commonly used in FTC\ |reg|.
es_mx: `goBILDA Mecanum Wheels v2 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ ($127.49 dólares con descuento de equipo): Las Ruedas Mecanum goBILDA v2 son el estándar de oro para los equipos que desean un diseño de calidad en todos los aspectos. Cuentan con un diámetro de 96 mm y un espesor de 38 mm, con rodamientos de bolas de apoyo, 70A rodillos durómetro que proporcionan un excelente rendimiento ametrallando. Con el uso de 16x16mm empotrado y 32x32mm agujeros, estas ruedas tienen la mayor cantidad de opciones de montaje y puede adaptarse a todos los estilos de eje de uso común en FTC\ |reg|.
fr_ca: `Roues mecanum goBILDA v2 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ ($127.49 avec réduction d'équipe) : Les roues Meccanum goBILDA v2 sont la référence pour les équipes qui veulent un design de qualité dans tous les aspects. Elles ont un diamètre de 96mm et une épaisseur de 38mm, avec des rouleaux supportés par des roulements à billes, 70A duromètre qui fournissent d'excellentes performances de déplacement latéral. Avec l'utilisation de trous encastrés de 16x16mm et 32x32mm, ces roues ont le plus grand nombre d'options de montage et peuvent s'adapter à tous les styles d'arbres couramment utilisés en FTC.
zh_cn: `goBILDA Mecanum Wheels v2 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ （127.49 美元，有团队折扣）：goBILDA v2 Mecanum 轮圈是追求全方位优质设计的车队的黄金标准。它们的直径为 96 毫米，厚度为 38 毫米，滚珠轴承支撑、硬度为 70A 的滚轮可提供出色的平移性能。由于使用了 16x16mm 和 32x32mm 的凹孔，这些轮子有最多的安装选择，可适用于 FTC\ |reg| 中常用的所有轴型。

source: `REV Robotics Mecanum Wheels <https://www.revrobotics.com/rev-45-1655/>`_ ($127.50 with team discount): The REV Robotics Mecanum Wheels come in at only 75mm in diameter, providing a smaller mecanum wheel option to FTC teams; however, they are not the thinnest option at 40.8mm thick. They feature ball bearing supported rollers that provide exceptional strafing capabilities and traction. The hole pattern featured on these wheels is compatible with Andymark Nubs as well as the REV Robotics Universal Hex Adapter v2 (which is included); however, in order to use other shaft options the use of an adapter or physical modification will likely be required.
es_mx: REV Robotics Mecanum Wheels <https://www.revrobotics.com/rev-45-1655/>`_ ($127.50 dólares con descuento de equipo): Las Ruedas Mecanum de REV Robotics tienen un diámetro de sólo 75 mm, proporcionando una opción de rueda mecanum más pequeña a los equipos de FTC; sin embargo, no son la opción más delgada con 40,8 mm de grosor. Incorporan rodillos con rodamientos de bolas que proporcionan una tracción y una capacidad de ametrallamiento excepcionales. El patrón de agujeros de estas ruedas es compatible con Andymark Nubs, así como el REV Robotics Universal Hex Adapter v2 (que se incluye), sin embargo, con el fin de utilizar otras opciones de eje el uso de un adaptador o modificación física probablemente será necesario.
fr_ca: `Roues mecanum REV Robotics <https://www.revrobotics.com/rev-45-1655/>`_ ($127.50 avec réduction d'équipe) : Les roues Mecanum de REV Robotics ne font que 75 mm de diamètre, ce qui permet aux équipes de FTC de disposer d'une roue Mecanum plus petite, mais ce n'est pas l'option la plus fine avec une épaisseur de 40,8 mm. Elles sont dotées de rouleaux supportés par des roulements à billes qui offrent des capacités de déplacement latéral et une traction exceptionnelles. Le schéma de perçage de ces roues est compatible avec les Andymark Nubs ainsi qu'avec l'adaptateur hexagonal universel REV Robotics v2 (qui est inclus) ; cependant, pour utiliser d'autres options d'arbres, l'utilisation d'un adaptateur ou d'une modification physique sera probablement nécessaire.
zh_cn: `REV Robotics Mecanum Wheels <https://www.revrobotics.com/rev-45-1655/>`_ （127.50 美元，可享受团队折扣）：REV Robotics Mecanum Wheels 的直径仅为 75 毫米，为 FTC 团队提供了更小的 Mecanum Wheels 选项；不过，它们并不是最薄的选项，厚度仅为 40.8 毫米。它们采用滚珠轴承支撑滚轮，可提供出色的扫射能力和牵引力。这些轮子上的孔型与 Andymark Nubs 以及 REV Robotics 通用六角适配器 v2（已包括在内）兼容；但是，要使用其他轴选项，可能需要使用适配器或进行物理改装。

source: These mecanums have acceptable performance but there is very little reason to buy them at this point, as they have been superseded by better ones. If you already own them, they are a viable option, but consider looking at some of the mecanums from the `Recommended`_ section.
es_mx: Estos mecanums tienen un rendimiento aceptable, pero hay muy pocas razones para comprarlos en este momento, ya que han sido sustituidos por otros mejores. Si ya los tiene, son una opción viable, pero considere la posibilidad de buscar algunos de los mecanums de la sección `Recomendados`_.
fr_ca: Ces mécanismes ont des performances acceptables, mais il y a très peu de raisons de les acheter à ce stade, car ils ont été remplacés par des mécanismes plus performants. Si vous les possédez déjà, ils constituent une option viable, mais envisagez de vous tourner vers certains des mécanismes de la section `Recommandé`_.
zh_cn: 这些麦克纳姆轮的性能可以接受，但目前购买它们的理由并不充分，因为它们已经被更好的机械手取代。如果您已经拥有它们，它们是一个可行的选择，但也可以考虑 "推荐 "部分中的一些麦克纳姆轮。

source: `Nexus Ball Bearing Mecanum Wheels <https://www.robotshop.com/en/100mm-mecanum-wheel-set.html>`_ ($134.00): These wheels are 100 mm in diameter and 59 mm wide. They strafe excellently because of the use of ball bearings. However, they are more expensive, take up more space, have less traction, and are harder to mount to than the recommended wheels.
es_mx: `Nexus Rodamiento de Bolas Ruedas Mecanum <https://www.robotshop.com/en/100mm-mecanum-wheel-set.html>`_ ($134.00 dólares): Estas ruedas tienen 100 mm de diámetro y 59 mm de ancho. Tienen una excelente tracción gracias al uso de rodamientos de bolas. Sin embargo, son más caras, ocupan más espacio, tienen menos tracción y son más difíciles de montar que las ruedas recomendadas.
fr_ca: `Roues Mecanum à roulements à billes Nexus <https://www.robotshop.com/en/100mm-mecanum-wheel-set.html>`_ ($134.00) : Ces roues ont un diamètre de 100 mm et une largeur de 59 mm. Elles ont une excellente trajectoire grâce à l'utilisation de roulements à billes. Cependant, elles sont plus chères, prennent plus de place, ont moins de traction et sont plus difficiles à monter que les roues recommandées.
zh_cn: `Nexus 滚珠轴承 麦轮 <https://www.robotshop.com/en/100mm-mecanum-wheel-set.html>`_ （134.00 美元）：这些轮子直径 100 毫米，宽 59 毫米。由于使用了滚珠轴承，它们的平移性能非常出色。不过，它们比推荐的轮子更贵，占用空间更大，牵引力更小，而且更难安装。

source: `goBILDA Mecanum Wheels v1 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ (discontinued): These wheels are very similar to the Nexus Ball Bearing Mecanum Wheels, but with a different color scheme and better mounting options.
es_mx: `goBILDA Mecanum Wheels v1 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ (descatalogado): Estas ruedas son muy similares a las Nexus Rodamiento de Bolas Ruedas Mecanum, pero con un esquema de color diferente y mejores opciones de montaje.
fr_ca: `Roues mecanum goBILDA v1 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ (discontinué) : Ces roues sont très similaires aux Nexus Ball Bearing Mecanum Wheels, mais avec une couleur différente et de meilleures options de montage.
zh_cn: `goBILDA Mecanum Wheels v1 <https://www.gobilda.com/96mm-mecanum-wheel-set-70a-durometer-bearing-supported-rollers/>`_ （已停产）：这些轮子与 Nexus Ball Bearing Mecanum Wheels 非常相似，但配色不同，安装方式也更好。

source: `Andymark Heavy Duty Mecanum Wheels <https://andymark.com/products/4-in-hd-mecanum-wheels>`_ ($225): These are easily the most expensive mecanums on the list. These wheels are 4" in diameter and 1.65" wide. These are bushing based mecanums, so while they strafe decently they still perform worse than bearing based ones. They have a good amount of traction, more than the Nexus bearing or bushing wheels.
fr_ca: `Roues mecanum Andymark Heavy Duty<https://andymark.com/products/4-in-hd-mecanum-wheels>`_ ($225) : Ce sont facilement les mecanums les plus chers de la liste. Ces roues ont un diamètre de 4" et une largeur de 1,65". Ce sont des mecanums à bague, donc même s'ils ont une bonne traction, ils sont moins performants que les mecanums à roulements. Elles ont une bonne traction, plus que les roues Nexus à roulements ou à bagues.
zh_cn: `Andymark Heavy Duty Mecanum Wheels <https://andymark.com/products/4-in-hd-mecanum-wheels>`_ （225 美元）：这些轮子是清单上最昂贵的轮子。这些轮子直径为 4 英寸，宽 1.65 英寸。这些轮子就是基于衬套的麦轮，因此虽然它们的打击性能不错，但仍然比基于轴承的轮子差。它们有很好的牵引力，比 Nexus 轴承或衬套车轮更大。

source: `Nexus Bushing Mecanum Wheels <https://www.robotshop.com/en/100mm-aluminum-mecanum-wheel-set.html>`_ ($80.00): This is the Nexus Ball Bearing Mecanum Wheel with bushings instead of ball bearings. There is not much to say about them except that they strafe decently but worse than the ball bearing based equivalent.
es_mx: `Nexus Bujes Ruedas Mecanum <https://www.robotshop.com/en/100mm-aluminum-mecanum-wheel-set.html>`_ ($80.00 dólares): Este es el Nexus Rodamiento de Bolas Mecanum Rueda con casquillos en lugar de rodamientos de bolas. No hay mucho que decir acerca de ellos, excepto que ametrallan decentemente, pero peor que el equivalente basado en rodamientos de bolas.
fr_ca: Roues mecanum à bagues Nexus <https://www.robotshop.com/en/100mm-aluminum-mecanum-wheel-set.html>`_ ($80.00) : Il s'agit de la Roues mecanum de Nexus avec des bagues au lieu de roulements à billes. Il n'y a pas grand chose à en dire si ce n'est qu'elles offrent un déplacement latéral correct, mais moins bien que l'équivalent à base de roulements à billes.
zh_cn: `Nexus Bushing Mecanum Wheels <https://www.robotshop.com/en/100mm-aluminum-mecanum-wheel-set.html>`_ （80.00 美元）：这是使用衬套而不是滚珠轴承的 Nexus Ball Bearing Mecanum Wheel。除了扫射效果不错，但比滚珠轴承的同类产品差一些之外，没有什么可说的。

source: Not Recommended
es_mx: No Recomendado
fr_ca: Non recommandé
zh_cn: 不推荐

source: There is almost no reason to use these mecanum wheels---they perform very poorly and are not much cheaper than those in the `Recommended`_ section. We cannot recommend the use of these on an FTC robot, if at all possible replace them with mecanums from the `Recommended`_ section.
es_mx: No hay casi ninguna razón para utilizar estas ruedas mecanum---tienen un rendimiento muy pobre y no son mucho más baratas que las de la sección `Recomendadas`_. No podemos recomendar su uso en un robot FTC; si es posible, sustitúyalas por las mecanum de la sección `Recomendadas`_.
fr_ca: Il n'y a pratiquement aucune raison d'utiliser ces roues mecanum - elles sont très peu performantes et ne sont pas beaucoup moins chères que celles de la section `Recommandé'_. Nous ne pouvons pas recommander l'utilisation de ces roues sur un robot FTC, si possible remplacez-les par des mecanums de la section `Recommandé`_.
zh_cn: 几乎没有理由使用这些麦克纳姆轮--它们的性能非常差，而且价格也不比 "推荐 "部分的机械轮便宜多少。我们不建议在 FTC 机器人上使用这些轮子，如果可能的话，请更换为 "推荐 "部分中的轮子。

source: `TETRIX Mecanum Wheels <https://www.pitsco.com/TETRIX-MAX-Mecanum-Wheels>`_ ($149.00): These mecanums are designed with a bushing based, hard plastic roller which in turn creates poor strafing performance. The integrated hub is a set screw based design with a round bore, causing unreliability as well as taking up extra space.
es_mx: `TETRIX Mecanum Ruedas <https://www.pitsco.com/TETRIX-MAX-Mecanum-Wheels>`_ ($149.00 dólares): Estos mecanums están diseñados basados en casquillos, rodillo de plástico duro que a su vez crea un pobre rendimiento ametrallador. El cubo integrado es un tornillo de fijación basado en el diseño con un agujero redondo, causando falta de fiabilidad, así como ocupar espacio extra.
fr_ca: Roues mecanum TETRIX <https://www.pitsco.com/TETRIX-MAX-Mecanum-Wheels>`_ ($149.00) : Ces mecanums sont conçus avec un rouleau en plastique dur basé sur une douille, ce qui entraîne de mauvaises performances en déplacement latéral. Le moyeu intégré est basé sur une vis sans fin avec un alésage rond, ce qui entraîne un manque de fiabilité et un encombrement supplémentaire.
zh_cn: `TETRIX Mecanum Wheels <https://www.pitsco.com/TETRIX-MAX-Mecanum-Wheels>`_ （149.00 美元）：这些麦轮采用基于衬套的硬塑料滚轮设计，因此平移性能较差。集成式轮毂是一种基于固定螺丝的圆孔设计，不仅不可靠，而且占用额外空间。

source: `Andymark Standard Duty Mecanum Wheels <https://andymark.com/products/4-in-sd-mecanum-wheel>`_ ($77.00): These wheels barely strafe and are super fragile.
fr_ca: `Roues mecanum Andymark Standard Duty <https://andymark.com/products/4-in-sd-mecanum-wheel>`_ ($77.00) : Ces roues sont très fragiles et ont du mal à se déplacer.
zh_cn: `Andymark Standard Duty Mecanum Wheels <https://andymark.com/products/4-in-sd-mecanum-wheel>`_ （$77.00）：这些轮子几乎不能平移，而且非常脆弱。

source: 8103 Null Robotics's mecanum drivetrain render
es_mx: 8103 Render del chasis mecanum de Null Robotics
fr_ca: Rendu du châssis mecanum de l'équipe 8103 Null Robotics
zh_cn: 8103 Null Robotics 的 mecanum 传动系统效果图

source: 8103 Null Robotics, Rover Ruckus, **using Nexus mecanum bearing**
es_mx: 8103 Null Robotics, Rover Ruckus, **usando cojinete Nexus mecanum**
fr_ca: 8103 Null Robotics, Rover Ruckus, **utilisant le palier Nexus mecanum**
zh_cn: 8103 Null Robotics, Rover Ruckus, **使用 Nexus mecanum 轴承**

source: 731 Wannabee Strange's mecanum drivetrain render
es_mx: 731 Wannabee Strange's render del chasis mecanum
fr_ca: Rendu du châssis mecanum de l'équipe 731 Wannabee Strange
zh_cn: 731 Wannabee Strange 的 mecanum 传动系统效果图

source: 731 Wannabee Strange, Rover Ruckus, using **AndyMark HD mecanum wheels**
es_mx: 731 Wannabee Strange, Rover Ruckus, usando **ruedas de mecanum HD de AndyMark**.
fr_ca: 731 Wannabee Strange, Rover Ruckus, utilisant **Les roues mecanum AndyMark HD **.
zh_cn: 731 Wannabee Strange，Rover Ruckus，使用 **AndyMark HD mecanum 车轮** 。

source: X-Drive is a holonomic omni-wheel based drivetrain. This type of drive involves mounting 4 omni wheels at the corner of the robot at a 45 degree angle.
es_mx: X-Drive es un chasis holonómico basado en omni-ruedas. Este tipo de accionamiento consiste en montar 4 ruedas omnidireccionales en la esquina del robot en un ángulo de 45 grados.
fr_ca: X-Drive est une transmission holonomique basée sur des roues omnidirectionnelles. Ce type d'entraînement implique le montage de 4 roues omnidirectionnelles au coin du robot à un angle de 45 degrés.
zh_cn: X-Drive 是一种基于整体工程学的全方位轮驱动系统。这种驱动方式是在机器人的一角以 45 度角安装 4 个全向轮。

source: One notable difference between X-Drive and mecanum is strafe speed. While, as mentioned in the mecanum section, the ratio of strafe speed to forward speed is noticeably less than 1, the ratio on an X-Drive is exactly 1 due to the rotational symmetry of the wheel placement. This means that an X-Drive bot's strafe speed and forward speed are equivalent. The drivetrains are slower, however, when strafing at 45\ |deg| (approximately :math:`\frac{\sqrt{2}}{2}` of its forward speed).
es_mx: Una diferencia notable entre X-Drive y mecanum es la velocidad de desplazamiento lateral. Mientras que, como se menciona en la sección de mecanum, la relación entre la velocidad de desplazamiento lateral y la velocidad hacia adelante es notablemente menor que 1, la relación en un X-Drive es exactamente 1 debido a la simetría rotacional de la colocación de las ruedas. Esto significa que la velocidad de desplazamiento lateral y la velocidad hacia adelante de un robot X-Drive son equivalentes. Sin embargo, las transmisiones son más lentas cuando se desplazan lateralmente a 45\ |deg| (aproximadamente :math:`\frac{\sqrt{2}}{2}` de su velocidad hacia adelante).
fr_ca: L'une des différences notables entre l'X-Drive et le système mecanum est la vitesse de déplacement latéral. Alors que, comme indiqué dans la section consacrée au Mécanisme, le rapport entre la vitesse de déplacement et la vitesse d'avancement est sensiblement inférieur à 1, ce rapport est exactement de 1 sur un X-Drive en raison de la symétrie de rotation du positionnement des roues. Cela signifie que la vitesse de déplacement et la vitesse d'avancement d'un robot X-Drive sont équivalentes. Les trains de roulement sont cependant plus lents lorsqu'ils se déplacent à 45° (environ :math:``frac{\sqrt{2}}{2}` de leur vitesse d'avancement).
zh_cn: X-Drive 和 mecanum 的一个显著区别是转向速度。正如麦克纳姆轮部分所述，扫射速度与前进速度的比值明显小于 1，而 X-Drive 上的比值正好是 1，这是因为车轮位置的旋转对称性。这意味着 X-Drive 机器人的扫射速度和前进速度相当。然而，当以 45 |deg|（约为 :math:`\frac{\sqrt{2}}{2}` 的前进速度）进行扫射时，传动系统的速度会变慢。

source: Even though X-drive has good turning and acceleration, the main downside to the drive is packaging/form factor. Packaging refers to how easy/convenient the drivetrain fits into the overall design of the robot.
es_mx: Aunque X-drive tiene una buena capacidad de giro y aceleración, su principal inconveniente es el factor empaque/forma. El empaquetado se refiere a la facilidad/conveniencia con la que la transmisión encaja en el diseño general del robot.
fr_ca: Même si la transmission X-drive offre de bonnes capacités de rotation et d'accélération, son principal inconvénient est son conditionnement et son facteur de forme. L'emballage fait référence à la facilité et à la commodité avec lesquelles la transmission s'intègre dans la conception générale du robot.
zh_cn: 尽管 X 驱动具有良好的转弯和加速性能，但其主要缺点在于包装/外形尺寸。包装指的是传动系统与机器人整体设计的匹配程度。

source: Ideally, the drivetrain should take up as little space as possible to make it easier to design mechanisms around. Because the omni wheels are offset, packaging a X-Drive is more difficult than other types of holonomic drive like mecanum or H-Drive. Also because of the strange packaging, it is relatively difficult to cleanly transfer power from the motors to wheels, meaning that most X-Drives end up being direct-driven, which is bad for the lifespan of the motor gearbox.
es_mx: Lo ideal es que el chasis ocupe el menor espacio posible para que sea más fácil diseñar mecanismos a su alrededor. Como las ruedas omnidireccionales están desplazadas, empaquetar un X-Drive es más difícil que otros tipos de accionamiento holonómico, como el mecanum o el H-Drive. Además, debido a su extraño diseño, es relativamente difícil transferir la potencia de los motores a las ruedas, por lo que la mayoría de los X-Drives acaban siendo de transmisión directa, lo que perjudica la vida útil de la caja de engranajes del motor.
fr_ca: Idéalement, le châssis devrait occuper le moins d'espace possible afin de faciliter la conception des mécanismes. Comme les roues omni sont décalées, il est plus difficile de concevoir un X-Drive que d'autres types d'entraînement holonomique comme le mecanum ou le H-Drive. De plus, en raison de ce conditionnement étrange, il est relativement difficile de transférer proprement la puissance des moteurs aux roues, ce qui signifie que la plupart des X-Drives finissent par être à entraînement direct, ce qui n'est pas bon pour la durée de vie de la boîte de vitesses du moteur.
zh_cn: 理想情况下，传动系统应占用尽可能少的空间，以便于围绕其设计机构。由于全向轮是偏置的，因此 X 驱动器的包装比其他类型的整体驱动（如机械传动或 H 驱动）更加困难。此外，由于包装奇特，从电机到车轮的动力传递也相对困难，这意味着大多数 X-Drive 最终都是直接驱动，这对电机齿轮箱的使用寿命不利。

source: When using X-Drive, the robot moves forwards/backwards/straight side-to-side :math:`\sqrt{2}` times faster than a drivetrain with wheels in the normal orientation (with the same gear ratio and wheel size).
es_mx: Cuando se utiliza X-Drive, el robot se desplaza hacia delante/atrás/de lado a lado :math:`\sqrt{2}` veces más rápido que un chasis con ruedas en la orientación normal (con la misma relación de engranes y el mismo tamaño de rueda).
fr_ca: Lorsqu'il utilise X-Drive, le robot se déplace en avant/en arrière/en ligne droite d'un côté à l'autre :math:`\sqrt{2}` fois plus vite qu'une transmission avec des roues dans l'orientation normale (avec le même rapport d'engrenage et la même taille de roue).
zh_cn: 使用 X-Drive 系统时，机器人向前/向后/直向移动的速度 :math:`\sqrt{2}` 要比车轮处于正常方向的传动系统（具有相同的齿轮比和车轮尺寸）快一倍。

source: For an explanation of why exactly this is, see `this analysis <https://www.chiefdelphi.com/t/paper-mecanum-and-omni-kinematic-and-force-analysis/106153>`_.
es_mx: Para saber a qué se debe exactamente, consulte `este análisis <https://www.chiefdelphi.com/t/paper-mecanum-and-omni-kinematic-and-force-analysis/106153>`_.
fr_ca: Pour une explication de la raison exacte, voir `cette analyse <https://www.chiefdelphi.com/t/paper-mecanum-and-omni-kinematic-and-force-analysis/106153>`_.
zh_cn: 有关具体原因的解释，请参阅 `this analysis <https://www.chiefdelphi.com/t/paper-mecanum-and-omni-kinematic-and-force-analysis/106153>`_ 。

source: Good maneuverability and agility
es_mx: Buena maniobrabilidad y agilidad
fr_ca: Bonne maniabilité et agilité
zh_cn: 良好的机动性和灵活性

source: Good acceleration
es_mx: Buena aceleración
fr_ca: Bonne accélération
zh_cn: 加速性能良好

source: Prone to defense, pushed around easily
es_mx: Propenso a la defensa, se le empuja con facilidad
fr_ca: Sujet à la défense, facilement bousculé
zh_cn: 易被防守，容易被推来推去

source: Often uses direct drive due to awkward form factor
es_mx: A menudo utiliza accionamiento directo debido a su incómodo factor de forma
fr_ca: Utilise souvent l'entraînement direct en raison de son format peu pratique
zh_cn: 由于外形笨拙，通常使用直接驱动

source: 731 Wannabee Strange's X-Drive
es_mx: 731 X-Drive de Wannabee Strange
fr_ca: X-Drive de 731 Wannabee Strange's
zh_cn: 731 Wannabee Strange队伍的X-Drive

source: 5040 Nuts and Bolts's X-Drive
es_mx: 5040 X-Drive de Nuts and Bolts
fr_ca: X-Drive de Nuts and Bolts 5040
zh_cn: 5040 Nuts and Bolts队伍的X-Drive

source: 5040 Nuts and Bolts, Relic Recovery
fr_ca: 5040 Boulons et écrous, récupération de reliques

source: H-Drive (also known as U-drive, depending on the configuration) is a holonomic type drive that uses all omni wheels. H-Drive relies on a set of "strafer wheels" that are perpendicular to the forward/backward wheels to achieve strafing. H-Drive is similar to a fusion of a tank drivetrain while retaining the maneuverability and strafing of holonomic drivetrains.
es_mx: La tracción en H (también conocida como tracción en U, según la configuración) es una tracción de tipo holonómico que utiliza todas las ruedas omnidireccionales. La propulsión H se basa en un conjunto de "ruedas strafer" perpendiculares a las ruedas delanteras/traseras para lograr el ametrallamiento. La propulsión H es similar a la fusión de un chasis de tanque, pero conserva la maniobrabilidad y el ametrallamiento de las propulsiones holonómicas.
fr_ca: La propulsion H (également connue sous le nom de propulsion U, selon la configuration) est une propulsion de type holonomique qui utilise toutes les roues omnidirectionnelles. La propulsion H s'appuie sur un ensemble de "roues d'entraînement" qui sont perpendiculaires aux roues avant/arrière afin d'assurer le déplacement latéral. Le H-Drive est similaire à la fusion d'un châssis de type tank tout en conservant la manœuvrabilité et le déplacement latéral des châssis holonomiques.
zh_cn: H-驱动（根据配置不同，也称为 U-驱动）是一种使用全向轮的整体工程学驱动。H-Drive依靠一组与前进/后退轮垂直的"扫射轮"来实现扫射。H-Drive类似于坦克传动系统的融合，同时保留了整体工程学传动系统的机动性和扫射功能。
