Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/index.po
Languages: es_mx, fr_ca, zh_cn

source: Drivetrains
es_mx: Chasises
fr_ca: Châssis
zh_cn: 传动系统

source: This section will cover the heart of any robot, the drivetrain. The purpose of the drivetrain is to facilitate the movement of the robot, and thus is crucial to the overall function of the robot. If the drivetrain doesn't work, the rest of the robot won't work either. There are many possible types of drivetrains in FTC\ |reg|, which we have covered in the guide. Drivetrains are split into two main types: tank (skid-steer) and holonomic.
es_mx: En esta sección se tratará el corazón de cualquier robot, el chasis. El objetivo del chasis es facilitar el movimiento del robot y, por lo tanto, es crucial para su funcionamiento general. Si el chasis no funciona, el resto del robot tampoco lo hará. Hay muchos tipos posibles de chasises en FTC |reg|, que hemos cubierto en la guía. Los chasises se dividen en dos tipos principales: de tanque (de dirección deslizante) y holonómicos.
fr_ca: Cette section couvrira le cœur de tout robot, le châssis. Le but du châssis est de faciliter le mouvement du robot, et il est donc crucial pour le bon fonctionnement global du robot. Si le châssis ne fonctionne pas, le reste du robot ne fonctionnera pas non plus. Il existe de nombreux types de châssis possibles en FTC®, que nous avons abordés dans le guide. Les châssis se divisent en deux types principaux : tank (skid-steer) et holonomique.
zh_cn: 本节将介绍机器人的核心部件--传动系统。传动系统的目的是促进机器人的运动，因此对机器人的整体功能至关重要。如果传动系统不工作，机器人的其他部分也将无法工作。在 FTC\ |reg| 中，有许多可能的传动系统类型，我们已在指南中进行了介绍。传动系统主要分为两种：坦克式（滑移式）和整体式。

source: Drivetrain types
es_mx: Tipos de chasis
fr_ca: Types de châssis
zh_cn: 传动系统的类型

source: Tank Drivetrain
es_mx: Chasis de Tanque
fr_ca: Châssis Tank
zh_cn: 坦克式传动系统

source: A tank drivetrain primarily utilizes :term:`traction wheels <Traction wheel>` and cannot strafe (move sideways). To change directions, a tank drivetrain relies on either turning the wheels on the left and right side in the opposite direction (thus spinning the robot) or running one side faster than the other side (thus making the robot take the path of an arc). Tank drivetrains prioritize traction and acceleration over pure maneuverability, giving these drivetrains the potential to traverse obstacles and play defense. Tank drivetrains are relatively simple to build, yet are still competitive at the highest levels.
es_mx: El chasis de un tanque utiliza principalmente :term:`ruedas de tracción <Traction wheel>` y no se puede ametrallar (desplazarse lateralmente). Para cambiar de dirección, un chasis de tanque depende de girar las ruedas de los lados izquierdo y derecho en dirección opuesta (haciendo girar al robot) o de que un lado vaya más rápido que el otro (haciendo que el robot siga la trayectoria de un arco). Los chasises de tanques dan prioridad a la tracción y la aceleración frente a la maniobrabilidad pura, lo que les permite atravesar obstáculos y jugar a la defensiva. Los chasises de tanque son relativamente sencillos de construir, pero siguen siendo competitivos en los niveles más altos.
fr_ca: Le châssis de type tank utilise des des :term:`roues de traction <Traction wheel>`(et ne peut pas se déplacer latéralement). Pour changer de direction, le châssis de type tank doit soit faire tourner les roues du côté gauche et du côté droit dans la direction opposée (ce qui fait tourner le robot), soit faire tourner un côté plus vite que l'autre (ce qui fait prendre au robot la trajectoire d'un arc de cercle). Les châssis de type tank privilégient la traction et l'accélération par rapport à la manœuvrabilité pure, ce qui leur permet de franchir des obstacles et de jouer la carte de la défense. Les châssis de type tank sont relativement simples à construire, mais restent compétitives aux plus hauts niveaux.
zh_cn: 坦克传动系统主要利用 :term:`履带式轮子 <Traction wheel>` ，不能横移（侧向移动）。要改变方向，坦克传动系统要么依靠左右两侧的车轮朝相反方向转动（从而使机器人旋转），要么一侧比另一侧跑得快（从而使机器人走弧形路线）。坦克传动系统优先考虑牵引力和加速度，而不是纯粹的机动性，这使得这些传动系统具有穿越障碍和进行防御的潜力。坦克传动系统的制造相对简单，但在最高级别的比赛中仍具有竞争力。

source: Holonomic Drivetrain
es_mx: Chasis Holonómico
fr_ca: Châssis Holonomic
zh_cn: 整体式传动系统

source: A holonomic drivetrain, in contrast to a tank drivetrain, can move sideways, due to using either :term:`mecanum <Mecanum Wheel>` or :term:`omni <Omni Wheel>` wheels. These kinds of wheels have special rollers that allow strafing movements. Thus, holonomic drivetrains prioritize movement over traction. Holonomic drivetrains eliminate the time it takes to turn for a tank drivetrain. However, holonomic is susceptible to defense and can suffer with a heavy robot. Holonomic has been proven to be competitive at the highest level for many years, and is common among world-class robots.
es_mx: Un chasis holonómico, a diferencia de un chasis de tanque, puede moverse lateralmente, gracias al uso de ruedas :term:`mecanum <Mecanum Wheel>` o :term:`omni <Omni Wheel>`. Estos tipos de ruedas tienen rodillos especiales que permiten movimientos de ametrallamiento. Por tanto, los chasises holonómicos dan prioridad al movimiento sobre la tracción. Los chasises holonómicos eliminan el tiempo que tarda en girar un chasis de tanque. Sin embargo, el holonómico es susceptible a la defensa y puede sufrir con un robot pesado. El holonómico ha demostrado ser competitivo al más alto nivel durante muchos años, y es común entre los robots de clase mundial.
fr_ca: Un châssis holonomique, contrairement à un châssis de type tank, peut se déplacer latéralement, grâce à l'utilisation de roues :term:`mecanum <Mecanum Wheel>` ou :term:`omni <Omni Wheel>`. Ces types de roues sont dotés de rouleaux spéciaux qui permettent les mouvements de translation. Ainsi, les transmissions holonomiques donnent la priorité au mouvement plutôt qu'à la traction. Les transmissions holonomiques éliminent le temps nécessaire pour tourner pour une transmission de char. Cependant, l'holonomie est sensible à la défense et peut souffrir d'un robot lourd. L'holonomie s'est avérée compétitive au plus haut niveau pendant de nombreuses années, et elle est courante parmi les robots de classe mondiale.
zh_cn: 与坦克传动系统不同，整体式传动系统可以侧向移动，这是因为使用了 :term:`麦克纳姆轮-麦轮 <Mecanum Wheel>` 或 :term:`全方向轮 <Omni Wheel>` 这类轮子。这些车轮有特殊的滚轮，可以进行横向的运动。因此，整体式传动系统优先考虑运动而非牵引。整体式传动系统消除了坦克传动系统转弯所需的时间。不过，该类系统容易受到防御的影响，重型机器人可能会受到影响。多年来，整体工程学已被证明在最高水平上具有竞争力，在世界级机器人中也很常见。

source: Drivetrain selection
es_mx: Selección del chasis
fr_ca: Sélection de châssis
zh_cn: 传动系统的选择

source: When building any mechanism, teams must list out some necessities or desired features. Here are some priorities for that we think are important for each drivetrain:
es_mx: Al construir cualquier mecanismo, los equipos deben enumerar algunas necesidades o características deseadas. Estas son algunas de las prioridades que consideramos importantes para cada chasis:
fr_ca: Lors de la construction de tout mécanisme, les équipes doivent établir une liste de nécessités ou de fonctionnalités souhaitées. Voici quelques priorités que nous considérons comme importantes pour chaque type de châssis :
zh_cn: 在建造任何机械时，团队都必须列出一些必需品或所需功能。以下是我们认为对每个传动系统都很重要的一些优先事项：

source: **Reliability**: Reliability, the key to success in *FIRST*\ |reg| Tech Challenge, starts with the drivetrain, the foundation to any robot. One aspect of reliability to consider is the type of motor and gearbox that is used in the drivetrain. For example, spur gearboxes are more likely to break under load than a planetary gearboxes. (See the :doc:`/docs/power-and-electronics/motor-guide/index` for details). Thus, spur gear motors are not the optimal choice for drivetrain, especially if the robot is projected to be on the heavy side (30+ pounds).
es_mx: **Fiabilidad**: La fiabilidad, la clave del éxito en FIRST Tech Challenge, comienza con él chasis, la base de cualquier robot. Un aspecto de la fiabilidad a tener en cuenta es el tipo de motor y caja de engranajes que se utiliza en el chasis. Por ejemplo, las cajas de engranajes rectos tienen más probabilidades de romperse bajo carga que las cajas de engranajes planetarios. (Para más detalles, consulte el :doc:`/docs/potencia-y-electrónica/guía-del-motor/índice`). Por lo tanto, los motores de engranajes rectos no son la mejor opción para él chasis, especialmente si se prevé que el robot sea pesado (más de 30 libras).
fr_ca: **Fiabilité** : La fiabilité, clé du succès dans le Défi Techno FIRST® , commence par le châssis, qui est la base de tout robot. Un aspect de la fiabilité à prendre en compte est le type de moteur et de boîte de vitesses utilisés dans le châssis. Par exemple, les boîtes de vitesses à pignons droits ont plus de chances de se casser sous charge que les boîtes de vitesses planétaires. (Voir le :doc:/docs/power-and-electronics/motor-guide/index pour plus de détails). Ainsi, les moteurs à pignons droits ne sont pas le choix optimal pour le châssis, surtout si le robot est destiné à être relativement lourd (plus de 30 livres).
zh_cn: **可靠性** ：可靠性是 **FIRST**\ |reg| 科技挑战赛成功的关键，它始于任何机器人的基础传动系统。可靠性需要考虑的一个方面是传动系统中使用的电机和变速箱的类型。例如，与行星齿轮箱相比，正齿轮箱在负载下更容易损坏。(详见 :doc:`/docs/power-and-electronics/motor-guide/index` 章节）。因此，正齿轮电机并非传动系统的最佳选择，尤其是当机器人预计偏重（30 磅以上）时。

source: Generally, more complex drivetrains pose more reliability challenges for inexperienced teams. Our advice is to stick to the simpler drivetrains such as 4 or 6 wheel drive and mecanum drive.
es_mx: En general, los chasises más complejos plantean más problemas de fiabilidad a los equipos inexpertos. Nuestro consejo es que te límites a los chasises más sencillos, como la tracción a las 4 o 6 ruedas y el mecanum drive.
fr_ca: En général, les châssis plus complexes posent davantage de défis en termes de fiabilité pour les équipes inexpérimentées. Notre conseil est de s'en tenir à des châssis plus simples, tels que la traction à 4 ou 6 roues ou le mecanum drive.
zh_cn: 一般来说，较复杂的传动系统会给缺乏经验的团队带来更多的可靠性挑战。我们的建议是坚持使用较简单的传动系统，如 4 轮或 6 轮驱动和机械传动。

source: **Agility**: There are many factors to agility: top speed, acceleration, turning radius, turn speed, and ability to strafe. Note that turning radius is an often overlooked feature that is critical to the overall agility of the drivetrain. Generally, a solid drivetrain should have a free speed (speed under no load) in the range of 4.5-6 feet/second.
es_mx: **Agilidad**: La agilidad depende de muchos factores: la velocidad máxima, la aceleración, el radio de giro, la velocidad de giro y la capacidad para ametrallar. Ten en cuenta que el radio de giro es una característica que a menudo se pasa por alto y que es fundamental para la agilidad general del chasis. Por lo general, un chasis sólido debería tener una velocidad libre (velocidad sin carga) de entre 4.5-6 pies/segundo.
fr_ca: **Agilité** : Il existe plusieurs facteurs qui influencent l'agilité : la vitesse maximale, l'accélération, le rayon de braquage, la vitesse de rotation et la capacité de strafing ou mouvement latéral. Il est important de noter que le rayon de braquage est une fonctionnalité souvent négligée, mais qui est cruciale pour l'agilité globale du châssis. En général, un châssis solide devrait avoir une vitesse libre (vitesse sans charge) dans la plage de 4,5 -6 pieds par seconde.
zh_cn: **灵活性** ：灵活性有许多因素：最高速度、加速度、转弯半径、转弯速度和转向能力。请注意，转弯半径是一个经常被忽视的特性，它对动力传动系统的整体灵活性至关重要。一般来说，牢靠的传动系统的自由速度（空载时的速度）应在 4.5-6 英尺/秒之间。

source: **Number of motors and gear ratio**: Generally, new teams may try to use only two motors on the drivetrain. While this is possible, it is not recommended, as all competitive teams use 4+ motors on the drivetrain. Another issue stemming from experience is that most teams' drivetrains are too slow. More advanced teams may focus on the ability to play :term:`defense <Defense>`, but in general, maneuverability and speed are the main factors to a successful drivetrain.
es_mx: **Número de motores y relación de engranajes**: En general, los equipos nuevos pueden intentar utilizar sólo dos motores en el chasis. Aunque esto es posible, no se recomienda, ya que todos los equipos competitivos utilizan más de 4 motores en el chasis. Otro problema derivado de la experiencia es que los chasises de la mayoría de los equipos son demasiado lentos. Los equipos más avanzados pueden centrarse en la capacidad de jugar a la :term:`defensa<Defense>`, pero en general, la maniobrabilidad y la velocidad son los principales factores para el éxito de unchasis.
fr_ca: **Nombre de moteurs et rapport de transmission** : En général, les nouvelles équipes essaient de n'utiliser que deux moteurs sur le châssis. Bien que cela soit possible, ce n'est pas recommandé, car toutes les équipes compétitives utilisent plus de 4 moteurs sur le groupe motopropulseur. L'expérience nous a également appris que la plupart des équipes ont un groupe motopropulseur trop lent. Les équipes plus avancées peuvent se concentrer sur la capacité à jouer :term:`défense <Defense>`, mais en général, la maniabilité et la vitesse sont les principaux facteurs d'un châssis réussi.
zh_cn: **电机数量和齿轮比** ：一般来说，新参赛队可能会尝试在传动系统上只使用两个电机。虽然这是可行的，但不建议这样做，因为所有有竞争力的团队都在传动系统上使用 4 个以上的电机。另一个经验问题是，大多数参赛队的传动系统速度太慢。更高级的团队可能会注重 :term:`防御性 <Defense>` 的能力，但一般来说，机动性和速度是驱动系统成功的主要因素。

source: 60:1 and 40:1 motors are **almost always too slow for FTC drivetrain use cases**. Any gear ratio between 16:1 and 20:1 is perfectly reasonable on 4 inch wheels. 19.2:1 on 4 inch wheels is a popular choice because it enables one to go 1 to 1 off of a 19.2:1 planetary motor. This ratio gives a great balance, having near instant acceleration and a high top speed.
es_mx: Los motores 60:1 y 40:1 son **casi siempre demasiado lentos para los casos de uso del chasis FTC**. Cualquier relación de engranajes entre 16:1 y 20:1 es perfectamente razonable en ruedas de 4 pulgadas. 19,2:1 en ruedas de 4 pulgadas es una opción popular porque permite ir 1 a 1 con un motor planetario de 19,2:1. Esta relación proporciona un gran equilibrio, ya que el motor de 19,2:1 es más lento. Esta relación proporciona un gran equilibrio, con una aceleración casi instantánea y una gran velocidad máxima.
fr_ca: Les moteurs avec un rapport de transmission 60:1 et 40:1 sont **presque toujours trop lents pour les cas d'utilisation des châssis en FTC**. Tout rapport de transmission entre 16:1 et 20:1 est parfaitement raisonnable avec des roues de 4 pouces. Un rapport de 19,2:1 avec des roues de 4 pouces est un choix populaire car il permet d'obtenir un rapport 1:1 à partir d'un moteur planétaire 19,2:1. Ce rapport offre un excellent équilibre, avec une accélération quasi instantanée et une vitesse de pointe élevée.
zh_cn: 60:1 和 40:1 的电机对于 FTC 传动系统来说 **几乎总是太慢**。在 4 英寸车轮上，16:1 到 20:1 之间的任何齿轮比都是完全合理的。在 4 英寸车轮上，19.2:1 是一种流行的选择，因为它使人们能够从 19.2:1 的行星电机上实现 1 比 1 的传动比。这一比例带来了极佳的平衡性、近乎瞬间的加速度和较高的最高速度。

source: On 3 inch wheels, the equivalent ratios are 12:1 to 15:1, which makes 13.7:1 on 3 inch wheels convenient, as it can be taken 1 to 1 off of goBILDA's 13.7:1 planetary gearbox motor. Teams can slow the drivetrain down in code by providing less power to the motors if needed.
es_mx: En ruedas de 3 pulgadas, las relaciones equivalentes son de 12:1 a 15:1, lo que hace que 13,7:1 en ruedas de 3 pulgadas sea conveniente, ya que se puede tomar 1 a 1 del motor reductor planetario de 13,7:1 de goBILDA. Los equipos pueden reducir la velocidad del chasis en el código, proporcionando menos potencia a los motores si es necesario.
fr_ca: Sur des roues de 3 pouces, les rapports équivalents sont de 12:1 à 15:1, ce qui rend le rapport 13,7:1 sur des roues de 3 pouces pratique, car il peut être obtenu avec un moteur de boîte de vitesses planétaire 13,7:1 de goBILDA. Les équipes peuvent ralentir le châssis dans le code en fournissant moins de puissance aux moteurs si nécessaire.
zh_cn: 在 3 英寸车轮上，等效传动比为 12:1 至 15:1，因此 3 英寸车轮上的 13.7:1 传动比非常方便，因为它可以从 goBILDA 的 13.7:1 行星齿轮箱电机上 1 比 1 地获取。如果需要，车队可以在代码中通过为电机提供较小的功率来减慢传动系统的速度。

source: It is not recommended for teams to use spur gearboxes on their drivetrain. Instead, use planetary gearboxes, as they are less prone to shock loads and breakage.
es_mx: No se recomienda que los equipos utilicen cajas de engranajes rectos en su chasis. En su lugar, utilice reductores planetarios, ya que son menos propensos a las cargas de choque y a la roptura.
fr_ca: Il n'est pas recommandé pour les équipes d'utiliser des boîtes de vitesses à pignons droits sur leur châssis. Il est préférable d'utiliser des boîtes de vitesses planétaires, car elles sont moins sensibles aux charges de choc et aux cassures.
zh_cn: 不建议车队在传动系统中使用正齿轮变速箱。相反，应使用行星齿轮箱，因为它们不易受到冲击负荷和损坏。

source: **Traction/Pushing Power**: While this feature is often overemphasized, it is still very important. Pushing power describes a drivetrain's ability to endure defense/engage in defense. In addition, traction will be important if the drivetrain must traverse obstacles or some sort of terrain. Many factors affect the pushing power of a drivetrain, including wheel type, motor gearing, and overall weight of the robot.
es_mx: **Tracción/Potencia de empuje**: Aunque a menudo se hace demasiada atención en esta característica, sigue siendo muy importante. La potencia de empuje describe la capacidad de un chasis para aguantar la defensa/participar en la defensa. Además, la tracción será importante si el chasis debe atravesar obstáculos o algún tipo de terreno. Hay muchos factores que afectan a la potencia de empuje de un chasis, como el tipo de rueda, el engranaje del motor y el peso total del robot.
fr_ca: **Traction/Puissance de poussée**: Bien que cette caractéristique soit souvent exagérée, elle reste très importante. La puissance de poussée décrit la capacité d'un châssis à résister à la défense ou à s'engager en défense. De plus, la traction sera cruciale si le châssis doit franchir des obstacles ou des terrains spécifiques. Plusieurs facteurs influencent la puissance de poussée d'un châssis, notamment le type de roues, le rapport de transmission des moteurs et le poids total du robot.
zh_cn: **牵引力/推动力**：虽然这一特性往往被过分强调，但它仍然非常重要。推动力描述的是动力传动系统承受防御/参与防御的能力。此外，如果传动系统必须穿越障碍或某种地形，牵引力也很重要。影响传动系统推动力的因素有很多，包括车轮类型、电机传动装置和机器人的整体重量。

source: If you already have a very agile drivetrain with experienced drivers, a team can avoid defense instead of having to fend it off or engage in it.
es_mx: Si ya se dispone de una conducción muy ágil con conductores experimentados, un equipo puede evitar la defensa en lugar de tener que rechazarla o implicarse en ella.
fr_ca: Si vous avez déjà un châssis très agile avec des conducteurs expérimentés, une équipe peut éviter la défense plutôt que d'avoir à la repousser ou à s'y engager. Cela permet de se concentrer davantage sur les objectifs stratégiques du jeu, tout en minimisant les risques de confrontation avec des robots défensifs.
zh_cn: 如果你已经拥有非常灵活的传动系统和经验丰富的操作手，那么团队就可以避开防守，而不必抵挡或参与防守。

source: **Powering the drivetrain**: Generally, there are four options for power transmission: direct drive, :term:`chain <Sprocket>`, :term:`gear <Gear>`, and belt. More detail about each option can be found in the power transmission section.
es_mx: **Alimentación de potencia del chasis**: En general, existen cuatro opciones para la transmisión de potencia: transmisión directa, :term:`cadena <Sprocket>`, :term:`engranaje <Gear>`, y correa. Puedes encontrar más información sobre cada opción en la sección de transmisión de potencia.
fr_ca: **Alimentation du châssis**: En général, il existe quatre options pour la transmission de puissance : entrainement direct, chaîne<Sprocket>, engrenage<Gear> et courroie. Plus de détails sur chaque option peuvent être trouvés dans la section sur la transmission de puissance.
zh_cn: **动力传动系统**：一般来说，动力传输有四种选择：直接驱动、 :term:`链式传动 <Sprocket>` 、 :term:`齿轮传动 <Gear>` 和皮带传动。有关每种选择的更多详情，请参阅动力传动部分。

source: Teams should stay away from direct drive, as gearboxes are prone to breaking, especially under shock loads (for example, if the wheel is hit by another robot, or the wheel slams into the wall).
es_mx: Los equipos deben evitar la transmisión directa, ya que las cajas de engranajes son propensas a romperse, especialmente bajo cargas de choque (por ejemplo, si la rueda es golpeada por otro robot, o la rueda se estrella contra la pared).
fr_ca: Les équipes devraient éviter l'entrainement direct, car les boîtes de vitesses sont susceptibles de se casser, en particulier sous des charges de choc (par exemple, si la roue est frappée par un autre robot ou si la roue heurte violemment le mur).
zh_cn: 参赛队应避免使用直接驱动，因为变速箱容易损坏，尤其是在冲击负荷下（例如，车轮被其他机器人撞到或车轮撞到墙上）。

source: We recommend belted drivetrains, but realize that belt is a difficult option for new teams. Chain and gears are also great options - chain requires a bit more forethought, as 1+ tensioner per side is required to maintain correct tension in the chain.
es_mx: Recomendamos las transmisiones con correa, pero somos conscientes de que la correa es una opción difícil para los equipos nuevos. La cadena requiere un poco más de previsión, ya que se necesita +1 de un tensor por lado para mantener la tensión correcta en la cadena.
fr_ca: Nous recommandons les châssis à courroie, mais nous reconnaissons que la courroie est une option difficile pour les nouvelles équipes. La chaîne et les engrenages sont également d'excellentes options – la chaîne nécessite un peu plus de réflexion, car il est nécessaire d'avoir au moins 1 tendeur par côté pour maintenir la bonne tension de la chaîne.
zh_cn: 我们推荐使用皮带传动系统，但也意识到皮带传动对于新车队来说是一个困难的选择。链条和齿轮也是不错的选择 - 链条需要更多的考虑，因为每侧需要1个以上的张紧器来保持链条的正确张力。

source: CAD or a detailed sketch is generally recommended with chain in order to visualize the chain run (where the chain will be placed). Gears are slightly simpler, and can be a fantastic and easy option, especially when using extrusion. We would advise to stay away from TETRIX gears, and use the gears from other kits such as the REV delrin gears (with hex hub strengthener) or REV aluminum gears.
es_mx: En general, se recomienda utilizar CAD o un croquis detallado con la cadena para visualizar el recorrido de la cadena (dónde se colocará la cadena). Los engranajes son algo más sencillos, y pueden ser una opción fantástica y fácil, especialmente cuando se utiliza extrusión. Aconsejamos alejarse de los engranajes TETRIX, y utilizar los engranajes de otros kits como los engranajes REV de delrin (con refuerzo hexagonal del buje) o los engranajes REV de aluminio.
fr_ca: Il est généralement recommandé d'utiliser un CAD ou un croquis détaillé avec la chaîne afin de visualiser le parcours de la chaîne (l'emplacement où la chaîne sera installée). Les engrenages sont légèrement plus simples et peuvent être une excellente option, surtout lorsqu'on utilise de l'extrusion. Nous conseillons d'éviter les engrenages TETRIX et de privilégier les engrenages d'autres kits, comme les engrenages en delrin REV (avec un renfort de moyeu hexagonal) ou les engrenages en aluminium REV.
zh_cn: 一般建议使用 CAD 或详细的草图来绘制链条的运行图（链条的放置位置）。齿轮的制作稍微简单一些，也是一种非常简单的选择，尤其是在使用挤压齿轮以啮合时。我们建议不要使用 TETRIX 齿轮，而应使用其他套件中的齿轮，如 REV delrin 齿轮（带六角轮毂加固器）或 REV 铝质齿轮。

source: See the :doc:`/docs/common-mechanisms/power-transmission/index` section for more details.
es_mx: Consulte la sección :doc:`/docs/mecanismos-comunes/transmisión-de-potencia/índice` para obtener más información.
fr_ca: Pour plus de détails, consultez la section :doc:/docs/common-mechanisms/power-transmission/index.
zh_cn: 详情参见 :doc:`/docs/common-mechanisms/power-transmission/index` 部分。

source: **An important step is determining what you want out of your drivetrain**.
es_mx: **Un paso importante es determinar lo que quieres de tu chasis**.
fr_ca: **Une étape importante est de déterminer ce que vous attendez de votre châssis**.
zh_cn: **重要的一步是确定您对动力传动系统的要求**。

source: Do you want speed?
es_mx: ¿Quieres velocidad?
fr_ca: Vous voulez de la vitesse?
zh_cn: 你想要速度吗？
