Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/index.po
Languages: es_mx, fr_ca, zh_cn

source: Pushing power?
es_mx: ¿Potencia de empuje?
fr_ca: Puissance de poussée ?
zh_cn: 推力如何？

source: Ability to get over terrain?
es_mx: ¿Habilidad para pasar por el terreno?
fr_ca: Capacité à franchir des terrains ?
zh_cn: 翻越各种地形的能力？

source: Do you need to strafe?
es_mx: ¿Necesitas ametrallar?
fr_ca: Avez-vous besoin de vous déplacer latéralement (strafe) ?
zh_cn: 需要有横向移动的能力吗？

source: All of these questions should be answered before choosing a drivetrain.
es_mx: Todas estas preguntas deben responderse antes de elegir un chasis.
fr_ca: Toutes ces questions doivent être répondues avant de choisir un châssis.
zh_cn: 在选择动力传动系统之前，应先回答所有这些问题。

source: Drivetrain Options
es_mx: Opciones de Chasis
fr_ca: Options de châssis
zh_cn: 传动系统选项

source: Glossary
es_mx: Glosario
fr_ca: Glossaire
zh_cn: 术语表

source: Omni Wheel
es_mx: Rueda Omni
fr_ca: Roues Omni
zh_cn: 全向轮

source: Omni(directional) wheels, sold by many different vendors, are a special type of wheel that prioritizes mobility and strafing (moving laterally) over traction or front-back movement. They are similar to :term:`mecanum wheels <Mecanum Wheel>` in that omni wheels have rubber rollers that rotate perpendicular to the plane of the wheel.
es_mx: Las ruedas omni (direccionales), vendidas por muchos proveedores diferentes, son un tipo especial de rueda que da prioridad a la movilidad y el ametrallamiento (movimiento lateral) sobre la tracción o el movimiento adelante-atrás. Se parecen a las :term:`ruedas mecanum <Mecanum Wheel>` en que las ruedas omni tienen rodillos de goma que giran perpendicularmente al plano de la rueda.
fr_ca: Les roues omnidirectionnelles (Omni wheels), vendues par de nombreux fournisseurs, sont un type spécial de roue qui privilégie la mobilité et le strafe (déplacement latéral) par rapport à la traction ou au mouvement avant-arrière. Elles sont similaires aux roues mecanum<Mecanum Wheel> dans le sens où les roues omnidirectionnelles possèdent des rouleaux en caoutchouc qui tournent perpendiculairement au plan de la roue.
zh_cn: 全向车轮（精准方向）由许多不同的供应商销售，是一种特殊类型的轮子，优先考虑移动性和横向移动（向着侧向移动），而不是牵引力或前后移动。它们与 :term:`麦克纳姆轮 <Mecanum Wheel>` 相似，全向车轮的橡胶滚轮垂直于车轮平面旋转。

source: Thus, the robot can move sideways (although the robot is not powered in the sideways direction). It is also utilized as a low-friction wheel in 4 wheel, 6 wheel, and 8 wheel drivetrains instead of having corner traction wheels.
es_mx: De este modo, el robot puede desplazarse lateralmente (aunque el robot no se propulsa en la dirección lateral). También se utiliza como rueda de baja fricción en transmisiones de 4, 6 y 8 ruedas en lugar de tener ruedas de tracción en las esquinas.
fr_ca: Ainsi, le robot peut se déplacer latéralement (bien que le robot ne soit pas propulsé dans cette direction). Les roues omnidirectionnelles sont également utilisées comme roues à faible friction dans des châssis à 4, 6 ou 8 roues, au lieu d'avoir des roues de traction dans les coins.
zh_cn: 因此，机器人可以侧向移动（尽管机器人在侧向没有动力）。在4轮、6轮和8轮传动系统中，它还可用作低摩擦轮，而不是转角牵引轮。

source: Furthermore, X-drive utilizes four omni wheels, though traction is at a minimum.
es_mx: Además, X-drive utiliza cuatro ruedas omnidireccionales, aunque la tracción es mínima.
fr_ca: De plus, le X-drive utilise quatre roues omnidirectionnelles, bien que la traction soit minimale.
zh_cn: 此外，X-drive 利用四个全向车轮，但牵引力很小。

source: A mecanum wheel is *technically* an omnidirectional wheel, but when generally referred to, an "omni wheel" has rollers rotated 90 degrees to the rotation of the wheel, where a mecanum wheel is generally 45 degrees.
es_mx: Una rueda mecanum es *técnicamente* una rueda omnidireccional, pero cuando se habla de ella en general, una "rueda omni" tiene los rodillos girados 90 grados respecto a la rotación de la rueda, mientras que una rueda mecanum suele tener 45 grados.
fr_ca: Une roue mecanum est *techniquement* une roue omnidirectionnelle, mais lorsqu'on parle généralement de "roue omnidirectionnelle", on fait référence à des rouleaux tournant à 90 degrés par rapport à la rotation de la roue, tandis qu'une roue mecanum a des rouleaux tournant généralement à 45 degrés.
zh_cn: 从技术上讲，麦克纳姆轮是一种全向轮，但在一般情况下，"全向轮 "的滚轮与轮子的旋转方向成 90 度，而麦轮一般为 45 度。

source: A REV Robotics omni wheel
es_mx: Una rueda Omni de REV Robotics
fr_ca: Une roue omnidirectionnelle REV Robotics
zh_cn: 一个 REV Robotics 的全向轮

source: Traction wheel
es_mx: Rueda de tracción
fr_ca: Roue de traction
zh_cn: 牵引轮

source: A traction or grip wheel is a wheel designed for maximum grip. It has an outer ring made of rubber, and its wide track ensures a larger contact patch with the ground. Traction wheels are commonly found in tank drivetrains. They are sold in different sizes and thicknesses by different manufacturers.
es_mx: Una rueda de tracción o agarre es una rueda diseñada para lograr la máxima adherencia. Tiene un aro exterior de goma y su ancho de vía garantiza una mayor superficie de contacto con el suelo. Las ruedas de tracción suelen encontrarse en los chasises de tanque. Los distintos fabricantes las comercializan en diferentes tamaños y grosores.
fr_ca: Une roue de traction ou roue de grip est une roue conçue pour offrir une adhérence maximale. Elle possède un anneau extérieur en caoutchouc, et son large profil assure une plus grande surface de contact avec le sol. Les roues de traction sont couramment utilisées dans les châssis à tank. Elles sont vendues en différentes tailles et épaisseurs par divers fabricants.
zh_cn: 牵引轮或抓地轮是为获得最大抓地力而设计的轮子。它的外圈由橡胶制成，其宽大的轨道可确保与地面有更大的接触面积。牵引轮常见于坦克传动系统中。不同制造商出售的牵引轮有不同的尺寸和厚度。

source: Strafing
es_mx: Ametrallamiento
fr_ca: Déplacement latéral
zh_cn: 平移

source: Strafing is the act of moving sideways or laterally (somewhat similar to drifting). It is possible with omni or mecanum wheels, and not possible with traction wheels.
es_mx: El ametrallamiento es el acto de desplazarse lateralmente (algo similar a derrapar). Es posible con ruedas omni o mecanum, y no es posible con ruedas de tracción.
fr_ca: Le strafing est l'action de se déplacer latéralement (un peu comme la dérive). Il est possible avec des roues omni ou mecanum, mais pas avec des roues de traction.
zh_cn: 平移是一种侧向或横向移动的行为（有点类似于漂移）。全向轮或麦克纳姆轮可以实现，而牵引轮则无法实现。

source: Parallel Plate Drivetrain
es_mx: Chasis de placas paralelas
fr_ca: Châssis à plaques parallèles
zh_cn: 平行板式传动系统

source: A parallel plate drivetrain is a drivetrain that has drive pods that consist of 2 plates spread apart with wheels and drive transmission in between them.
es_mx: Un chasis de placas paralelas es un chasis que consta de 2 placas separadas con ruedas y transmisión entre ellas.
fr_ca: Un châssis à plaques parallèles est un système de propulsion où les pods de traction se composent de 2 plaques espacées, avec les roues et le mécanisme de transmission de puissance placés entre elles.
zh_cn: 平行板动力传动系统是一种动力传动系统，其电机由两块分开的板组成，2块板之间装有车轮和驱动传动装置。

source: These plates can be anywhere from 1" to 5" apart, depending on the space requirements of the wheels and drive system. Generally, a pod width of 3" or less is desired to maximize the space between the drive pods for mechanisms such as an intake.
es_mx: Estas placas pueden tener una separación de entre 1" y 5", dependiendo de los requisitos de espacio de las ruedas y el sistema de tracción. Por lo general, se desea una anchura de la cápsula de 3" o menos para maximizar el espacio entre la cápsula para mecanismos tales como un intake.
fr_ca: Ces plaques peuvent être espacées de 1" à 5", en fonction des besoins en espace des roues et du système de propulsion. En général, une largeur de pod de 3" ou moins est souhaitée pour maximiser l'espace entre les pods de propulsion pour des mécanismes tels qu'un système d'aspiration.
zh_cn: 根据车轮和驱动系统的空间要求，这些板的间距可以从 1 英寸到 5 英寸不等。一般情况下，电机宽度应为 3 英寸或更小，以便最大限度地利用驱动电机之间的空间来安装吸取模块等装置。
