Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/tank.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/e02b1ee98816af5505b528e2>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/e02b1ee98816af5505b528e2>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/e02b1ee98816af5505b528e2>`__
ro_ro: `Click aici pentru a explora acest model în OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/e02b1ee98816af5505b528e2>`__
zh_cn: `点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/e02b1ee98816af5505b528e2> 中查看此模型 `__

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/16bae3d8b801874d9b1daaff>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/16bae3d8b801874d9b1daaff>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/16bae3d8b801874d9b1daaff>`__
ro_ro: `Click aici pentru a explora acest model în OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/16bae3d8b801874d9b1daaff>`__
zh_cn: `点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/16bae3d8b801874d9b1daaff> 中查看此模型 `__

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/fab2c2e33242281f0d46e524>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/fab2c2e33242281f0d46e524>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/fab2c2e33242281f0d46e524>`__
ro_ro: `Click aici pentru a explora acest model în OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/fab2c2e33242281f0d46e524>`__
zh_cn: `点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/fab2c2e33242281f0d46e524> 中查看此模型 `__

source: 7209 Tech Hog's Relic Recovery Robot
fr_ca: 7209 Robot de récupération de reliques Tech Hog
zh_cn: 7209 Tech Hog队伍的 Relic Recovery Robot

source: 10641 Atomic Gear's 4WD on a table
es_mx: 10641 Atomic Gear's 4WD en una mesa
fr_ca: 10641 4WD d'Atomic Gear sur une table
ro_ro: 10641 Atomic Gear's 4WD
zh_cn: 10641 Atomic Gear的 4WD 摆放在桌上

source: 6 Wheel Drive (6WD)
es_mx: Tracción a las 6 ruedas (6WD)
fr_ca: 6 roues motrices (6WD)
ro_ro: Tracțiune pe 6 roți (6WD)
zh_cn: 六轮驱动（6WD）

source: A 6 wheel drivetrain is a common competitive drivetrain in FTC for multiple reasons: it has fantastic traction, great turning, and by having 6 wheels, the drivetrain has more contact with the ground, helping with stability and traction. There are two main types of 6 wheel drivetrains: ones with **corner omnis** and ones with a **drop center**.
es_mx: Un chasis de 6 ruedas es un chasis competitivo común en FTC por múltiples razones: tiene una tracción fantástica, un gran giro, y al tener 6 ruedas, el chasis tiene más contacto con el suelo, ayudando con la estabilidad y la tracción. Hay dos tipos principales de transmisiones de 6 ruedas: las que tienen **esquinas omnis** y las que tienen **centro de caída**.
ro_ro: Un șasiu cu 6 roți este un șasiu competitiv comun în FTC din mai multe motive: are o tracțiune fantastică, se întoarce foarte bine și, având 6 roți, șasiul are mai mult contact cu solul, ceea ce ajută la stabilitate și tracțiune. Există două tipuri principale de sasiu cu 6 roți: cele cu **omni-uri în colțuri** și cele cu **drop center**.
zh_cn: 六轮传动系统是 FTC 中常见的竞技传动系统，原因有很多：它具有出色的牵引力和转弯性能，而且由于有六个车轮，传动系统与地面的接触更多，有助于提高稳定性和牵引力。6 轮传动系统主要有两种类型：**转角全向**和**投放中心**。

source: **Drop Center**
es_mx: **Centro de Caída**
zh_cn: **投放中心**

source: A drop center 6WD is a 6 wheel drive with the center wheel mounted slightly below the other two wheels. The drop should be anywhere from more than 1/16" up to 1/4". However, the recommended drop is around 1/8". Typically, lighter robots (<25 lbs.) can have less drop, while heavier robots (>25 lbs.) perform slightly better with more than 1/8" drop.
es_mx: Un centro de caída 6WD son 6 ruedas motrices con la rueda central montada ligeramente por debajo de las otras dos ruedas. La caída debe ser en cualquier lugar de más de 1/16 "hasta 1/4". Sin embargo, la caída recomendada es de alrededor de 1/8". Normalmente, los robots más ligeros (<25 lbs.) pueden tener menos caída, mientras que los robots más pesados (>25 lbs.) funcionan ligeramente mejor con más de 1/8" de caída.
zh_cn: 中心下沉式 6WD 方案是一种 6 轮驱动装置，其中心轮安装在略低于其他两个车轮的位置。落差应在 1/16 英寸以上至 1/4 英寸之间。不过，建议的落差约为 1/8"。通常情况下，轻型机器人（<25 lbs.)落差更小，而重型机器人 (>25 lbs.）的性能略好于 1/8 英寸以上的落差。

source: The purpose of dropping the middle wheel is to ensure that only 4 wheels are in contact with the ground at all times. This is because turning with 6 wheels on the ground introduces lots of friction, making it very difficult to turn quickly. Note that the **required drop may vary depending on both field condition and weight of the overall robot**.
es_mx: El objetivo de dejar caer la rueda central es garantizar que sólo 4 ruedas estén en contacto con el suelo en todo momento. Esto se debe a que girar con 6 ruedas en el suelo introduce mucha fricción, lo que hace muy difícil girar rápidamente. Tenga en cuenta que el **descenso requerido puede variar en función de las condiciones del terreno y del peso del robot**.
zh_cn: 放下中间车轮的目的是确保始终只有 4 个车轮与地面接触。这是因为在 6 个轮子着地的情况下转弯会产生很大的摩擦力，很难快速转弯。请注意，**所需的落差可能因场地条件和整个机器人的重量而异**。

source: Turning can drastically degrade due to a difference in material underneath the field, leading to the robot sinking down further than usual.
es_mx: El giro puede degradarse drásticamente debido a una diferencia de material debajo del campo, lo que hace que el robot se hunda más de lo habitual.
fr_ca: Le retournement peut se dégrader considérablement en raison d'une différence de matériaux sous le terrain, ce qui fait que le robot s'enfonce plus que d'habitude.
zh_cn: 由于场地下方的材料不同，机器人的转弯性能会急剧下降，导致机器人比平时下沉得更多。

source: **Most drop center 6 wheel drives are made using custom drivetrains** because it is difficult to get the center wheel drop using a kit based build system (a notable exception being REV-based kit drivetrains). It is possible to execute a drop center using goBILDA and Actobotics using pillow blocks, but it is a little bit more awkward. However, with the new `goBILDA drop-center bearing plate <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_, it is straightforward to make a drop center drivetrain on goBILDA channel.
es_mx: **La mayoría de las transmisiones de 6 ruedas con centro de caída se hacen usando chasises personalizados** porque es difícil conseguir la caída de la rueda central usando un sistema de construcción basado en un kit (una notable excepción son los chasises de kit basados en REV). Es posible realizar una caída central con goBILDA y Actobotics utilizando bloques de almohada, pero es un poco más incómodo. Sin embargo, con el nuevo `goBILDA drop-center bearing plate <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_, es sencillo hacer un chasis con centro de caída en el canal goBILDA.
fr_ca: **La plupart des transmissions à 6 roues motrices avec centre de gravité sont fabriquées en utilisant des transmissions sur mesure** car il est difficile d'obtenir le centre de gravité en utilisant un système de construction basé sur un kit (une exception notable étant les transmissions en kit basées sur le système REV). Il est possible d'obtenir un centre de gravité avec goBILDA et Actobotics en utilisant des paliers, mais c'est un peu plus difficile. Cependant, avec la nouvelle `plaque de roulement pour centre de gravité goBILDA <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_, il est facile de faire une transmission à centre de gravité sur le canal goBILDA.
zh_cn: **大多数降心六轮驱动装置都是使用定制的传动系统**制作的，因为使用基于套件的构建系统很难实现中心轮降心（基于 REV 的套件传动系统是一个显著的例外）。使用 goBILDA 和 Actobotics 的枕木块可以实现中心下降，但会比较笨拙。不过，有了新的 `goBILDA 落心轴承板 <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_，就可以在 goBILDA 通道上直接制作落心传动系统。

source: Great traction and maneuverability
es_mx: Gran tracción y maniobrabilidad
fr_ca: Excellente traction et maniabilité
zh_cn: 强大的牵引力和可操作性

source: Good acceleration, can have a high top speed
es_mx: Buena aceleración, puede tener una alta velocidad máxima
fr_ca: Bonne accélération, vitesse de pointe élevée
zh_cn: 加速性能好，速度上限高

source: Great stability under all robot weights
es_mx: Gran estabilidad con todos los pesos de robot
fr_ca: Grande stabilité quel que soit le poids du robot
zh_cn: 在所有机器人重量下都具有极高的稳定性

source: Able to play defense
es_mx: Capaz de jugar en defensa
fr_ca: Capable de jouer en défense
zh_cn: 能够进行防守

source: Drop-center 6WD is tricky to build with :term:`channel <Channel>` based systems, though this has been partially mitigated with the `goBILDA drop-center bearing plate <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_
es_mx: La 6WD de caída central son difícil de construir con los sistemas basados en :term:`canal <Channel>`, aunque esto se ha mitigado parcialmente con la placa de rodamiento de centro descendente `goBILDA <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_
fr_ca: Il est difficile de construire un 6 roues motrices à centre basculant avec les systèmes basés sur :term:`channel <Channel>`, bien que cela ait été partiellement atténué avec la plaque de roulement à centre basculant `goBILDA <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_.
zh_cn: 使用基于 :term: ` 通道 <Channel>` 的系统制造落心式 6WD 方案十分困难，不过使用 `goBILDA 落心式轴承板 <https://www.gobilda.com/1616-series-drop-center-bearing-plate-2mm-drop-4-pack/>`_可以部分缓解这一问题。

source: Drop-center 6WD is slightly worse at turning, but has more traction
es_mx: La tracción 6WD es ligeramente peor en los giros, pero tiene más tracción.
zh_cn: 落心式 6WD 方案转弯能力稍差，但牵引力更大

source: Drop-center 6WD is dependent on field conditions
es_mx: La 6WD de centro de caída depende de las condiciones del campo
fr_ca: Le centre de gravité de 6 roues motrices dépend des conditions de terrain.
zh_cn: 下降中心 6WD 方案取决于现场条件

source: Corner omni 6WD has less traction
es_mx: Esquina omni 6WD tiene menos tracción
fr_ca: Corner omni 6 roues motrices a moins de traction
zh_cn: 使用转角全向轮的 6WD 方案的牵引力较弱

source: Slow :term:`gear ratios <Gear Reduction>` will make a 6WD feel sluggish
es_mx: Las relaciones de engranajes <Gear Reduction> lentas harán que un 6WD se sienta lento.
fr_ca: Un :terme:`rapports de vitesse lents <Gear Reduction>` donnera à un 6 roues motrices une impression de lenteur.
zh_cn: 慢 :term: ` 齿轮比 <Gear Reduction>`会使 6WD 方案感觉迟钝

source: CAD Examples of Six Wheel Drive (Click to expand)
es_mx: Ejemplos CAD de tracción a las seis ruedas (Haga clic para ampliar)
fr_ca: Exemples CAD de 6 roues motrices (Cliquez pour agrandir)
zh_cn: 六轮驱动 CAD 示例（点击展开）

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/97e67997606a54fcabd367ac>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/97e67997606a54fcabd367ac>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/97e67997606a54fcabd367ac>`__
zh_cn: 点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/97e67997606a54fcabd367ac> 中查看此模型 `__

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/a787322363f7646a8b7cb69e>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/a787322363f7646a8b7cb69e>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/a787322363f7646a8b7cb69e>`__
zh_cn: 点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/a787322363f7646a8b7cb69e> 中查看此模型 `__

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/05fbe7b65c6c4be0b0cddabb>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/05fbe7b65c6c4be0b0cddabb>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/05fbe7b65c6c4be0b0cddabb>`__
zh_cn: 点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/05fbe7b65c6c4be0b0cddabb> 中查看此模型 `__

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/258524b3c7582178ba684ac5>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/258524b3c7582178ba684ac5>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/258524b3c7582178ba684ac5>`__
zh_cn: 点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/258524b3c7582178ba684ac5> 中查看此模型 `__

source: 7236 Recharged Green's 6wd
fr_ca: Le vert rechargé à six roues motrices de 7236
zh_cn: 7236 Recharged Green 队伍的6WD 方案

source: 7236 Recharged Green, Rover Ruckus; drop center 6WD
es_mx: 7236 Recharged Green, Rover Ruckus; caída central 6WD
zh_cn: 7236 Recharged Green, Rover Ruckus; 的投放中心 6WD方案

source: Ethan Doak, goBILDA 6 wheel drive with corner omni wheels
es_mx: Ethan Doak, goBILDA 6 ruedas motrices con ruedas omni de esquina
zh_cn: Ethan Doak，goBILDA 6 轮驱动，带转角全向车轮

source: 8 Wheel Drive
es_mx: Tracción a las 8 ruedas
fr_ca: 8 roues motrices
zh_cn: 8 轮驱动

source: An 8 wheel drivetrain is less common than its 6WD counterpart, combining elements found in both 4 wheel and 6 wheel drivetrains. For example, the 6 wheel drivetrain generally will have a dropped center wheel so that the robot turns on four wheels instead of six, reducing friction and increasing turning mobility.
es_mx: Una transmisión de 8 ruedas es menos común que su contraparte de 6 ruedas motrices, ya que combina elementos que se encuentran tanto en los chasises de 4 ruedas como en las de 6 ruedas. Por ejemplo, el chasis de 6 ruedas suele tener una rueda central más baja para que el robot gire sobre cuatro ruedas en lugar de seis, lo que reduce la fricción y aumenta la movilidad de giro.
zh_cn: 八轮传动系统不如六轮传动系统常见，它结合了四轮和六轮传动系统中的元素。例如，6 轮传动系统通常会有一个下置的中心轮，这样机器人就可以用 4 个轮子而不是 6 个轮子来转动，从而减少摩擦，提高转弯机动性。

source: On an 8 wheel drive, the center four wheels are dropped. This means that when turning, only these middle four wheels are touching the ground. Thus, the 8 wheel drivetrain has slightly more stability while turning than a 6 wheel drive, whereas 6 wheel drives can turn more quickly. Furthermore, since the 8 wheel drive has wheels in the same place as a 4 wheel drive, it has the stability of a 4 wheel drive.
es_mx: En unas 8 ruedas motrices, las cuatro ruedas centrales están caídas. Esto significa que, al girar, sólo estas cuatro ruedas centrales tocan el suelo. Así, la transmisión de 8 ruedas tiene algo más de estabilidad al girar que una de 6, mientras que las de 6 pueden girar más rápidamente. Además, como la tracción a 8 ruedas tiene las ruedas en el mismo lugar que una tracción a 4 ruedas, tiene la estabilidad de una tracción a 4 ruedas.
zh_cn: 在 8 轮驱动的汽车上，中间的四个车轮是下置的。这意味着在转弯时，只有中间的四个车轮接触地面。因此，8 轮传动系统转弯时的稳定性比 6 轮传动系统略高，而 6 轮传动系统转弯速度更快。此外，由于 8 轮驱动的车轮与 4 轮驱动的车轮位于同一位置，因此它具有 4 轮驱动的稳定性。

source: It is suggested that all eight wheels should be powered, and :term:`planetary <Planetary Gear>` motors should be used over a :term:`spur gear <Spur gearbox>` motor.
es_mx: Se sugiere accionar las ocho ruedas y utilizar motores :term:`planetarios <Planetary Gear>` en lugar de un motor :term:`engranajes rectos <Spur gearbox>`.
fr_ca: Il est suggéré que les huit roues soient motorisées et que les moteurs :term:`planétaire <Planetary Gear>` soient utilisés plutôt qu'un moteur :term:`à engrenage cylindrique <Spur gearbox>`.
zh_cn: 建议为所有八个车轮提供动力，并使用 :term: `planetary <Planetary Gear>` 电机，而不是 :term: `spur gear <Spur gearbox>` 电机。

source: Teams also have the option of using doubled omni wheels on the outer four wheels. Doing so will reduce traction/pushing power and increase mobility.
es_mx: Los equipos también tienen la opción de utilizar ruedas omni dobles en las cuatro ruedas exteriores. De este modo se reduce la fuerza de tracción/empuje y se aumenta la movilidad.
fr_ca: Les équipes ont également la possibilité d'utiliser des roues omni doublées sur les quatre roues extérieures. Cela permet de réduire la force de traction/poussée et d'augmenter la mobilité.
zh_cn: 参赛队还可以选择在外侧四个车轮上使用双层全能轮。这样做可以减少牵引力/推力，提高机动性。

source: Combines the stability of 6WD with the agility of 4WD
es_mx: Combina la estabilidad de la 6WD con la agilidad de la 4WD
fr_ca: Combine la stabilité des 6 roues motrices et l'agilité des 4 roues motrices
zh_cn: 兼具 6WD 方案的稳定性和 4WD 的灵活性

source: Even more stable than 6WD
es_mx: Aún más estable que 6WD
fr_ca: Encore plus stable que les 6 roues motrices
zh_cn: 比 6WD 方案更稳定

source: Fantastic traction and acceleration
es_mx: Tracción y aceleración fantásticas
fr_ca: Traction et accélération fantastiques
zh_cn: 出色的牵引力和加速度

source: Great for defense
es_mx: Excelente para la defensa
fr_ca: Idéal pour la défense
zh_cn: 非常适合防御

source: Takes up more space than 6WD
es_mx: Ocupa más espacio que la 6WD
fr_ca: Prends plus de place qu'un 6 roues motrices.
zh_cn: 比 6WD 方案占用更多空间

source: Powering all 8 wheels can be tricky
es_mx: Accionar las 8 ruedas puede ser complicado
fr_ca: Alimenter les 8 roues peut s'avérer délicat
zh_cn: 为所有 8 个车轮提供动力可能很棘手

source: Without adequate center drop, turning can be drastically reduced
es_mx: Sin una caída central adecuada, los giros pueden verse drásticamente reducidos
fr_ca: Si la chute du centre n'est pas suffisante, le braquage peut être considérablement réduit.
zh_cn: 如果没有足够的中心落差，转弯速度会大大降低

source: 3846 Maelstrom's 8WD
fr_ca: 3846 Maelstrom's 8 roues motrices
zh_cn: 3846 Maelstrom 的八轮驱动方案

source: A render of 13075 Coram Deo Academy Robotics' 8WD
es_mx: Un render de 13075 Coram Deo Academy Robotics' 8WD
fr_ca: Un rendu du 13075 Coram Deo Academy Robotics' de 8 roues motrices.
zh_cn: 13075 Coram Deo Academy 8WD 机器人效果图

source: 13075 Coram Deo Academy Robotics' 8WD
zh_cn: 13075 Coram Deo Academy 8WD机器人

source: Tread Drive
es_mx: Accionamiento de la banda de rodadura
fr_ca: Rendu du système à chenilles
zh_cn: 胎面驱动

source: Tread drive is the use of tank treads or wide belts to power movement, much like a real life tank. Unfortunately, in FTC, it is not a competitive drivetrain for a number of reasons.
es_mx: La tracción por bandas de rodadura es el uso de bandas de rodadura o correas anchas para impulsar el movimiento, como en un tanque de la vida real. Por desgracia, en la FTC no es una transmisión competitiva por varias razones.
zh_cn: 履带驱动是指使用坦克履带或宽皮带为运动提供动力，就像现实中的坦克一样。遗憾的是，在 FTC 中，由于多种原因，这种传动系统并不具有竞争力。

source: Tread is complex, and has many points of failure. Treads are also very prone to defense, and a slight hit from another robot is enough to misalign the treads. :term:`Commercial Off-The-Shelf (COTS) <COTS>` tread options aren't great either - TETRIX tracks have a tendency to snap and derail when used on robot drivetrains, making them not suitable for competition use.
es_mx: Las bandas de rodadura son complejas y tienen muchos puntos de fallo. Las bandas de rodadura también son muy propensas a defenderse, y basta un ligero golpe de otro robot para desalinearlas. :term:`Commercial Off-The-Shelf (COTS) <COTS>` las opciones de bandas de rodadura tampoco son buenas: las orugas TETRIX tienen tendencia a romperse y descarrilar cuando se utilizan en los chasises de los robots, por lo que no son adecuadas para su uso en competición.
zh_cn: 胎面很复杂，有很多故障点。胎面也非常容易损坏，来自其他机器人的轻微撞击就足以使胎面错位。 :term: `Commercial Off-The-Shelf (COTS) <COTS>`胎面的选择也不多--TETRIX 履带在用于机器人传动系统时容易断裂和脱轨，因此不适合在比赛中使用。

source: While it is possible to implement tread drive successfully, such as in the example below, most inexperienced teams do not have the capability and know-how to do so. Tread drive has negligible traction improvements at the cost of maneuverability. There are better options to traverse terrain, such as a 4WD.
es_mx: Aunque es posible implantar con éxito la tracción en las bandas de rodadura, como en el ejemplo siguiente, la mayoría de los equipos inexpertos no tienen la capacidad ni los conocimientos necesarios para hacerlo. La tracción de la banda de rodadura ofrece mejoras insignificantes de la tracción a costa de la maniobrabilidad. Hay mejores opciones para atravesar el terreno, como un 4x4.
fr_ca: Bien qu'il soit possible de mettre en œuvre avec succès la traction sur bande de roulement, comme dans l'exemple ci-dessous, la plupart des équipes inexpérimentées n'ont pas les capacités et le savoir-faire nécessaires pour le faire. La bande de roulement apporte des améliorations négligeables en matière de traction, au détriment de la maniabilité. Il existe de meilleures options pour traverser le terrain, comme un 4 roues motrices.
zh_cn: 虽然有可能成功实施履带式驱动，例如下面的例子，但大多数缺乏经验的团队并不具备这样做的能力和技术诀窍。胎面驱动对牵引力的改善微乎其微，但却牺牲了机动性。要穿越地形，还有更好的选择，例如 4WD 方案。

source: Very good at traversing terrain
es_mx: Muy bueno atravesando terrenos
fr_ca: Très bonne capacité à traverser le terrain
zh_cn: 非常擅长穿越地形

source: Fantastic traction and pushing power
es_mx: Fantástica tracción y potencia de empuje
fr_ca: Traction et puissance de poussée fantastiques
zh_cn: 出色的牵引力和推动力

source: Suffers in maneuverability and top speed
es_mx: Sufre en maniobrabilidad y velocidad punta
fr_ca: Manœuvrabilité et vitesse de pointe insuffisantes
zh_cn: 机动性和最高速度较差

source: Very complex to implement
es_mx: Muy compleja de aplicar
fr_ca: Très complexe à implémenter
zh_cn: 实施起来非常复杂

source: Treads are prone to breakage and can fall off easily
es_mx: Los tacos son propensos a romperse y pueden caerse con facilidad
fr_ca: Les bandes de roulement sont sujettes à la rupture et peuvent tomber facilement
zh_cn: 踏板容易破损和脱落

source: 5975 Cybots' Tread Drive Render
es_mx: 5975 Render de la unidad de tracción de Cybots
fr_ca: Rendu du système à chenilles des 5975 Cybots
zh_cn: 5975 Cybots机器人的履带式驱动器效果图

source: goBILDA Custom
es_mx: goBILDA Personalizado
