Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/tank.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Tank (Skid-Steer) Drivetrains
es_mx: Tanques (Skid-Steer) Chasis
fr_ca: Châssis de type tank (ou à glissement différentiel)
ro_ro: Șasiuri Tank (Skid-Steer)
zh_cn: 坦克（滑移装载机）传动系统

source: 2 Wheel Drive (Pushbot Drive)
es_mx: 2 ruedas motrices (Pushbot Drive)
fr_ca: 2 Roues Motrices (Pushbot Drive)
ro_ro: Tracțiune pe 2 roți (Pushbot Drive)
zh_cn: 2轮驱动（推杆驱动）

source: **Recommended only for first drivetrain, not for competitions**
es_mx: **Recomendado sólo para el primer chasis, no para competiciones**
fr_ca: **Recommandé uniquement comme premier châssis, pas pour les compétitions**
ro_ro: **Recomandat doar pentru șasiu, nu pentru competiții**
zh_cn: **建议仅用于你的团队入门用的动力系统，而不用于比赛**

source: This rookie drivetrain is considered one of the inferior drivetrains, though it is usable at low competition levels. This is the introductory drivetrain type for many rookies, as it is promoted in official guides published by *FIRST*\ |reg| (giving it the name pushbot). It often has :term:`direct driven <Direct Drive>` :term:`traction wheels <Traction wheel>` with unpowered :term:`omni wheels <Omni Wheel>`.
es_mx: Este chasis para novatos se considera una de los chasises inferiores, aunque es utilizable en niveles de competición bajos. Es el tipo de chasis introductorio para muchos novatos, ya que se promociona en las guías oficiales publicadas por *FIRST* |reg| (dándole el nombre de pushbot). Suele tener :term:`transmisión directa <Direct Drive>` :term:`ruedas de tracción <Traction wheel>` con :term:`ruedas omni <Omni Wheel>` sin motor.
fr_ca: Ce châssis pour débutants est considérée comme l'une des transmissions inférieures, bien qu'elle soit utilisable à des niveaux de compétition peu élevés. C'est le type de transmission d'introduction pour de nombreux débutants, car il est promu dans les guides officiels publiés par *FIRST*\ |reg| (ce qui lui a valu le nom de pushbot). Il a souvent :term:`direct driven <Direct Drive>` :term:`traction wheels <Traction wheel>` avec des :term:`omni wheels <Omni Wheel>` non motorisés.
ro_ro: Aceast șasiu pentru începători este considerat unu; dintre cele mai slabe transmisii, deși este utilizabilă la niveluri de competiție scăzute. Acesta este tipul de șasiu introductiv pentru mulți începători, deoarece este promovat în ghidurile oficiale publicate de *FIRST* |reg| (ceea ce îi conferă numele de pushbot). Adesea are :term:`direct driven <Direct Drive>` :term:` traction wheels<Traction wheel> ` cu :term:`omni wheels<Omni Wheel> ` nealimentate.
zh_cn: 这种新手传动系统被认为是低级传动系统之一，尽管它在低级比赛中也能使用。这是许多新手的入门传动系统类型，因为*FIRST*/|reg|出版的官方指南中推广了这种传动系统（给它起了个名字叫pushbot）。它通常有 :term:`直接驱动 <Direct Drive>` :term:`牵引轮 <Traction wheel>` 和无动力的 :term:`全向轮 <Omni Wheel>`。

source: This type of drivetrain has poor turning as the center of turning is at the back of the robot between the two powered wheels. In comparison to other drivetrains, it has poor acceleration due to only using two motors.
es_mx: Este tipo de chasis tiene un giro deficiente, ya que el centro de giro se encuentra en la parte trasera del robot, entre las dos ruedas motrices. En comparación con otras chasises, tiene una aceleración deficiente debido a que sólo utiliza dos motores.
fr_ca: Ce type de transmission ne permet pas de tourner correctement, car le centre de rotation se trouve à l'arrière du robot, entre les deux roues motrices. Par rapport à d'autres transmissions, il a une faible accélération car il n'utilise que deux moteurs.
ro_ro: Acest șasiu virează slab, deoarece centrul de virare se află în partea din spate a robotului, între cele două roți motoare. În comparație cu alte șasiu, accelerația este slabă din cauza utilizării a numai două motoare.
zh_cn: 这种传动系统的转弯性能较差，因为转弯中心位于机器人后部的两个动力轮之间。与其他传动系统相比，由于只使用了两个电机，它的加速性能也较差。

source: Even though it may not be an optimal drivetrain, it is still possible to be competitive as long as the drivetrain is reliable. As a consensus, we would advise every new team to build the pushbot primarily to learn how to build with a kit. The pushbot is a good starting point and helps the team get familiarized with using kit parts, attaching wheels, mounting motors, etc. However, it is subpar to every other drivetrain in a competitive context.
es_mx: Aunque no sea un chasis óptimo, es posible ser competitivo siempre que el chasis sea fiable. En general, aconsejamos a todos los equipos nuevos que construyan el pushbot principalmente para aprender a construir con un kit. El pushbot es un buen punto de partida y ayuda al equipo a familiarizarse con el uso de las piezas del kit, la fijación de las ruedas, el montaje de los motores, etc. Sin embargo, es inferior a cualquier otr ochasis en un contexto competitivo.
fr_ca: Même s'il ne s'agit pas d'une transmission optimale, il est toujours possible d'être compétitif tant que la transmission est fiable. De manière générale, nous conseillons à toute nouvelle équipe de construire le pushbot principalement pour apprendre à construire avec un kit. Le pushbot est un bon point de départ et aide l'équipe à se familiariser avec l'utilisation des pièces du kit, la fixation des roues, le montage des moteurs, etc. Cependant, il est inférieur à toutes les autres transmissions dans un contexte compétitif.
ro_ro: Chiar dacă nu este un șasiu optim, este posibil să fie competitivi, atâta timp cât sistemul de propulsie este fiabil. Ca un consens, sfătuim ca fiecare echipă nouă să construiască pushbotul în primul rând pentru a învăța cum să construiască cu un kit. Pushbot-ul este un bun punct de plecare și ajută echipa să se familiarizeze cu utilizarea pieselor din kit, cu atașarea roților, cu montarea motoarelor etc. Cu toate acestea, este sub nivelul oricărui alt șasiu într-un context competitiv.
zh_cn: 尽管这可能不是最佳的动力传动系统，但只要动力传动系统可靠，还是有可能取得竞争优势的。作为共识，我们建议每支新参赛队制作推杆机器人，主要是为了学习如何使用套件进行制作。pushbot 是一个很好的起点，可以帮助团队熟悉如何使用套件部件、安装车轮和电机等。但是，在竞技环境中，它与其他任何动力传动系统相比都不尽如人意。

source: While the pushbot is a good first drivetrain for new teams to get acquainted with the kit, it is recommended that teams move away from this drivetrain when building their competition robot.
es_mx: Aunque el pushbot es un buen primer chasis para que los nuevos equipos se familiaricen con el kit, se recomienda que los equipos se alejen de este chasis cuando construyan su robot de competición.
fr_ca: Bien que le pushbot soit une bonne première transmission pour les nouvelles équipes afin de se familiariser avec le kit, il est recommandé que les équipes s'éloignent de cette transmission lors de la construction de leur robot de compétition.
ro_ro: În timp ce pushbot este un prim șasiu bun pentru echipele noi pentru a se familiariza cu kitul, se recomandă ca echipele să renunțe la această transmisie atunci când își construiesc robotul de competiție.
zh_cn: 虽然推杆机器人是新团队熟悉该套件的第一套传动系统，但建议团队在制作比赛机器人时不要使用该传动系统。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
ro_ro: Avantaje
zh_cn: 优势

source: Most simple drivetrain to build
es_mx: El chasis más sencillo de construir
fr_ca: La transmission la plus simple à construire
ro_ro: Cel mai simplu șasiu de construit
zh_cn: 最简单、最容易制作的动力传动系统

source: No need to worry about powering all four wheels
es_mx: No hay que preocuparse por la potencia de las cuatro ruedas
fr_ca: Pas besoin de se préoccuper de l'alimentation des quatre roues
ro_ro: Nu trebuie să vă faceți griji cu privire la punerea în mișcare a tuturor celor patru roți
zh_cn: 无需担心为四个车轮提供动力

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
ro_ro: Dezavantaje
zh_cn: 劣势

source: Slower than other options
es_mx: Más lento que otras opciones
fr_ca: Plus lent que les autres options
ro_ro: Mai lent decât alte opțiuni
zh_cn: 比其他可选传动系统慢

source: Underpowered (all other drivetrain options typically use 4 motors)
es_mx: Poca potencia (el resto de opciones de chasis suelen utilizar 4 motores).
fr_ca: Sous-puissance (toutes les autres options de transmission utilisent généralement 4 moteurs)
ro_ro: Subalimentat (toate celelalte opțiuni de transmisie folosesc de obicei 4 motoare)
zh_cn: 动力不足（所有其他传动系统方案通常使用 4 个电机）

source: Uses the Tetrix MAX motor, which is prone to burning out easily, is underpowered, and has a fragile gearbox.
es_mx: Utiliza el motor Tetrix MAX, que tiende a quemarse con facilidad, es poco potente y tiene una caja de engranajes frágil.
fr_ca: Utilise le moteur Tetrix MAX, qui a tendance à griller facilement, est sous-puissant et possède une boîte de vitesses fragile
ro_ro: Folosește motorul Tetrix MAX, care este predispus să se ardă cu ușurință, este insuficient de puternic și are un reductor fragil.
zh_cn: 使用 Tetrix MAX 电机，容易烧毁，动力不足，变速箱也很脆弱。

source: Lacks agility and maneuverability due to 2 motor turning
es_mx: Carece de agilidad y maniobrabilidad debido al giro de 2 motores
fr_ca: Manque d'agilité et de maniabilité en raison des 2 moteurs qui tournent
ro_ro: Lipsește agilitatea și manevrabilitatea din cauza celor 2 motoare care se rotesc
zh_cn: 由于使用 2 个电机转弯，缺乏灵活性和机动性

source: Poor acceleration due to 2 motors
es_mx: Poca aceleración debido a los 2 motores
fr_ca: Mauvaise accélération due à la présence de 2 moteurs
ro_ro: Accelerație slabă din cauza celor 2 motoare
zh_cn: 2 个电机导致加速性能差

source: Often :term:`direct driven <Direct Drive>`, which is highly discouraged for drivetrains
es_mx: A menudo el :term:`accionamiento directo`<Direct Drive>, muy desaconsejado para los chasises
fr_ca: Souvent :terme:`direct driven <Direct Drive>`, ce qui est fortement déconseillé pour les systèmes de transmissions.
ro_ro: Adesea asamblat :term:`direct driven<Direct Drive>`, ceea ce este extrem de descurajat în cazul transmisiilor.
zh_cn: 通常使用 :term:`直接驱动 <Direct Drive>`，就传动系统而言，非常不推荐这么搭建

source: Example pushbot drivetrain included in the starter FTC\ |reg| guide
es_mx: Ejemplo de chasis pushbot incluida en la guía de arranque FTC |reg|.
fr_ca: Exemple de système de transmission pushbot incluse dans le guide de démarrage FTC\ |reg| règlement
zh_cn: 包含在启动器 FTC\ |reg| 指南中的 pushbot 传动系统示例

source: 4 Wheel Drive
es_mx: Tracción a las 4 ruedas
fr_ca: 4 roues motrices
ro_ro: Tracțiune pe 4 roți
zh_cn: 4轮驱动（即后文所述4WD方案，WD意即“Wheel Drive”）

source: In its most common form, the drivetrain uses the same wheel layout as the two wheel drivetrain (2 traction wheels in the back, 2 omnis in the front), but with one notable difference: **all four wheels are powered**.
es_mx: En su forma más común, el chasis utiliza la misma disposición de ruedas que el chasis de dos ruedas (2 ruedas de tracción detrás, 2 omnis delante), pero con una diferencia notable: **Las cuatro ruedas son motrices**.
fr_ca: Dans sa forme la plus courante, le système de transmission utilise la même disposition des roues que la transmission à deux roues (2 roues motrices à l'arrière, 2 omnis à l'avant), mais avec une différence notable : **les quatre roues sont motrices**.
ro_ro: În forma sa cea mai obișnuită, șasiul utilizează acelaș layout al roților ca și șasiul pe două roți (2 roți de tracțiune în spate, 2 roți omnidirecționale în față), dar cu o diferență notabilă: **toate cele patru roți sunt acționate**.
zh_cn: 在最常见的形式中，传动系统使用与双轮传动系统相同的车轮布局（后部 2 个牵引轮，前部 2 个全向轮），但有一个显著区别： **四个车轮都有动力** 。

source: Some teams will put all four traction wheels or use all four omni wheels. It is not suggested to use all 4 traction wheels due to poor turning that results in this setup. This is caused by wheel scrub. Using omni wheels for all four wheels will result in incredible turning, with the robot rotating around its center.
es_mx: Algunos equipos pondrán las cuatro ruedas de tracción o utilizarán las 4 ruedas omni. No se recomienda utilizar las cuatro ruedas de tracción debido a los malos giros que se producen con esta configuración. Esto se debe a la fricción de las ruedas. El uso de ruedas omni para las cuatro ruedas dará como resultado un giro increíble, con el robot girando alrededor de su centro.
fr_ca: Certaines équipes utilisent les 4 roues de traction ou les quatre roues omni. Il n'est pas recommandé d'utiliser les quatre roues motrices en raison du mauvais virage qui résulte de cette configuration. Cela est dû au frottement des roues. L'utilisation de roues omnidirectionnelles pour les quatre roues permet d'obtenir un virage incroyable, le robot tournant autour de son centre.
ro_ro: Unele echipe vor pune toate cele patru roți de tracțiune sau vor folosi toate cele patru roți omni. Nu se sugerează utilizarea tuturor celor 4 roți de tracțiune din cauza virajelor slabe care rezultă în această configurație. Acest lucru este cauzat de frecarea roților. Folosirea roților omni pentru toate cele patru roți va avea ca rezultat o întoarcere incredibilă, robotul rotindu-se în jurul centrului său.
zh_cn: 有些参赛队伍会使用全部四个牵引轮或全部四个全向轮。不建议使用全部4个牵引轮，因为这种设置会导致转弯性能不良。这是车轮摩擦过大造成的。如果四个轮子都使用全向轮，机器人将围绕中心旋转，从而实现不可思议的转向性能。

source: Term
es_mx: Término
fr_ca: Définition
ro_ro: Termeni
zh_cn: 术语

source: Wheel scrub
es_mx: Rozamiento de ruedas
fr_ca: Frottement des roues
ro_ro: Frecarea roților
zh_cn: 车轮摩擦

source: Wheel scrub refers to friction between the side of the wheel and the floor tile. It inhibits turning as the drivetrain must overcome this frictional force in order to turn the robot. Wheel scrub is most common on 4 or 6 wheel tank drivetrains that do not have a :term:`center drop <Drop Center>`.
es_mx: El rozamiento de la rueda se refiere a la fricción entre el lateral de la rueda y la baldosa del suelo. Inhibe el giro, ya que el chasis debe superar esta fuerza de fricción para hacer girar al robot. El rozamiento de las ruedas es más común en transmisiones de 4 ó 6 ruedas que no tienen una :term:`caída central <Drop Center>`.
fr_ca: Le frottement de la roue correspond à la friction entre le côté de la roue et la dalle de sol. Il empêche le robot de tourner, car la transmission doit surmonter cette force de frottement pour faire tourner le robot. Le frottement des roues est plus fréquent sur les transmissions à réservoir à 4 ou 6 roues qui n'ont pas de :term:`center drop <Drop Center>`.
ro_ro: Frecarea roților se referă la frecarea dintre partea laterală a roții și tile. Aceasta împiedică rotirea, deoarece sistemul de transmisie trebuie să depășească această forță de frecare pentru a roti robotul. Frecarea roților este cel mai frecventă la trenurile de rulare cu 4 sau 6 roți care nu au un :term:`center drop<Drop Center>`.
zh_cn: 车轮摩擦是指车轮侧面与地砖之间的摩擦。由于传动系统必须克服这种摩擦力才能使机器人转动，因此这种摩擦力会抑制机器人的转动。车轮摩擦最常见于没有 :term:`中心落差 <Drop Center>`的 4 轮或 6 轮坦克驱动系统。

source: However, this advantage comes with a major loss of traction. For these reasons, many teams choose to use two traction wheels and two omni wheels for a balance between quick turning and traction. The primary advantage of this drivetrain over other tank drivetrains is its ability to easily move across raised terrain when the bot's center is raised above the terrain.
es_mx: Sin embargo, esta ventaja conlleva una importante pérdida de tracción. Por estas razones, muchos equipos optan por usar dos ruedas de tracción y dos ruedas omni para conseguir un equilibrio entre giro rápido y tracción. La principal ventaja de esta cadena cinemática sobre otras cadenas cinemáticas de tanques es su capacidad para desplazarse fácilmente por terrenos elevados cuando el centro del robot se eleva por encima del terreno.
fr_ca: Toutefois, cet avantage s'accompagne d'une perte importante de traction. C'est pour ces raisons que de nombreuses équipes choisissent d'utiliser deux roues de traction et deux roues omnidirectionnelles pour un équilibre entre la rapidité des virages et la traction. L’avantage principal de ce système de transmission de type char par rapport aux autres modèles similaires réside dans sa capacité à se déplacer aisément sur un terrain surélevé, même lorsque le centre du robot est soulevé au-dessus du sol.
zh_cn: 然而，这种优势也会带来牵引力的重大损失。因此，许多团队选择使用两个牵引轮和两个全能轮，以在快速转弯和牵引力之间取得平衡。与其他坦克传动系统相比，这种传动系统的主要优势在于，当机器人的中心高于地形时，它能够轻松地在凸起的地形上移动。

source: It is suggested that a four wheel drivetrain be close to, or exactly, a square. Otherwise, one may encounter problems turning.
es_mx: Se sugiere que un chasis con cuatro ruedas sea cercana, o exactamente, a un cuadrado. De lo contrario, pueden surgir problemas de giro.
fr_ca: Il est suggéré qu'une transmission à quatre roues soit proche, ou exactement, d'un carré. Dans le cas contraire, des problèmes de rotation peuvent survenir.
ro_ro: Se sugerează ca un șasiu pe patru roți să fie aproape sau chiar exact un pătrat. În caz contrar, se pot întâmpina probleme la întoarcere.
zh_cn: 建议四轮驱动系统接近或正好是一个正方形。否则，可能会遇到转向问题。

source: :term:`Weight distribution` is furthermore a large factor that should be considered: the more weight in the back, the better.
es_mx: :term:`La distribución del peso` es además un factor importante que debe tenerse en cuenta: cuanto más peso en la espalda, mejor.
fr_ca: :term:``La répartition du poids`` est également un facteur important à prendre en compte : plus le poids est important à l'arrière, mieux c'est.
ro_ro: :term:`Distribuția greutății` este, de asemenea, un factor important care trebuie luat în considerare: cu cât mai multă greutate în spate, cu atât mai bine.
zh_cn: :term:`重量分配` 也是一个需要考虑的重要因素：背部的重量越重越好。

source: Weight distribution
es_mx: Distribución del peso
fr_ca: Répartition du poids
ro_ro: Distribuția greutății
zh_cn: 重量分配

source: Weight distribution generally refers to how the weight of the robot is proportioned. It is desirable to have a relatively 50-50 (50% of weight in the front half, 50% in back half) so that the drivetrain has optimal manuverability and turning.
es_mx: La distribución del peso se refiere generalmente a cómo está proporcionado el peso del robot. Es deseable que sea relativamente 50-50 (50% del peso en la mitad delantera, 50% en la mitad trasera) para que el chasis tenga una maniobrabilidad y un giro óptimo.
fr_ca: La répartition du poids fait généralement référence à la manière dont le poids du robot est proportionné. Il est souhaitable d'avoir une répartition relativement 50-50 (50 % du poids dans la moitié avant, 50 % dans la moitié arrière) afin que le groupe motopropulseur ait une maniabilité et une capacité de virage optimales.
ro_ro: Distribuția greutății se referă, în general, la modul în care este proporționată greutatea robotului. Este de dorit să existe o proporție relativ 50-50 (50% din greutate în jumătatea din față, 50% în jumătatea din spate), astfel încât șasiul să aibă o manevrabilitate și o capacitate de virare optimă.
zh_cn: 重量分配一般是指机器人的重量比例。机器人的重量最好是50-50分配，即各占一半（50% 的重量在前半部分，50% 的重量在后半部分），这样传动系统就能获得最佳的操纵性和转弯性能。

source: Off-center turning, which may or may not be a drawback, is nearly ubiquitous among 4 wheel drives. This may not be a problem for teams, but it is good to be aware of it. Off-center turning can be an advantage, but be warned that turning will be slightly slower on 4 wheel drives than their six or eight wheel counterparts.
es_mx: El giro descentrado, que puede o no ser un inconveniente, es casi omnipresente entre los 4x4. Esto puede no ser un problema para los equipos, pero es bueno ser consciente de ello. El giro descentrado puede ser una ventaja, pero hay que tener en cuenta que los giros serán ligeramente más lentos en las 4 ruedas motrices que en sus contrapartes de seis u ocho ruedas.
fr_ca: Les virages décentrés, qui peuvent ou non constituer un inconvénient, sont presque omniprésents parmi les véhicules à 4 roues motrices. Ce n'est peut-être pas un problème pour les équipes, mais il est bon d'en être conscient. Les virages décentrés peuvent être un avantage, mais il faut savoir que les virages sont légèrement plus lents sur les véhicules à quatre roues motrices que sur les véhicules à six ou huit roues motrices.
ro_ro: Întoarcerea descentrată, care poate fi sau nu un dezavantaj, este aproape omniprezentă în cazul șasiurilor cu tracțiune integrală. Este posibil ca acest lucru să nu fie o problemă pentru echipe, dar este bine să fie conștientizat. Întoarcerea descentrată poate fi un avantaj, dar vă avertizăm că întoarcerea va fi ușor mai lentă la șasiurile cu 4 roți decât la cele cu 6 sau 8 roți.
zh_cn: 偏离中心转弯可能是也可能不是缺点，但在四轮驱动车中几乎无处不在。这对车队来说可能不是问题，但最好还是注意一下。偏离中心转弯可能是一种优势，但需要注意的是，4轮驱动车的转弯速度会比6轮或8轮的同类车型稍慢。

source: More maneuverable than 2WD
es_mx: Más maniobrable que 2WD
fr_ca: Plus maniable que les deux roues motrices
ro_ro: Mai ușor de manevrat decât 2WD
zh_cn: 比2轮驱动更灵活

source: Solid acceleration and traction
es_mx: Aceleración y tracción sólidas
fr_ca: Accélération et traction solides
ro_ro: Accelerație și tracțiune solide
zh_cn: 稳健的加速和牵引力

source: Can traverse terrain if the chassis is raised high enough
es_mx: Puede atravesar terrenos si el chasis se eleva lo suficiente
fr_ca: Peut traverser un terrain si le châssis est suffisamment élevé
ro_ro: Poate traversa terenul dacă șasiul este ridicat suficient de sus
zh_cn: 如果底盘升得足够高，就能穿越地形

source: Good pushing power for defense, yet maneuverable enough to avoid it
es_mx: Buena potencia de empuje para la defensa, pero lo suficientemente maniobrable para evitarla
fr_ca: Bonne puissance de poussée pour la défense, mais suffisamment manœuvrable pour l'éviter.
ro_ro: Putere bună de împingere pentru defense, dar suficient de manevrabil pentru a evita
zh_cn: 良好的推力可用于防御，但机动性足以躲避推力

source: Can tip more easily than 6WD/8WD with a high center of mass
es_mx: Puede volcar más fácilmente que 6WD/8WD con un centro de masa alto
fr_ca: Peut basculer plus facilement qu'un 6RM/8RM avec un centre de masse élevé
ro_ro: Se poate răsturna mai ușor decât 6WD/8WD cu un centru de greutate ridicat
zh_cn: 重心较高，比 6轮/8轮驱动更容易翻车

source: All traction wheel 4WD can have decreased maneuverability
es_mx: Todas las ruedas de tracción 4WD pueden tener una maniobrabilidad disminuida
fr_ca: Les quatre roues motrices à traction peuvent avoir une manœuvrabilité réduite.
ro_ro: Toate roțile de tracțiune 4WD pot avea o manevrabilitate redusă
zh_cn: 4个轮子全部都是牵引轮的4驱系统会降低操控性

source: Weight distribution factors into the turning point and turning radius of the robot
es_mx: La distribución del peso influye en el punto y radio de giro del robot
fr_ca: La répartition du poids influe sur le point de braquage et le rayon de braquage du robot.
ro_ro: Distribuția greutății influențează punctul de întoarcere și raza de întoarcere a robotului.
zh_cn: 机器人的转弯点和转弯半径与重量分配有关

source: CAD Examples of Four Wheel Drive (Click to expand)
es_mx: Ejemplos CAD de tracción a las cuatro ruedas (Haga clic para ampliar)
fr_ca: Exemples CAD de Quatre Roues Motrices (Cliquez pour agrandir)
ro_ro: Exemple CAD de tracțiune pe patru roți (Click pentru a extinde)
zh_cn: 四轮驱动 CAD 示例（点击展开）

source: `Click here to explore this model in OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/873a6e756fd385a1b743bdc1>`__
es_mx: `Haga clic aquí para explorar este modelo en OnShape CAD en línea <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/873a6e756fd385a1b743bdc1>`__
fr_ca: `Cliquez ici pour explorer ce modèle dans OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/873a6e756fd385a1b743bdc1>`__
ro_ro: `Click aici pentru a explora acest model în OnShape online CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/873a6e756fd385a1b743bdc1>`__
zh_cn: `点击此处在 OnShape 在线 CAD <https://cad.onshape.com/documents/45549489f570f3694569a2df/w/85ff26b9fca4988ebc4df3b4/e/873a6e756fd385a1b743bdc1> 中查看此模型 `__
