Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/drivetrains/tank.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: REV Custom
es_mx: REV Personalizado
fr_ca: REV customisé

source: 6 wheel drives with corner :term:`omni wheels <Omni Wheel>` do not need to have a center drop. It attempts to solve the issue of turning by replacing the corner traction wheels with omni wheels, allowing the drivetrain to achieve better turning, albeit with slightly less traction than a center-drop. This is very easily buildable in kits, and is a great all-around drivetrain. Drop center and corner omnis can be combined for maximum turning reliability, although this comes with side effects like rocking and reduced traction.
es_mx: Las transmisiones de 6 ruedas con :term:`ruedas omni de esquina <Omni Wheel>` no necesitan tener una caída central. Intenta resolver el problema de los giros sustituyendo las ruedas de tracción de las esquinas por ruedas omni, lo que permite al chasis lograr mejores giros, aunque con algo menos de tracción que con una caída central. Esto es muy fácil de construir en kits, y es un gran chasis de todo-en torno. Las ruedas omnidireccionales centrales y las omnidireccionales de esquina pueden combinarse para obtener la máxima fiabilidad de giro, aunque esto conlleva efectos secundarios como balanceo y tracción reducida.
fr_ca: Les véhicules à 6 roues motrices équipés de :term:`roues omnidirectionnelles <Omni Wheel>` n'ont pas besoin d'être équipés d'une suspension centrale. Il tente de résoudre le problème des virages en remplaçant les roues de traction des virages par des roues omni, ce qui permet à la transmission de mieux tourner, même si la traction est légèrement inférieure à celle d'un centre de gravité. Il est très facile à construire en kit, et c'est une excellente transmission polyvalente. Il est possible de combiner des roues centrales et des roues omni pour obtenir une fiabilité maximale en virage, bien que cela entraîne des effets secondaires tels que le balancement et la réduction de la traction.

source: 7209 Tech Hogs, Relic Recovery
fr_ca: 7209 Tech Hogs, récupération de reliques

source: Ethan Doak's 6wd
fr_ca: Le 6 roue motrice d'Ethan Doak
