Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/servo-guide/choosing-servo.po
Languages: es_mx, fr_ca, zh_cn

source: Choosing a Servo
es_mx: Elegir un servo
fr_ca: Choix d'un servo
zh_cn: 挑选舵机

source: Choosing a :term:`servo <Servo>` can seem daunting at first, given the number of options to consider. This guide is intended to provide a starting point to compare different servo options, and also has some hand picked recommendations at the end.
es_mx: Elegir un :term:`servo <Servo>` puede parecer desalentador al principio, dado el número de opciones a considerar. Esta guía pretende proporcionar un punto de partida para comparar diferentes opciones de servo, y también tiene algunas recomendaciones elegidas a mano al final.
fr_ca: Le choix d'un :term:`servo <Servo>` peut sembler décourageant au début, étant donné le nombre d'options à considérer. Ce guide a pour but de fournir un point de départ pour comparer les différentes options de servo, et contient également quelques recommandations à la fin.
zh_cn: 鉴于需要考虑的选项众多，挑选 :term:`舵机 <Servo>` 起初可能会令人望而生畏。本指南旨在为比较不同的舵机选项提供一个起点，并在最后提供一些精选建议。

source: It is very important to keep the reliability of a given vendor in mind when choosing servos. It is not uncommon for manufacturers and resellers on Amazon and other similar sites to exaggerate their servos specs, or pick unrealistic best case scenarios for measuring the specs. We have limited our recommendation only to vendors who historically have been reliable with publishing servo specifications.
fr_ca: Il est très important de garder à l'esprit la fiabilité d'un vendeur donné lors du choix des servos. Il n'est pas rare que les fabricants et les revendeurs sur Amazon et d'autres sites similaires exagèrent les spécifications de leurs servos, ou choisissent des scénarios irréalistes pour mesurer les spécifications. Nous avons limité nos recommandations aux vendeurs qui se sont toujours montrés fiables dans la publication des spécifications des servos.
zh_cn: 在选择舵机时，牢记特定供应商的产品信息可信性非常重要。亚马逊和其他类似网站上的制造商和经销商夸大其舵机规格或选择不切实际的最佳情况来衡量规格的做法并不少见。我们的推荐仅限于在发布舵机规格方面历来可靠的供应商。

source: As a rule of thumb established manufacturers (HiTech, Savox, ServoCity, Gobilda, Andymark, etc) will usually publish accurate numbers, and servos from marketplaces (Amazon, AliExpress, etc) should be viewed with some skepticism.
fr_ca: En règle générale, les fabricants établis (HiTech, Savox, ServoCity, Gobilda, Andymark, etc.) publient généralement des chiffres exacts, et les servos provenant de marchés (Amazon, AliExpress, etc.) doivent être considérés avec un certain scepticisme.
zh_cn: 根据经验，知名制造商（HiTech、Savox、ServoCity、Gobilda、Andymark 等）通常会公布准确的数字，而对于来自市场（亚马逊、AliExpress 等）的舵机则应持怀疑态度。

source: Servo Type: Regular or Continuous
es_mx: Tipo de servo: Regular o Continuo
fr_ca: Type de Servo : Régulier ou Continu
zh_cn: 舵机类型：常规或连续旋转式

source: :term:`Servos <Servo>` that can rotate to a given position based on PWM input signal are called **regular servos**. In addition, there are also **continuous rotation servos**, which are effectively just small motors in a :term:`servo <Servo>` form factor. They have no position control; instead, PWM signal is used to control their rotation speed.
es_mx: Los :term:`servos <Servo>` que pueden girar a una posición determinada basándose en una señal de entrada PWM se denominan **servos regulares**. Además, también hay **servos de rotación continua**, que son en realidad pequeños motores en un :term:`servo <Servo>` factor de forma. No tienen control de posición; en su lugar, la señal PWM se utiliza para controlar su velocidad de rotación.
fr_ca: :term:`Servos <Servo>` Les **servos réguliers** sont ceux qui peuvent tourner jusqu'à une position donnée sur la base d'un signal d'entrée PWM. Il existe également des **servos à rotation continue**, qui ne sont en fait que de petits moteurs dans un :term:`servo <Servo>` facteur de forme. Ils n'ont pas de contrôle de position, mais le signal PWM est utilisé pour contrôler leur vitesse de rotation.
zh_cn: :term:`舵机 <Servo>` 舵机可以根据 PWM 输入信号旋转到给定位置的舵机称为 **常规舵机** 。此外，还有 **连续旋转舵机** ，它们实际上只是 :term:`舵机 <Servo>` 舵机外形尺寸的小型电机。它们没有位置控制，而是使用 PWM 信号来控制转速。

source: Many servos from FTC\ |reg| vendors are Dual Mode, meaning they can switch between continuous and regular modes (often requiring the use of a sold-separately servo programmer). These servos can be used as either continuous or regular servos.
es_mx: Muchos servos de vendedores de FTC |reg| son de Modo Dual, lo que significa que pueden cambiar entre los modos continuo y regular (a menudo requieren el uso de un programador de servos vendido por separado). Estos servos se pueden utilizar como continuos o regulares.
fr_ca: De nombreux servos des fournisseurs de FTC\ |reg| sont bi-mode, ce qui signifie qu'ils peuvent passer du mode continu au mode normal (ce qui nécessite souvent l'utilisation d'un programmateur de servos vendu séparément). Ces servos peuvent être utilisés soit en mode continu, soit en mode normal.
zh_cn: FTC\ |reg|供应商的许多舵机都是双模式的，这意味着它们可以在连续模式和常规模式之间切换（通常需要使用单独出售的舵机编程器）。这些舵机既可用作连续旋转舵机，也可用作常规舵机。

source: Servo Torque And Speed
es_mx: Torque y velocidad del servo
fr_ca: Couple et Vitesse des Servos
zh_cn: 舵机扭矩和速度

source: :term:`Servo` output power is measured in both **speed** and **torque**. Speed (normally in seconds per 60\ |deg|) refers to how fast the :term:`servo <Servo>` turns 60 degrees in Standard Rotation mode.
es_mx: La potencia de salida de :term:`servo` se mide tanto en **velocidad** como en **torque**. La velocidad (normalmente en segundos por 60 |deg|) se refiere a la rapidez con la que el :term:`servo <Servo>` gira 60 grados en el modo de rotación estándar.
fr_ca: La puissance de sortie du :term:`Servo` est mesurée en **vitesse** et **couple**. La vitesse (normalement en secondes par 60 degrés) correspond à la vitesse à laquelle le :term:`servo <Servo>` tourne de 60 degrés en mode de rotation standard.
zh_cn: :term:`舵机 <Servo>` 输出功率以速度和扭矩来衡量。速度（通常以秒/60度为单位）是指在标准旋转模式下，:term:`舵机 <Servo>` 转动 60 度的速度。

source: Why seconds per 60 degrees?
es_mx: ¿Por qué segundos por 60 grados?
fr_ca: Pourquoi des secondes par 60 degrés ?
zh_cn: 为什么是每 60 度几秒钟？

source: Historically, the servos commonly used in FTC were created for RC (Radio Controlled) car setups. These cars often had steering linkages with a maximum side to side travel of 60 degrees so manufacturers would often advertise their servos using seconds for 60 degrees.
es_mx: Históricamente, los servos comúnmente utilizados en FTC fueron creados para RC (Radio Control) configuraciones de coches. Estos coches a menudo tenían vínculos de dirección con un máximo de lado a lado de viaje de 60 grados por lo que los fabricantes a menudo anuncian sus servos utilizando segundos para 60 grados.
fr_ca: Historiquement, les servos couramment utilisés en FTC ont été créés pour les voitures RC (Radio Controlled). Ces voitures étaient souvent équipées de tringleries de direction avec un débattement latéral maximal de 60 degrés, de sorte que les fabricants annonçaient souvent leurs servos en utilisant des secondes pour 60 degrés.
zh_cn: 从历史上看，FTC 中常用的舵机是为 RC（无线电遥控）汽车设置的。这些汽车的转向连杆的最大侧向行程通常为 60 度，因此制造商通常会用 60 度的秒数来宣传他们的舵机。

source: Torque (usually measured in oz-in or in kg-cm) refers to the amount of force the :term:`servo <Servo>` can apply to a lever. For reference, if you put a 1" bar on a servo, then put a force gauge on the end, the torque rating of the servo (in oz-in) will be measured.
es_mx: El torque (normalmente medido en oz-in o en kg-cm) se refiere a la cantidad de fuerza que el :term:`servo<Servo> ` puede aplicar a una palanca. Como referencia, si colocas una barra de 1" en un servo y luego pones un dinamómetro en el extremo, se medirá el torque nominal del servo (en oz-in).
fr_ca: Le couple (généralement mesuré en oz-in ou en kg-cm) correspond à la force que le :term:`servo <Servo>` peut appliquer à un levier. Par exemple, si vous placez une barre de 1" sur un servo, puis un dynamomètre à l'extrémité, le couple nominal du servo (en oz-in) sera mesuré.
zh_cn: 扭矩（通常以 oz-in 或 kg-cm 为单位）是指:term:`舵机 <Servo>` 可以施加到杠杆上的力的大小。作为参考，如果在舵机上安装一根 1 英寸的杆，然后在杆端安装测力计，就能测出舵机的额定扭矩（单位为 oz-in）。

source: As you may know, speed and torque will generally have an inverse relationship. You can find some insanely powerful servos that are pretty slow (slower than 0.20 s/60\ |deg|) or some less powerful ones with faster ratios (anything faster than 0.12 s/60\ |deg| is considered very fast).
fr_ca: Comme vous le savez peut-être, la vitesse et le couple ont généralement une relation inverse. Vous pouvez trouver des servos extrêmement puissants mais plutôt lents (plus lents que 0,20 s/60 |deg|) ou des servos moins puissants avec des rapports plus rapides (tout ce qui est plus rapide que 0,12 s/60 |deg| est considéré comme très rapide).
zh_cn: 您可能知道，速度和扭矩通常呈反比关系。你可以找到一些功能强大的舵机，但速度却很慢（慢于 0.20 秒/60度），或者一些功能较弱的舵机，但转动比却更快（快于 0.12 秒/60 度的都被认为是非常快的）。

source: Finding the right :term:`servo <Servo>` for your application can be tough, but a good way is trying to decide if you need more speed or torque, and if your :term:`servo <Servo>` will experience shock loads or not.
es_mx: Encontrar el :term:`servo <Servo>` adecuado para su aplicación puede ser difícil, pero una buena forma es intentar decidir si necesita más velocidad o torque, y si su :term:`servo <Servo>` experimentará cargas de choque o no.
fr_ca: Il peut être difficile de trouver le :term:`servo <Servo>` adapté à votre application, mais une bonne façon de procéder consiste à déterminer si vous avez besoin de plus de vitesse ou de couple, et si votre :term:`servo <Servo>` subira des chocs ou non.
zh_cn: 为您的应用找到合适的:term:`舵机 <Servo>` 可能很难，但一个好方法是尝试决定您是否需要更高的速度或扭矩，以及您的 :term:`舵机 <Servo>` 是否会承受冲击负荷。

source: Durability and Servo Gear Material
es_mx: Durabilidad y material del engranaje del servo
fr_ca: Durabilité et matériau des servos
zh_cn: 耐用性和舵机齿轮材料

source: The two things that threaten a :term:`servo's <Servo>` longevity are the internal motor burning out and more commonly, the :term:`gears <Gear>` stripping inside the :term:`servo <Servo>`. A motor burning out is pretty uncommon, but it can happen under large loads for a prolonged amount of time.
es_mx: Las dos cosas que amenazan la longevidad de un :term:`servo <Servo>` son el motor interno que se quema y, más comúnmente, los :term:`engranajes <Gear>` que se pelan dentro del :term:`servo <Servo>`. Un motor que se quema es bastante infrecuente, pero puede ocurrir bajo grandes cargas durante un tiempo prolongado.
fr_ca: Les deux choses qui menacent la longévité d'un :term:`servo <Servo>` sont le moteur interne qui grille et, plus fréquemment, les :term:`engrenages <Gear>` qui s'effilochent à l'intérieur du :term:`servo <Servo>`. Un moteur qui grille est assez rare, mais il peut se produire sous de fortes charges pendant une période prolongée.
zh_cn: 威胁 :term:`舵机 <Servo>` 寿命的两件事是内部电机烧毁和更常见的:term:`齿轮 <Gear>` 在:term:`舵机 <Servo>` 内部剥离。电机烧毁的情况并不常见，但在长时间大负载的情况下也会发生。

source: You should **never** stall a servo against an immovable object.
es_mx: **Nunca** se debe calar un servo contra un objeto inamovible.
fr_ca: Vous ne devez **jamais** caler un servo contre un objet inamovible.
zh_cn: 永远不要将舵机安装在不动的模块上。

source: Gear stripping is a very common problem which occurs when the torque needed to actuate a component exceeds that of the :term:`servo's <Servo>` maximum torque. There are two main cases when this can occur.
fr_ca: L'usure des engrenages est un problème très courant qui survient lorsque le couple nécessaire pour actionner un composant dépasse le couple maximal du :term:`servo <Servo>`. Il y a deux cas principaux où cela peut se produire.
zh_cn: 当驱动部件所需的扭矩超过`舵机 <Servo>` 最大扭矩时，就会出现齿轮剥离这一非常常见的问题。这种情况主要有两种。

source: Shock load from external force can strip the :term:`gears <Gear>` easily, regardless of which material the :term:`gears <Gear>` are made from. An example could be the component slamming into the field wall or another robot.
fr_ca: <Gear>Les chocs dus à une force extérieure peuvent facilement dénuder les :term:`engrenages <Gear>`, quel que soit le matériau dont ils sont faits. Par exemple, le composant peut heurter le mur du champ ou un autre robot.
zh_cn: 无论 齿轮 <Gear>` 是由哪种材料制成，外力造成的冲击负荷都会轻易剥离 齿轮 <Gear>`。例如，部件撞上场地墙壁或其他机器人。

source: Shock load from reversing directions on an object that is too heavy can strip the :term:`gears <Gear>`. Torque increases with mass and also distance from the center of rotation. If the component being actuated is far from the :term:`servo <Servo>`, the long lever arm means larger torque. Furthermore, if the component is moving, reversing direction also will require more torque. Thus, the principle is that components should be light and not reverse direction suddenly to prolong :term:`servo <Servo>` life.
es_mx: El choque producido por la inversión del sentido de giro de un objeto demasiado pesado puede dañar los :term:`engranajes <Gear>`. El torque aumenta con la masa y también con la distancia al centro de rotación. Si el componente accionado está lejos del :term:`servo <Servo>`, el brazo de palanca largo significa un torque mayor. Además, si el componente está en movimiento, invertir la dirección también requerirá más torque. Por lo tanto, el principio es que los componentes deben ser ligeros y no invertir la dirección repentinamente para prolongar la vida útil del :term:`servo <Servo>`.
fr_ca: Les chocs provoqués par l'inversion du sens de rotation d'un objet trop lourd peuvent endommager les :term:`engrenages <Gear>`. Le couple augmente avec la masse et la distance par rapport au centre de rotation. Si le composant actionné est éloigné du :term:`servo <Servo>`, le long bras de levier se traduit par un couple plus important. En outre, si le composant est en mouvement, l'inversion du sens de rotation nécessitera également un couple plus important. Le principe est donc que les composants doivent être légers et ne pas s'inverser brusquement pour prolonger la durée de vie du :term:`servo <Servo>`.
zh_cn: 太重的物体在反转时产生的冲击负荷会使 :term:`齿轮 <Gear>` 脱落。扭矩随质量和与旋转中心的距离而增加。如果被驱动的部件远离 :term:`舵机 <Servo>`，则杠杆臂长意味着扭矩大。此外，如果部件在移动，反转方向也需要更大的扭矩。因此，原则是部件要轻，不要突然反向，以延长 :term:`舵机 <Servo>` 的使用寿命。

source: Shock load resistance is impacted directly by the material the :term:`gears <Gear>` are made from. This ranges from plastic to titanium, so let's go down the list, starting from the weakest.
es_mx: La resistencia a las cargas de choque depende directamente del material con el que están fabricados los :term:`engranajes <Gear>`. Esto va desde el plástico hasta el titanio, así que vayamos descendiendo en la lista, empezando por los más débiles.
fr_ca: La résistance aux chocs est directement influencée par le matériau dont sont faites les :term:`engrenages <Gear>`. Cela va du plastique au titane, alors descendons la liste, en commençant par le plus faible.
zh_cn: 抗冲击负荷能力直接受到:term:`齿轮 <Gear>` 所用材料的影响。材料范围从塑料到钛，让我们从最弱的开始往下看。

source: **Plastic**: with low power :term:`servos <Servo>`, these are normally okay. Generally used for applications in model airplanes such as ailerons. FTC applications include light load mechanisms which will not have direct contact with any game elements or the field. An example could be a servo that opens a trapdoor or moves game elements within the robot.
fr_ca: **Plastique** : avec des :term:`servos <Servo>` de faible puissance, ils conviennent normalement. Généralement utilisés pour des applications dans les modèles réduits d'avions, comme les ailerons. Les applications FTC comprennent les mécanismes à charge légère qui n'ont pas de contact direct avec les éléments du jeu ou le terrain. Il peut s'agir par exemple d'un servo qui ouvre une trappe ou qui déplace des éléments du jeu à l'intérieur du robot.
zh_cn: **塑料**：使用低功率:term:`舵机 <Servo>``时，通常没有问题。一般用于模型飞机，如副翼。FTC 应用包括不会直接接触任何游戏元素或场地的轻负载机构。例如，用于打开活板门或移动机器人内游戏元素的舵机。

source: **Karbonite**: Hitec's :term:`gear <Gear>` plastic is a very durable and long lasting plastic and is very good under long use and low load. Be aware that it can strip easily under the shock loads found in FTC. Karbonite is more durable than plastic but still suffers from shock loads.
fr_ca: **Karbonite** : L':term:`engrenage <Gear>` en karbonite de Hitec est un plastique très résistant et durable, qui convient très bien à une utilisation prolongée et à une faible charge. Il faut savoir qu'il peut se décoller facilement sous l'effet des chocs que l'on trouve en FTC. La karbonite est plus durable que le plastique, mais souffre toujours des chocs.
zh_cn: **碳纤维** ：Hitec 的 :term:`齿轮 <Gear>` 塑料非常耐用，使用寿命长，在长期使用和低负荷的情况下性能非常好。需要注意的是，它在 FTC 中的冲击负荷下很容易剥落。碳纤维 比塑料更耐用，但仍会受到冲击负荷的影响。

source: **Brass**: Brass :term:`gears <Gear>` are stronger than plastic but also suffer greatly when faced with shock loads in FTC like intake wrists and deposit buckets. It's found on slightly higher end servos such as the REV Smart Servo.
fr_ca: **Laiton** : L':term:`engrenage en laiton <Gear>` est plus résistant que le plastique, mais souffre beaucoup des chocs en FTC comme les poignets d'admission et les godets de dépose. On les trouve sur des servos un peu plus haut de gamme comme le REV Smart Servo.
zh_cn: **黄铜** ：黄铜 :term:`齿轮 <Gear>` 比塑料更坚固，但在 FTC，如吸取装置和存放装置，中面对冲击负荷时也会受到很大影响。REV智能舵机等稍高端的舵机都采用了这种材料。

source: **Steel**: This is where we start getting big. Steel :term:`gears <Gear>` are very durable and you'll have a tough time stripping these. In general, expect to pay a premium. The goBILDA Dual mode servos (v2) is an example of steel :term:`gear <Gear>` :term:`servo <Servo>`.
fr_ca: **Acier** : C'est ici que les choses commencent à se corser. Les :term:`engrenages <Gear>` en acier sont très résistants et vous aurez du mal à les démonter. En général, il faut s'attendre à payer plus cher. Le goBILDA Dual mode servos (v2) est un exemple se <Gear>` :term:`servo <Servo>` avec un :term:`engrenage en acier.
zh_cn: **钢材** ：这就是我们开始需要研究的地方。钢材 :term:`齿轮 <Gear>`非常耐用，你很难剥离它们。一般来说，需要支付更高的价格。goBILDA 双模式舵机 (v2) 是钢制 :term:`齿轮 <Gear>`:term:`舵机 <Servo>` 的典范。

source: **Titanium**: Titanium is where you get into really high end, virtually unbreakable :term:`servos <Servo>`. Starting from $75, they can reach over $150. A common misconception is that titanium is stronger then steel, however its advantage is in strength to weight ratio (as in, titanium gearboxes will often be lighter then steel gearboxes).
zh_cn: **钛** ：钛是真正的高端产品，几乎牢不可破的:term:`舵机 <Servo>`.。起价从75 美元到150 美元不等。一个常见的误解是，钛比钢更坚固，但其优势在于强度与重量比（例如，钛齿轮箱通常比钢齿轮箱更轻）。

source: Servo Size
es_mx: Tamaño del servo
fr_ca: Taille des servomoteurs
zh_cn: 舵机尺寸

source: :term:`Servos <Servo>` come in different sizes. Fortunately, almost all manufacturers use the same standard set of :term:`servo <Servo>` sizes, ranging from sub-micro to large. The two sizes commonly used in FTC are *standard size* (which includes REV Smart Servo and goBILDA Dual Mode Servos) and *large size* (also known as quarter-scale) :term:`servos <Servo>`. However, large :term:`servos <Servo>` are quite uncommon.
fr_ca: Les :term:`servos <Servo>` existent en différentes tailles. Heureusement, presque tous les fabricants utilisent le même ensemble standard de tailles de :term:`servo <Servo>` , allant de sub-micro à grand. Les deux tailles couramment utilisées en FTC sont la *taille standard* (qui inclut les REV Smart Servo et les goBILDA Dual Mode Servos) et la *grande taille* (également connue sous le nom de quart d'échelle) :term:`servos <Servo>`. Cependant, les grands :term:`servos <Servo>` sont assez rares.
zh_cn: :term:`舵机 <Servo>` 有不同的尺寸。幸运的是，几乎所有制造商都使用同一套标准的 :term:`舵机 <Servo>` 尺寸，从超小型到大型不等。FTC 中常用的两种尺寸是 * 标准尺寸*（包括 REV Smart Servo 和 goBILDA Dual Mode Servo）和 * 大尺寸*（也称为四分之一尺寸）:term:`舵机 <Servo>`。不过，大型:term:`舵机 <Servo>` 并不常见。

source: Note that while in general, the larger the size, the more powerful the :term:`servo <Servo>`, it is not a strict rule. You can buy very powerful standard size :term:`servos <Servo>` - just expect to pay more for them.
fr_ca: Notez qu'en général, plus la taille est grande, plus le :term:`servo <Servo>` est puissant, mais il ne s'agit pas d'une règle stricte. Il est possible d'acheter des :term:`servos <Servo>` de taille standard très puissants, mais il faut s'attendre à les payer plus cher.
zh_cn: 请注意，一般来说，尺寸越大， :term:`舵机 <Servo>`功能越强，但这并不是严格的规则。您可以购买功能非常强大的标准尺寸舵机 :term:`舵机 <Servo>`，只是需要支付更高的价格。

source: Servo Spline
zh_cn: 舵机花键轴

source: The output shaft of the :term:`servo <Servo>` is commonly called the **spline**. Most servos have industry standard 25 tooth spline (also known as F3); in particular, this is the spline used by REV Smart Servo and goBILDA Dual Mode servos. However, Hitec servos using 24 tooth spline are also very popular.
fr_ca: L'arbre de sortie du :term:`servo <Servo>` est communément appelé **cannelure**. La plupart des servos ont une cannelure standard de 25 dents (également connue sous le nom de F3) ; en particulier, c'est la cannelure utilisée par les servos REV Smart Servo et goBILDA Dual Mode. Cependant, les servos Hitec utilisant une cannelure de 24 dents sont également très populaires.
zh_cn: :term:`舵机 <Servo>` 的输出轴通常称为花键轴。大多数舵机采用行业标准的 25 齿花键（也称为 F3）；特别是 REV Smart Servo 和 goBILDA Dual Mode 舵机使用的就是这种花键。不过，使用 24 齿花键的 Hitec 舵机也很受欢迎。

source: Andymark servos are an exception to this, as they use a 5mm hex shaft as their output instead of a 24 or 25 tooth servo spline.
fr_ca: Les servos Andymark sont une exception à cette règle, car ils utilisent un arbre hexagonal de 5 mm comme sortie au lieu d'une cannelure de servo de 24 ou 25 dents.
zh_cn: Andymark舵机是个例外，因为它们使用5毫米六角轴作为输出，而不是24或25齿舵机花键。

source: Please check the spline type before you buy the :term:`servo <Servo>` - otherwise, your :term:`servo <Servo>` attachments will not fit.
es_mx: Por favor, compruebe el tipo de estría antes de comprar el :term:`servo <Servo>` - de lo contrario, sus accesorios :term:`servo <Servo>` no encajarán.
fr_ca: Veuillez vérifier le type de cannelure avant d'acheter le :term:`servo <Servo>` - sinon votre :term:`servo <Servo>` ne conviendra pas.
zh_cn: 请在购买:term:`舵机 <Servo>` 前检查花键类型 - 否则，您的 :term:`舵机 <Servo>` 附件将无法安装。

source: For more info about servo splines, please check https://www.servocity.com/servo-spline-info/.
es_mx: Para más información sobre servo splines, consulte https://www.servocity.com/servo-spline-info/.
fr_ca: Pour plus d'informations sur les cannelures de servo, veuillez consulter https://www.servocity.com/servo-spline-info/.
zh_cn: 有关舵机花键的更多信息，请访问 https://www.servocity.com/servo-spline-info/。

source: Servo Range
es_mx: Rango de servos
fr_ca: Gamme Servo
zh_cn: 舵机范围

source: The angle over which a non-continuous :term:`servo <Servo>` can rotate while retaining position feedback is called the range. When choosing a servo, it is important to make sure you have enough range for the movement you need.
es_mx: El ángulo sobre el que un :term:`servo <Servo>` no continuo puede girar manteniendo la realimentación de posición se denomina rango. Al elegir un servo, es importante asegurarse de que tiene suficiente rango para el movimiento que necesita.
fr_ca: L'angle sur lequel un :term:`servo <Servo>` non continu peut tourner tout en conservant le retour de position s'appelle la plage. Lorsque vous choisissez un servo, il est important de vous assurer que vous disposez d'une plage suffisante pour le mouvement dont vous avez besoin.
zh_cn: 非连续式:term:`舵机 <Servo>` 在保持位置反馈的同时可以旋转的角度称为量程。在选择舵机时，必须确保有足够的量程来满足运动需求。
