Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/servo-guide/choosing-servo.po
Languages: es_mx, fr_ca, zh_cn

source: By default, the FTC Control Hub and FTC Expansion Hub output 600-2400 microsecond signals. However, this range can be expanded to 500-2500 microseconds. When choosing a servo, it is important to make sure that its range will be usable for your application inside of 500-2500 microseconds.
fr_ca: Par défaut, le FTC Control Hub et le FTC Expansion Hub émettent des signaux de 600-2400 microsecondes. Cependant, cette plage peut être étendue à 500-2500 microsecondes. Lors du choix d'un servo, il est important de s'assurer que sa plage sera utilisable pour votre application à l'intérieur de 500-2500 microsecondes.
zh_cn: 默认情况下，FTC 控制集线器和 FTC 扩展集线器输出 600-2400 微秒信号。不过，这一范围可扩展至 500-2500 微秒。在选择舵机时，必须确保其量程在 500-2500 微秒范围内适用于您的应用。

source: The default 600-2400 range of the FTC Expansion Hub and FTC Control Hub can make it appear that popular servos like the goBILDA Dual Mode servos and REV Smart Robot Servo have less range then advertised. You can use the following code to expand the range to 500-2500 microseconds.
zh_cn: FTC Expansion Hub和 FTC Control Hub的默认范围为 600-2400 微秒，这可能会导致 goBILDA 双模式舵机和 REV 智能机器人舵机等常用舵机的范围比宣传的要小。您可以使用以下代码将范围扩大到 500-2500 微秒。

source: Cost
es_mx: Costo
fr_ca: Coût
zh_cn: 费用

source: :term:`Servos <Servo>` range from cheap $7 :term:`servos <Servo>` for light applications, all the way up to some Hitec or Savox :term:`servos <Servo>` for close to $200.
es_mx: Los :term:`servos <Servo>` van desde los :term:`servos <Servo>` baratos de 7$ dólares para aplicaciones ligeras, hasta algunos Hitec o Savox :term:`servos <Servo>` por cerca de $200 dólares.
fr_ca: Les :term:`Servos <Servo>` vont de 7 $ :term:`servos <Servo>` bon marché pour des applications légères, jusqu'à des :term:`servos <Servo>` Hitec ou Savox pour près de 200 $.
zh_cn: :term:`舵机 <Servo>`范围从廉价的 7 美元:term:`舵机 <Servo>`轻型应用，一直到一些近 200 美元的 Hitec 或 Savox:term:`舵机 <Servo>`。

source: By far the best bang for your buck :term:`servos <Servo>` out there are going to be **goBILDA dual mode** and **REV SRS** servos. In addition, the **Andymark High Torque/Speed** servos on paper are the best bang for your buck servo, but at the time of writing have not been released and tested.
fr_ca: De loin, les meilleurs servos pour votre argent :term:`servos <Servo>` sont les **goBILDA dual mode** et **REV SRS**. De plus, les servos **Andymark High Torque/Speed** sont sur le papier le meilleur servo pour votre argent, mais à l'heure où j'écris ces lignes, ils n'ont pas encore été commercialisés et testés.
zh_cn: 到目前为止，性价比最高的:term:`舵机 <Servo>` 是 **goBILDA dual mode** 和 **REV SRS** 舵机。此外，**Andymark 高扭矩/高速**舵机在纸面上是性价比最高的舵机，但在撰写本文时尚未发布和测试。

source: The biggest downside to the REV SRS are their brass :term:`gears <Gear>`. Coupled with high output power, this meant that stripping :term:`gears <Gear>` with any shock load was commonplace.
fr_ca: Le plus gros inconvénient des REV SRS est leur :term:`engrenage <Gear>` en laiton. Associé à une puissance de sortie élevée, cela signifie que le dénudage des :term:`engrenages <Gear>` avec n'importe quel choc est monnaie courante.
zh_cn: REV SRS 最大的缺点是其黄铜:term:`齿轮 <Gear>`。再加上高输出功率，这意味着在任何冲击负荷下剥离:term:`齿轮 <Gear>` 是家常便饭。

source: The next big name in FTC :term:`Servos <Servo>` is Hitec, who is a huge name in hobby :term:`servos <Servo>` for decades and are very well trusted. Their low end :term:`servos <Servo>` are inexpensive but easily broken.
fr_ca: Le prochain grand nom des :term:`servos <Servo>` en FTC est Hitec, qui est un grand nom du hobby :term:`servos <Servo>` depuis des décennies et qui jouit d'une grande confiance. Leurs :term:`servos <Servo>` bas de gamme sont peu coûteux, mais facilement cassables.
zh_cn: FTC :term:`舵机 <Servo>` 的下一个大品牌是 Hitec，该公司在业余 :term:`舵机 <Servo>` 中大名鼎鼎，几十年来一直深受信赖。他们的低端 :term:`舵机 <Servo>` 价格低廉，但容易损坏。

source: A mid-priced Hitec :term:`servo <Servo>` is the HS 485-HB/488-HB servo, with Karbonite :term:`gears <Gear>`. While it shouldn't be used in high load applications, it is fine for general use such as claws or trapdoors. 485HB uses 24 tooth spline; 488 HB uses 25 tooth spline (recommended).
fr_ca: Un :term:`servo <Servo>` Hitec de prix moyen est le HS 485-HB/488-HB, avec des :term:`engrenages <Gear>` en Karbonite. Bien qu'il ne doive pas être utilisé dans des applications à forte charge, il est parfait pour un usage général tel que les pinces ou les trappes. Le 485HB utilise une cannelure de 24 dents ; le 488 HB utilise une cannelure de 25 dents (recommandé).
zh_cn: 价格中等的 Hitec :term:`舵机 <Servo>` 是 HS 485-HB/488-HB舵机，配有碳纤维:term:`齿轮 <Gear>`。虽然它不应该用于高负荷应用，但对于爪子或活门等一般应用来说，它还是可以胜任的。485HB 使用 24 齿花键；488 HB 使用 25 齿花键（推荐）。

source: Where Hitec really shines is the high end market. If your budget is over $100, you can get into some very powerful Hitec :term:`servos <Servo>`. Most have titanium :term:`gears <Gear>` and are programmable, so you can dial in the performance and range to exactly what you need.
fr_ca: Là où Hitec brille vraiment, c'est sur le marché haut de gamme. Si votre budget est supérieur à 100 $, vous pouvez vous procurer des :term:`servos <Servo>` Hitec très puissants. La plupart d'entre eux sont dotés d':term:`engrenages <Gear>` en titane et sont programmables, ce qui vous permet de régler les performances et la portée en fonction de vos besoins.
zh_cn: Hitec 真正的亮点在于高端市场。如果您的预算超过 100 美元，您可以购买一些功能非常强大的 Hitec:term:`舵机 <Servo>`。大多数都有钛 :term:`齿轮 <Gear>`，并且可以编程，因此您可以根据自己的需要调节性能和范围。

source: Axon Robotics, a relatively new company, offers programmable, titanium-geared servos in the $75+ range.
fr_ca: Axon Robotics, une société relativement récente, propose des servos programmables à engrenage en titane à partir de 75 dollars.
zh_cn: Axon Robotics 是一家相对较新的公司，它提供的可编程钛齿轮舵机系统价格在 75 美元以上。

source: The last big player in the :term:`servo <Servo>` market in FTC is Savox, which produces great mid-high range :term:`servos <Servo>` (think $60-$100+). They are made with titanium :term:`gears <Gear>` (close to bulletproof) and are **fast**. Savox :term:`servos <Servo>` are mostly brushless and coreless, so they do tend to scream a little under load, but they're definitely worth it if your budget allows for it.
fr_ca: Le dernier grand acteur du marché :term:`servo <Servo>` en FTC est Savox, qui produit d'excellents :term:`servos <Servo>` moyen-haut de gamme (60-100$+). Ils sont fabriqués avec des :term:`engrenages <Gear>` en titane (presque à l'épreuve des balles) et sont **rapides**. Les :term:`servos <Servo>` Savox sont principalement sans balais et sans noyau, ils ont donc tendance à crier un peu sous la charge, mais ils en valent vraiment la peine si votre budget le permet.
zh_cn: 在 FTC 的 :term:`舵机 <Servo>` 市场上，最后一个大厂是 Savox，它生产的中高端:term:`舵机 <Servo>` （60-100 美元以上）产品非常出色。它们使用钛制造齿轮:term:`齿轮 <Gear>`（接近防弹），速度快。Savox :term:`舵机 <Servo>`无刷和无芯的，所以它们在负载情况下确实会有点尖叫，但如果你的预算允许的话，它们绝对值得购买。

source: Recommended Servos
es_mx: Servos recomendados
fr_ca: Servomoteurs recommandés
zh_cn: 推荐的舵机

source: We no longer recommend low priced servos. Due to their low strength, they end up requiring multiple replacements over time, negating any cost benefits.
fr_ca: Nous ne recommandons plus les servos à bas prix. En raison de leur faible résistance, ils finissent par nécessiter de multiples remplacements au fil du temps, ce qui annule tout avantage financier.
zh_cn: 我们不再推荐低价舵机。由于其强度低，随着时间的推移，最终需要多次更换，从而抵消了任何成本效益。

source: Bang for Your Buck
fr_ca: Un bon rapport qualité-prix
zh_cn: 高性价比舵机

source: `goBILDA Dual Mode Servo (Torque) (25-2-torque) <https://www.gobilda.com/2000-series-dual-mode-servo-25-2-torque/>`_ - A very good price to performance servo. It is dual mode, has a higher then average output torque (and correspondingly lower speed), and steel gearbox.
zh_cn: `goBILDA 双模式舵机（扭矩）(25-2-扭矩) <https://www.gobilda.com/2000-series-dual-mode-servo-25-2-torque/>`_ - 性价比非常高的舵机。它采用双模式，输出扭矩高于平均水平（速度相应较低），并配有钢制齿轮箱。

source: `goBILDA Dual Mode Servo (Speed) (25-3) <https://www.gobilda.com/2000-series-dual-mode-servo-25-3-speed/>`_ - A very good price to performance servo. It is dual mode, has a higher then average output torque (and correspondingly lower speed), and steel gearbox.
zh_cn: `goBILDA 双模式舵机（速度）(25-3) <https://www.gobilda.com/2000-series-dual-mode-servo-25-3-speed/>`_ - 性价比非常高的舵机。它采用双模式，输出扭矩高于平均水平（速度相应较低），采用钢制齿轮箱。

source: `REV Smart Servo <https://www.revrobotics.com/rev-41-1097/>`_ - While very good price to performance, its brass gearbox makes it less recommended then goBILDA Dual Mode Servos
zh_cn: `REV 智能舵机 <https://www.revrobotics.com/rev-41-1097/>`_ - 虽然性价比很高，但其黄铜齿轮箱使其不如 goBILDA 双模舵机值得推荐

source: `Andymark High Speed/Torque Servo <https://www.andymark.com/products/programmable-servos>`_ - A newcomer to the market, this servo is extremely promising as a price to performance servo, with a unique 5mm hex output and imperial half inch mounting pattern. The high speed variant has more power output then the commonly used goBILDA Dual Mode servo. The high torque servo has a higher efficiency then the goBILDA Dual Mode servo. **It is unreleased at the time of writing, so these claims have not been verified.** This servo has been included due to Andymark's historical reliability.
zh_cn: `Andymark 高速/扭矩舵机 <https://www.andymark.com/products/programmable-servos>`_ - 作为市场新秀，这款舵机性价比极高，具有独特的 5 毫米六角输出和英制半英寸安装模式。与常用的 goBILDA 双模式舵机相比，高速舵机的输出功率更大。高扭矩舵机的效率高于 goBILDA 双模式舵机。**在撰写本文时，该产品尚未发布，因此这些说法尚未得到证实。** 由于Andymark一贯的品质，所以在这里包含了这款舵机。

source: Premium Options
fr_ca: Options Premium
zh_cn: 高级选项

source: `Axon Robotics MAX+ <https://axon-robotics.com/products/max>`_ - The best price to performance high performance servo. It has a high efficiency and a high power output. In addition, this servo can track its absolute position via an analog output wire.
fr_ca: Axon Robotics MAX+ <https://axon-robotics.com/products/max>`_ - Le meilleur prix pour un servo de haute performance. Il a un rendement élevé et une grande puissance de sortie. De plus, ce servo peut suivre sa position absolue via un fil de sortie analogique.
zh_cn: `Axon Robotics MAX+ <https://axon-robotics.com/products/max>`_ - 性价比最高的高性能舵机。它具有高效率和高功率输出。此外，该舵机还可通过模拟输出线跟踪其绝对位置。

source: Hitec titanium servos - A reliable choice, Hitec has a large variety of servos making it a good option for super specific servos such as non-standard form factors or specific qualities desired such as high speed or very high torque.
fr_ca: Servos en titane Hitec - Un choix fiable, Hitec dispose d'une grande variété de servos, ce qui en fait une bonne option pour les servos très spécifiques tels que les facteurs de forme non standard ou les qualités spécifiques souhaitées telles qu'une vitesse élevée ou un couple très élevé.
zh_cn: Hitec 钛制舵机 - 作为可靠的选择，Hitec 拥有种类繁多的舵机，是超特殊舵机（如非标准外形尺寸或所需的特殊质量，如高速或超高扭矩）的理想选择。

source: Specialty Servos
fr_ca: Servomoteurs spécialisés
zh_cn: 特种舵机

source: goBILDA manufactures all three of their Dual Mode servos (Speed, Super Speed, Torque) in 5 turn varients, which can rotate 5 turns while still tracking position. These servos have high range, making them ideal for use with external gearboxes, but are more expensive and have a lower precision then the normal varients.
zh_cn: goBILDA 生产的所有三种双模式舵机（速度、超速、扭矩）都有 5 转变体，可以旋转 5 转，同时仍能跟踪位置。这些舵机具有较高的量程，非常适合与外部齿轮箱配合使用，但价格较高，精度也比普通舵机低。

source: REV and goBILDA :term:`servos <Servo>` can be purchased from REV and goBILDA websites respectively. For all other servos, some good sources are `ServoCity <https://www.servocity.com/>`_ or `Amazon <https://www.amazon.com/>`_.
fr_ca: REV et goBILDA :term:`servos <Servo>` peuvent être achetés sur les sites REV et goBILDA respectivement. Pour tous les autres servos, de bonnes sources sont `ServoCity <https://www.servocity.com/>`_ ou `Amazon <https://www.amazon.com/>`_.
zh_cn: REV 和 goBILDA:term:`舵机 <Servo>`可分别从 REV 和 goBILDA 网站购买。对于所有其他舵机，一些好的来源是 `ServoCity <https://www.servocity.com/>`_ 或 `Amazon <https://www.amazon.com/>`_。

source: **Titanium**: Titanium is where you get into really high end, virtually unbreakable :term:`servos <Servo>`. Starting from $75, they can reach over $150. A common misconception is that titanium is stronger than steel, however its advantage is in strength to weight ratio (as in, titanium gearboxes will often be lighter than steel gearboxes).
fr_ca: **Titanium** : Le titane est un matériau haut de gamme, pratiquement incassable :term:`servos <Servo>`. Commençant à 75 dollars, ils peuvent atteindre plus de 150 dollars. On pense souvent à tort que le titane est plus résistant que l'acier, mais son avantage réside dans le rapport résistance/poids (par exemple, les boîtes de vitesses en titane sont souvent plus légères que les boîtes de vitesses en acier).

source: The default 600-2400 range of the FTC Expansion Hub and FTC Control Hub can make it appear that popular servos like the goBILDA Dual Mode servos and REV Smart Robot Servo have less range than advertised. You can use the following code to expand the range to 500-2500 microseconds.
fr_ca: La plage par défaut de 600-2400 du FTC Expansion Hub et du FTC Control Hub peut donner l'impression que des servos populaires comme les servos goBILDA Dual Mode et REV Smart Robot Servo ont moins de portée que ce qui est annoncé. Vous pouvez utiliser le code suivant pour étendre la plage à 500-2500 microsecondes.

source: `goBILDA Dual Mode Servo (Torque) (25-2-torque) <https://www.gobilda.com/2000-series-dual-mode-servo-25-2-torque/>`_ - A very good price to performance servo. It is dual mode, has a higher than average output torque (and correspondingly lower speed), and steel gearbox.
fr_ca: `goBILDA Dual Mode Servo (Torque) (25-2-torque) <https://www.gobilda.com/2000-series-dual-mode-servo-25-2-torque/>`_ - Un servo très bon rapport qualité/prix. Il est bi-mode, a un couple de sortie plus élevé que la moyenne (et donc une vitesse plus faible), et une boîte de vitesse en acier.

source: `goBILDA Dual Mode Servo (Speed) (25-3) <https://www.gobilda.com/2000-series-dual-mode-servo-25-3-speed/>`_ - A very good price to performance servo. It is dual mode, has a higher than average output speed (and correspondingly lower torque), and steel gearbox.
fr_ca: `goBILDA Dual Mode Servo (Speed) (25-3) <https://www.gobilda.com/2000-series-dual-mode-servo-25-3-speed/>`_ - Un très bon rapport qualité/prix. Il est bi-mode, a une vitesse de sortie plus élevée que la moyenne (et un couple correspondant plus faible), et une boîte de vitesse en acier.

source: `REV Smart Servo <https://www.revrobotics.com/rev-41-1097/>`_ - While very good price to performance, its brass gearbox makes it less recommended than goBILDA Dual Mode Servos
fr_ca: `REV Smart Servo <https://www.revrobotics.com/rev-41-1097/>`_ - Bien que son rapport qualité/prix soit très bon, sa boîte de vitesse en laiton le rend moins recommandé que les servos goBILDA Dual Mode.

source: `Andymark High Speed/Torque Servo <https://andymark.com/products/programmable-servos>`_ - A newcomer to the market, this servo is extremely promising as a price to performance servo, with a unique 5mm hex output and imperial half inch mounting pattern. The high speed variant has more power output than the commonly used goBILDA Dual Mode servo. The high torque servo has a higher efficiency than the goBILDA Dual Mode servo. **It is unreleased at the time of writing, so these claims have not been verified.** This servo has been included due to Andymark's historical reliability.
fr_ca: `Andymark High Speed/Torque Servo <https://andymark.com/products/programmable-servos>`_ - Nouveau venu sur le marché, ce servo est extrêmement prometteur en termes de prix et de performances, avec une sortie hexagonale unique de 5 mm et un schéma de montage impérial d'un demi-pouce. La variante haute vitesse a une puissance de sortie supérieure à celle du servo goBILDA Dual Mode couramment utilisé. Le servo à couple élevé a un rendement plus élevé que le servo goBILDA Dual Mode. **Ce servo a été inclus en raison de la fiabilité historique d'Andymark.

source: goBILDA manufactures all three of their Dual Mode servos (Speed, Super Speed, Torque) in 5 turn variants, which can rotate 5 turns while still tracking position. These servos have high range, making them ideal for use with external gearboxes, but are more expensive and have a lower precision than the normal variants.
fr_ca: goBILDA fabrique ses trois servos Dual Mode (Speed, Super Speed, Torque) en version 5 tours, qui peuvent tourner de 5 tours tout en conservant leur position. Ces servos ont une grande portée, ce qui les rend idéaux pour une utilisation avec des boîtes de vitesses externes, mais ils sont plus chers et ont une précision plus faible que les variantes normales.

source: It is very important to keep the reliability of a given vendor in mind when choosing servos. It is very common for manufacturers and resellers on Amazon and other similar sites to significantly exaggerate their servos' specs, or pick unrealistic best-case scenarios for measuring the specs. We have limited our recommendations only to vendors who historically have been reliable with publishing accurate servo specifications.
es_mx: Es muy importante tener en cuenta la fiabilidad de un determinado proveedor a la hora de elegir servos. Es muy común que los fabricantes y revendedores en Amazon y otros sitios similares exageren significativamente las especificaciones de sus servos, o elijan escenarios poco realistas para medir las especificaciones. Hemos limitado nuestras recomendaciones sólo a los proveedores que históricamente han sido fiables con la publicación de especificaciones precisas servo.

source: As a rule of thumb established manufacturers (Hitec, Savox, ServoCity, goBILDA, AndyMark, etc) will usually publish accurate numbers, and servos from marketplaces (Amazon, AliExpress, hobby stores, etc) should be viewed with significant skepticism.
es_mx: Como regla general, los fabricantes establecidos (Hitec, Savox, ServoCity, goBILDA, AndyMark, etc) suelen publicar cifras precisas, y los servos de los mercados (Amazon, AliExpress, tiendas de hobby, etc) deben ser vistos con gran escepticismo.

source: Continuous rotation servos aren't even always in a traditional servo form factor. The `Melonbotics Super Servo Plus <https://www.melonbotics.com/products/super-servo-plus>`_, while considered a continuous rotation servos from a rules and control system perspective, is essentially a small motor + spur gearbox. The 1000rpm rated output speed makes it an excellent alternative to large, heavy standard motors for small, high-speed mechanisms such as :doc:`active intakes </docs/common-mechanisms/active-intake/index>`.
es_mx: Los servos de rotación continua ni siquiera tienen siempre el formato de un servo tradicional. El `Melonbotics Super Servo Plus <https://www.melonbotics.com/products/super-servo-plus>`_, aunque se considera un servo de rotación continua desde el punto de vista de las reglas y el sistema de control, es esencialmente un pequeño motor + caja de engranajes rectos. La velocidad nominal de salida de 1000rpm lo convierte en una excelente alternativa a los grandes y pesados motores estándar para mecanismos pequeños de alta velocidad como :doc:` intakes activos </docs/common-mechanisms/active-intake/index>`_.

source: As you may know, speed and torque will generally have an inverse relationship. You can find some insanely powerful servos that are pretty slow (slower than 0.20 s/60\ |deg|) or some less powerful ones with faster ratios (anything faster than 0.12 s/60\ |deg| is considered fast).
es_mx: Como ya sabrás, la velocidad y el torque generalmente tienen una relación inversa. Puedes encontrar algunos servos increíblemente potentes que son bastante lentos (más lentos que 0,20 s/60\ |deg|) o algunos menos potentes con relaciones más rápidas (cualquier cosa más rápida que 0,12 s/60\ |deg| se considera muy rápida).

source: Gear stripping is a problem which can occur when the torque needed to actuate a component exceeds that of the :term:`servo's <Servo>` maximum torque. There are two main cases when this can occur.
es_mx: El gripado de engranajes es un problema que puede producirse cuando el torque necesario para accionar un componente supera el torque máximo del :term:`servo <Servo>`. Hay dos casos principales en los que esto puede ocurrir.

source: Shock load from external force can strip the :term:`gears <Gear>`. An example could be the component slamming into the field wall or another robot.
es_mx: La carga de choque de una fuerza externa puede dañar los :term:`engranajes <Gear>`. Un ejemplo podría ser el componente golpeándose contra la pared del campo o contra otro robot.

source: **Plastic** (usually Nylon): With low power :term:`servos <Servo>`, these can be okay if you ensure they are not subjected to shock loads. Generally used for applications in model airplanes such as ailerons. FTC applications include light load mechanisms which will not have direct contact with any game elements or the field. An example could be a servo that opens a trapdoor or moves game elements within the robot.
es_mx: **Plástico** (normalmente Nylon): Con baja potencia :term:`servos <Servo>`, estos pueden estar bien si te aseguras de que no están sometidos a cargas de choque. Generalmente se utilizan para aplicaciones en aeromodelismo como los alerones. Las aplicaciones FTC incluyen mecanismos de carga ligera que no tendrán contacto directo con ningún elemento del juego o el campo. Un ejemplo podría ser un servo que abre una trampilla o mueve elementos del juego dentro del robot.

source: **Karbonite**: Hitec's :term:`gear <Gear>` plastic is more durable than Nylon and wears less over time, but it can still strip easily under the shock loads found in FTC.
es_mx: **Karbonita**: El :term:`engranje <Gear>` plástico de Hitec es más duradero que el Nylon y se desgasta menos con el tiempo, pero aún puede rayarse fácilmente bajo las cargas de choque que se encuentran en FTC.

source: **Brass**: Brass :term:`gears <Gear>` are stronger than plastic, but also suffer greatly when faced with shock loads in FTC such as intake wrists and deposit buckets. Brass :term:`gears <Gear>` are found on slightly higher end servos such as the original REV Smart Robot Servo.
es_mx: **Latón**: Los :term:`engranajes <Gear>` de latón son más resistentes que los de plástico, pero también sufren mucho cuando se enfrentan a cargas de choque en FTC como muñecas de intakes y cubos de depósito. Los :term:`engranajes <Gear>` de latón se encuentran en servos de gama ligeramente superior, como el original REV Smart Robot Servo.

source: **Steel**: This is where we start getting big. Steel :term:`gears <Gear>` are very durable and you'll have a tough time stripping these. The goBILDA Proton servos, goBILDA Dual Mode servos, REV V2 Smart Robot Servos, and Axon servos are all examples of steel :term:`gear <Gear>` :term:`servo <Servo>`.
es_mx: **Acero: Aquí es donde empezamos a ponernos grandes. Los :term:`engranajes <Gear>` de acero son muy duraderos y te costará mucho desmontarlos. Los servos goBILDA Proton, los servos goBILDA Dual Mode, los servos REV V2 Smart Robot y los servos Axon son todos ejemplos de :term:`enganajes <Gear>` de :term:`servo <Servo>` de acero.
