Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/servo-guide/choosing-servo.po
Languages: es_mx, fr_ca, zh_cn

source: **Titanium**: Titanium is where you get into really high end :term:`servos <Servo>`. Starting from $75, they can reach over $150. A common misconception is that titanium is stronger than steel, however its advantage is in strength to weight ratio (as in, titanium gearboxes will often be lighter than steel gearboxes).
es_mx: **Titanio**: Titanio es la gama alta de :term:`servos <Servo>`. A partir de 75 dólares, pueden llegar a superar los 150 dólares. Una idea errónea muy extendida es que el titanio es más resistente que el acero, pero su ventaja radica en la relación resistencia/peso (por ejemplo, las cajas de engranajes de titanio suelen ser más ligeras que las de acero).

source: :term:`Servos <Servo>` with weaker materials (e.g. plastic and brass) used for their :term:`gears <Gear>` will often strip quite easily. Servos with steel :term:`gears <Gear>` are significantly harder to strip; some teams have even reported stripping the aluminum hubs attached to their servos while the servos themselves survived with no damage.
es_mx: :term:`Servos <Servo>` con materiales más débiles (por ejemplo, plástico y latón) utilizados para sus :term:`engranajes <Gear>` a menudo se pelan con bastante facilidad. Los servos con :term:`engranajes <Gear>` de acero son significativamente más difíciles de pelar; algunos equipos incluso han informado de que los cubos de aluminio unidos a sus servos se han pelado mientras que los propios servos han sobrevivido sin daños.

source: :term:`Servos <Servo>` come in different sizes. Fortunately, almost all manufacturers use the same standard set of :term:`servo <Servo>` sizes, ranging from sub-micro to large. The size most commonly used in FTC is the *standard size* (which includes REV Smart Robot Servos and goBILDA Dual Mode Servos) :term:`servos <Servo>`. *Micro size* (which includes the Axon Micro) :term:`servos <Servo>` can be useful when a particularly small mechanism is needed, though they usually are significantly less durable than *standard size* :term:`servos <Servo>`. *Large size* (also known as quarter-scale) :term:`servos <Servo>` are quite uncommon in FTC.
es_mx: Los :term:`servos <Servo>` vienen en diferentes tamaños. Afortunadamente, casi todos los fabricantes utilizan el mismo conjunto estándar de tamaño de :term:`servos <Servo>` , que van desde sub-micro a grande. El tamaño más utilizado en FTC es el *tamaño estándar* (que incluye los REV Smart Robot Servos y los goBILDA Dual Mode Servos) de :term:`servos <Servo>`. El *tamaño micro* (que incluye el Axon Micro) de :term:`servos <Servo>` puede ser útil cuando se necesita un mecanismo particularmente pequeño, aunque normalmente son significativamente menos duraderos que el *tamaño estándar* de :term:`servos <Servo>`. *Los :term:`servos <Servo>` de tamaño grande (también conocidos como de cuarto de escala) son bastante poco comunes en FTC.

source: Note that while it is easy to assume the larger the size, the more powerful the :term:`servo <Servo>`, it is often not the case. You can buy very powerful standard size :term:`servos <Servo>` - just expect to pay more for them.
es_mx: Tenga en cuenta que, aunque es fácil suponer que cuanto mayor es el tamaño, más potente es el :term:`servo <Servo>`, a menudo no es así. Se pueden comprar :term:`servos <Servo>` de tamaño estándar muy potentes, pero hay que pagar más por ellos.

source: The output shaft of the :term:`servo <Servo>` is commonly called the **spline**. Most servos have industry standard 25 tooth spline (also known as F3); in particular, this is the spline used by REV Smart Servo and goBILDA Dual Mode servos. Hitec servos using 24 tooth spline were historically also very popular, but are much less common today.
es_mx: El eje de salida del :term:`servo <Servo>` es comúnmente llamado el **spline**. La mayoría de los servos tienen el estándar de la industria de 25 dientes spline (también conocido como F3), en particular, este es el spline utilizado por REV Smart Servo y goBILDA Dual Mode servos. Los servos Hitec que utilizan spline de 24 dientes fueron históricamente también muy populares, pero son mucho menos comunes hoy en día.

source: AndyMark servos are an exception to this, as they use a 5mm hex shaft as their output instead of a 24 or 25 tooth servo spline.
es_mx: Andymark servos son una excepción a esto, ya que utilizan un eje hexagonal de 5 mm como su salida en lugar de un diente 24 o 25 spline servo.

source: By default, the FTC control system outputs 600-2400 microsecond signals. However, this range can be expanded to 500-2500 microseconds. When choosing a servo, it is important to make sure that its range will be usable for your application inside of 500-2500 microseconds.
es_mx: Por defecto, el sistema de control FTC emite señales de 600-2400 microsegundos. Sin embargo, este rango puede ampliarse a 500-2500 microsegundos. Al elegir un servo, es importante asegurarse de que su rango será utilizable para su aplicación dentro de 500-2500 microsegundos.

source: The default 600-2400 range of the FTC control system when selecting the "Servo" configuration limits the range of many servos to less than the advertised range. Make sure you select the "Full Range Servo" configuration instead to get the full 500-2500 range.
es_mx: El rango por defecto de 600-2400 del sistema de control FTC al seleccionar la configuración "Servo" limita el rango de muchos servos a menos del rango anunciado. Asegúrate de seleccionar la configuración "Full Range Servo" en su lugar para obtener el rango completo de 500-2500.

source: By far the best bang for your buck :term:`servos <Servo>` out there are going to be the **goBILDA Dual Mode Servos** and **REV V2 Smart Robot Servos**. In addition, the **goBILDA Proton** servos are an excellent value for low-load mechanisms when you do not need more than 180 degrees of rotation or continuous rotation.
es_mx: Con mucho, la mejor relación calidad-precio de :term:`servos <Servo>` por ahí van a ser los **goBILDA Dual Mode Servos** y **REV V2 Smart Robot Servos**. Además, los servos **goBILDA Proton** son un valor excelente para mecanismos de baja carga cuando no necesitas más de 180 grados de rotación o rotación continua.

source: Axon Robotics offers brushless, highly-programmable, steel-geared servos in the $90 price range. These servos are designed specifically for FTC, and are extremely popular among teams wishing to maximize their robot's capabilities and performance.
es_mx: Axon Robotics ofrece servos sin escobillas, altamente programables y con engranajes de acero por un precio de 90 dólares. Estos servos están diseñados específicamente para FTC, y son muy populares entre los equipos que desean maximizar las capacidades y el rendimiento de su robot.

source: We do not recommend very low-priced servos. Due to their low strength, they end up requiring multiple replacements over time, negating any cost benefits.
es_mx: No recomendamos servos muy baratos. Debido a su baja resistencia, acaban necesitando múltiples sustituciones a lo largo del tiempo, anulando cualquier beneficio económico.

source: `goBILDA Servos <https://www.gobilda.com/standard-size-servos>`_: goBILDA offers a wide variety of servos suited excellently for FTC.
es_mx: `goBILDA Servos <https://www.gobilda.com/standard-size-servos>`_: goBILDA ofrece una amplia variedad de servos excelentemente adecuados para FTC.

source: **goBILDA Dual Mode Servos** are very good price to performance/capability servos. They are dual mode, meaning you can program them to either standard or continuous rotation using a `goBILDA servo programmer <https://www.gobilda.com/servo-programmer-for-2000-series-dual-mode-servo/>`_ or `REV servo programmer <https://www.revrobotics.com/rev-31-1108/>`_. In standard mode, they are rated for up to 300 degrees of range. They come in three gear ratio options: Torque, Speed, and Super Speed. They are rated for a reasonably high total mechanical output power (around 2.7W for the Torque and Speed, and around 3.2W for the Super Speed), and have steel gearboxes.
es_mx: Los servos **goBILDA Dual Mode Servos** son servos de muy buena relación calidad/precio. Son de modo dual, lo que significa que puede programar a cualquiera de rotación estándar o continua utilizando un `goBILDA servo programador <https://www.gobilda.com/servo-programmer-for-2000-series-dual-mode-servo/>`_ o `REV servo programador <https://www.revrobotics.com/rev-31-1108/>`_. En modo estándar, pueden alcanzar hasta 300 grados de alcance. Disponen de tres opciones de relación de transmisión: Torque, Speed y Super Speed. Tienen una potencia mecánica total razonablemente alta (unos 2,7 W para Torque y Speed, y unos 3,2 W para Super Speed) y cajas de engranajes de acero.

source: **goBILDA 5 Turn Servos** are 5 turn variants of their standard Dual Mode servos, which can rotate 5 turns while still tracking position. These servos have high range, making them ideal for use with external gearboxes, but are more expensive and have a lower precision than the normal variants.
es_mx: **goBILDA 5 Turn Servos** son variantes de 5 vueltas de sus servos estándar de modo dual, que pueden girar 5 vueltas sin dejar de seguir la posición. Estos servos tienen un alto rango, lo que los hace ideales para su uso con cajas de engranajes externas, pero son más caros y tienen una precisión menor que las variantes normales.

source: **goBILDA Proton Servos** are goBILDA's budget servos, coming it at approximately half the price of the standard Dual Mode servos. They come in two gear ratio options, Torque and Speed. Unlike the Dual Mode servos, these are not programmable, and therefore can not be used as continuous rotation servos. While their total mechanical power output of approximately 0.7W is a fair bit less than the Dual Mode servos, and they only have a 180 degree rotation range, their low price makes them a decent option for low-load mechanisms, and their steel gearboxes greatly reduce the chances of breaking the servos from accidental shock loads compared to other brands' budget servos.
es_mx: **Los Proton Servos** de goBILDA son los servos económicos de goBILDA, y cuestan aproximadamente la mitad que los servos Dual Mode estándar. Vienen en dos opciones de relación de engranajes, torque y velocidad. A diferencia de los servos Dual Mode, estos no son programables, y por lo tanto no se pueden utilizar como servos de rotación continua. Mientras que su potencia mecánica total de salida de aproximadamente 0,7 W es un poco menos que los servos de modo dual, y sólo tienen un rango de rotación de 180 grados, su bajo precio los convierte en una opción decente para los mecanismos de baja carga, y sus cajas de engranajes de acero reducen en gran medida las posibilidades de romper los servos de las cargas de choque accidental en comparación con los servos de presupuesto de otras marcas.

source: `REV Robotics V2 Smart Robot Servos <https://www.revrobotics.com/Smart-servo-v2>`_: These are similar to the goBILDA Dual Mode servos in price, performance, and capability. They are also dual mode, meaning you can program them to either standard or continuous rotation using a `goBILDA servo programmer <https://www.gobilda.com/servo-programmer-for-2000-series-dual-mode-servo/>`_ or `REV servo programmer <https://www.revrobotics.com/rev-31-1108/>`_. In standard mode, they are rated for up to 270 degrees of range. They come in two gear ratio options, Balanced and UltraSpeed. The UltraSpeed is rated for a relatively high total mechanical output power of approximately 3.5W, and the Balanced is rated for a somewhat lower output of approximately 2.5W. They have steel gearboxes.
es_mx: `REV Robotics V2 Smart Robot Servos <https://www.revrobotics.com/Smart-servo-v2>`_: Son similares a los servos de modo dual de goBILDA en precio, rendimiento y capacidad. También son de modo dual, lo que significa que puedes programarlos para rotación estándar o continua utilizando un `goBILDA servo programmer <https://www.gobilda.com/servo-programmer-for-2000-series-dual-mode-servo/>`_ o `REV servo programmer <https://www.revrobotics.com/rev-31-1108/>`_. En modo estándar, tienen un alcance de hasta 270 grados. Están disponibles con dos relaciones de engranaje: Balanced y UltraSpeed. El UltraSpeed tiene una potencia de salida mecánica total relativamente alta, de aproximadamente 3,5 W, y el Balanced tiene una potencia de salida algo inferior, de aproximadamente 2,5 W. Tienen cajas de engranajes de acero.

source: `Melonbotics Super Servo Plus <https://www.melonbotics.com/products/super-servo-plus>`_: This servo is different from the other servos listed here. While considered a continuous rotation servos from a rules and control system perspective, it is essentially a small motor + spur gearbox. The 1000rpm rated output speed makes it an excellent alternative to large, heavy standard motors for small, high-speed mechanisms such as :doc:`active intakes </docs/common-mechanisms/active-intake/index>`.
es_mx: `Melonbotics Super Servo Plus <https://www.melonbotics.com/products/super-servo-plus>`_: Este servo es diferente de los otros servos enumerados aquí. Aunque se considera un servo de rotación continua desde el punto de vista de las reglas y el sistema de control, es esencialmente un pequeño motor + caja de engranajes rectos. La velocidad nominal de salida de 1000rpm lo convierte en una excelente alternativa a los grandes y pesados motores estándar para mecanismos pequeños de alta velocidad como :doc:` intakes activos </docs/common-mechanisms/active-intake/index>`.

source: `Axon MAX MK2 <https://axon-robotics.com/products/max>`_: This is widely considered to be the best high performance servo for FTC. It has uses heat-treated stainless steel gears for top-notch reliability, and has a very high rated total mechanical power output of 7.5W (only 0.5W below the 8W limit defined in the Competition Manual). The servo features an analog output wire, allowing you to read the absolute position of the servo. The Axon MK2 servos are also highly programmable with the `Programmer MK2 <https://axon-robotics.com/products/programmer>`_, featuring a wide range of adjustable parameters and modes (including standard and continuous rotation modes).
es_mx: `Axon MAX MK2 <https://axon-robotics.com/products/max>`_: Este es ampliamente considerado como el mejor servo de alto rendimiento para FTC. Utiliza engranajes de acero inoxidable tratados térmicamente para una fiabilidad de primera categoría, y tiene una potencia mecánica total nominal muy alta de 7,5W (sólo 0,5W por debajo del límite de 8W definido en el Manual de Competición). El servo dispone de un cable de salida analógico, que permite leer la posición absoluta del servo. Los servos Axon MK2 también son altamente programables con el `Programmer MK2 <https://axon-robotics.com/products/programmer>`_, que ofrece una amplia gama de parámetros y modos ajustables (incluyendo los modos de rotación estándar y continua).

source: Being able to read the absolute position of the servo can have significant benefits when programming your robot. For example, you can tell the servo to go to a position, wait for it to reach that position, then do the next action; as opposed to telling the servo to go to a position, waiting a set amount of time (which may be longer or shorter than the time actually needed), then doing the next action.
es_mx: Ser capaz de leer la posición absoluta del servo puede tener beneficios significativos al programar tu robot. Por ejemplo, puedes decirle al servo que vaya a una posición, esperar a que llegue a esa posición, y luego hacer la siguiente acción; en lugar de decirle al servo que vaya a una posición, esperar un tiempo determinado (que puede ser mayor o menor que el tiempo realmente necesario), y luego hacer la siguiente acción.

source: The `Axon MINI MK2 <https://axon-robotics.com/products/mini>`_ is very similar to the MAX in terms of total output power (though geared at a slightly faster speed/lower torque), and has the same features (including the heat treated stainless steel gears, programmability, and analog output wire). However, this servo is a slightly different form factor to the standard form factor used by the other servos on this list. While the height is shorter than the MAX, it is slightly wider, and the servo horn is in a different postion compared to the standard servo size. Due to this, we don't recommend the MINI for anything other than fully custom-designed mechanisms not relying on standard mounts and horn position.
es_mx: El `Axon MINI MK2 <https://axon-robotics.com/products/mini>`_ es muy similar a la MAX en términos de potencia total de salida (aunque engranado a una velocidad ligeramente más rápida / menor torque), y tiene las mismas características (incluyendo los engranajes de acero inoxidable tratados con calor, programabilidad, y el cable de salida analógica). Sin embargo, este servo es un factor de forma ligeramente diferente al factor de forma estándar utilizado por los otros servos en esta lista. Mientras que la altura es más corta que el MAX, es ligeramente más ancho, y el cuerno del servo está en una posición diferente en comparación con el tamaño del servo estándar. Debido a esto, no recomendamos el MINI para cualquier cosa que no sea totalmente mecanismos de diseño personalizado que no dependen de los soportes estándar y la posición del cuerno.
