Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/servo-guide/index.po
Languages: es_mx, fr_ca, zh_cn

source: Servo Guide
es_mx: Guía de Servo
fr_ca: Guide des Servomoteurs
zh_cn: 舵机指南

source: Term
es_mx: Término
fr_ca: Terme
zh_cn: 术语

source: Servo
fr_ca: Servomoteurs
zh_cn: 舵机

source: a small DC motor attached to servo gears that is very finely controllable and interfaces via a 3 wire PWM connector. Servos are used in FTC\ |reg| for high-precision applications that are low-load - for example, opening a trapdoor for balls to fall through. Typically servos have limited range of rotation (180\ |deg| is common). The output has splines, which are the rigid teeth that are on top of the servo.
fr_ca: Un petit moteur à courant continue attaché à des engrenages de servomoteur qui est très finement contrôlable et qui s'interface via un connecteur PWM à 3 fils. Les servomoteurs sont utilisés dans le cadre de la compétition FTC® pour des applications de haute précision à faible charge, par exemple, pour ouvrir une trappe permettant aux balles de tomber. Les servomoteurs ont généralement une plage de rotation limitée (180° est courant). La sortie est équipée de cannelures, qui sont les dents rigides situées sur le dessus du servomoteur.
zh_cn: 舵机是一种与舵机齿轮相连的小型直流电机，可进行非常精细的控制，并通过 3 线 PWM 连接器进行连接。舵机在 FTC\ |reg| 中用于低负载的高精度应用--例如，打开活板门让小球通过。通常，舵机的旋转范围有限（通常为 180°）。输出有花键，即舵机顶部的刚性齿。

source: Servos are commonly used in RC cars (steering) and RC planes (moving ailerons). In FTC, servos are typically used for claws, grabbers, and arms.
es_mx: Los servos son comúnmente utilizados en autos de control remoto (dirección) y aviones de control remoto (movimiento de alerones). En FTC, los servos se utilizan típicamente para garras, agarres y brazos.
fr_ca: Les servomoteurs sont couramment utilisés dans les voitures RC (pour la direction) et les avions RC (pour déplacer les ailerons). Dans le cadre de la compétition FTC, les servomoteurs sont généralement utilisés pour les griffes, les pinces et les bras.
zh_cn: 舵机通常用于遥控汽车（转向）和遥控飞机（移动副翼）。在 FTC 中，舵机通常用于爪子、抓手和机械臂。

source: HS488 Hitec servo
fr_ca: Servomoteurs Hitec HS488
zh_cn: HS488 Hitec 舵机

source: A common servo, HS488-HB from Hitec
fr_ca: Un servomoteur commun, HS488-HB de Hitec
zh_cn: Hitec 的 HS488-HB 通用舵机

source: Servos are **NOT** replacements for DC motors, and should not be used as such. Servos are made for fine-tuned and accurate movement, not high-load or fast rotation applications.
fr_ca: Les servomoteurs ne sont **PAS** des remplacements pour les moteurs à courant continu, et ne doivent pas être utilisés comme tels. Les servomoteurs sont conçus pour des mouvements précis et réglés finement, pas pour des applications nécessitant une grande charge ou une rotation rapide.
zh_cn: 舵机 **不是** 直流电机的替代品，不应作为直流电机使用。舵机用于微调和精确运动，而非高负荷或快速旋转应用。

source: There are many servos from different manufacturers, which vary widely in price, performance and value. Fortunately, virtually all servos use the standard 3-wire connector, and accept the same kind of controlling signal (PWM signal at 50 hz). Each REV Expansion Hub provides 6 servo ports, so you can plug in a servo from any manufacturer. Also, there is a standard size for servos for FTC use, so mounts can be interchanged between manufacturers.
es_mx: Hay muchos servos de diferentes fabricantes, que varían ampliamente en precio, rendimiento y valor. Afortunadamente, prácticamente todos los servos utilizan el conector estándar de 3 cables y aceptan el mismo tipo de señal de control (señal PWM a 50 Hz). Cada REV Expansion Hub proporciona 6 puertos de servo, por lo que puedes conectar un servo de cualquier fabricante. Además, hay un tamaño estándar para los servos para uso en FTC, por lo que los soportes se pueden intercambiar entre fabricantes.
fr_ca: Il existe de nombreux servomoteurs provenant de différents fabricants, qui varient considérablement en termes de prix, de performance et de rapport qualité-prix. Heureusement, pratiquement tous les servomoteurs utilisent le connecteur standard à 3 fils et acceptent le même type de signal de commande (signal PWM à 50 Hz). Chaque REV Expansion Hub offre 6 ports pour servomoteurs, ce qui permet de connecter un servomoteur de n'importe quel fabricant. De plus, il existe une taille standard pour les servomoteurs utilisés dans la compétition FTC, ce qui permet de changer les supports entre différents fabricants.
zh_cn: 不同制造商生产的舵机种类繁多，价格、性能和价值也大相径庭。幸运的是，几乎所有的舵机都使用标准的三线连接器，并接受同一种控制信号（50 赫兹的 PWM 信号）。每个 REV 扩展集线器提供 6 个舵机端口，因此你可以插入任何制造商生产的舵机。此外，FTC 使用的舵机有一个标准尺寸，因此不同制造商生产的支架可以互换。

source: Commonly used servos used in FTC are the REV Smart Servo and goBILDA Dual mode Servos (`25-2 <https://www.gobilda.com/2000-series-dual-mode-servo-25-2/>`_) and (`25-3 <https://www.gobilda.com/2000-series-dual-mode-servo-25-3-speed/>`_), but you should check out other servos as well. Picking the right servo for your application is a question that's almost impossible to give a blanket answer for. To learn more, please read the :doc:`choosing-servo` section.
fr_ca: Les servomoteurs couramment utilisés dans la compétition FTC sont le REV Smart Servo et les servomoteurs goBILDA Dual Mode (25-2 <https://www.gobilda.com/2000-series-dual-mode-servo-25-2/>) et (25-3 <https://www.gobilda.com/2000-series-dual-mode-servo-25-3-speed/>). Cependant, il est important d'explorer d'autres servomoteurs également. Choisir le bon servomoteur pour votre application est une question complexe à laquelle il est presque impossible de donner une réponse universelle. Pour en savoir plus, veuillez consulter la section :doc:choisir-un-servomoteur.
zh_cn: FTC 中常用的舵机是 REV 智能舵机和 goBILDA 双模式舵机 (`25-2 <https://www.gobilda.com/2000-series-dual-mode-servo-25-2/>`_) 和 (`25-3 <https://www.gobilda.com/2000-series-dual-mode-servo-25-3-speed/>`_)，但你也应该了解一下其他舵机。为你的应用选择合适的舵机是一个几乎不可能给出全面答案的问题。要了解更多信息，请阅读 :doc:`choosing-servo` 部分。

source: The most prevalent problem with servos is durability. Internal servo gears in cheaper servos strip easily when subjected to shock loads. Servos are also poor at handling lateral loads or bending of the shaft. To avoid having to frequently replace servos, choose ones with metal gears and use :term:`Servoblocks` or your kit's equivalent to prolong longevity.
fr_ca: Le problème le plus courant avec les servomoteurs est leur durabilité. Les engrenages internes des servomoteurs bon marché se détruisent facilement lorsqu'ils sont soumis à des charges de choc. Les servomoteurs sont également inefficaces pour gérer les charges latérales ou la flexion de l'arbre. Pour éviter de devoir remplacer fréquemment les servomoteurs, il est recommandé de choisir des modèles avec des engrenages métalliques et d'utiliser des Servoblocks ou l'équivalent de votre kit pour prolonger leur durée de vie.
zh_cn: 舵机最常见的问题是耐用性。廉价舵机的内部舵机齿轮在受到冲击负荷时很容易剥落。舵机在处理横向负载或轴弯曲时的能力也很差。为避免频繁更换舵机，请选择带有金属齿轮的舵机，并使用 :term:`Servoblocks` 或套件中的同类产品来延长舵机的使用寿命。

source: A small DC motor attached to servo gears that is very finely controllable and interfaces via a 3 wire PWM connector. Servos are generally used in FTC\ |reg| for high-precision applications - for example, actuating a claw or lightweight arm. Typically servos have limited range of rotation (180\ |deg| is common). The output has splines, which are the rigid teeth that are on top of the servo.
es_mx: Se trata de un pequeño motor de corriente continua acoplado a servoengranajes que se controla con gran precisión y se conecta mediante un conector PWM de 3 hilos. Los servos se utilizan generalmente en FTC para aplicaciones de alta precisión, por ejemplo, para accionar una garra o un brazo ligero. Normalmente los servos tienen un rango de rotación limitado (180 grados es lo habitual). La salida tiene splines, que son los dientes rígidos que se encuentran en la parte superior del servo.

source: goBILDA Dual Mode Servo
es_mx: Servo goBILDA Dual Mode

source: A common servo, the goBILDA Dual Mode Servo
es_mx: Un servo común, un servo goBILDA Dual Mode

source: Historically, servos were designed for fine-tuned and accurate movement in low-load applications, not high-load or fast rotation applications. However, modern high-performance servos (often designed and marketed specifically towards FTC teams) have pushed the limits of how powerful a servo can be, resulting in many teams using one or more high-power servo(s) to power mechanisms that do not need the power of a full motor, such as horizontal extensions and active intakes.
es_mx: Históricamente, los servos se diseñaban para movimientos precisos y ajustados en aplicaciones de baja carga, no para aplicaciones de alta carga o rotación rápida. Sin embargo, los servos modernos de alto rendimiento (a menudo diseñados y comercializados específicamente para equipos de FTC) han ampliado los límites de potencia de un servo, lo que ha dado lugar a que muchos equipos utilicen uno o varios servos de alta potencia para accionar mecanismos que no necesitan la potencia de un motor completo, como extensiones horizontales e intakes activos.

source: Commonly used servos used in FTC are the `goBILDA Dual Mode Servos <https://www.gobilda.com/standard-size-servos>`_ and REV Smart Robot Servo, but you should check out other servos as well. Picking the right servo for your application is a question that's almost impossible to give a blanket answer for. To learn more, please read the :doc:`choosing-servo` section.
es_mx: Los servos más utilizados en FTC son el `goBILDA Dual Mode Servos <https://www.gobilda.com/standard-size-servos>`_ y el REV Smart Robot Servo, pero también deberías echar un vistazo a otros servos. Elegir el servo adecuado para tu aplicación es una pregunta para la que es casi imposible dar una respuesta general. Para saber más, por favor lee la sección :doc:`elegir-servo`.

source: The most prevalent problem with servos is durability. Internal servo gears in cheaper servos strip easily when subjected to shock loads. Servos are also often poor at handling lateral loads or bending of the shaft. To avoid having to frequently replace servos, choose ones with steel gears and use :term:`ServoBlocks` or your kit's equivalent to prolong longevity.
es_mx: El problema más prevalente con los servos es la durabilidad. Los engranajes internos de los servos más baratos se desgastan fácilmente cuando se someten a cargas de impacto. Los servos también son malos para manejar cargas laterales o flexión del eje. Para evitar tener que reemplazar los servos con frecuencia, elija aquellos con engranajes de acero y use :term:`Servoblocks` o el equivalente en su kit para prolongar la longevidad.
