Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/servo-guide/usage-tips.po
Languages: es_mx, fr_ca, zh_cn

source: Servo Usage Tips
es_mx: Consejos de uso del servo
fr_ca: Conseils d'Utilisation des Servos
zh_cn: 舵机使用技巧

source: Below are some tips on using servos in FTC\ |reg|.
es_mx: A continuación se presentan algunos consejos sobre el uso de servos en FTC |reg|.
fr_ca: Voici quelques conseils sur l'utilisation des servos dans FTC\ |reg|.
zh_cn: 下面是在 FTC\ |reg| 中使用舵机的一些提示。

source: Do not backdrive :term:`servos <Servo>`. Forcibly rotating a powered :term:`servo <Servo>` away from its position risks damaging the internal :term:`gears <Gear>`.
es_mx: No haga girar hacia atrás los :term:`servos <Servo>`. Si gira a la fuerza un :term:`servo motorizado <Servo>` fuera de su posición, corre el riesgo de dañar los :term:`engranajes <Gear>` internos.
fr_ca: Ne pas faire reculer les :term:`servos <Servo>`. La rotation forcée d'un :term:`servo <Servo>` motorisé hors de sa position risque d'endommager les :term:`engrenages <Gear>` internes.
zh_cn: 请勿反向驱动:term:`舵机 <Servo>`。强行将电动:term:`舵机 <Servo>` 从其位置上旋转可能会损坏舵机内部的:term:` 齿轮 <Gear>`。

source: Pay attention to a servo's travel range! The default 600-2400 range of the FTC control system when selecting the "Servo" configuration can make it appear that popular servos like the goBILDA Dual Mode Servos and REV Smart Robot Servos have less range than advertised. Make sure you select the "Full Range Servo" configuration instead to get the full 500-2500 range.
es_mx: ¡Presta atención al rango de recorrido de un servo! El rango por defecto de 600-2400 del sistema de control FTC al seleccionar la configuración "Servo" puede hacer parecer que servos populares como el goBILDA Dual Mode Servos y REV Smart Robot Servos tienen menos rango del anunciado. Asegúrate de seleccionar la configuración "Full Range Servo" en su lugar para obtener el rango completo de 500-2500.

source: :term:`Servo` wires usually are black-red-white or black-red-yellow. Matching the colors is an easy way to check if the servo is plugged in correctly. Most :term:`servo <Servo>` connectors provide no protection from plugging them the wrong way: if you rotate it 180 degrees, it will still fit - but the :term:`servo <Servo>` would not work. (It shouldn't be damaged, though.) Thus, if your :term:`servo <Servo>` is not working, first check if they are plugged in correctly. Then check it again.
es_mx: :term:`Los cables del servo suelen ser negro-rojo-blanco o negro-rojo-amarillo. Comparar los colores es una forma fácil de comprobar si el servo está conectado correctamente. La mayoría de los conectores :term:`servo <Servo>` no protegen de una conexión incorrecta: si los giras 180 grados, seguirán encajando, pero el :term:`servo <Servo>` no funcionará. (Aunque no debería estar dañado). Por lo tanto, si su :term:`servo <Servo>` no funciona, compruebe primero si están enchufados correctamente. A continuación, vuelva a comprobarlo.

source: When using :term:`servo <Servo>` wire extensions, use `retaining clips <https://www.gobilda.com/servo-connector-clip-yellow-6-pack/>`_ to prevent the connection from coming apart when someone pulls on the wire. Alternatively, electrical tape will work in a pinch.
es_mx: Cuando utilice extensiones de cable :term:`servo <Servo>`, utilice `clips de sujeción <https://www.gobilda.com/servo-connector-clip-yellow-6-pack/>`_ para evitar que la conexión se separe cuando alguien tire del cable. También puede utilizar cinta aislante.
fr_ca: Lorsque vous utilisez des rallonges de fil :term:`servo <Servo>`, utilisez des `clips de maintien <https://www.gobilda.com/servo-connector-clip-yellow-6-pack/>`_ pour éviter que la connexion ne se sépare lorsque quelqu'un tire sur le fil. Une autre solution consiste à utiliser du ruban adhésif électrique.
zh_cn: 在使用`舵机 <Servo>` 延长线时，请使用 `固定夹 <https://www.gobilda.com/servo-connector-clip-yellow-6-pack/>`_，以防止在有人拉扯电线时连接脱开。或者，在紧要关头也可以使用电工胶带。

source: Some vendors sell versions of the 3-pin female connector with retaining clips built-in. BackBayRC on Amazon sells pre-made `servo extension wires with locking connectors <https://www.amazon.com/BackBayRC-Extension-Strands-Vehicles-bikes/dp/B0CXR2YBS4/>`_; and Ferra Components sells both `pre-made servo extension wires with locking connectors <https://ferracomponents.com/products/20awg-locking-servo-wire>`_, and `packs of locking connectors you can crimp yourself <https://ferracomponents.com/products/servo-locking-connector>`_.
es_mx: Algunos proveedores venden versiones del conector hembra de 3 pines con clips de retención incorporados. BackBayRC en Amazon vende cables de extensión de servo prefabricados con conectores de bloqueo <https://www.amazon.com/BackBayRC-Extension-Strands-Vehicles-bikes/dp/B0CXR2YBS4/>`_; y Ferra Components vende cables de extensión de servo prefabricados con conectores de bloqueo <https://ferracomponents.com/products/20awg-locking-servo-wire>`_, y paquetes de conectores de bloqueo que puedes engarzar tú mismo <https://ferracomponents.com/products/servo-locking-connector>`_.

source: Do not use bare socket head screws to attach :term:`servos <Servo>` - when tightened, they will damage the plastic. Use button head screws or socket heads with a washer.
es_mx: No utilice tornillos de cabeza hueca desnudos para fijar los :term:`servos <Servo>` - al apretarlos, dañarán el plástico. Utilice tornillos de cabeza de botón o de cabeza hueca con arandela.

source: :term:`Servos <Servo>` break very easily when subjected to lateral loads or bending of the :term:`shaft <Shaft>`. For example, if you mount an arm or a claw directly on the :term:`servo <Servo>` without any additional precautions, it is very likely that you will break the :term:`servo <Servo>` first time you drive into the wall with the arm extended (and this will inevitably happen).
es_mx: Los :term:`servos <Servo>` se rompen muy fácilmente cuando se someten a cargas laterales o a la flexión del :term:`eje <Shaft>`. Por ejemplo, si monta un brazo o una garra directamente en el :term:`servo <Servo>` sin ninguna precaución adicional, es muy probable que rompa el :term:`servo <Servo>` la primera vez que se estrelle contra la pared con el brazo extendido (y esto ocurrirá inevitablemente).
fr_ca: Les :term:`Servos <Servo>` se cassent très facilement lorsqu'ils sont soumis à des charges latérales ou à la flexion de l' :term:`arbre <Shaft>`. Par exemple, si vous montez un bras ou une pince directement sur le :term:`servo <Servo>` sans aucune précaution supplémentaire, il est très probable que vous casserez le :term:`servo <Servo>` la première fois que vous foncerez dans le mur avec le bras déployé (et cela se produira inévitablement).
zh_cn: :term:`舵机 <Servo>` 在承受横向负载或 :term:`轴 <Shaft>` 弯曲时很容易断裂。例如，如果不采取任何额外的预防措施，直接在:term:`舵机 <Servo>` 上安装机械臂或机械爪，很可能在机械臂伸长后第一次撞墙时就会折断:term:`舵机 <Servo>`（这种情况不可避免地会发生）。

source: To avoid that, use additional supports. The easiest way to do it is by using `ServoBlocks from goBILDA <https://www.gobilda.com/servoblocks>`_. :term:`ServoBlocks` act as exoskeletons for the :term:`servo <Servo>`, providing additional support. They pay for themselves, since they help protect your servos from getting damaged. Additionally, REV offers the inside and outside channel :term:`servo <Servo>` bracket, which when paired with the aluminum servo :term:`shaft <Shaft>` adapter and :term:`bearing <Ball Bearing>` assembly, fulfills the same function.
es_mx: Para evitarlo, utiliza soportes adicionales. La forma más fácil de hacerlo es utilizando `ServoBlocks de goBILDA <https://www.gobilda.com/servoblocks>`_. :term:`ServoBlocks` actúan como exoesqueletos para el :term:`servo <Servo>`, proporcionando soporte adicional. Se pagan por sí mismos, ya que ayudan a proteger tus servos de ser dañados. Además, REV ofrece el soporte de canal interior y exterior del :term:`servo <Servo>`, que cuando se combina con el adaptador de :term:`eje <Shaft>` de aluminio para servo y el conjunto de :term:`rodamientos <Ball Bearing>`, cumple la misma función.

source: A servo in a compact ServoBlock
es_mx: Un servo en un ServoBlock compacto

source: Use linkages. Instead of mounting some rotating piece directly on a :term:`servo <Servo>`, mount it so it can rotate around a pivot point and then connect it to the :term:`servo <Servo>` using linkage as shown below:
es_mx: Utilice conexiones. En lugar de montar una pieza giratoria directamente en un :term:`servo <Servo>`, móntela de modo que pueda girar alrededor de un punto de giro y luego conéctela al :term:`servo <Servo>` utilizando enlaces como se muestra a continuación:
fr_ca: Utilisez des liaisons. Au lieu de monter une pièce rotative directement sur un :term:`servo <Servo>`, montez-la de manière à ce qu'elle puisse tourner autour d'un point de pivot, puis reliez-la au :term:`servo <Servo>` à l'aide d'une tringlerie, comme indiqué ci-dessous :
zh_cn: 使用连接件。与其将旋转部件直接安装在:term:`舵机 <Servo>`上，不如将其安装为可绕支点旋转，然后使用连杆将其连接到:term:`舵机 <Servo>`上，如下图所示：

source: linkage
es_mx: enlace
fr_ca: lien
zh_cn: 连杆

source: Linkage example, courtesy of team 4137 Islandbots. A goBILDA flat beam is used as the link.
es_mx: Ejemplo de enlace, cortesía del equipo 4137 Islandbots. Se utiliza una viga plana goBILDA como enlace.
fr_ca: Exemple de liaison, avec l'aimable autorisation de l'équipe 4137 Islandbots. Une poutre plate goBILDA est utilisée comme lien.
zh_cn: 连杆示例，由 4137 Islandbots 队伍提供。使用 goBILDA 平梁作为连接装置。

source: If you need more power, use a `REV Servo Hub <https://www.revrobotics.com/rev-11-1855/>`_ or `goBILDA 6V Servo Power Injector <https://www.gobilda.com/6v-servo-power-injector-6-channel-8-15v-input/>`_. **This is important for servos under high load conditions.**
es_mx: Si necesita más potencia, utilice un `REV Servo Hub <https://www.revrobotics.com/rev-11-1855/>`_ o `goBILDA 6V Servo Power Injector <https://www.gobilda.com/6v-servo-power-injector-6-channel-8-15v-input/>`_. **Esto es importante para servos en condiciones de alta carga.**

source: Term
es_mx: Término
fr_ca: Durée
zh_cn: 术语

source: A Servo Power Module (SPM) is a device made by REV Robotics that boosts the voltage that the Expansion Hub provides to a :term:`servo <Servo>`. The Control/Expansion Hub's output for servos is 5V at 6 amps, and the SPM boosts the voltage to 6V and up to 15amps.
es_mx: Un Servo Power Module (SPM) es un dispositivo fabricado por REV Robotics que aumenta el voltaje que el Expansion Hub proporciona a un :term:`servo <Servo>`. La salida del Expansion/Control Hub para los servos es de 5V a 6 amperios, y el SPM aumenta el voltaje a 6V y hasta 15 amperios.

source: The Servo Power Module has a tendency to fail spectacularly, burning out the SPM, and sometimes the Control/Expansion Hub it is plugged into. Teams shouold use the newer REV Servo Hub or goBILDA Servo Power Injector instead.
es_mx: El Servo Power Module tiene tendencia a fallar espectacularmente, quemando el SPM, y a veces el Control/Expansion Hub al que está conectado. Los equipos deben utilizar el nuevo REV Servo Hub o goBILDA Servo Power Injector en su lugar.

source: A REV Robotics Servo Power Module
es_mx: Un Servo Power Module de REV Robotics
fr_ca: Un Module d'Alimentation Servo REV Robotics
zh_cn: REV 机器人舵机电源模块

source: A Servo Hub is a device made by REV Robotics that is a controller like the Expansion Hub, but only controls servos. The Control/Expansion Hub's output for servos is 5V at 6 amps, but the Servo Hub's output for servos is 6V and up to 15amps.
es_mx: Un Servo Hub es un dispositivo fabricado por REV Robotics que es un controlador como el Expansion Hub, pero sólo controla servos. La salida del Control/Expansion Hub para servos es de 5V a 6 amperios, pero la salida del Servo Hub para servos es de 6V y hasta 15 amperios.

source: The Servo Hub can make wiring significantly easier in certain circumstances. For example, if you have an arm on a long extension that has 4 servos on it, you can run just the power wire and the data wire to a Servo Hub on the end of the arm, rather than running 4 servo extension cables the entire length.
es_mx: El Servo Hub puede hacer el cableado significativamente más fácil en ciertas circunstancias. Por ejemplo, si tienes un brazo en una extensión larga que tiene 4 servos en él, puedes pasar sólo el cable de alimentación y el cable de datos a un Servo Hub en el extremo del brazo, en lugar de pasar 4 cables de extensión de servo a lo largo de toda la longitud.

source: A Servo Power Injector (SPI) is a device made by goBILDA that boosts the voltage that the Expansion Hub provides to a :term:`servo <Servo>`. The Control/Expansion Hub's output for servos is 5V at 6 amps, and the SPI boosts the voltage to 6V and up to 24 amps total output. It works similarly to the original REV Servo Power Module, but with significant improvements to maximum output power and overcurrent handling to prevent failure.
es_mx: Un Servo Power Injector (SPI) es un dispositivo fabricado por goBILDA que aumenta el voltaje que el Expansion Hub proporciona a un :term:`servo <Servo>`. La salida del Control/Expansion Hub para servos es de 5V a 6 amperios, y el SPI aumenta el voltaje a 6V y hasta 24 amperios de salida total. Funciona de forma similar al original REV Servo Power Module, pero con mejoras significativas en la potencia máxima de salida y el manejo de sobrecorriente para evitar fallos.

source: A goBILDA 6V Servo Power Injector
es_mx: Un goBILDA 6V Servo Power Injector

source: Pay attention to a servo's travel range! The FTC API, by default, outputs 600-2400 |micro|\ s. ``ServoImplEx`` can be used to increase the range to a maximum of 500-2500 |micro|\ s.
fr_ca: Faites attention à la plage de déplacement d'un servo ! L'API FTC, par défaut, fournit 600-2400 |micro|\ s. ``ServoImplEx`` peut être utilisé pour augmenter la plage jusqu'à un maximum de 500-2500 |micro|\ s.
zh_cn: 注意舵机的行程范围！默认情况下，FTC API输出600-2400 |micro|\ s。``ServoImplEx`` 可用于将范围增加到最大500-2500 |micro|\ s。

source: :term:`Servo` wires usually are black-red-white. Matching the colors is an easy way to check if the servo is plugged in correctly. :term:`Servo` connectors provide no protection from plugging them the wrong way: if you rotate it 180 degrees, it will still fit - but the :term:`servo <Servo>` would not work. (It wouldn't be damaged, though). Thus, if your :term:`servo <Servo>` is not working, first check if they are plugged in correctly. Then check it again.
fr_ca: :term:`Servo` fils sont généralement noirs et rouges. Les connecteurs :term:`Servo` ne fournissent aucune protection contre le branchement dans le mauvais sens : si vous le tournez de 180 degrés, il tiendra toujours - mais le :term:`servo <Servo>` ne fonctionnera pas. (Il ne sera cependant pas endommagé). Par conséquent, si votre :term:`servo <Servo>` ne fonctionne pas, vérifiez d'abord s'il est correctement branché. Puis vérifiez à nouveau.
zh_cn: :term:`舵机` 接线通常是黑-红-白。匹配颜色是检查舵机是否正确插入的简便方法。`舵机`连接器不提供插错的保护：如果您将其旋转 180 度，它仍然可以插入 - 但:term:`舵机 <Servo>`将无法工作。(但不会损坏）。因此，如果您的:term:`舵机 <Servo>` 不工作，请首先检查它们是否正确接线。然后再检查一次。

source: Do not use socket head screws to attach :term:`servos <Servo>` - when tightened, they will damage the plastic. Use button head screws or socket heads with a washer.
fr_ca: N'utilisez pas de vis à tête creuse pour fixer les :term:`servos <Servo>` - elles endommageront le plastique lorsqu'elles seront serrées. Utilisez des vis à tête cylindrique ou à tête cylindrique avec une rondelle.
zh_cn: 请勿使用内六角螺丝固定 :term:`舵机 <Servo>` - 拧紧后会损坏塑料。请使用带垫圈的圆头螺钉或内六角螺钉。

source: To avoid that, use additional supports. The easiest way to do it is by using :term:`Servoblocks` from Actobotics or goBILDA. These assemblies act as exoskeletons for the :term:`servo <Servo>`, providing additional support. They are expensive, but worth every penny. Additionally, REV offers the inside and outside channel :term:`servo <Servo>` bracket, which when paired with the aluminum servo :term:`shaft <Shaft>` adapter and :term:`bearing <Ball Bearing>` assembly, fulfills the same function.
fr_ca: Pour éviter cela, utilisez des supports supplémentaires. Le moyen le plus simple est d'utiliser les :term:`Servoblocks` d'Actobotics ou de goBILDA. Ces assemblages agissent comme des exosquelettes pour le :term:`servo <Servo>`, en fournissant un support supplémentaire. Ils sont coûteux, mais valent chaque centime. En outre, REV propose le support :term:`servo <Servo>` à canal intérieur et extérieur qui, associé à l'adaptateur :term:`arbre <Shaft>` et au :term:`roulement à billes <Ball Bearing>` de servo en aluminium, remplit la même fonction.
zh_cn: 为了避免这种情况，需要使用额外的支持。最简单的方法是使用 Actobotics 或 goBILDA 的 舵机输出安装座 。这些组件就像 :term:`舵机 <Servo>` 的外骨骼，提供额外的支撑。它们价格昂贵，但物有所值。此外，REV 还提供内外通道 :term:`舵机 <Servo>` 支架，与铝制舵机输出:term:`轴 <Shaft>` 适配器和:term:`支座 <Ball Bearing>` 组件搭配使用，可实现相同的功能。

source: servoblock
zh_cn: 舵机输出座

source: A servo in a ServoBlock
fr_ca: Un servo dans un ServoBlock
zh_cn: 帮助舵机固定在结构件并实现不同方向输出的安装座

source: There are also some alternative designs of servo supports; one of them, which is not as strong as the original :term:`Servoblock <Servoblocks>` but much more compact, is shown below (`CAD <https://myhub.autodesk360.com/ue2801558/g/shares/SH56a43QTfd62c1cd968b8829158db7626b9>`_ is also available):
fr_ca: Il existe également d'autres modèles de supports de servo ; l'un d'entre eux, qui n'est pas aussi solide que le :term:`Servoblock <Servoblocks>` original mais beaucoup plus compact, est illustré ci-dessous (`CAD <https://myhub.autodesk360.com/ue2801558/g/shares/SH56a43QTfd62c1cd968b8829158db7626b9>`_ est également disponible) :
zh_cn: 舵机支架也有一些替代设计；其中一种强度不如最初的:term:`舵机输出座 <Servoblocks>`，但更紧凑，如下图所示（`CAD <https://myhub.autodesk360.com/ue2801558/g/shares/SH56a43QTfd62c1cd968b8829158db7626b9>`_也可用）：

source: compact servoblock
fr_ca: servobloc compact
zh_cn: 紧凑型舵机输出座

source: Alternative :term:`servo <Servo>` support block
fr_ca: Alternative :terme:`servo <Servo>` bloc de soutien
zh_cn: 替代 :term:`舵机 <Servo>` 的支撑块

source: If you need more power, use a `REV Servo Power Module <https://www.revrobotics.com/rev-11-1144/>`_.
fr_ca: Si vous avez besoin de plus de puissance, utilisez un `REV Servo Power Module <https://www.revrobotics.com/rev-11-1144/>`_.
zh_cn: 如果需要更大的功率，请使用 `REV舵机电源模块 <https://www.revrobotics.com/rev-11-1144/>`_。

source: Servo Power Module
fr_ca: Module d'Alimentation Servo
zh_cn: 舵机电源模块

source: A Servo Power Module (SPM) is a device made by REV Robotics that boosts the voltage that the Expansion Hub provides to a :term:`servo <Servo>`. The Expansion Hub's output for servos is 5V at 6 amps, and the SPM boosts the voltage to 6V and up to 15amps.
fr_ca: Un module de puissance servo (SPM) est un dispositif fabriqué par REV Robotics qui augmente la tension que le Hub d'expansion fournit à un :term:`servo <Servo>`. La sortie de l'Expansion Hub pour les servos est de 5V à 6 ampères, et le SPM augmente la tension à 6V et jusqu'à 15 ampères.
zh_cn: 舵机电源模块 (SPM) 是 REV Robotics 生产的一种设备，用于提升Expansion Hub 为:term:`舵机 <Servo>` 提供的电压。Expansion Hub 的舵机输出为 5V 6 安培，而 SPM 可将电压提升至 6V，最大可达 15 安培。

source: **This is important for servos under high load conditions such as the Savox servo.**
fr_ca: **Ceci est important pour les servos soumis à des conditions de charge élevées, comme le servo Savox.**
zh_cn: **这对高负载条件下的舵机系统，如 Savox 舵机系统，非常重要。**
