Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/active-intake/index.po
Languages: es_mx, fr_ca, zh_cn

source: Active Intake
es_mx: Intake activo
fr_ca: Système de ramasseur actif
zh_cn: 主动吸入拾取装置

source: There's one main rule when it comes to intakes in FTC: you need one. Before diving in, what *is* an intake in the first place?
es_mx: Hay una regla principal cuando se trata de intakes en FTC: necesitas uno. Antes de sumergirte en, ¿qué *es* un intake en primer lugar?
fr_ca: Il y a une règle principale en ce qui concerne les systèmes de ramasseurs en FTC : il vous en faut un. Avant de plonger dans les détails, qu'*est-ce qu*'un système d'aspiration, au juste ?
zh_cn: 说到FTC的主动吸入拾取装置，有一个主要规则：你肯定需要这么一个结构。在深入研究之前，首先什么是主动吸入拾取装置？

source: Intake
fr_ca: Ramasseur
zh_cn: 吸入拾取装置

source: A mechanism designed to pick up game elements using some component of rotational motion powered by a motor.
es_mx: Un mecanismo diseñado para recoger elementos de juego utilizando algún componente de movimiento rotacional impulsado por un motor.
fr_ca: Un mécanisme conçu pour ramasser les éléments de jeu en utilisant un composant de mouvement rotationnel alimenté par un moteur.
zh_cn: 利用马达驱动的旋转运动的某些部分来拾取游戏元素的结构。

source: An intake is differentiated from a claw as an intake does not grasp individual game elements using a pinching motion, but rather sucks the element in through a variety of means such as wheels, tubes, etc.
es_mx: Un intake se diferencia de una garra en que un intake no agarra elementos individuales del juego utilizando un movimiento de pellizco, sino que succiona el elemento a través de una variedad de medios como ruedas, tubos, etc.
fr_ca: Un système de ramassage se distingue d'une pince, car il ne saisit pas les éléments de jeu individuels en utilisant un mouvement de pincement, mais les aspire plutôt à l'aide de divers moyens tels que des roues, des tubes, etc.
zh_cn: 吸入拾取装置与夹子不同，因为吸入拾取装置不会使用捏合动作抓住单个游戏元素，而是通过轮子、管子等各种方式将元素吸入。

source: There are multiple parts of an effective intake: intake geometry, intake type and material, and speed. However, a common rule of them is the faster the intake, often the more effective it is. For example, near the end of Rover Ruckus, many of the top performing teams used a 3.7:1 (1600 RPM) motor or a 5.2:1 (1000 RPM) motor on their intake.
es_mx: Hay múltiples partes de un intake efectivo: geometría del intake, tipo y material del intake, y velocidad. Sin embargo, una regla común de estos es que cuanto más rápido sea el intake, generalmente más efectivo será. Por ejemplo, cerca del final de Rover Ruckus, muchos de los equipos con mejor rendimiento utilizaron un motor de 3.7:1 (1600 RPM) o un motor de 5.2:1 (1000 RPM) en su intake.
fr_ca: Il y a plusieurs éléments d'un système de ramassage efficace : la géométrie de ramassage, le type et le matériau de ramassage, et la vitesse. Cependant, une règle commune est que plus l'aspiration est rapide, plus elle est souvent efficace. Par exemple, vers la fin de Rover Ruckus, de nombreuses équipes performantes utilisaient un moteur 3,7:1 (1600 RPM) ou un moteur 5,2:1 (1000 RPM) pour leur système de ramassage.
zh_cn: 有用的吸入装置有多个部分：吸入口的几何形状、吸入物体类型和材料以及速度。然而，它们的一个共同规则是吸入速度越大，通常来说，越有效。例如，在Rover Ruckus比赛接近尾声时，许多具有顶级表现的团队在进气时使用了3.7:1（1600RPM）电机或5.2:1（1000RPM）的电机。

source: While not a necessity, it is highly recommended that teams dedicate at least one motor to their intake if possible.
es_mx: Si bien no es una necesidad, se recomienda encarecidamente que los equipos dediquen al menos un motor a su intake si es posible.
fr_ca: Bien que ce ne soit pas une nécessité, il est fortement recommandé que les équipes dédient au moins un moteur à leur système de ramassage, si possible.
zh_cn: 虽然并非完全必要，但强烈建议团队有可能的话至少使用一个电机来做吸入拾取装置。

source: When it comes to intakes: "**Touch it, own it**" is a really valuable concept.
es_mx: Cuando se trata de intakes: "**Tócalo, hazlo tuyo**" es un concepto realmente valioso.
fr_ca: Lorsqu'il s'agit des systèmes de ramassage :"**Touchez-le, possédez-le**" est un concept vraiment précieux.
zh_cn: 谈到吸入装置： "**接触到目标，并把目标放进机器**”" 是一个非常有价值的概念。

source: When your intake comes in contact with game elements, you want it to instantly control them. You should design with a margin for error, both in the orientation of the game piece and in the alignment of the robot. For example, look at FRC\ |reg| Team 694's ball intake on their 2019 robot:
es_mx: Cuando tu intake entra en contacto con elementos del juego, quieres que los controle instantáneamente. Debes diseñar con un margen de error, tanto en la orientación de la pieza del juego como en la alineación del robot. Por ejemplo, mira el intake de pelotas del equipo 694 de FRC en su robot de 2019.
fr_ca: Lorsque votre système de ramassage entre en contact avec les éléments de jeu, vous voulez qu'il les contrôle instantanément. Vous devriez concevoir avec une marge d'erreur, tant pour l'orientation de l'élément de jeu que pour l'alignement du robot. Par exemple, regardez l'aspiration de balle de l'équipe FRC\ |reg| 694 sur leur robot de 2019 :
zh_cn: 当你的吸入拾取装置接触到游戏元素时，你希望它能立即控制它们。你应该在设计时留有误差余地，无论是游戏部件的方向还是机器人的对齐方式。例如，看看FRC\ |reg| 694队2019年机器人吸入了多少球：

source: FRC Team 694's Deep Space ball intake with 2 horizontal rollers with compliant wheels
es_mx: FRC Team 694's intake de bola Deep Space con 2 rodillos horizontales con ruedas flexibles
fr_ca: L'aspiration de balles de l'équipe FRC 694, StuyPulse, pour le jeu Deep Space avec 2 rouleaux horizontaux avec des roues conformes.
zh_cn: FRC 694 队的 "深空"——Deep Space——球形吸入拾取装置，配有 2 个水平滚轮和顺应性滚轮

source: FRC 694 StuyPulse, Deep Space
fr_ca: FRC 694 StuyPulse, destination: DEEP SPACE

source: When this robot drives up to a ball, it barely has to point itself at the ball before the ball is instantly locked in between the two rows of wheels. What makes it so effective is the immense amount of testing that went into its design. The team tried a number of intake shapes, initially building with wood and rubber bands, and recorded which shapes were most effective. By testing their intake design out before competition, they didn't have to guess whether it would work as intended: they put it on the field with confidence.
es_mx: Cuando este robot se acerca a una pelota, apenas tiene que apuntarse hacia la pelota antes de que la pelota se bloquee instantáneamente entre las dos filas de ruedas. Lo que lo hace tan efectivo es la inmensa cantidad de pruebas que se realizaron en su diseño. El equipo probó varias formas de intake, inicialmente construyendo con madera y bandas de goma, y registró qué formas eran más efectivas. Al probar su diseño de intake antes de la competencia, no tuvieron que adivinar si funcionaría como se pretendía: lo pusieron en el campo con confianza.
fr_ca: Lorsque ce robot s'approche d'une balle, il lui suffit à peine de s'orienter vers la balle avant que celle-ci ne soit instantanément bloquée entre les deux rangées de roues. Ce qui rend cela si efficace, c'est la quantité impressionnante de tests réalisés lors de sa conception. L'équipe a essayé plusieurs formes d'aspiration, en commençant par construire avec du bois et des élastiques, et a enregistré quelles formes étaient les plus efficaces. En testant leur conception d'aspiration avant la compétition, ils n'ont pas eu à deviner si cela fonctionnerait comme prévu : ils l'ont placé sur le terrain avec confiance.
zh_cn: 当这个机器人驶向一个球时，它几乎不需要把自己对准球，球就会立即被锁在两排轮子之间。它如此有效的原因是它的设计中进行了大量的测试。该团队尝试了许多吸入装置的形状，最初是用木头和橡皮筋建造的，并记录了哪些形状最有效。通过在比赛前测试他们的吸入装置的设计，他们不必猜测它是否会按预期工作：他们自信地把它放在比赛场地上。
