Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/active-intake/principles-of-an-intake.po
Languages: es_mx, fr_ca, zh_cn

source: Principles of an Intake
es_mx: Principios de un Intake
fr_ca: Principes d'un ramasseur
zh_cn: 拾取装置原理

source: Reliability
es_mx: Confiabilidad
fr_ca: Fiabilité
zh_cn: 可靠性

source: An intake must be reliable, as picking up and scoring game elements is the primary method to gain points in all FTC\ |reg| games.
es_mx: Un intake debe ser confiable, ya que recoger y anotar elementos del juego es el método principal para obtener puntos en todos los juegos de FTC\ |reg|.
fr_ca: Un ramasseur doit être fiable, car ramasser et marquer des éléments de jeu est la principale méthode pour gagner des points dans tous les jeux de FTC\ |reg|.
zh_cn: 拾取装置必须可靠，因为在所有 FTC\ |reg| 游戏中，拾取得分道具和得分是获得分数的主要方法。

source: Intakes have many moving parts and are susceptible to breaking, especially at high RPM. Thus, the intake material must be durable to withstand long periods of operation.
es_mx: Los intakes tienen muchas partes móviles y son susceptibles a romperse, especialmente a altas RPM. Por lo tanto, el material del intake debe ser duradero para resistir largos períodos de funcionamiento.
fr_ca: Les ramassuers comportent de nombreuses pièces mobiles et sont susceptibles de se briser, en particulier à haut régime. Le matériau de l'admission doit donc être durable pour résister à de longues périodes de fonctionnement.
zh_cn: 拾取装置有许多活动部件，很容易损坏，尤其是在高转速时。因此，拾取装置材料必须经久耐用，能够承受长时间运行。

source: Intakes often stick outside of the robot frame perimeter. In this case, durability becomes extremely important; the intake must be built so that they can withstand impacts/collisions with other robots or parts of the field.
es_mx: Los intakes a menudo sobresalen del perímetro del marco del robot. En este caso, la durabilidad se vuelve extremadamente importante; el intake debe ser construido de manera que pueda resistir impactos/colisiones con otros robots o partes del campo.
fr_ca: Les ramasseurs se trouvent souvent à l'extérieur du périmètre du châssis du robot. Dans ce cas, la durabilité devient extrêmement importante ; les ramasseurs doivent être construits de manière à résister aux impacts/collisions avec d'autres robots ou des parties du terrain.
zh_cn: 拾取装置通常位于机器人框架外围。在这种情况下，耐用性就变得极为重要；拾取装置的构造必须能够承受与其他机器人或场地部分的撞击/碰撞。

source: There are two ways to accomplish this - either by building the intake very robustly (lots of support so it doesn't break), or making the intake flexible (for example out of lexan or spring loading it) so that even though it may bend due to impacts, it will always spring back into place.
es_mx: Hay dos formas de lograr esto: o construyendo el intake de manera muy robusta (con mucho soporte para que no se rompa), o haciendo el intake flexible (por ejemplo, de lexan o equipado con resorte) para que, aunque se doble debido a impactos, siempre vuelva a su lugar y forma.
fr_ca: Il y a deux façons d'y parvenir : soit en construisant le ramasseur de manière très robuste (beaucoup de support pour qu'elle ne se casse pas), soit en rendant l'admission flexible (par exemple en lexan ou en la chargeant de ressorts) de sorte que même si elle se plie à cause des chocs, elle se remettra toujours en place.
zh_cn: 要做到这一点，有两种方法——一种把拾取装置做得非常坚固（有很多支撑，这样就不会断裂)，另一种把拾取装置做得有弹性（例如用lexan或弹簧加载），这样即使拾取装置可能会因撞击而弯曲，它也总能弹回原位。

source: Another way to prevent intake breaking is to make a fully retractable intake that won't protrude outside the 18" cube, though this is seldom needed.
es_mx: Otra forma de evitar que el intake se rompa es hacer un intake completamente retráctil que no sobresalga fuera del cubo de 18", aunque rara vez se necesita.
fr_ca: Un autre moyen d'éviter la rupture du ramasseur est de fabriquer une admission entièrement rétractable qui ne dépasse pas le cube de 18 pouces, bien que cela soit rarement nécessaire.
zh_cn: 防止拾取装置破损的另一种方法是制作一个完全可伸缩的拾取装置，使其不会伸出 18 英寸立方体之外，不过这种方法很少用到。

source: Consistency
es_mx: Consistencia
fr_ca: Cohérence
zh_cn: 一致性

source: The intake **must** be able to pick up game elements consistently and quickly. For example, in Rover Ruckus each robot could only possess 2 minerals at a time. Therefore, the intake should only pick up two pieces at a time, not zero, one, or three.
es_mx: El intake **debe** ser capaz de recoger elementos del juego de manera constante y rápida. Por ejemplo, en Rover Ruckus cada robot solo podía poseer 2 minerales a la vez. Por lo tanto, el intake solo debe recoger dos piezas a la vez, no cero, uno o tres.
fr_ca: Le ramasseur **doit** être capable d'assimiler des éléments de jeu de manière cohérente et rapide. Par exemple, dans Rover Ruckus, chaque robot ne peut posséder que 2 minéraux à la fois. Par conséquent, le ramasseur ne doit ramasser que deux pièces à la fois, et non pas zéro, un ou trois.
zh_cn: 拾取装置“必须”能够持续、快速地拾取得分道具。例如，在 Rover Ruckus 中，每个机器人一次只能拥有 2 块道具。因此，拾取装置一次只能拾取两块，而不是零块、一块或三块。

source: This is a common mistake that many inexperienced teams fail to take into account.
es_mx: Este es un error común que muchos equipos inexpertos no toman en cuenta.
fr_ca: Il s'agit d'une erreur courante que de nombreuses équipes inexpérimentées ne prennent pas en compte.
zh_cn: 这是一个常见的错误，许多缺乏经验的团队都没有考虑到这一点。

source: Another component is the varying angles that the game objects can be located in. This was especially apparent in the Relic Recovery season, where the "glyphs" (foam cubes) could be oriented in many directions.
es_mx: Otro componente son los ángulos variables en los que los objetos del juego pueden estar ubicados. Esto fue especialmente evidente en la temporada de Relic Recovery, donde los "glifos" (cubos de espuma) podían estar orientados en muchas direcciones.
fr_ca: Un autre élément est la diversité des angles dans lesquels les objets du jeu peuvent être placés. C'était particulièrement évident dans la saison Relic Recovery, où les "glyphes" (cubes de mousse) pouvaient être orientés dans de nombreuses directions.
zh_cn: 另一个要素是游戏对象可以从不同角度定位。这一点在“文物寻回”赛季中尤为明显，“符文”（泡沫方块）可以朝向多个方向。

source: Even though it was relatively easy to make a compliant wheel intake that could effectively intake glyphs in one direction, it was hard to make an intake that could deal with angled glyphs. Being able to intake glyphs in all orientations was especially important for multi-glyph autonomous modes.
es_mx: Aunque fue relativamente fácil hacer un intake de rueda compatible que pudiera tomar eficazmente glifos en una dirección, fue difícil hacer un intake que pudiera manejar glifos angulados. Ser capaz de tomar glifos en todas las orientaciones fue especialmente importante para los modos autónomos de varios glifos.
fr_ca: Bien qu'il ait été relativement facile de fabriquer un ramasseur à roue conforme capable d'aspirer efficacement les glyphes dans une direction, il a été difficile de fabriquer une prise d'air capable d'aspirer les glyphes en angle. La possibilité d'aspirer des glyphes dans toutes les orientations était particulièrement importante pour les modes autonomes à plusieurs glyphes.
zh_cn: 尽管制作一个能有效摄取单向字形的顺滑轮拾取装置相对容易，但要制作一个能处理倾斜符文的拾取装置却很难。对于多符文自主模式来说，能够拾取所有方向的符文尤为重要。

source: Controllability
es_mx: Controlabilidad
fr_ca: Contrôlabilité
zh_cn: 可控性

source: The intake must be able to consistently control the game elements. For example, if the intake is too fast and the collection box is not well designed, then game pieces might fly out. If the intake is too slow, it may jam itself when contacting the game elements.
es_mx: El intake debe ser capaz de controlar de manera constante los elementos del juego. Por ejemplo, si el intake es demasiado rápido y la caja de recolección no está bien diseñada, entonces las piezas del juego podrían salir volando. Si el intake es demasiado lento, puede atascarse al entrar en contacto con los elementos del juego.
fr_ca: Le ramasseur doit permettre de contrôler de manière cohérente les éléments du jeu. Par exemple, si l'admission est trop rapide et que la boîte de collecte n'est pas bien conçue, les pièces de jeu risquent de s'envoler. Si le ramasseur est trop lente, elle risque de se bloquer lorsqu'elle entre en contact avec les éléments du jeu.
zh_cn: 拾取装置必须能够始终如一地控制得分道具。例如，如果拾取装置的速度太快，而收集箱又设计得不好，那么游戏碎片就可能飞出来。如果拾取装置速度太慢，在接触得分道具时可能会卡住。

source: It is possible for pieces to get jammed at an unreachable angle, especially when using wheeled intakes. If this occurs, ensure that the driver can jar the stuck element loose to avoid having a disabled robot.
es_mx: Es posible que las piezas se atoren en un ángulo inalcanzable, especialmente al usar intakes con ruedas. Si esto ocurre, asegúrese de que el conductor pueda liberar el elemento atascado para evitar que el robot quede deshabilitado.
fr_ca: Il est possible que des pièces se coincent à un angle inaccessible, en particulier lors de l'utilisation du ramasseur à roues. Si cela se produit, assurez-vous que le conducteur peut dégager l'élément coincé pour éviter d'avoir un robot handicapé.
zh_cn: 元件有可能卡在无法触及的角度，特别是在使用轮式拾取装置时。如果出现这种情况，应确保操作手能将卡住的元件撬开，以免机器人瘫痪。

source: Optimally, the game elements should follow a certain path each time if funneling is done correctly.
es_mx: Óptimamente, los elementos del juego deberían seguir un cierto camino cada vez si la canalización se realiza correctamente.
fr_ca: Dans le meilleur des cas, les éléments du jeu devraient suivre un certain chemin à chaque fois si l'entonnoir est correctement mis en place.
zh_cn: 最理想的情况是，如果漏斗处理得当，得分道具每次都应遵循一定的路径。

source: It is best practice that the driver can see the game elements which are being controlled. This can be done through using clear plating such as Lexan.
es_mx: Es una buena práctica que el conductor pueda ver los elementos del juego que se están controlando. Esto se puede lograr utilizando placas transparentes como Lexan.
fr_ca: La meilleure pratique consiste à faire en sorte que le conducteur puisse voir les éléments du jeu qui sont contrôlés. Pour ce faire, on peut utiliser un revêtement transparent tel que le Lexan.
zh_cn: 最好的做法是让操作手能够看到所控制的得分道具。这可以通过使用 Lexan 等透明镀层来实现。

source: Efficiency
es_mx: Eficiencia
fr_ca: Efficacité
zh_cn: 效率

source: The key to any successful robot is cycle time. Reducing cycle time by having an efficient intake will lead to major improvements in score. A good intake should take no more than a few seconds to successfully collect the needed elements.
es_mx: La clave de cualquier robot exitoso es el tiempo de ciclo. Reducir el tiempo de ciclo al tener un intake eficiente conducirá a mejoras importantes en la puntuación. Un buen intake no debería tomar más de unos segundos para recolectar con éxito los elementos necesarios.
fr_ca: La clé de la réussite d'un robot est le temps de cycle. La réduction de la durée du cycle grâce à un ramasseur efficace permettra d'améliorer considérablement le score. Un bon ramasseur ne devrait pas prendre plus de quelques secondes pour collecter les éléments nécessaires.
zh_cn: 周期时间是机器人成功的关键。通过高效的取件来缩短周期时间，将大大提高得分。一个好的拾取装置应能在几秒钟内成功收集所需的得分道具。

source: For example, in Relic Recovery, the best intakes often had a <3 second collection time for two game elements, and in Rover Ruckus a 1 second collection time was desired at the highest level.
es_mx: Por ejemplo, en Relic Recovery, los mejores intakes a menudo tenían un tiempo de recolección de <3 segundos para dos elementos del juego, y en Rover Ruckus se deseaba un tiempo de recolección de 1 segundo en el nivel más alto.
fr_ca: Par exemple, dans Relic Recovery, les meilleurs ramasseurs avaient souvent un temps de collecte de <3 secondes pour deux éléments de jeu, et dans Rover Ruckus, un temps de collecte de 1 seconde était souhaité au niveau le plus élevé.
zh_cn: 例如，在Relic Recover中，最好的拾取装置往往需要小于3秒的时间才能收集到两个得分道具，而在Rover Ruckus中，最高级别的拾取装置需要 1 秒的收集时间。

source: A key rule to remember in FTC is the shortest distance rule: how can you get scoring elements from A to B in the shortest distance?
es_mx: Una regla clave para recordar en FTC es la regla de la distancia más corta: ¿cómo puedes llevar los elementos de puntuación de A a B en la distancia más corta?
fr_ca: La règle de la distance la plus courte est une règle clé dont il faut se souvenir en matière de FTC : comment obtenir des éléments de notation de A à B en parcourant la distance la plus courte ?
zh_cn: 在 FTC 中，需要记住的一个关键规则是最短距离规则：如何在最短的距离内将得分道具从 A 运送到 B？

source: The answer is usually one or two straight lines. The closer the scoring elements follow this path, the faster they will go from collection to deposit. Don't make overly long routes unless needed.
es_mx: La respuesta suele ser una o dos líneas rectas. Cuanto más cerca sigan los elementos de puntuación este camino, más rápido irán de la recolección al depósito. No hagas rutas excesivamente largas a menos que sea necesario.
fr_ca: La réponse est généralement une ou deux lignes droites. Plus les éléments de notation sont proches de cette trajectoire, plus ils passeront rapidement de la collecte au dépôt. Ne créez pas d'itinéraires trop longs si cela n'est pas nécessaire.
zh_cn: 答案通常是一条或两条直线。得分道具越靠近这条路径，它们从收集到存入的速度就越快。除非需要，否则不要设置过长的路线。
