Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/active-intake/types-of-intakes.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Surgical tubing is generally latex or rubber tubing. Its most common use case is in active intakes, and has been popular among teams for many seasons. Surgical tubing has a hollow center and is sold in different diameters and wall thicknesses. Teams can experiment with different kinds of surgical tubing, as well as adding polyurethane tubing (clear tubing that is stiffer than rubber or latex tubing) in order to make the tubing more stiff.
es_mx: El tubo quirúrgico generalmente es de látex o caucho. Su caso de uso más común es en intakes activos, y ha sido popular entre los equipos durante muchas temporadas. El tubo quirúrgico tiene un centro hueco y se vende en diferentes diámetros y espesores de pared. Los equipos pueden experimentar con diferentes tipos de tubo quirúrgico, así como agregar tubo de poliuretano (tubo transparente que es más rígido que el tubo de caucho o látex) para hacer que el tubo sea más rígido.
fr_ca: Le tube chirurgical est généralement un tube en latex ou en caoutchouc. Son utilisation la plus courante est dans les ramasseurs actifs, et il est populaire parmi les équipes depuis de nombreuses saisons. Le tube chirurgical possède un centre creux et est vendu avec différents diamètres et épaisseurs de paroi. Les équipes peuvent expérimenter différents types de tubes chirurgicaux, ainsi qu’ajouter des tubes en polyuréthane (tubes transparents plus rigides que les tubes en caoutchouc ou en latex) afin de rendre le système plus rigide.
ro_ro: Tubulatura, în general fabricată din latex sau cauciuc, este folosită în intake-urile active și sunt populare printre echipe de multe sezoane. Tubulatura are un centru gol și este vandut in diverse diametre și grosimi ale pereților. Echipele pot experimenta cu diverse tipuri de tubulatură, și de asemenea să adauge tubulatură din poliuretan (tubulatură transparentă care este mai rigidă decât tubulatura din latex sau cauciuc) ca să facă tubulatura mai rigidă.
zh_cn: 手术管一般是乳胶或橡胶管。其最常见的用途是在主动吸入拾取装置中使用，许多赛季以来一直深受队伍的欢迎。手术管的中心是空心的，有不同的直径和壁厚可供选择。参赛队伍可以尝试使用不同种类的手术管，也可以添加聚氨酯管（比橡胶或乳胶管更硬的透明管），以使管子更硬。

source: A roll of surgical tubing
es_mx: Un rollo de tubo quirúrgico
fr_ca: Un rouleau de tube chirurgical
ro_ro: O rolă de tubulatură chirurgicală
zh_cn: 一卷手术管

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
ro_ro: Avantaje
zh_cn: 优点

source: Very controllable
es_mx: Muy controlable
fr_ca: Très contrôlable
ro_ro: Foarte controlabil
zh_cn: 非常可控

source: Propels elements to desired location
es_mx: Propulsa elementos a la ubicación deseada
fr_ca: Propulse les éléments à l'endroit souhaité
ro_ro: Propulsează elementele într-o locație dorită
zh_cn: 将元素推进到所需位置

source: Great at picking up large elements
es_mx: Genial para recoger elementos grandes
fr_ca: Excellent pour collecter des éléments volumineux
ro_ro: Excelent pentru colectarea elementelor mari
zh_cn: 善于拾取大型元素

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
ro_ro: Dezavantaje
zh_cn: 缺点

source: Picks up only one element at a time
es_mx: Recoge solo un elemento a la vez
fr_ca: Ne ramasse qu'un seul élément à la fois
ro_ro: Poate colecta doar un element la un moment dat
zh_cn: 一次只能拾取一个元素

source: Elements can get jammed in a bad position
es_mx: Los elementos pueden atascarse en una mala posición.
fr_ca: Les éléments peuvent se bloquer dans une mauvaise position
ro_ro: Elementele se pot bloca într-o poziție proastă
zh_cn: 元素可能会被卡在不良位置

source: Not generally used for picking up small elements
es_mx: No se utiliza generalmente para recoger elementos pequeños.
fr_ca: N'est généralement pas utilisé pour ramasser de petits éléments
ro_ro: Nu este în general utilizat pentru a colecta elemente mici
zh_cn: 一般不用于拾取小元素

source: Can generally only pick up one specific element shape
es_mx: Solo puede recoger generalmente una forma de elemento específica
fr_ca: Ne peut généralement capter qu'une forme d'élément spécifique
ro_ro: Poate în general să colecteze doar elemente cu o formă specifică
zh_cn: 一般只能拾取一种特定的元素形状

source: 9971's Relic Recovery intake
fr_ca: Le ramasseur de 9971 pendant la saison Relic Recovery
ro_ro: Intake-ul echipei 9971 în sezonul Relic Recovery
zh_cn: 9971 队伍的Relic Recovery吸入拾取装置

source: 9971 LanBros, Finalist Alliance First Pick (Detroit), Relic Recovery, springloaded
es_mx: 9971 LanBros, Alianza Finalista Primera Selección (Detroit), Relic de Recovery, equipado con resortes
fr_ca: 9971 LanBros, premier choix de l’alliance finaliste (Détroit), Relic Recovery, ramasseur à ressorts
ro_ro: 9971 LanBros, Parte din Alianța Finalistă ca First Pick (Detroit), Relic Recovery, acționat cu arc
zh_cn: 9971 LanBros，入围联盟第一选拔赛（于底特律举办），Relic Recovery ，弹簧加载

source: 8680's Relic Recovery intake
fr_ca: Le ramasseur de 8680 pendant la saison Relic Recovery
ro_ro: Intake-ul echipei 8680 în sezonul Relic Recovery
zh_cn: 8680队伍的Relic Recovery吸入拾取装置

source: 2856's Relic Recovery intake
fr_ca: Le ramasseur de 2856 pendant la saison Relic Recovery
ro_ro: Intake-ul echipei 2856 în sezonul Relic Recovery
zh_cn: 2856 队伍的Relic Recovery吸入拾取装置

source: 2856 Tesseract, Relic Recovery, 2 & 4 in. compliant wheels, 2 in. omni wheels
es_mx: 2856 Tesseract, Relic Recovery, 2 y 4 pulgadas. Ruedas compatibles, 2 pulgadas. ruedas omni
fr_ca: 2856 Tesseract, Relic Recovery, roues flexibles de 2 et 4 pouces, roues omnidirectionnelles de 2 pouces
ro_ro: Echipa 2856 Tesseract, Relic Recovery, roți compliant de 2 și 4 inch, roți mecanum de 2 inch
zh_cn: 2856 Tesseract，Relic Recovery，2 和 4 英寸顺从轮，2 英寸全能轮

source: 11115's Relic Recovery intake
fr_ca: Le ramasseur de 11115 pendant la saison Relic Recovery
ro_ro: Intake-ul echipei 11115's în sezonul Relic Recovery
zh_cn: 11115 队伍的Relic Recovery吸入拾取装置

source: 11115 Gluten Free, Finalist Alliance Captain (Detroit), Relic Recovery, springloaded
es_mx: 11115 Gluten Free, Capitán de la Alianza Finalista (Detroit), Relic Recovery, equipado con resortes
fr_ca: 11115 Gluten Free, capitaine de l’alliance finaliste (Détroit), Relic Recovery, ramasseur à ressorts
ro_ro: 11115 Gluten Free, Parte din Alianța Finalistă în rol Căpitan (Detroit), Relic Recovery, acționat cu arc
zh_cn: 11115 Gluten Free、入围Alliance Captain（于底特律举办）、Relic Recovery、弹簧加载

source: Foam Wheel Intake
es_mx: Intake de Rueda de Espuma
fr_ca: Ramasseur à roues en mousse
ro_ro: Intake cu roți din spumă
zh_cn: 泡沫轮吸入拾取装置

source: A foam wheel intake has the same principles as a compliant wheel intake, except that it uses foam wheels. It is generally recommended that teams stick to compliant wheels as they are grippier and easier to control.
es_mx: Un intake de rueda de espuma tiene los mismos principios que un intake de rueda compatible, excepto que utiliza ruedas de espuma. Generalmente se recomienda que los equipos se adhieran a las ruedas compatibles ya que son más adherentes y más fáciles de controlar.
fr_ca: Un ramasseur à roues en mousse repose sur les mêmes principes qu’un ramasseur à roues flexibles, sauf qu’il utilise des roues en mousse. Il est généralement recommandé que les équipes utilisent plutôt des roues flexibles, car elles offrent une meilleure adhérence et sont plus faciles à contrôler.
zh_cn: 泡沫车轮吸入拾取装置的原理与橡胶轮吸入拾取装置相同，只是它使用的是泡沫车轮。一般建议车队坚持使用橡胶轮，因为它们抓地力更强，更易于控制。

source: 6299's ResQ intake
fr_ca: Ramasseur de ResQ de 6299
zh_cn: 6299 队伍的ResQ吸入拾取装置

source: Rubber Band Intake
es_mx: Intake de Liga de Hule
fr_ca: Ramasseur à élastiques
zh_cn: 橡皮筋吸入拾取装置

source: Rubber band intakes, commonly used by in VRC, generally feature sprockets, wheels, or gears at two ends, with rubber bands interlaced in between to form a pliable and bendable roller. Generally, it can be actuated or adjustable with a servo, although this is not necessary.
es_mx: Los intakes de liga de hule, comúnmente utilizadas en VRC, generalmente cuentan con piñones, ruedas o engranajes en ambos extremos, con ligas de hule entrelazadas entre ellos para formar un rodillo flexible y maleable. Por lo general, puede ser accionado o ajustable con un servo, aunque esto no es necesario.
fr_ca: Les ramasseurs à élastiques, couramment utilisés en VRC, comportent généralement des pignons, des roues ou des engrenages à leurs deux extrémités, avec des élastiques entrelacés entre eux pour former un rouleau souple et flexible. En général, ils peuvent être actionnés ou ajustés à l’aide d’un servo, bien que cela ne soit pas nécessaire.
zh_cn: 橡皮筋吸入拾取装置通常用于 VRC，其特点是两端有链轮、轮子或齿轮，中间交错着橡皮筋，形成一个柔韧可弯曲的滚筒。一般来说，它可以用舵机驱动或调节，尽管这并非必要。

source: Rubber band intakes are great with intaking balls, but not so great with other types of game elements such as cubes. It generally is slower than a surgical tubing intake, and requires multiple stages to transfer elements from collection to deposit. Zip ties can be added to increase the intake's range to accommodate for smaller balls.
es_mx: Los intakes de liga de hule son excelentes para recoger bolas, pero no tan buenas para otros tipos de elementos de juego como cubos. En general, es más lento que un intake de tubo quirúrgico y requiere múltiples etapas para transferir elementos de la colección al depósito. Se pueden agregar cinchos/corbatas de plástico para aumentar el alcance del intake y adaptarse a bolas más pequeñas.
fr_ca: Les ramasseurs à bandes élastiques sont très efficaces pour ramasser des balles, mais beaucoup moins adaptés à d’autres types d’éléments de jeu comme les cubes. En général, ils sont plus lents qu’un ramasseur à tube chirurgical et nécessitent plusieurs étapes pour transférer les éléments de la collecte au dépôt. Des attaches autobloquantes peuvent être ajoutées pour augmenter la portée du ramasseur et permettre de ramasser des balles plus petites.
zh_cn: 橡皮筋吸入拾取装置非常适合取球，但对于其他类型的游戏元素（如方块）则不太适用。一般来说，它的速度比手术管式取物器慢，而且需要多个阶段才能将元素从收集处转移到存放处。可以添加拉链来增加吸入口的范围，以适应较小的球。

source: A rubber band intake for VRC Turning Point
es_mx: Intake de liga de hule para VRC Turning Point
fr_ca: Un ramasseur à bandes élastiques pour VRC Turning Point
zh_cn: VRC 比赛转折点的橡皮筋摄入量

source: Ball intake for VRC Game Turning Point
es_mx: Intake de balón para el juego VRC Turning Point
fr_ca: Ramasseur de balles pour le jeu VRC Turning Point
zh_cn: VRC 比赛转折点的进球

source: Tubing Intakes
es_mx: Intake de Tubos
fr_ca: Ramasseurs à tubes
zh_cn: 弯管吸入拾取装置

source: Tubing or noodle intakes typically use some sort of pliable tubing, which is rotated at high RPM to intake game pieces. Tubing intakes are particularly efficient at picking up small objects such as the balls and cubes from Res-Q, Velocity Vortex, and Rover Ruckus.
es_mx: Los intakes de tubo o de fideos generalmente utilizan algún tipo de tubo flexible, que se gira a alta velocidad para recoger las piezas del juego. Los intakes de tubo son particularmente eficientes para recoger objetos pequeños como las pelotas y cubos de Res-Q, Velocity Vortex y Rover Ruckus.
fr_ca: Les ramasseurs à tubes ou à nouilles utilisent généralement un type de tube flexible, qui tourne à haute vitesse pour ramasser les éléments de jeu. Les ramasseurs à tubes sont particulièrement efficaces pour collecter de petits objets tels que les balles et les cubes des jeux Res-Q, Velocity Vortex et Rover Ruckus.
zh_cn: 弯管或软管吸入拾取装置通常使用某种柔韧的弯管，它以每1k展现的收入高旋转来进气游戏棋子。油管吸入拾取装置在拾取小物体方面特别有效，例如来自Res-Q、Velmode Vortex和Rover Ruckus的球和立方体。

source: Surgical Tubing Intake
es_mx: Intake de tubo quirúrgico
fr_ca: Mécanisme de ramassage avec tube
zh_cn: 手术管式吸入拾取装置

source: Surgical tubing or spearfishing rubber tubing, sold by many different manufacturers, is a great option for picking up small game elements such as the minerals from Res-Q or Rover Ruckus.
es_mx: El tubo quirúrgico o el tubo de goma para pesca submarina, vendido por muchos fabricantes diferentes, es una excelente opción para recoger elementos de juegos pequeños como los minerales de Res-Q o Rover Ruckus.
fr_ca: Les tubes chirurgicaux ou les tubes en caoutchouc pour la pêche au harpon, vendus par de nombreux fabricants, sont une excellente option pour ramasser de petits éléments de jeu tels que les minéraux de Res-Q ou de Rover Ruckus.
zh_cn: 许多不同制造商都出售手术管或鱼叉捕鱼橡胶管，它们是拾取 Res-Q 或 Rover Ruckus 的矿物质等小型游戏元素的最佳选择。

source: Surgical tubing intakes can, and often, have multiple sets of tubing in order to move minerals from the collection point to the holding box. This was most often seen in games where robots had to transfer minerals from the field to an elevated location.
es_mx: Los intakes de tubos quirúrgicos pueden, y a menudo, tienen múltiples conjuntos de tubos para mover minerales desde el punto de recolección hasta la caja de almacenamiento. Esto se veía con mayor frecuencia en juegos donde los robots tenían que transferir minerales desde el campo hasta una ubicación elevada.
fr_ca: Les ramasseurs à tubes chirurgicaux peuvent, et ont souvent, plusieurs ensembles de tubes afin de déplacer les minéraux du point de collecte jusqu’à la boîte de stockage. Ce type de système était le plus souvent utilisé dans les jeux où les robots devaient transférer des minéraux du terrain vers un emplacement surélevé.
zh_cn: 手术管式吸入拾取装置通常可以有多组管路，以便将矿物从收集点移动到储存箱。这种情况最常见于机器人需要将矿物从野外转移到高处的游戏中。

source: Unlike wheeled and rubber band intakes, which can be spring-loaded, surgical tubing intakes are practically always fixed at a certain height and angle.
es_mx: A diferencia de los intakes con ruedas y ligas de hule, que pueden ser equipados con resorte, los intakes con tubos quirúrgicos casi siempre están fijos a una cierta altura y ángulo.
fr_ca: Contrairement aux ramasseurs à roues et à bandes élastiques, qui peuvent être montés sur ressort, les ramasseurs à tubes chirurgicaux sont pratiquement toujours fixés à une certaine hauteur et à un certain angle.
zh_cn: 轮式和橡皮筋吸入拾取装置可以通过弹簧加载，而手术管式吸入拾取装置则不同，实际上总是固定在一定的高度和角度上。

source: Surgical tubing by itself is soft and pliable. Teams have two options
es_mx: El tubo quirúrgico por sí mismo es suave y flexible. Los equipos tienen dos opciones.
fr_ca: Les tubes chirurgicaux sont en eux-mêmes souples et flexibles. Les équipes ont deux options
zh_cn: 手术管道本身柔软而有弹性。团队有两种选择

source: Increase the RPM to 800-1000+ RPM
es_mx: Aumenta las RPM a 800-1000+ RPM
fr_ca: Augmenter la vitesse de rotation à 800-1000+ RPM
zh_cn: 将转速提高到 800-1000+ RPM

source: Use polyurethane tubing at a lower RPM (100-250 RPM).
es_mx: Utilice tubería de poliuretano a una velocidad más baja (100-250 RPM).
fr_ca: Utiliser des tubes en polyuréthane à une vitesse de rotation plus faible (100-250 tours/minute).
zh_cn: 当转速较低时（100-250 转/分钟）使用聚氨酯管。

source: Polyurethane tubing can be purchased at a local hardware store and is a clear tubing that is quite stiff. Using some lubricant, insert the clear tubing into the surgical tubing for added stiffness.
es_mx: El tubo de poliuretano se puede comprar en una ferretería local y es un tubo transparente que es bastante rígido. Usando un lubricante, inserta el tubo transparente en el tubo quirúrgico para mayor rigidez.
fr_ca: Le tube en polyuréthane est un tube transparent assez rigide que l'on peut acheter dans une quincaillerie locale. En utilisant un peu de lubrifiant, insérez la tubulure transparente dans la tubulure chirurgicale pour plus de rigidité.
zh_cn: 聚氨酯管可以在本地五金店买到，这是一种相当坚硬的透明管。可以使用一些润滑剂，将透明管插入手术管以增加硬度。

source: It is encouraged that teams test different RPMs and stiffness to develop the optimal intake. You will be surprised how changing one small variable such as the diameter of tubing or how far the tubing extends can affect intake effectiveness.
es_mx: Se recomienda que los equipos prueben diferentes RPM y rigidez para desarrollar el intake óptimo. Te sorprenderá cómo cambiar una pequeña variable, como el diámetro del tubo o hasta dónde se extiende el tubo, puede afectar la efectividad del intake.
fr_ca: Nous encourageons les équipes à tester différents régimes et différentes rigidités pour mettre au point l'admission optimale. Vous serez surpris de constater à quel point le changement d'une petite variable telle que le diamètre de la tubulure ou la longueur de la tubulure peut affecter l'efficacité de l'admission.
zh_cn: 我们鼓励车队测试不同的转速和刚度，以开发出最佳的吸入拾取装置。您会惊讶地发现，只要改变一个微小的变量，例如管子的直径或管子的延伸距离，就能影响吸入拾取装置的效果。

source: Surgical tubing intakes are especially good at picking up multiple elements at a time, due to the high RPM (sometimes >1000 RPM) of the rollers. However, it suffers from a lack of controllability, as sometimes the driver may accidentally pick up more than needed, and have to spit it out.
es_mx: Las entradas de tubos quirúrgicos son especialmente buenas para recoger múltiples elementos a la vez, debido a las altas RPM (a veces >1000 RPM) de los rodillos. Sin embargo, sufre de falta de controlabilidad, ya que a veces el conductor puede recoger accidentalmente más de lo necesario y tener que escupirlo.
fr_ca: Les ramasseurs à tubes chirurgicaux sont particulièrement efficaces pour ramasser plusieurs éléments à la fois, grâce à la vitesse de rotation élevée (parfois supérieure à 1000 tr/min) des rouleaux. Cependant, ils présentent un manque de contrôle : le pilote peut parfois ramasser plus d’éléments que nécessaire et devoir en recracher une partie.
zh_cn: 由于滚筒的转速很高（有时大于 1000 转/分钟），手术管式吸入拾取装置特别适合一次拾取多个元素。不过，它的缺点是缺乏可控性，因为有时驱动器可能会不小心拾取到超过需要的元素，而不得不将其吐出来。

source: Able to collect multiple elements at a time
es_mx: Capaz de recolectar múltiples elementos a la vez
fr_ca: Capacité à collecter plusieurs éléments à la fois
zh_cn: 能够同时收集多个元素

source: Generally more efficient than wheeled intakes
es_mx: Generalmente más eficiente que los intakes con ruedas
fr_ca: Généralement plus efficace que les entrer avec roues
zh_cn: 通常比轮式吸入拾取装置更高效

source: Specializes in small and odd-shaped elements
es_mx: Se especializa en elementos pequeños y de formas extrañas
fr_ca: Spécialisé dans les éléments de petite taille et de forme irrégulière
zh_cn: 专攻小型和异型元素

source: Requires high RPM
es_mx: Requiere altas RPM
fr_ca: Nécessite une vitesse de rotation élevée
zh_cn: 需要高转速

source: Less controllable
es_mx: Menos controlable
fr_ca: Moins contrôlable
zh_cn: 可控性较差

source: Harder to pick up large elements easily
es_mx: Más difícil recoger elementos grandes fácilmente
fr_ca: Il est plus difficile de ramasser facilement des éléments de grande taille
zh_cn: 更难轻松拾取大型元素

source: 8375's surgical tubing intake
es_mx: 8375's intake de tubo quirúrgico
fr_ca: Ramassage à tube chirurgicale de 8375
zh_cn: 8375队伍的手术管式吸入拾取装置

source: 8375 Vulcan Robotics, Res-Q - great example of funneling
es_mx: 8375 Vulcan Robotics, Res-Q - gran ejemplo de embudo
fr_ca: 8375 Vulcan Robotics, Res-Q - un bon exemple d'entonnoir
zh_cn: 8375 Vulcan Robotics、Res-Q--漏斗输送的典范

source: 8393's surgical tubing intake
es_mx: 8393's intake de tubo quirúrgico
fr_ca: Ramassage à tube chirurgicale de 8393
zh_cn: 8393队伍的手术管式吸入拾取装置

source: 8393 Giant Diencephalic BrainSTEM Robotics Team, Semifinalist Alliance Captain (St. Louis), Velocity Vortex
es_mx: 8393 Giant Diencephalic BrainSTEM Robotics Team, Capitán de la Alianza Semifinalista (St. Louis), Velocity Vortex
fr_ca: Équipe 8393 Giant Diencephalic BrainSTEM Robotics, capitaine d’alliance demi-finaliste (St. Louis), Velocity Vortex
zh_cn: 8393 Giant Diencephalic BrainSTEM Robotics Team，半决赛联盟冠军（于圣路易斯举办），Velocity Vortex

source: 11115's surgical tubing intake
es_mx: 11115's intake de tubo quirúrgico
fr_ca: Ramassage à tube chirurgicale de 11115
zh_cn: 11115队伍的手术管式吸入拾取装置

source: 11115 Gluten Free, Winning Alliance First Pick (Detroit), Rover Ruckus
es_mx: 11115 Gluten Free, Primera selección de la Alianza Ganadora (Detroit), Rover Ruckus
fr_ca: Équipe 11115 Gluten Free, premier choix de l’alliance gagnante (Détroit), Rover Ruckus
zh_cn: 11115 Gluten Free, 赢得联盟比赛第一名 (于底特律举办), Rover Ruckus

source: 7203's surgical tubing intake
es_mx: 7203's intake de tubo quirúrgico
fr_ca: Ramassage à tube chirurgicale de 7203
zh_cn: 7203队伍的手术管式吸入拾取装置

source: 7203 KNO3, Rover Ruckus
fr_ca: Équipe 7203 KNO3, Rover Ruckus

source: Zip Tie Intake
es_mx: Intake de Cincho/Corbata
fr_ca: Ramassage avec collier de serrage
zh_cn: 拉链式吸入拾取装置

source: Instead of using surgical tubing, some teams opt for heavy zip ties instead. This can work, but we recommend surgical tubing as it is one of the most tried and tested methods for picking up nearly any game element. Zip ties lack the friction of rubber tubing.
es_mx: En lugar de usar tubos quirúrgicos, algunos equipos optan por usar cinchos gruesos en su lugar. Esto puede funcionar, pero recomendamos el uso de tubos quirúrgicos, ya que es uno de los métodos más probados y comprobados para recoger casi cualquier elemento del juego. Los cinchos/corbatas carecen de la fricción de los tubos de goma.
fr_ca: Au lieu d'utiliser des tubes chirurgicaux, certaines équipes optent pour de gros colliers de serrage. Cela peut fonctionner, mais nous recommandons les tubes chirurgicaux, car c'est l'une des méthodes les plus éprouvées pour ramasser presque n'importe quel élément de jeu. Les attaches zip n'ont pas la friction des tubes en caoutchouc.
zh_cn: 有些团队不使用手术管，而是选择使用厚拉链。这种方法也行得通，但我们还是推荐使用手术管，因为它是几乎所有游戏元素的拾取方法中最久经考验的一种。拉链缺乏橡胶管的摩擦力。

source: 3D printed intake (NinjaFlex/TPU Filament)
es_mx: Intake Impreso en 3D (NinjaFlex/TPU Filamento)
fr_ca: Ramasseur imprimé en 3D (NinjaFlex/filament PTU)
zh_cn: 3D打印的吸入拾取装置（NinjaFlex/TPU 灯丝）

source: TPU/NinjaFlex 3D printer filament is a great low-RPM intake flap option, if designed right they work well with servos, and several teams have successfully used this configuration in competition.
es_mx: TPU/NinjaFlex filamento para impresora 3D es una excelente opción de intake aleta de baja RPM, si se diseña correctamente funcionan bien con servos, y varios equipos han utilizado con éxito esta configuración en competencia.
fr_ca: Le filament TPU/NinjaFlex pour imprimante 3D est une excellente option pour les ramasseurs à bas régime. S'ils sont bien conçus, ils fonctionnent bien avec les servos, et plusieurs équipes ont utilisé avec succès cette configuration en compétition.
zh_cn: TPU/NinjaFlex 3D打印成型丝是一种很好的低转速进气襟翼选择，如果设计得当，它们能与舵机很好地配合，有几支队伍已经在比赛中成功地使用了这种配置。

source: We recommend 3D printed intakes only if your team has had experience in 3D printing parts.
es_mx: Recomendamos los intakes impresos en 3D solo si tu equipo tiene experiencia en la impresión de piezas en 3D.
fr_ca: Nous recommandons les ramasseurs imprimés en 3D uniquement si votre équipe a de l'expérience dans l'impression de pièces en 3D.
zh_cn: 只有当您的团队拥有3D打印部件的经验时，我们才建议使用3D打印吸入拾取装置。

source: 731's 3D printed intake
es_mx: 731's intake impreso en 3D
fr_ca: Ramasseur imprimé en 3D de 731
zh_cn: 731队伍的3D打印吸入拾取装置

source: 8417's 3D printed intake
es_mx: 8417's intake impreso en 3D
fr_ca: Ramasseur imprimé en 3D de 8417
zh_cn: 8417队伍的3D打印吸入拾取装置

source: 8417 Lectric Legends, Rover Ruckus - TPU intake flaps
es_mx: 8417 Lectric Legends, Rover Ruckus - TPU intake aleta
fr_ca: 8417 Lectric Legends, Rover Ruckus - Plaques de ramasseur en TPU
zh_cn: 8417 Lectric Legends, Rover Ruckus - TPU吸入拾取装置挡板

source: Wheeled intakes can be spring-loaded or locked into place. Teams could choose one or mix; in Relic Recovery, some teams spring-loaded the set of wheels that made contact first, and then had a fixed set in the back. This is up to the design team’s choosing.
ro_ro: Intake-urile cu roți pot fi acționate cu arc sau blocate in loc. Echipele puteau să aleagă o metodă sau un mix; în Relic Recovery, unele echipe aveau un set de roți care erau acționate cu arc, iar apoi un set de roți blocate în loc. Acest lucru era la decizia echipei de design.
