Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/active-intake/types-of-intakes.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Types of Intake
es_mx: Tipos de Intake
fr_ca: Types de ramasseurs
ro_ro: Tipuri de Intake-uri
zh_cn: 吸入拾取装置的类型

source: Horizontal/Top Intake
fr_ca: Ramasseur horizontal/Par le haut
ro_ro: Intake Orizontal/Superior
zh_cn: 水平/顶部吸入拾取装置

source: A horizontal intake generally is a wider style of intake that has the intake rotating on a horizontal axis or plane. Horizontal intakes are generally used for intaking smaller game elements, as these types of intakes can control more than one piece at a time. Horizontal intakes have been used successfully in games such as Res-Q and Rover Ruckus, where teams needed to pick up small cubes and balls from the floor.
es_mx: Una intake horizontal generalmente es un estilo más amplio de intake que tiene la entrada girando en un eje o plano horizontal. Las entradas horizontales se utilizan generalmente para recoger elementos de juego más pequeños, ya que este tipo de entradas pueden controlar más de una pieza a la vez. Las entradas horizontales se han utilizado con éxito en juegos como Res-Q y Rover Ruckus, donde los equipos necesitaban recoger cubos pequeños y pelotas del suelo.
fr_ca: Une ramasseur horizontal est généralement un style de ramasseur plus large dont le ramasseur tourne sur un axe ou un plan horizontal. Les ramasseurs horizontaux sont généralement utilisés pour prendre des éléments de jeu plus petits, car ces types de ramasseurs peuvent contrôler plus d'un élément à la fois. Les ramasseurs horizontaux ont été utilisées avec succès dans des jeux tels que Res-Q et Rover Ruckus, où les équipes devaient ramasser de petits cubes et des balles sur le sol.
ro_ro: Un intake orizontal este, în general, un stil de intake mai lat, în care intake-ul se rotește pe o axă sau un plan orizontal. Intake-urile orizontale sunt în general folosite pentru \aspirarea\ elementelor de joc mai mici, deoarece aceste tipuri de intake-uri pot controla mai mult de un element odată. Intake-urile orizontale au fost utilizate cu succes în jocuri precum Res-Q și Rover Ruckus, în care echipele trebuiau să ridice cuburi și bile mici de pe podea.
zh_cn: 水平吸入拾取装置通常是一种较宽的吸入拾取装置，其可在水平轴或平面上旋转。水平吸入拾取装置一般用于吸入较小的游戏元素，因为这类装置可以同时控制多个元素。水平吸入拾取装置已成功应用于 Res-Q 和 Rover Ruckus 等竞赛中，在这些比赛中，团队需要从地板上拾取小方块和小球。

source: Vertical Intake
es_mx: Intake vertical
fr_ca: Ramasseur vertical
ro_ro: Intake Vertical
zh_cn: 垂直吸入拾取装置

source: A vertical intake typically has wheels or other intake components rotating on a vertical axis (the z-axis). Vertical intakes are more controllable, as they can only pick up one element at a time. Vertical intakes excel at picking up large game elements which would be impossible to control more than one piece at once, such as the foam glyphs in Relic Recovery.
es_mx: Un intake vertical típicamente tiene ruedas u otros componentes de intake que giran en un eje vertical (el eje z). Los intakes verticales son más controlables, ya que solo pueden recoger un elemento a la vez. Las tomas verticales son excelentes para recoger elementos grandes del juego que sería imposible controlar más de una pieza a la vez, como los glifos de espuma en Relic Recovery.
fr_ca: Un ramasseur vertical comporte généralement des roues ou d'autres composants de ramassage qui tournent sur un axe vertical (l'axe z). Les ramasseurs verticaux sont plus faciles à contrôler, car ils ne peuvent ramasser qu'un seul élément à la fois. Les ramasseurs verticaux sont idéaux pour ramasser de gros éléments de jeu dont il serait impossible de contrôler plusieurs a la fois, comme les glyphes en mousse dans Relic Recovery.
ro_ro: Un intake vertical are de obicei roți sau alte componente de intake care se rotesc pe o axă verticală (axa z). Intake-urile verticale sunt mai ușor de controlat, deoarece pot prelua doar un singur element la un moment dat. Intake-urile verticale excelează la preluarea elementelor mari de joc care ar fi imposibil de controlat mai mult de un element deodată, cum ar fi elementele din spumă din Relic Recovery.
zh_cn: 垂直吸入拾取装置通常具有在垂直轴（Z 轴）上旋转的轮子或其他拾取部件。垂直进气道更易于控制，因为它们一次只能拾取一个元素。垂直进气道擅长拾取大型游戏元素，而这些元素是不可能同时控制多个的，例如《Relic Recovery》中的泡沫石刻。

source: Below are different implementations of horizontal and vertical intakes:
es_mx: A continuación se presentan diferentes implementaciones de intakes horizontales y verticales.
fr_ca: Vous trouverez ci-dessous différentes mises en œuvre de ramasseurs horizontaux et verticaux :
ro_ro: Mai jos sunt prezentate diferite implementări ale intake-urilor orizontale și verticale:
zh_cn: 以下是水平和垂直吸入拾取装置的不同实现方式：

source: Roller and Wheeled Intakes
es_mx: Intakes con Rodillos y Ruedas
fr_ca: Ramasseurs à Rouleaux et à Roues
ro_ro: Intake-uri cu Roți/Role
zh_cn: 滚筒式和轮式吸入拾取装置

source: Roller and wheeled intakes refer to types of intakes which work by having some sort of hard or pliable object rotate along an axis. Wheeled intakes use different kinds of wheels (solid traction, compliant, or foam wheels) that propel the game element to the collection bin. Roller intakes are wider, and can sometimes intake more than one game element.
es_mx: Intakes con rodillos y ruedas se refieren a tipos de intakes que funcionan al hacer que algún objeto duro o flexible gire a lo largo de un eje. Los intakes con ruedas utilizan diferentes tipos de ruedas (tracción sólida, flexibles o de espuma) que impulsan el elemento del juego hacia el contenedor de recolección. Los intakes de rodillos son más anchos y a veces pueden recoger más de un elemento del juego.
fr_ca: Les ramasseurs à rouleaux et à roues se réfèrent à des types de ramasseurs qui fonctionnent en faisant tourner une sorte d'objet dur ou souple le long d'un axe. Les ramasseurs à roues utilisent différents types de roues (roues à traction solide, roues souples ou roues en mousse) qui propulsent l'élément de jeu vers le bac de collecte. Les ramasseurs à rouleaux sont plus larges et peuvent parfois contenir plus d'un élément de jeu.
ro_ro: Intake-urile cu role și cu roți se referă la tipuri de intake-uri care funcționează prin rotirea unui obiect dur sau flexibil de-a lungul unei axe. Intake-urile cu roți folosesc diferite tipuri de roți (roți cu tracțiune solidă, roți flexibile sau roți din spumă) care propulsează elementul de joc către coșul de colectare. Intake-urile cu roti sunt mai late și, uneori, pot prelua mai multe elemente de joc.
zh_cn: 滚轮式吸入拾取装置和轮式吸入拾取装置是指通过让某种坚硬或柔韧的物体沿着轴旋转来工作的装置。轮式吸入拾取装置使用不同类型的轮子（实心牵引轮、橡胶轮或泡沫轮）将游戏元素推进到收集箱。滚轮吸入拾取装置更宽，有时可以吸入多个游戏元素。

source: Term
es_mx: Término
fr_ca: Terme
ro_ro: Termen
zh_cn: 术语

source: Compliant Wheel
es_mx: Rueda Compatible/Complaint Wheel
fr_ca: Roue flexible
ro_ro: Roată "Compliant"
zh_cn: 橡胶轮

source: A compliant wheel is a flexible rubber wheel that is primarily used for intakes. These are **NOT** designed for use in drivetrains.
es_mx: Una rueda compatible es una rueda de goma flexible que se utiliza principalmente para los intakes. Estas **NO** están diseñadas para su uso en el chasis.
fr_ca: Une roue flexible est une roue en caoutchouc flexible qui est principalement utilisée pour les ramasseurs. Elles ne sont **PAS** conçues pour être utilisées dans les transmissions.
ro_ro: O roată flexibilă (compliant) este o roată de cauciuc flexibilă care este utilizată în principal pentru intake-uri. Acestea NU sunt concepute pentru a fi utilizate în șasiuri.
zh_cn: 橡胶轮是一种主要用于吸入拾取装置的柔性橡胶轮。这些不是（请注意不是）为动力传动系统设计的。

source: The available bore options vary depending on the vendor. As with the compliant wheels, durometer (hardness of rubber) affects both traction and longevity, sacrificing one for the other. However, in the case of intakes, a lower durometer is recommended to have maximum grippiness for intaking game elements.
es_mx: Las opciones de diámetro disponibles varían dependiendo del proveedor. Al igual que con las ruedas compatibles, el durómetro (la dureza del caucho/goma) afecta tanto la tracción como la durabilidad, sacrificando una por la otra. Sin embargo, en el caso de los intakes, se recomienda una menor dureza para tener la máxima adherencia al tomar elementos del juego.
fr_ca: Les options d'alésage disponibles varient en fonction du fournisseur. Comme pour les roues flexibles, le duromètre (dureté du caoutchouc) affecte à la fois la traction et la longévité, sacrifiant l'une pour l'autre. Toutefois, dans le cas des ramasseurs, il est recommandé d'utiliser un duromètre plus faible afin d'obtenir une adhérence maximale pour les éléments de jeu à prendre en charge.
ro_ro: Opțiunile de axe disponibile variază în funcție de furnizor. Ca și în cazul roților "complaint", durometrul (duritatea cauciucului) afectează atât tracțiunea, cât și longevitatea, sacrificând una pentru cealaltă. Cu toate acestea, în cazul preluărilor, se recomandă un durometru mai mic pentru a avea o aderență maximă pentru preluarea elementelor de joc.
zh_cn: 可供选择的内径因供应商而异。与橡胶车轮一样，硬度（橡胶硬度）对牵引力和使用寿命都有影响，两者缺一不可。不过，在当使用吸入拾取装置的情况下，建议使用硬度较低的橡胶，以获得最大的抓地力，用于拾取游戏元素。

source: Durometer refers to the hardness of rubber. Having a high durometer translates to a harder rubber surface, more durability, but less traction. A low durometer means a softer rubber, worse durability, but improved traction.
es_mx: El durómetro se refiere a la dureza del caucho. Tener un durómetro alto se traduce en una superficie de caucho/goma más duro, mayor durabilidad, pero menor tracción. Un durómetro bajo significa un caucho más suave, menor durabilidad, pero mejor tracción.
fr_ca: Le duromètre fait référence à la dureté du caoutchouc. Un duromètre élevé se traduit par une surface de caoutchouc plus dure, plus durable, mais moins adhérente. Un duromètre faible signifie un caoutchouc plus mou, une durabilité moindre, mais une meilleure traction.
ro_ro: Durometrul se referă la duritatea caciucului. Un durometru mare înseamnă un cauciuc mai dur, durabilitate mai mare, însă tracțiune/aderență mai slabă. Un durometru slab înseamnă un cauciuc moale, durabilitate mai slabă, însă tracțiune mai bună.
zh_cn: 硬度指橡胶的硬度。硬度越高，橡胶表面越硬，耐用性越高，但牵引力越小。硬度低意味着橡胶更软，耐用性更差，但牵引力更大。

source: Examples of compliant wheel are Andymark's Compliant Wheels, and goBILDA's Gecko Wheels.
es_mx: Ejemplos de ruedas compatibles son las Ruedas Flexibles de Andymark y las Ruedas Gecko de goBILDA.
fr_ca: Les roues flexibles d'Andymark et les roues Gecko de goBILDA sont des exemples de roues flexibles.
ro_ro: Exemple de roți compliant sunt roțile AndyMark Compliant, și roțile goBILDA Gecko
zh_cn: 橡胶轮的例子有 Andymark 的橡胶轮和 goBILDA 的橡胶轮。

source: A 2" green compliant wheel
es_mx: A 2" rueda compatible verde
fr_ca: Une roue flexible verte de 2"
ro_ro: O roată de 2 inch compliant verde
zh_cn: 一个2英寸绿色橡胶轮

source: A 2" compliant wheel
es_mx: A 2" rueda compatible
fr_ca: Une roue flexible de 2"
ro_ro: O roată de 2 inch compliant
zh_cn: 一个2英寸橡胶轮

source: A 4" green compliant wheel
es_mx: A 4" rueda compatible verde
fr_ca: Une roue verte flexible de 4"
ro_ro: O roată de 4 inch compliant verde
zh_cn: 一个4英寸绿色橡胶轮

source: A 4" compliant wheel
es_mx: A 4" rueda compatible
fr_ca: Une roue flexible de 4"
ro_ro: O roată de 4 inch compliant
zh_cn: 一个4英寸橡胶轮

source: Solid Wheel Intake
es_mx: Intake de Rueda Sólida
fr_ca: Ramasseur à roues pleines
ro_ro: Intake cu Roată Dură
zh_cn: 实心轮吸入拾取装置

source: Solid wheel intakes use wheels such as grip and traction wheels to pick up game elements. They can be effective in picking up large game elements which do not have much tolerance difference.
es_mx: Los intakes de rueda sólida utilizan ruedas como ruedas de agarre y tracción para recoger elementos del juego. Pueden ser efectivas para recoger grandes elementos del juego que no tienen mucha diferencia de tolerancia.
fr_ca: Les ramasseurs à roues pleines utilisent des roues comme des roues à adhérence ou des roues de traction pour ramasser les éléments de jeu. Ils peuvent être efficaces pour ramasser de gros éléments de jeu qui ne présentent pas beaucoup de différence de tolérance.
ro_ro: Intake-urile de roți dure folosesc roți precum roțile de aderență și de tracțiune pentru a prelua elemente de joc. Acestea pot fi eficiente în preluarea elementelor de joc mari care nu au o diferență de toleranță prea mare.
zh_cn: 实心轮吸入拾取装置使用抓地轮和牵引轮等轮子来拾取竞赛元素。它们可以有效拾取容差不大的大型游戏元素。

source: However, compliant wheel intakes generally will be more effective because compliant wheels offer more adjustability and forgiveness for the game elements. Compliant wheels also accounting for different game element orientations (the game pieces can get rotated when being controlled) and intake angles (the orientation of the game piece before it reaches the intake).
es_mx: Sin embargo, las entradas de ruedas compatibles en general serán más efectivas porque las ruedas compatibles ofrecen más ajustabilidad y perdón para los elementos del juego. Las ruedas compatibles también tienen en cuenta las diferentes orientaciones de los elementos del juego (las piezas del juego pueden girar cuando se controlan) y los ángulos del intake (la orientación de la pieza del juego antes de llegar al intake).
fr_ca: Cependant, les ramasseurs à roues flexibles seront généralement plus efficaces, car les roues flexibles offrent plus d’adaptabilité et de tolérance pour les éléments de jeu. Les roues flexibles tiennent également compte des différentes orientations des éléments de jeu (les pièces peuvent pivoter lorsqu’elles sont manipulées) et des angles de ramassage (l’orientation de la pièce avant qu’elle n’atteigne le ramasseur).
ro_ro: Cu toate acestea, în general, intake-urile din roți flexibile vor fi mai eficiente, deoarece roțile flexibile oferă mai multă toleranță pentru elementele de joc. De asemenea, roțile tip \compliant\ țin cont de diferitele orientări ale elementelor de joc (piesele de joc se pot roti atunci când sunt controlate) și de unghiurile de \aspirare\ (orientarea piesei de joc înainte de a ajunge la intake).
zh_cn: 不过，一般来说，橡胶轮吸入拾取装置会更有效，因为橡胶轮为游戏元素提供了更多的可调节性和容错性。橡胶轮还能考虑到不同的游戏元素方向（游戏装置在被控制时可能会旋转）和吸入拾取装置角度（游戏装置在到达吸入拾取装置之前的方向）。

source: Compliant Wheel Intake
es_mx: Intake de Rueda Compatible
fr_ca: Ramasseur à roues flexibles
ro_ro: Intake cu Roți "Compliant"
zh_cn: 符合标准的车轮吸入拾取装置

source: Spring-Loaded Intakes
es_mx: Intake Equipado con Resortes
fr_ca: Ramasseurs à ressorts
ro_ro: Intake-uri cu Arc
zh_cn: 弹簧式吸入拾取装置

source: A spring-loaded intake is able to pivot in order to accommodate a game element when it is passing through the intake, but will snap back when the element has gone through. A spring-loaded intake requires more thought, but guarantees that the intake wheel will always be in contact with the desired element.
es_mx: Un intake con resorte puede girar para acomodar un elemento del juego cuando pasa a través del intake, pero volverá a su posición cuando el elemento haya pasado. Un intake con resorte requiere más consideración, pero garantiza que la rueda del intake siempre estará en contacto con el elemento deseado.
fr_ca: Un ramasseur à ressorts peut pivoter afin de s’adapter à un élément de jeu lorsqu’il passe à travers le ramasseur, mais revient rapidement en place une fois que l’élément est passé. Un ramasseur à ressorts demande plus de réflexion dans sa conception, mais garantit que la roue de ramassage reste toujours en contact avec l’élément souhaité.
ro_ro: Un intake cu arc este capabil să pivoteze pentru a găzdui un element de joc atunci când acesta trece prin intake, dar se va întoarce la loc atunci când elementul a trecut. Un intake cu arc necesită mai multă gândire, dar garantează că roata de intake va fi întotdeauna în contact cu elementul dorit.
zh_cn: 当游戏元素通过吸入拾取装置时，弹簧式吸入拾取装置可以转动，以容纳游戏元素，但当游戏元素通过后，弹簧式吸入拾取装置又会弹回。使用弹簧式吸入拾取装置需要更多的考虑，但可以保证进气轮始终与所需的元素接触。

source: A locked intake simply means that the wheels are locked into place and cannot pivot.
es_mx: Un intake bloqueado simplemente significa que las ruedas están bloqueadas en su lugar y no pueden pivotar.
fr_ca: Un ramasseur fixe signifie simplement que les roues sont bloquées en position et ne peuvent pas pivoter.
ro_ro: Un intake blocat înseamnă pur și simplu că roțile sunt blocate în poziție și nu pot pivota.
zh_cn: 锁定吸入拾取装置仅仅意味着车轮被锁定到位，无法转动。

source: The compliant wheel intake is most commonly used with large game elements such as the glyphs in the 2017-2018 season, Relic Recovery. Compliant wheel intakes excel at controlling elements with flat surfaces such as cubes or rectangular prisms. They suffer at picking up balls.
es_mx: El intake de rueda compatible se utiliza más comúnmente con elementos de juego grandes como los glifos en la temporada 2017-2018, Relic Recovery. Los intakes de rueda compatible son excelentes para controlar elementos con superficies planas como cubos o prismas rectangulares. Tienen dificultades para recoger pelotas.
fr_ca: Le ramasseur à roues flexibles est le plus souvent utilisé avec de grands éléments de jeu, comme les glyphes de la saison 2017-2018, Relic Recovery. Les ramasseurs à roues flexibles excellent dans le contrôle d’éléments ayant des surfaces planes, comme les cubes ou les prismes rectangulaires. Ils ont cependant du mal à ramasser les balles.
ro_ro: Un intake din roți compliant este folosit în general pentru elemente de joc de dimensiuni mari, precum glifele din sezonul 2017-2018, Relic Recovery. Intake-urile din roți compliant sunt foarte bune pentru posesia elementelor cu suprafețe plate, precum cuburi și prizme rectangulare. Acestea nu sunt ideale pentru sfere/mingi.
zh_cn: 橡胶轮吸入拾取装置最常用于大型游戏元素，如 2017-2018 赛季《Relic Recovery》中的石刻。橡胶轮擅长控制具有平面的元素，如立方体或矩形棱柱。但它们在拾取球方面会吃亏。

source: In this game, robots had to pick up glyphs, which were 6 inch foam cubes, from the center pit and place them in the cryptobox. This game had many wheeled intakes primarily because the wheels had consistent and controllable contact with the glyphs. Wheeled intakes were able to propel the glyphs in a consistent fashion from the point of contact to the deposit plate, which would flip up to deposit the glyphs.
es_mx: En este juego, los robots tenían que recoger glifos, que eran cubos de espuma de 6 pulgadas, del pozo central y colocarlos en la criptocaja. Este juego tenía muchos sistemas de intakes con ruedas principalmente porque las ruedas tenían un contacto constante y controlable con los glifos. Los sistemas de intake con ruedas podían propulsar los glifos de manera constante desde el punto de contacto hasta la placa de depósito, que se voltearía para depositar los glifos.
fr_ca: Dans ce jeu, les robots devaient ramasser des glyphes, qui étaient des cubes en mousse de 6 pouces, depuis la fosse centrale et les placer dans la cryptobox. Ce jeu utilisait de nombreux ramasseurs à roues principalement parce que les roues assuraient un contact constant et contrôlable avec les glyphes. Les ramasseurs à roues pouvaient propulser les glyphes de manière régulière depuis le point de contact jusqu’à la plaque de dépôt, qui se relevait pour déposer les glyphes.
ro_ro: În acest joc, roboții trebuiau să colecteze glife, care erau defapt niște cuburi din spumă de 15 cm, din zona din centru și să le plasezi în "cryptobox". Acest joc avea multe intake-uri din roți compliant în general datorită tracțiunii consistente ale roților cu glifele. Intake-urile din roți erau capabile să propulseze glifele într-o manieră consistentă din punctul de contact până în zona de depozitare, care se răsturna pentru a depozita glifele.
zh_cn: 在这个游戏中，机器人必须从中心坑中拾取石刻（6 英寸的泡沫方块），并将其放入密码箱中。这个游戏有很多轮式吸入拾取装置，主要是因为轮子与石刻的接触是一致且可控的。轮式吸入拾取装置能够以一致的方式将石刻从接触点推进到存料板，然后存料板翻转将石刻存入。

source: Wheeled intakes can be spring-loaded or locked into place. Teams could choose one or mix; in Relic Recovery, some teams spring-loaded the set of wheels that made contact first, and then had a fixed set in the back. This is up to the design team's choosing.
es_mx: Los intakes con ruedas pueden estar equipadas con resortes o bloqueadas en su lugar. Los equipos pueden elegir una opción o combinarlas; en Relic Recovery, algunos equipos equiparon con resortes el conjunto de ruedas que hacían contacto primero, y luego tenían un conjunto fijo en la parte trasera. Esto depende de la elección del equipo de diseño.
fr_ca: Les ramasseurs à roues peuvent être montés sur ressorts ou fixés en position. Les équipes pouvaient choisir l’une ou l’autre option, ou même combiner les deux. Dans Relic Recovery, certaines équipes montaient sur ressorts l’ensemble de roues qui entrait en contact en premier, puis avaient un ensemble fixe à l’arrière. Ce choix dépend entièrement de l’équipe de conception.
zh_cn: 轮式吸入拾取装置可以是弹簧加载的，也可以是锁定到位的。参赛队可以选择其中一种，也可以混合使用；在 "Relic Recovery "项目中，一些参赛队将先接触的一组轮子装上弹簧，然后在后面装上固定的一组轮子。这取决于设计团队的选择。

source: Wheeled intakes operate at much slower RPM than surgical tubing intakes, as wheeled intakes are meant to pick up **one** element at a time. They generally require more torque than a surgical tubing intake, which is geared for speed.
es_mx: Los intakes con ruedas operan a RPM mucho más lentas que los intakes de tubo quirúrgico, ya que los intakes con ruedas están diseñadas para recoger **un** elemento a la vez. Generalmente requieren más torque que un intake de tubo quirúrgico, que está diseñado para la velocidad.
fr_ca: Les ramasseurs à roues fonctionnent à une vitesse de rotation bien plus faible que les ramasseurs à tubes chirurgicaux, car ils sont conçus pour ramasser un seul élément à la fois. Ils nécessitent généralement plus de couple qu’un ramasseur à tubes chirurgicaux, qui est conçu pour la vitesse.
ro_ro: Intake-urile cu roți operează la un nivel RPM mai mic decât intake-urile din tubulatură, din moment ce intake-urile din roți sunt făcute să colecteze un **singur** element deodată. În general, este nevoie de mai mult cuplu decât un intake din tubulatură, care este angrenat pentru viteză.
zh_cn: 轮式吸入拾取装置的转速要比手术管式吸入拾取装置慢得多，因为轮式吸入拾取装置一次只能拾取一个元素（请注意一个）。一般来说，轮式吸入拾取装置比手术管式吸入拾取装置需要更大的扭矩，因为手术管式进气道是为了速度而设计的。

source: Surgical Tubing
es_mx: Tubos quirúrgicos
fr_ca: Tubes Chirurgicaux
ro_ro: Tubulatură Chirurgicală
zh_cn: 手术管
