Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/actobotics.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: 9794 Wizards.exe's Rover Ruckus robot
es_mx: 9794 Robot Rover Ruckus de Wizards.exe
fr_ca: 9794 de Wizards.exe pour Robot Rover Ruckus
ro_ro: Robotul 9794 Wizards.exe's Rover Ruckus
zh_cn: 9794 Wizards.exe的Rover Ruckus机器人

source: 9794 Wizards.exe used both Actobotics and REV :term:`extrusion <Extrusion>` to build their Rover Ruckus robot
es_mx: 9794 Wizards.exe utilizó tanto Actobotics como REV :term:`extrusión <Extrusion>` para construir su robot Rover Ruckus
fr_ca: 9794 Wizards.exe utilisait à la fois Actobotics et REV :term:`extrusion<Extrusion>` pour construire leur robot Rover Ruckus
ro_ro: 9794 Wizards.exe a folosit atât Actobotics cât și REV pentru a construi robotul din sezonul Rover Ruckus.
zh_cn: 9794 Wizards.exe 使用Actobotics和REV :term:`铝型材 <Extrusion>` 来制造他们的 Rover Ruckus 机器人

source: The Actobotics kit from ServoCity (https://www.servocity.com/actobotics) is a fixed-pitch, :term:`channel-based <Channel>` building system using imperial units. Its 1.5” :term:`c-channel <Channel>` and :term:`ball-bearing <Ball Bearing>` based motion system allows teams to iterate and build mechanisms entirely from kit parts.
ro_ro: Kitul Actobotics de la ServoCity (https://www.servocity.com/actobotics) este un sistem de construcție cu pas fix, :term:` bazat pe canale <Channel> ` care utilizează unități imperiale. Sistemul său de mișcare bazat pe :term:`canal c <Channel> ` de 1.5” și :term:`rulmenți cu bile <Ball Bearing> ` permite echipelor să itereze și să construiască mecanisme în întregime din piese ale kit-ului.

source: To complement the structural offerings, Actobotics uses a series of clamping hubs and a robust 1/4” steel :term:`D-shaft <Shaft>`.
ro_ro: Pentru o structură completă, Actobotics utilizează o serie de hub-uri de prindere și un :term:`D-shaft <Shaft>`puternic din oțel de 1/4".

source: Actobotics is easily compatible with other build systems such as REV’s kit using adapters which can be found on the Servocity website.
ro_ro: Actobotics este ușor compatibil cu alte sisteme de construcție, cum ar fi kitul REV, folosind adaptoare care pot fi găsite pe site-ul Servocity.

source: Actobotics’ motion system is **very** robust and relies on :term:`ball bearings <Ball Bearing>`, which have a lower coefficient of friction than bushings. Actobotics is compatible with the 5mm hex used by REV with their adaptable hubs.
ro_ro: Sistemul de mișcare al Actobotics este **foarte** robust și se bazează pe :term:`rulmenți cu bile <Ball Bearing>`, care au un coeficient de frecare mai mic decât bucșele. Actobotics este compatibil cu axul hex de 5 mm utilizat de REV cu hub-urile lor adaptabile.

source: Actobotics is not very cheap, so its cost may be prohibitive for some teams with a low budget. Note that with the 25% off FTC team discount, Actobotics can be cheaper than TETRIX. The only cheaper build system is REV.
ro_ro: Actobotics nu este foarte ieftin, așadar costul său poate fi restrictiv pentru unele echipe cu un buget redus. Luați în considerare că, folosind reducerea de 25% pentru echipele FTC, Actobotics poate fi mai ieftin decât TETRIX. Singurul sistem de construcție mai ieftin este REV.

source: The XL :term:`belts <Timing Belt>` from ServoCity are not great. It is recommended that :term:`belts <HTD Belt>` are purchased from ServoCity instead, which may necessitate the use of 3d printed pulleys. There also isn’t a large amount of space inside the channel for a belt or chain run, vastly limiting the size of the pulleys.
ro_ro: :term:`curele <Timing Belt>` XL de la ServoCity nu sunt grozave. Se recomandă să achiziționați în schimb :term:`curele <HTD Belt>` de la ServoCity, ceea ce ar putea necesita utilizarea de fulii printate 3d. De asemenea, în interiorul canalului nu există mult spațiu pentru o curea sau un lanț de rulare, ceea ce limitează foarte mult dimensiunea fuliilor.
