Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/actobotics.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Actobotics (Discontinued)
es_mx: Actobotics (Descontinuado)
fr_ca: Actobotics (abandonner)
zh_cn: 自动机器人Actobotics（已停产）

source: As of June 2023, ServoCity is `discontinuing the Actobotics line <https://www.servocity.com/blog/farewell-to-actobotics/>`_ to focus on goBILDA. We are retaining these pages as historical reference for teams that continue to have and use Actobotics parts.
es_mx: A partir de junio de 2023, ServoCity `discontinuará la línea Actobotics <https://www.servocity.com/blog/farewell-to-actobotics/>`_ para centrarse en goBILDA. Conservamos estas páginas como referencia histórica para los equipos que sigan teniendo y utilizando piezas de Actobotics.
fr_ca: À compter de juin 2023, ServoCity cessera la gamme Actobotics <https://www.servocity.com/blog/farewell-to-actobotics/>`_ pour se concentrer sur goBILDA. Nous conservons ces pages comme référence historique pour les équipes qui continuent de posséder et d'utiliser des pièces Actobotics.
zh_cn: 自2023年6月起，ServoCity将 `停止Actobotics产品 <https://www.servocity.com/blog/farewell-to-actobotics/>`_ ，专注于 goBILDA。我们将保留这些页面，作为继续拥有和使用Actobotics零件的队伍的历史参考。

source: The Actobotics kit from ServoCity (https://www.servocity.com/actobotics) is a fixed-pitch, :term:`channel-based <Channel>` building system using imperial units. Its 1.5" :term:`c-channel <Channel>` and :term:`ball-bearing <Ball Bearing>` based motion system allows teams to iterate and build mechanisms entirely from kit parts.
es_mx: El kit Actobotics de ServoCity (https://www.servocity.com/actobotics) es un sistema de construcción de paso fijo basado en :term:`canales <Channel>` que utiliza unidades imperiales. Su sistema de movimiento de 1,5" :term:`canales <Channel>` y :term:`rodamiento-de-bolas <Ball Bearing>` permite a los equipos iterar y construir mecanismos íntegramente a partir de piezas del kit.
fr_ca: Le kit Actobotics de ServoCity (https://www.servocity.com/actobotics) est un kit à pas fixe, basé sur les profilés<Channel>Construction de systèmes utilisant des unités impériales. Ce sont des systèmes utilisant des profilés de 1,5" :term:`c-channel<Channel>` et :term:` des roulements à billesLe système de mouvement basé sur <Ball Bearing> permet aux équipes d'itérer et de construire des mécanismes entièrement à partir de pièces de kit.
zh_cn: 来自ServoCity(https://www.servocity.com/actobotics)的Actobotics套件是一个固定间距、 :term:`基于链条 <Channel>` 使用英制单位的构建系统。其 1.5英寸 :term:`链条 <Channel>` 和 :term:`滚珠 <Ball Bearing>` 运动系统使团队能够完全利用套件部件进行迭代和构建机械装置。

source: Special Considerations
es_mx: Consideraciones Especiales
fr_ca: Considérations particulières
ro_ro: Considerații Speciale
zh_cn: 特殊考虑因素

source: Actobotics' :term:`channel <Channel>` hole pattern has many more mounting holes than a Tetrix channel, so it offers more flexibility in terms of mounting.
es_mx: El patrón de orificios de los :term:`canales <Channel>` Actobotics tiene muchos más orificios de montaje que un canal Tetrix, por lo que ofrece más flexibilidad en términos de montaje.
fr_ca: Profilé d'Actobotics<Channel> : Le modèle de trou comporte beaucoup plus de trous de montage qu'un profilé Tetrix, il offre donc plus de flexibilité en termes de montage.
ro_ro: :term:`Canalele <Channel>` Actobotics au mult mai multe găuri de montare decât cele Tetrix, astfel încât oferă mai multă flexibilitate în ceea ce privește montarea.
zh_cn: Actobotics的 :term:`链条 <Channel>` 孔型比TetrixC形梁多出许多安装孔，因此在安装方面更具灵活性。

source: Actobotics uses imperial units across the board, allowing for clean spacing and fitting. However, most other kits use metric.
es_mx: Actobotics utiliza unidades imperiales en todas sus piezas, lo que permite un espaciado y un ajuste exacto. Sin embargo, la mayoría de los demás kits utilizan el sistema métrico.
fr_ca: Actobotics utilise systématiquement les unités impériales, ce qui permet un espacement et un ajustement précis. Cependant, la plupart des autres kits utilisent le système métrique.
ro_ro: Actobotics folosește unități imperiale peste tot, permițând spațierea și potrivirea perfectă. Cu toate acestea, majoritatea celorlalte kituri utilizează sistemul metric.
zh_cn: Actobotics全面使用英制单位，使间距和装配更加简洁。不过，大多数其他套件都使用公制单位。

source: Actobotics can interface with other kits such as REV through a variety of Pattern Adapters.
es_mx: Actobotics puede interactuar con otros kits, como REV, a través de diversos adaptadores de patron.
fr_ca: Actobotics peut s'interfacer avec d'autres kits tels que REV via une variété d'adaptateurs de modèles.
ro_ro: Actobotics se poate interconecta cu alte kituri, cum ar fi REV, printr-o varietate de adaptoare de modele.
zh_cn: Actobotics可通过各种图案适配器与REV等其他套件连接。

source: ServoCity offers a 25% off discount for all *FIRST*\ |reg| teams making, pricing competitive: https://www.servocity.com/first_team_discounts
es_mx: ServoCity ofrece un 25% de descuento para todos los equipos de *FIRST*\ |reg| presentando un precio competitivo: https://www.servocity.com/first_team_discounts
fr_ca: ServoCity offre une réduction de 25 % pour toutes les équipes *FIRST*\ |reg|, ce qui rend les prix compétitifs : https://www.servocity.com/first_team_discounts
ro_ro: ServoCity oferă o reducere de 25% pentru toate echipele *FIRST*\ |reg|, rezultând în prețuri competitive: https://www.servocity.com/first_team_discounts
zh_cn: ServoCity 为所有 *FIRST*\ |reg| 团队提供七五折优惠，价格极具竞争力： https://www.servocity.com/first_team_discounts

source: Notable Components
es_mx: Componentes Destacados
fr_ca: Composants notables
ro_ro: Componente Notabile
zh_cn: 特殊组件

source: Mini-channel is offered in addition to the standard size :term:`channel <Channel>` for non-structural components.
es_mx: El minicanal se ofrece además del tamaño de :term:`canal <Channel>` estandar, para componentes no estructurales.
fr_ca: Un mini profilé est proposée en plus de la taille standard :term:`channel<Channel>` pour les composants non structurels.
ro_ro: Mini-canalul este oferit în plus față de dimensiunea standard de :term:`canal <Channel> ` pentru componente nestructurale.
zh_cn: 除了用于非结构部件的标准尺寸 :term:`链条 <Channel>` 之外，还提供微型槽钢。

source: Actobotics' X-rail :term:`extrusion <Extrusion>` system offers immense adjustability and flexibility as it adds a :term:`extrusion <Extrusion>` component to a :term:`channel-based <Channel>` kit.
es_mx: El sistema X-rail de :term:`extrusión <Extrusion>` de Actobotics ofrece una enorme capacidad de ajuste y flexibilidad, ya que añade un componente de :term:`extrusión <Extrusion>` a un kit :term:`basado en canales <Channel>`.
fr_ca: Rail X d'Actobotics :term:`extrusion<Extrusion>` Le système offre une immense adaptabilité et flexibilité car il ajoute une :term:`extrusion<Extrusion>` composant vers un :term:`basé sur un kit de profilés<Channel>` .
ro_ro: Sistemul X-rail de :term:`extrudare <Extrusion>` Actobotics oferă ajustabilitate și flexibilitate imensă, deoarece adaugă :term:`profile extrudate<Extrusion>` la un kit bazat pe :term:`canale <Channel>`.
zh_cn: Actobotics的X-rail :term:`铝型材 <Extrusion>` 系统在 :term:`基于链条的 <Channel>` 套件的基础上增加了一个 :term:`铝型材 <Extrusion>` 组件，具有极大的可调性和灵活性。

source: To complement the structural offerings, Actobotics uses a series of clamping hubs and a robust 1/4" steel :term:`D-shaft <Shaft>`.
es_mx: Para complementar la oferta estructural, Actobotics utiliza una serie de cubos de sujeción y un robusto eje :term:`D` de acero de 1/4" <Shaft>`.
fr_ca: Pour compléter les offres structurelles, Actobotics utilise une série de moyeux de serrage et un arbre en D robuste en acier de 1/4"<Shaft>`.
zh_cn: 作为结构产品的补充，Actobotics使用了一系列夹紧轮胎和坚固的1/4英寸钢 :term:`D形轴 <Shaft>` 。

source: The Linear Motion Kit uses X-rail :term:`extrusion <Extrusion>` to build extending mechanisms.
es_mx: El kit de movimiento lineal utiliza :term:`extrusión <Extrusion>` X-rail para construir mecanismos extensibles.
fr_ca: Le kit de mouvement linéaire utilise l'extrusion X-rail :term:`<Extrusion>` pour construire des mécanismes d'extension.
ro_ro: Kitul de mișcare liniară utilizează :term:`profilul <Extrusion>` X-rail pentru a construi mecanisme de extindere.
zh_cn: 线性运动套件使用X-rail :term:`铝型材 <Extrusion>` 来构建延伸机构。

source: The :term:`Servoblocks`, which prolongs the life of a servo, are recommended for all teams, regardless of kit. However, :term:`Servoblocks` seamlessly interface with the Actobotics ecosystem.
es_mx: Los :term:`Servoblocks`, los cuales prolongan la vida útil de un servo, se recomiendan para todos los equipos, independientemente del kit. Sin embargo, los :term:`Servoblocks` interactúan a la perfección con el ecosistema Actobotics.
fr_ca: Les Servoblocks, qui prolongent la durée de vie d'un servomoteur, sont recommandés pour toutes les équipes, quel que soit leur équipement. Cependant, ils s'intègrent parfaitement à l'écosystème Actobotics.
ro_ro: :term:`Servoblock-urile`, care prelungesc durata de viață a unui servo, sunt recomandate pentru toate echipele, indiferent de kit. Cu toate acestea, :term:`Servoblock-urile` se potrivesc perfect cu ecosistemul Actobotics.
zh_cn: :term:`舵机座` 可延长舵机的使用寿命，建议所有队伍使用，无论套件如何。不过， :term:`舵机座` 能与Actobotics搭建体系系统无缝对接。

source: Actobotics furthermore offers motion options such as :term:`bevel gears <Bevel gear>` and Linear Actuator kits (using :term:`lead screws <Lead Screw>`) for specific use cases.
es_mx: Además, Actobotics ofrece opciones de movimiento como :term:`engranajes cónicos <Bevel gear>` y kits de actuadores lineales (que utilizan :term:`tornillos de cabeza <Lead Screw>`) para casos de uso específicos.
fr_ca: Actobotics propose en outre des options de mouvement telles que :term:`engrenages coniques<Bevel gear>` et kits d'actionneurs linéaires (utilisant :term:`vis mères<Lead Screw>`) pour des cas d'utilisation spécifiques.
ro_ro: Actobotics oferă, de asemenea, mecanisme de mișcare, cum ar fi :term:`angrenaje conice <Bevel gear>` și kituri de acționare liniară ( :term:`șuruburi cu plumb <Lead Screw>`) pentru cazuri specifice.
zh_cn: Actobotics还提供运动选项，如 :term:`圆锥齿轮 <Bevel gear>` 和线性执行器套件（使用 :term:`导螺杆 <Lead Screw>` ），以满足特定的使用情况。

source: Verdict
es_mx: Veredicto
zh_cn: 建议

source: Prior to being discontinued, Actobotics was a solid choice for new teams, offering a reliable base kit with many options to expand upon. Because it is no longer being produced we recommend teams consider other kits instead.
es_mx: Antes de ser descatalogado, Actobotics era una opción sólida para los nuevos equipos, ya que ofrecía un kit base fiable con muchas opciones de ampliación. Dado que ya no se fabrica, recomendamos a los equipos que consideren otros kits en su lugar.
fr_ca: Avant son arrêt, Actobotics était un choix judicieux pour les nouvelles équipes, offrant un kit de base fiable avec de nombreuses options d'extension. N'étant plus produit, nous recommandons aux équipes d'envisager d'autres kits.
zh_cn: 在停产之前，Actobotics是新团队的可靠选择，它提供了可靠的基础套件，并有许多可扩展的选项。由于该套件已停产，我们建议参赛队考虑其他套件。

source: Kit of Parts
es_mx: Kit de Piezas
fr_ca: Kit de pièces
ro_ro: Kit de Piese
zh_cn: 配件包

source: `2020-2021 Kit Parts <https://www.servocity.com/ftc-competition-kit-20-21-season/>`_
es_mx: ` Kit de Piezas para el 2020-2021 <https://www.servocity.com/ftc-competition-kit-20-21-season/>`_
fr_ca: `Pièces du kit 2020-2021 <https://www.servocity.com/ftc-competition-kit-20-21-season/>`_
ro_ro: `2020-2021 Kit piese <https://www.servocity.com/ftc-competition-kit-20-21-season/>`_
zh_cn: `2020-2021配件包 <https://www.servocity.com/ftc-competition-kit-20-21-season/>`_

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
ro_ro: Avantaje
zh_cn: 优点

source: Actobotics provides a great value fixed pitch build system that is generally easier to assemble than :term:`extrusion-based <Extrusion>` systems which require cutting :term:`extrusion <Extrusion>` to length.
es_mx: Actobotics proporciona un sistema de construcción de rosca fija de gran valor que suele ser más fácil de montar que los sistemas :term:`basados en extrusión <Extrusion>` que requieren cortar :term:`extrusión <Extrusion>` a medida.
fr_ca: Actobotics fournit un système de construction à pas fixe de grande valeur qui est généralement plus facile à assembler que :term:`basé sur l'extrusion<Extrusion>` systèmes qui nécessitent une découpe :term:`extrusion<Extrusion>` à la longueur.
ro_ro: Actobotics oferă un sistem de construcție de mare valoare, care este, în general, mai ușor de asamblat decât sistemele bazate pe extrudare, care necesită tăierea prin extrudare la lungime.
zh_cn: Actobotics提供了一种超值的固定间距构建系统，通常比 :term:`基于铝型材 <Extrusion>` 的系统更容易组装，后者需要将 :term:`铝型材 <Extrusion>` 切成一定长度。

source: Actobotics has the patented :term:`Servoblocks`, which help drastically increase servo life by protecting it from shock loads. More information may be found in the glossary.
es_mx: Actobotics dispone de los patentados :term:`Servoblocks`, que ayudan a aumentar drásticamente la vida útil del servo protegiéndolo de las fuerzasde choque. Se puede encontrar más información acerca de esto en el glosario.
fr_ca: Actobotics possède les Servoblocks brevetés, qui contribuent à augmenter considérablement la durée de vie du servomoteur en le protégeant des chocs. Plus d'informations sont disponibles dans le glossaire.
ro_ro: Actobotics a patentat :termen:`Servoblocks`, lucru care ajută la creșterea drastică a duratei de viață a servo motorului prin protejarea acestuia de șocuri. Mai multe informații pot fi găsite în glosar.
zh_cn: Actobotics拥有专利:":term:`Servoblocks`"，通过保护舵机免受冲击载荷，大大延长了舵机的使用寿命。更多信息请参见术语表。

source: Actobotics is easily compatible with other build systems such as REV's kit using adapters which can be found on the Servocity website.
es_mx: Actobotics es fácilmente compatible con otros sistemas de construcción, como el kit de REV, mediante adaptadores que pueden encontrarse en el sitio web de Servocity.
fr_ca: Actobotics est facilement compatible avec d'autres systèmes de construction tels que le kit REV utilisant des adaptateurs qui peuvent être trouvés sur le site Web de Servocity.
zh_cn: Actobotics可以使用Servocity网站上提供的适配器与其他构建系统（如REV套件）轻松兼容。

source: Actobotics is more sturdy than TETRIX in terms of drivetrain flex and has more support options to prevent structural bending.
es_mx: Actobotics es más robusto que TETRIX en cuanto a la flexión de un chasis, y tiene más opciones de soporte para evitar la flexión estructural.
fr_ca: Actobotics est plus robuste que TETRIX en termes de flexibilité de la transmission et dispose de plus d'options de support pour éviter la flexion structurelle.
ro_ro: Actobotics este mai robust decât TETRIX în ceea ce privește flexibilitatea sistemului de mers și are mai multe opțiuni de susținere pentru a preveni îndoirea structurală.
zh_cn: Actobotics在传动系统弯曲方面比TETRIX更为坚固，并有更多的支撑选项来防止结构弯曲。

source: The :term:`clamping hubs <Clamping Hub>` offered are more reliable than :term:`set screws <Set Screw>`, as clamping engages the shaft in more places than a :term:`set screw <Set Screw>` (one face). As discussed in the :doc:`TETRIX section <tetrix>`, set screws in particular are vulnerable to loosening, especially without application of Loctite.
es_mx: Los :term:`ejes de apriete <Clamping Hub>` ofrecidos son más fiables que los :term:`tornillos de ajuste <Set Screw>`, ya que el apriete engrana el eje en más lugares que un :term:`tornillo de ajuste <Set Screw>` (los cuales solo hacen presión en una cara). Como se explica en la sección de :doc:`TETRIX <tetrix>`, los tornillos de fijación en particular son vulnerables al aflojamiento, especialmente sin la aplicación de Loctite.
fr_ca: Les moyeux de serrage<Clamping Hub>` proposés sont plus fiables que :term:`les vis sans tête<Set Screw>`, car le serrage engage l'arbre à plus d'endroits qu'une :term:`vis de réglage<Set Screw>(une face). Comme indiqué dans la section TETRIX<tetrix>Les vis de réglage sont particulièrement vulnérables au desserrage, surtout sans application de Loctite.
ro_ro: Huburile de prindere :term:`hub-uri de prindere <Clamping Hub>` oferite sunt mai fiabile decât :term:`șuruburile de prindere <Set Screw>`, deoarece prinderea cuplează axul în mai multe locuri decât un :term:`șurub de prindere <Set Screw>` (cu o singură față). Din ce a fost menționat în secțiunea :doc:`TETRIX <tetrix> `, șuruburile de fixare, în special, sunt vulnerabile la slăbire, mai ales fără aplicarea de Loctite.
zh_cn: 与 :term:`固定螺钉 <Set Screw>` 相比， :term:`夹紧轮毂 <Clamping Hub>` 更可靠，因为与 :term:`固定螺钉 <Set Screw>` （单面）相比，夹紧轮毂与轴啮合的位置更多。正如在 :doc:`TETRIX部分 <tetrix>` 中所讨论的，固定螺钉尤其容易松动，特别是在没有涂抹粘合剂的情况下。

source: Actobotics' motion system is **very** robust and relies on :term:`ball bearings <Ball Bearing>`, which have a lower coefficient of friction than bushings. Actobotics is compatible with the 5mm hex used by REV with their adaptable hubs.
es_mx: El sistema de movimiento de Actobotics es **muy** robusto y se basa en :term:`rodamientos de bolas <Ball Bearing>`, que tienen un coeficiente de fricción menor que los casquillos. Actobotics es compatible con el hexágono de 5 mm utilizado por REV con sus hubs adaptables.
fr_ca: Le système de mouvement d'Actobotics est **très** robuste et repose sur des :term:`roulements à billes<Ball Bearing>`, dont le coefficient de frottement est inférieur à celui des bagues. Actobotics est compatible avec l'hexagone de 5 mm utilisé par REV grâce à ses moyeux adaptables.
zh_cn: Actobotics的运动系统非常非常坚固，依靠的是 :term:`滚珠轴承 <Ball Bearing>` ，这种轴承的摩擦系数比轴衬低。Actobotics与REV使用的5毫米六角适配轮胎兼容。

source: Actobotics also allows for :term:`face mounting <Face Mounting>` of motors as opposed to :term:`clamp mounting <Clamp Mounting>`.
es_mx: Actobotics también permite el :term:`montaje frontal <Face Mounting>` de los motores, en lugar de las :term:`abrazaderas de montaje<Clamp Mounting>` que son comúnmente usadas en otros sistemas.
fr_ca: Actobotics permet également le :term:`montage facial<Face Mounting>` des moteurs par opposition au :term:`montage par pince<Clamp Mounting>`.
ro_ro: Actobotics permite, de asemenea, :term:`montarea frontală <Face Mounting>` a motoarelor, spre deosebire de :term:`montarea cu clemă <Clamp Mounting>`.
zh_cn: Actobotics还允许 :term:`正面安装 <Face Mounting>` 电机，而不是使用 :term:`垫圈 <Clamp Mounting>` 固定。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
ro_ro: Dezavantaje
zh_cn: 缺点

source: Actobotics is no longer being produced by ServoCity, so it may be difficult to locate some parts.
es_mx: Actobotics ya no es producido por ServoCity, por lo que puede ser difícil obtener algunas piezas.
fr_ca: Actobotics n'est plus produit par ServoCity, il peut donc être difficile de localiser certaines pièces.
zh_cn: Actobotics已不再由ServoCity生产，因此可能很难找到某些部件。

source: Actobotics is not very cheap, so its cost may be prohibitive for some teams with a low budget. Note that with the 25% off FTC\ |reg| team discount, Actobotics can be cheaper than TETRIX. The only cheaper build system is REV.
es_mx: Actobotics no es muy barato, por lo que su costo puede ser prohibitivo para algunos equipos con un presupuesto bajo. Ten en cuenta que con el descuento del 25% para equipos de FTC\ |reg|, Actobotics puede ser más barato que TETRIX. El único sistema de construcción más barato es REV.
fr_ca: Actobotics n'est pas très bon marché, son prix peut donc être un obstacle pour certaines équipes à petit budget. Notez qu'avec la réduction de 25 % sur les équipes FTC\ |reg|, Actobotics peut être moins cher que TETRIX. Le seul système de construction moins cher est REV.
zh_cn: Actobotics的价格并不便宜，因此它的成本可能会让一些预算较低的团队望而却步。请注意，在 FTC\ |reg| 团队七五折优惠的情况下，Actobotics可能比 TETRIX更便宜。唯一便宜的构建系统是REV。

source: The XL :term:`belts <Timing Belt>` from ServoCity are not great. It is recommended that :term:`belts <HTD Belt>` are purchased from ServoCity instead, which may necessitate the use of 3d printed pulleys. There also isn't a large amount of space inside the channel for a belt or chain run, vastly limiting the size of the pulleys.
es_mx: Las correas XL <Timing Belt>` de ServoCity no son buenas. Se recomienda que las :term:`correas <HTD Belt>` se compren en ServoCity en su lugar, lo que puede hacer necesario el uso de poleas impresas en 3d. Tampoco hay mucho espacio dentro del canal para una correa o cadena, lo que limita enormemente el tamaño de las poleas.
fr_ca: Les ceintures XL :term:`<Timing Belt>Les courroies ServoCity ne sont pas très performantes. Il est recommandé d'utiliser des courroies<HTD Belt>` sont achetés chez ServoCity, ce qui peut nécessiter l'utilisation de poulies imprimées en 3D. De plus, l'espace à l'intérieur du canal pour une courroie ou une chaîne est limité, ce qui limite considérablement la taille des poulies.
zh_cn: 来自ServoCity的XL :term:`同步带 <Timing Belt>` 并不好。建议从ServoCity购买 :term:`HTD同步带 <HTD Belt>` ，这样可能需要使用3d打印的滑轮。此外，C形梁内没有足够的空间供皮带或链条运行，这大大限制了滑轮的尺寸。

source: :term:`Channel` takes up more space than :term:`extrusion <Extrusion>`, so mechanisms can be a bit larger with the Actobotics kit. To remediate this issue, ServoCity sells :term:`mini-channel <Channel>` which is a similar size as :term:`extrusion <Extrusion>`.
es_mx: El :term:`canal` ocupa más espacio que la :term:`extrusion <Extrusion>`, por lo que los mecanismos pueden ser un poco más grandes con el kit Actobotics. Para remediar este problema, ServoCity vende :term:`mini-canales <Channel>` que tiene un tamaño similar al de la :term:`extrusión <Extrusion>`.
fr_ca: :term:`Channel` prend plus de place que :term:`extrusion<Extrusion>`, les mécanismes peuvent donc être un peu plus grands avec le kit Actobotics. Pour remédier à ce problème, ServoCity vend des mini-canaux<Channel>` qui est une taille similaire à :term:`extrusion<Extrusion>`.
ro_ro: :term:`Channel` ocupă mai mult spațiu decât :term:`extrusion <Extrusion>`, astfel încât mecanismele pot fi puțin mai mari cu kitul Actobotics. Pentru a remedia această problemă, ServoCity vinde :term:`mini-channel <Channel>` care are o dimensiune similară cu :term:`extrusion <Extrusion>`.
zh_cn: :term:`C形梁` 比 :term:`铝型材 <Extrusion>` 占用更多空间，因此Actobotics套件的机构可能会稍大一些。为了解决这个问题，ServoCity销售 :term:`微型梁 <Channel>` ，其大小与 :term:`铝型材 <Extrusion>` 相似。

source: 8644 Brainstormers' Relic Recovery robot
fr_ca: Robot de 8644 Brainstormers de Relic Recovery
ro_ro: Robotul echipei 8644 Brainstormers din Relic Recovery
zh_cn: 8644 Brainstormers' 的Relic Recovery机器人

source: An example of a successful Actobotics based robot, 8644 Brainstormers: 2018 Winning Alliance Captain (Detroit), Relic Recovery
es_mx: Un ejemplo de éxito de un robot basado en Actobotics, 8644 Brainstormers: 2018 Capitán de la Alianza Ganadora (Detroit), Relic Recovery
fr_ca: Un exemple de robot basé sur Actobotics réussi, 8644 Brainstormers : 2018 Capitaine de l'alliance gagnante (Detroit), Relic Recovery
ro_ro: Un exemplu de robot de succes bazat pe Actobotics este 8644 Brainstormers, câștigător al 2018 Winning Alliance Captain (Detroit), Relic Recovery
zh_cn: 基于Actobotics的机器人的成功范例，8644 Brainstormers机器人：2018年获胜联盟比赛队长（于底特律举办）Relic Recovery

source: 9971 LanBros' Rover Ruckus robot
es_mx: 9971 Robot Rover Ruckus de LanBros
fr_ca: 9971 par LanBros pour Robot Rover Ruckus
ro_ro: Robotul echipei 9971 LanBros din Rover Ruckus
zh_cn: 9971 LanBros 的Rover Ruckus机器人

source: Another successful Actobotics based robot, 9971 LanBros: 2019 Winning Alliance Captain (Detroit), Rover Ruckus
es_mx: Otro exitoso robot basado en Actobotics, 9971 LanBros: Capitán de la Alianza Ganadora de 2019 (Detroit), Rover Ruckus.
fr_ca: Un autre robot basé sur Actobotics à succès, 9971 LanBros : Capitaine de l'Alliance gagnante 2019 (Détroit), Rover Ruckus
ro_ro: Un alt robot de succes bazat pe Actobotics este 9971 LanBros, câștigător al premiului 2019 Winning Alliance Captain (Detroit), Rover Ruckus
zh_cn: 另一个成功的基于Actobotics的机器人 9971 LanBros：2019年获胜联盟比赛队长（于底特律举办），Rover Ruckus
