Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/gobilda.po
Languages: es_mx, fr_ca, zh_cn

source: goBILDA (https://www.gobilda.com/) is a fixed-pitch, :term:`channel <Channel>` based building system using metric units. It was recently released in the 2018-2019 season and is made by the same company as Actobotics.
es_mx: goBILDA (https://www.gobilda.com/) es un sistema de construcción de paso fijo, :term:`canal <Channel>` basado en unidades métricas. Fue lanzado recientemente en la temporada 2018-2019 y está fabricado por la misma empresa que Actobotics.
fr_ca: goBILDA (https://www.gobilda.com/) est un système de construction à pas fixe, :term:`canal <Channel>` basé sur des unités métriques. Il a été récemment publié dans la saison 2018-2019 et est fabriqué par la même société qu'Actobotics.
zh_cn: goBILDA (https://www.gobilda.com/) 是一种基于固定间距、:term:`channel <Channel>`的建筑系统，使用公制单位。它最近于 2018-2019 赛季发布，与 Actobotics 由同一家公司制造。

source: Special Considerations
es_mx: Consideraciones especiales
fr_ca: Considérations particulières
zh_cn: 特殊考虑因素

source: goBILDA is based on metric measurements using M4 hardware. The hole pattern has 4mm holes on 8mm grid.
es_mx: goBILDA se basa en medidas métricas utilizando hardware M4. El patrón de orificios tiene orificios de 4 mm en una cuadrícula de 8 mm.
fr_ca: goBILDA est basé sur des mesures métriques utilisant du matériel M4. Le schéma de perçage comporte des trous de 4 mm sur une grille de 8 mm.
zh_cn: goBILDA 使用 M4 硬件以公制为基础进行测量。孔型为 4 毫米孔，8 毫米栅格。

source: The kit is primarily structured around :term:`U-channel <Channel>`, which is strong and durable.
es_mx: El kit se estructura principalmente en torno al :term:`canal en U<Channel>`, que es resistente y duradero.
fr_ca: Le kit est principalement structuré autour de :term:`extrusion en U <Channel>`, qui est solide et durable.
zh_cn: 该套件主要由 :term:`U-channel <Channel>` 构成，坚固耐用。

source: goBILDA's robust motion system allows teams to easily build drivetrains and mechanisms without worrying about placement and tensioning.
es_mx: El robusto sistema de movimiento de goBILDA permite a los equipos construir fácilmente chasises y mecanismos sin preocuparse por la colocación y el tensado.
fr_ca: Le système de mouvement robuste de goBILDA permet aux équipes de construire facilement des châssis et des mécanismes sans se soucier du placement et de la tension.
zh_cn: goBILDA强大的运动系统允许团队轻松构建传动系统和机制，而无需担心放置和张力。

source: It is arguable, but goBILDA has likely a low learning curve due to its simple yet extremely functional catalog of parts.
es_mx: Es discutible, pero goBILDA tiene probablemente una curva de aprendizaje baja debido a su sencillo pero extremadamente funcional catálogo de piezas.
fr_ca: C'est discutable, mais goBILDA a probablement une courbe d'apprentissage faible en raison de son catalogue de pièces simple mais extrêmement fonctionnel.
zh_cn: 这是有争议的，但goBILDA可能具有相对较简单的学习曲线，因为它的零件目录直截了当且高度实用。

source: goBILDA parts can generally be easily adapted to other kit parts such as REV.
es_mx: Por lo general, las piezas de goBILDA pueden adaptarse fácilmente a otras piezas del kit, como REV.
fr_ca: Les pièces de goBILDA peuvent généralement être facilement adaptées à d'autres pièces de kit telles que REV.
zh_cn: goBILDA 部件通常很容易改装成其他套件部件，如 REV。

source: Additionally, goBILDA is still being developed at a quick pace and is responsive to the needs of the FTC\ |reg| community.
es_mx: Además, goBILDA sigue desarrollándose a un ritmo rápido y responde a las necesidades de la comunidad FTC\ |reg|.
fr_ca: En outre, goBILDA continue d'être développé à un rythme rapide et répond aux besoins de la communauté de FTC\ |reg|.
zh_cn: 此外，goBILDA仍在快速开发中，并响应FTC社区的需求。

source: **goBILDA offers a 25% discount for** *FIRST*\ |reg| **teams**.
es_mx: **goBILDA ofrece un descuento del 25% para** *FIRST* |reg| **equipos**.
fr_ca: **goBILDA offre une réduction de 25% pour** **les équipes** *FIRST*\ |reg| .
zh_cn: goBILDA提供25%的折扣** *FIRST*\ |reg| **teams**.

source: Notable components
es_mx: Componentes destacados
fr_ca: Composants remarquables
zh_cn: 著名的组件

source: goBILDA uses :term:`8mm pitch chain <Chain>` and HTD 3 or HTD 5 :term:`belts <HTD Belt>` for motion.
es_mx: goBILDA utiliza :term:`cadena de 8 mm de paso <Chain>` y :term:`correas HTD 3 o HTD 5 <HTD Belt>` para el movimiento.
fr_ca: goBILDA utilise :term:`chaîne à pas de 8 mm <Chain>` et HTD 3 ou des :term:`courroies <HTD Belt>` HTD 5 pour le mouvement.
zh_cn: goBILDA 使用 :term:`8mm pitch chain <Chain>` 和 HTD 3 或 HTD 5 :term:`belts <HTD Belt>` 进行运动。

source: goBILDA mostly uses :term:`clamping hubs <Clamping Hub>` (called Sonic hubs), eliminating the unreliable :term:`set screws <Set Screw>`.
es_mx: goBILDA utiliza principalmente :term:`cubos de sujeción <Clamping Hub>` (llamados cubos Sonic), eliminando los poco fiables :term:`tornillos de fijación <Set Screw>`.
fr_ca: goBILDA utilise principalement :term:`moyens de serrage <Clamping Hub>` (appelés moyeux Sonic), éliminant les :term:`vis de réglage <Set Screw>` peu fiables.
zh_cn: goBILDA 主要使用 :term:`clamping hubs <Clamping Hub>`（称为 Sonic hubs），省去了不可靠的 :term:`set screws <Set Screw>`。

source: goBILDA :term:`shafts <Shaft>` are metric (:term:`6mm D <Shaft>` and :term:`8mm rounded hex <Shaft>`).
es_mx: goBILDA :term:`ejes <Shaft>` son métricos (:term:`6mm D <Shaft>` y :term:`8mm hex redondeado <Shaft>`).
fr_ca: goBILDA :term:`arbres <Shaft>` sont métriques (:term:`6mm D <Shaft>` et :term:`8mm hexagonaux arrondis <Shaft>`).
zh_cn: goBILDA :term:`shafts <Shaft>` 是公制（:term:`6mm D <Shaft>` 和 :term:`8mm rounded hex <Shaft>`）。

source: The primary structural component is the 48mm aluminum :term:`U-channel <Channel>`, shown below.
es_mx: El principal componente estructural es el canal en U de aluminio de 48 mm <Channel>, que se muestra a continuación.
fr_ca: Le principal élément structurel est le :term:`profilé en U <Channel>` de 48 mm en aluminium, illustré ci-dessous.
zh_cn: 主要结构部件是 48 毫米铝质 :term:`U-channel <Channel>`，如下图所示。

source: goBILDA U-channel
es_mx: goBILDA Canal en U
fr_ca: Profilés en U goBILDA
zh_cn: goBILDA U 型通道

source: goBILDA :term:`U-channel <Channel>` (48x48 mm)
es_mx: goBILDA :term:`Canal en U <Channel>` (48x48 mm)
fr_ca: goBILDA :terme:`profilé en U <Channel>` (48x48 mm)

source: Low-Side channel (smaller profile :term:`channel <Channel>`) complements full size channel. Low-Side channel is just 12mm in height and allows for more compact builds. Additionally, Low-Side channel opens up possibilities such as a kit-based :term:`parallel plate drivetrain <Parallel Plate Drivetrain>`. Low-Side channel also forms the basis of the cascading kit with a 2 or 4 stage option.
es_mx: El canal Low-Side (perfil más pequeño de :term:`canal <Channel>`) complementa al canal de tamaño normal. El canal Low-Side tiene sólo 12 mm de altura y permite construcciones más compactas. Además, el canal Low-Side ofrece posibilidades como un kit de chasis de placas paralelas :term:`chasis de placas paralelas <Parallel Plate Drivetrain>`. El canal Low-Side también constituye la base del kit en cascada con una opción de 2 ó 4 etapas.
fr_ca: Le rail Low-Side (profil plus petit :term:`profilé<Channel>`) complète le rail de taille normale. Le profilé Low-Side ne mesure que 12 mm de hauteur et permet des constructions plus compactes. En outre, le canal Low-Side ouvre des possibilités telles qu'une transmission à plaques parallèles en kit :term:` châssis à plaques parallèles <Parallel Plate Drivetrain>`. Le canal Low-Side constitue également la base du kit de mise en cascade avec une option à 2 ou 4 étages.
zh_cn: 低侧通道(较小的轮廓:术语:“通道” <Channel>)是全尺寸通道的补充。低侧通道的高度仅为12毫米，并允许更紧凑的建筑。此外，低侧通道开辟了各种可能性，如基于套件的术语:“平行板传动系统” <Parallel Plate Drivetrain>。低侧通道也形成与2或4级选项级联套件的基础。

source: goBILDA low-side channel
es_mx: goBILDA canal low-side
fr_ca: goBILDA profilé en U
zh_cn: goBILDA 低压侧通道

source: goBILDA low-side channel (12x48 mm)
es_mx: Canal bajo goBilda (12x48 mm)
fr_ca: goBILDA profilé en U (12x48 mm)
zh_cn: goBILDA 低侧通道（12x48 毫米）

source: Mini-Low-Side channel (even smaller profile :term:`channel <Channel>`) that compliments Low-Side channel. Mini-Low-Side channel is 12mm tall and just 32mm wide, making it great for small structures.
es_mx: Minicanal Low-Side (perfil aún más pequeño de :term:`canal <Channel>`) que complementa al canal Low-Side. El minicanal Low-Side mide 12 mm de alto y solo 32 mm de ancho, por lo que es ideal para estructuras pequeñas.
fr_ca: Caniveau mini-profil-bas (profil encore plus petit :term:`profilé <Channel>`) qui complète le caniveau profil-bas. Le caniveau mini-profil-bas mesure 12 mm de haut et seulement 32 mm de large, ce qui le rend idéal pour les petites structures.
zh_cn: 迷你低边槽钢（轮廓更小 :term:`channel <Channel>`）是低边槽钢的补充。迷你低边槽高 12 毫米，宽仅 32 毫米，非常适合小型结构。

source: goBILDA mini-low-side channel
es_mx: goBILDA minicanal low-side
fr_ca: Mini-profilé côté bas de goBILDA
zh_cn: goBILDA 小型低压侧通道

source: goBILDA mini-low-side channel (12x48 mm)
es_mx: goBILDA minicanal bajo (12x48 mm)
fr_ca: Mini-profilé côté bas goBILDA (12x48 mm)
zh_cn: goBILDA 小型低边通道（12x48 毫米）

source: Viper-Slides are goBILDA's version of the commonly used drawer slides for linear extension in 336mm and 240mm lengths. Notably, goBILDA sells a Viper-Slide kit, which contains all of the parts to assemble either a 2 stack or 4 stack of slides. In addition, they are one of the few vendors who sells a belted version of these slides. The 240mm slide is also uniquely bidirectional, sliding both ways.
es_mx: Las guías Viper-Slide son la versión de goBILDA de las guías para rieles de uso común para la extensión lineal en longitudes de 336 mm y 240 mm. En particular, goBILDA vende un kit Viper-Slide, que contiene todas las piezas para montar un 2 juegos o 4 juegos de rieles. Además, es uno de los pocos proveedores que vende una versión con correa de estos rieles. El riel de 240 mm también es bidireccional, deslizándose en ambos sentidos.
fr_ca: Les glissières Viper sont la version de goBILDA des glissières de tiroirs couramment utilisées pour l'extension linéaire en 336 mm et 240 mm de longueur. goBILDA vend notamment un kit de glissières Viper, qui contient toutes les pièces nécessaires à l'assemblage d'une glissière à 2 ou 4 étages. En outre, goBILDA est l'un des rares vendeurs à proposer une version ceinturée de ces glissières. La glissière de 240 mm est également bidirectionnelle, c'est-à-dire qu'elle coulisse dans les deux sens.
zh_cn: 蝰蛇滑轨是 goBILDA 的常用抽屉滑轨，用于线性延伸，长度为 336 毫米和 240 毫米。值得注意的是，goBILDA 销售蝰蛇滑轨套件，其中包含组装 2 层或 4 层滑轨的所有部件。此外，他们还是少数几家销售带式滑轨的供应商之一。240 毫米滑轨也是独特的双向滑轨，可双向滑动。

source: goRAIL is :term:`extrusion <Extrusion>` that complements the :term:`channel <Channel>` offerings well. goRAIL is used in the linear actuator kit for extending mechanisms.
es_mx: goRAIL es :term:`extrusión <Extrusion>` que complementa bien la oferta de :term:`canal <Channel>`. goRAIL se utiliza en el kit de actuadores lineales para extender mecanismos.
fr_ca: goRAIL est l':term:`extrusion <Extrusion>` qui complète bien les :term:`profilés<Channel>`. goRAIL est utilisé dans le kit d'actionneur linéaire pour les mécanismes d'extension.
zh_cn: goRAIL 是 :term:`extrusion <Extrusion>`，与 :term:`channel <Channel>` 的产品相得益彰。goRAIL 用于线性推杆套件中的延伸机构。

source: Verdict
es_mx: Veredicto
zh_cn: 判决

source: goBILDA's kit is a solid, albeit slightly more expensive, option for new teams. It offers a great deal of flexibility and part options from their catalog. goBILDA is a solid choice due to reasonable pricing, low learning curve, and thought-out design that reduces headaches.
es_mx: El kit de goBILDA es una opción sólida, aunque algo más cara, para los nuevos equipos. Ofrece una gran flexibilidad y opciones de piezas de su catálogo. goBILDA es una opción sólida debido a su precio razonable, una curva de aprendizaje baja y un diseño bien pensado que reduce los dolores de cabeza.
fr_ca: Le kit de goBILDA est une option solide, bien que légèrement plus chère, pour les nouvelles équipes. goBILDA est un choix solide en raison de son prix raisonnable, de sa faible courbe d'apprentissage et de sa conception réfléchie qui réduit les maux de tête.
zh_cn: goBILDA 的套件是新团队的可靠选择，尽管价格略高。goBILDA 价格合理，学习成本低，设计周到，减少了很多麻烦，因此是一个不错的选择。

source: Kit of Parts
es_mx: Kit de piezas
fr_ca: Kit de pièces
zh_cn: 配件包

source: `2023-2024 Kit Parts <https://www.gobilda.com/ftc-starter-kit-2023-2024-season/>`_
es_mx: `2023-2024 Kit Piezas <https://www.gobilda.com/ftc-starter-kit-2023-2024-season/>`_
fr_ca: `2023-2024 Kit Pièces <https://www.gobilda.com/ftc-starter-kit-2023-2024-season/>`_
zh_cn: `2023-2024 套件 <https://www.gobilda.com/ftc-starter-kit-2023-2024-season/>`_

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: goBILDA's Low-Side U-channel opens up many new possibilities due to its flexibility and compactness. For example, one can now make a :term:`parallel plate drivetrain <Parallel Plate Drivetrain>` without custom machining, or make custom width :term:`U-channel <Channel>`.
es_mx: El canal en U Low-Side de goBILDA abre muchas nuevas posibilidades gracias a su flexibilidad y compacidad. Por ejemplo, ahora se puede fabricar un :term:`chasis de placas paralelas<Parallel Plate Drivetrain>` sin maquinado a medida, o fabricar :term:`canal en U <Channel>` de anchura personalizada.
fr_ca: Le profilé en U profil-bas de goBILDA ouvre de nombreuses nouvelles possibilités grâce à sa flexibilité et à sa compacité. Par exemple, on peut maintenant fabriquer un :term:`châssis à plaques parallèles <Parallel Plate Drivetrain>` sans usinage personnalisé, ou fabriquer un :term:`profil en U <Channel>` de largeur personnalisée.
zh_cn: goBILDA 的低边 U 型槽因其灵活性和紧凑性而开辟了许多新的可能性。例如，现在人们可以制作 :term:`parallel plate drivetrain <Parallel Plate Drivetrain>`，而无需进行定制加工，或者制作定制宽度的 :term:`U-channel <Channel>`。

source: goBILDA also has :term:`Servoblocks` (identical to Actobotics other than hole pattern) which drastically increase servo life.
es_mx: goBILDA también dispone de :term:`Servoblocks` (idénticos a los de Actobotics salvo el patrón de agujeros) que aumentan drásticamente la vida útil de los servos.
fr_ca: goBILDA a également :term:`Servoblocks` (identique à Actobotics à l'exception de la configuration des trous) qui augmentent considérablement la durée de vie des servos.
zh_cn: goBILDA 还有 :term:`Servoblocks`（除孔型外与 Actobotics 相同），可大幅延长舵机的使用寿命。

source: goBILDA has native large bore :term:`hex shaft <Shaft>` support (12 mm REX is comparable to 3/8" rounded hex) which is one of the main advantages of custom fabrication brought to a kit based system.
es_mx: goBILDA dispone de un soporte nativo de gran diámetro :term:`hex eje <Shaft>` (12 mm REX es comparable a 3/8" hexagonal redondeado) que es una de las principales ventajas de la fabricación a medida llevada a un sistema basado en kits.
fr_ca: goBILDA dispose d'un support natif de grand alésage :term:` d'arbre hexagonal <Shaft>` (12 mm REX est comparable à un arbre hexagonal arrondi 3/8") qui est l'un des principaux avantages de la fabrication sur mesure apportée à un système basé sur un kit.
zh_cn: goBILDA 具有原生的大孔径 :term:`hex shaft <Shaft>` 支持（12 毫米 REX 相当于 3/8 英寸圆角六角），这是将定制加工带入套件系统的主要优势之一。

source: goBILDA also is able to interface with TETRIX :term:`channel <Channel>` because they share some holes. For more information about TETRIX-goBILDA compatibility, check out this `website <https://gobildatetrix.blogspot.com/>`_. It is also quite compatible with REV's ecosystem.
es_mx: goBILDA también es capaz de interactuar con TETRIX :term:`canal <Channel>` porque comparten algunos agujeros. Para más información sobre la compatibilidad TETRIX-goBILDA, consulte esta `website <https://gobildatetrix.blogspot.com/>`_. También es bastante compatible con el ecosistema de REV.
fr_ca: goBILDA est aussi capable de s'interfacer avec le :term:`profilé <Channel>` TETRIX parce qu'ils partagent quelques trous. Pour plus d'informations sur la compatibilité TETRIX-goBILDA, consultez ce `site web <https://gobildatetrix.blogspot.com/>`_. Il est également tout à fait compatible avec l'écosystème REV.
zh_cn: goBILDA 也能与 TETRIX :term:`channel <Channel>` 接口，因为它们共享一些漏洞。有关 TETRIX-goBILDA 兼容性的更多信息，请访问 <https://gobildatetrix.blogspot.com/> 。它与 REV 的生态系统也相当兼容。

source: goBILDA has a well thought-out :term:`ball bearing <Ball Bearing>` based motion system with smart motion transfer. It is easy to do :term:`chain <Chain>` or :term:`belt <HTD Belt>` in channel.
es_mx: goBILDA dispone de un sistema de movimiento basado en :term:`rodamiento de bolas <Ball Bearing>` con transferencia de movimiento inteligente. Es fácil hacer :term:`cadena <Chain>` o :term:`correa <HTD Belt>` en canal.
fr_ca: goBILDA a un système de mouvement bien pensé de :term:`roulements à billes <Ball Bearing>` basé sur un transfert de mouvement intelligent. Il est facile de faire une :term:`chaîne <Chain>` ou une :term:`courroie <HTD Belt>` dans le profilé.
zh_cn: goBILDA 拥有经过深思熟虑的 :term:`ball bearing <Ball Bearing>` 运动系统，具有智能运动传输功能。在通道中很容易实现 :term:`chain <Chain>` 或 :term:`belt <HTD Belt>`。

source: 8mm :term:`chain <Chain>`, HTD 3, and HTD 5 mm :term:`belt <HTD Belt>` can do perfect :term:`C2C (center to center) <C2C>` on the goBILDA pattern. This saves a lot of headache when needing to calculate :term:`C2C` distances.
es_mx: 8mm :term:`cadena <Chain>`, HTD 3, y HTD 5 mm :term:`correa <HTD Belt>` pueden hacer perfecto :term:`C2C (centro a centro) <C2C>` en el patrón goBILDA. Esto ahorra muchos quebraderos de cabeza a la hora de calcular distancias :term:`C2C`.
fr_ca: 8mm :term:`chaîne <Chain>`, HTD 3, et HTD 5 mm :term:`courroie <HTD Belt>` peuvent faire un :term:`C2C (centre à centre) <C2C>` parfait sur le motif goBILDA. Cela évite bien des maux de tête lorsqu'il faut calculer les distances :term:`C2C`.
zh_cn: 8 毫米 :term:`chain <Chain>`、HTD 3 和 HTD 5 毫米 :term:`belt <HTD Belt>` 可以在 goBILDA 图案上实现完美的 :term:`C2C（中心到中心） <C2C>`。当需要计算 :term:`C2C` 距离时，这将省去很多麻烦。

source: goBILDA has plenty of :term:`shaft <Shaft>`, :term:`ball bearing <Ball Bearing>`, and pillow block options.
es_mx: goBILDA dispone de numerosas opciones de :term:`eje <Shaft>`, :term:`rodamiento de bolas <Ball Bearing>` y bloque de almohadas.
fr_ca: goBILDA propose de nombreuses options d':term:`arbres <Shaft>`, :term:`roulement à billes <Ball Bearing>`, et de palliers.
zh_cn: goBILDA 有大量 :term:`shaft <Shaft>`、:term:`ball bearing <Ball Bearing>` 和枕式轴承可供选择。

source: goBILDA motors can :term:`face mount <Face Mounting>` natively into :term:`channel <Channel>`, eliminating the need for motor mounts and providing a robust, reliable way to mount motors.
es_mx: Los motores goBILDA se puede hacer :term:`montaje frontal <Face Mounting>` de forma nativa en el :term:`canal <Channel>`, eliminando la necesidad de soportes de motor y proporcionando una forma robusta y fiable de montar motores.
fr_ca: Les moteurs goBILDA peuvent directement sur la :term:`face avant<Face Mounting>` du :term:`profilé <Channel>`, sans avoir besoin de supports moteur, offrant ainsi une méthode de fixation robuste et fiable.
zh_cn: goBILDA 电机可以 :term:`face mount <Face Mounting>` 本地安装到 :term:`channel <Channel>`，无需电机支架，提供了一种坚固可靠的电机安装方式。

source: goBILDA has some special parts are unavailable in other systems, like :term:`square beam shafts <Shaft>`.
es_mx: goBILDA tiene algunas piezas especiales que no están disponibles en otros sistemas, como :term:`ejes <Shaft>de viga cuadrada
fr_ca: goBILDA possède des pièces spéciales qui ne sont pas disponibles dans d'autres systèmes, comme :term:`arbre à poutre carrée <Shaft>`.
zh_cn: goBILDA 有一些其他系统无法提供的特殊部件，例如 :term:`square beam shafts <Shaft>`。

source: goBILDA provides a large selection of 12V DC motors. Their :term:`Yellow Jacket motors <Yellow Jacket Motor>` use orbital gearboxes and are available in 10 different gear ratios ranging from 30 RPM to 1620 RPM. No other manufacturer offers such varied gear ratios out of the box.
es_mx: goBILDA ofrece una amplia selección de motores de 12 V CC. Sus motores :term:`Yellow Jacket <Yellow Jacket Motor>` utilizan reductores orbitales y están disponibles en 10 relaciones de engranajes diferentes que van desde 30 RPM hasta 1620 RPM. Ningún otro fabricante ofrece relaciones de engranajes tan variadas.
fr_ca: goBILDA propose une large sélection de moteurs 12V DC. Leurs :term:`moteurs Yellow Jacket <Yellow Jacket Motor>` utilisent des réducteurs orbitaux et sont disponibles dans 10 rapports différents allant de 30 RPM à 1620 RPM. Aucun autre fabricant ne propose des rapports de vitesse aussi variés.
zh_cn: goBILDA 提供大量 12V 直流电机供您选择。他们的 :term:`Yellow Jacket motors <Yellow Jacket Motor>` 使用轨道齿轮箱，有 10 种不同的齿轮比，从 30 RPM 到 1620 RPM 不等。没有其他制造商能提供如此多样的齿轮比。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: goBILDA is not the cheapest build system; it is relatively equivalent in pricing to Actobotics, but REV is cheaper.
es_mx: goBILDA no es el sistema de construcción más barato; su precio es relativamente equivalente al de Actobotics, pero REV es más barato.
fr_ca: goBILDA n'est pas le système de construction le moins cher ; son prix est relativement équivalent à celui d'Actobotics, mais REV est moins cher.
zh_cn: goBILDA 并不是最便宜的构建系统；它的价格与 Actobotics 相对相当，但 REV 更便宜。

source: goBILDA :term:`U-channels <Channel>` are larger than the :term:`channels <Channel>` from Tetrix, resulting in larger builds. However, this is more than compensated by the fact that one can put a :term:`goBILDA motor <Yellow Jacket Motor>` *inside* a :term:`channel <Channel>`. In addition, the introduction of mini-low-side channel allows for more compact builds where needed
es_mx: Los :term:`canales-U <Channel>` de goBILDA son más grandes que los :term:`canales <Channel>` de Tetrix, lo que resulta en construcciones más grandes. Sin embargo, esto se compensa con creces por el hecho de que se puede colocar un :term:`motor goBILDA <Yellow Jacket Motor>` *dentro* de un :term:`canal <Channel>`. Además, la introducción del minicanal inferior permite realizar construcciones más compactas cuando sea necesario.
fr_ca: Le :term:`profilé en U<Channel>` de goBILDA est plus grand que le :term:`profilé <Channel>` de Tetrix, ce qui entraîne des constructions plus importantes. Cependant, ceci est plus que compensé par le fait que l'on peut mettre un :term:`moteur goBILDA <Yellow Jacket Motor>` *à l'intérieur* d'un :term:`profilé <Channel>`. De plus, l'introduction de mini-profilés permet des constructions plus compactes là où c'est nécessaire.
zh_cn: goBILDA 的 :term:`U-channels <Channel>` 比 Tetrix 的 :term:`channels <Channel>` 要大，导致构建量较大。不过，这一点可以通过在 :term:`channel <Channel>` 内放置 :term:`goBILDA 电机 <Yellow Jacket Motor>` 来弥补。此外，迷你低侧通道的引入可在必要时实现更紧凑的构造
