Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/gobilda.po
Languages: es_mx, fr_ca, zh_cn

source: Because of metric pattern spacing, goBILDA utilizes 8mm pitch :term:`chain <Chain>`, as opposed to the FTC standard #25 Imperial :term:`chain <Chain>`. This means that other kits' :term:`chain <Chain>` and :term:`sprockets <Sprocket>` won't work with goBILDA :term:`chain <Chain>` and :term:`sprockets <Sprocket>`.
es_mx: Debido al espaciado métrico de los patrones, goBILDA utiliza un paso de 8 mm de :term:`cadena <Chain>`, a diferencia del estándar FTC #25 Imperial :term:`cadena <Chain>`. Esto significa que las :term:`cadenas<Chain>` y :term:`piñones <Sprocket>` de otros kits no funcionarán con las :term:`cadenas <Chain>` y :term:`piñones <Sprocket>` de goBILDA.
fr_ca: A cause de l'espacement métrique, goBILDA utilise une :term:`chaîne <Chain>` de 8mm, contrairement à la :term:`chaîne <Chain>` impériale #25 standard de la FTC. Cela signifie que les :term:`chaînes <Chain>` et :term:`pignons <Sprocket>` d'autres kits ne fonctionneront pas avec les :term:`chaînes <Chain>` et :term:`pignons <Sprocket>` de goBILDA.
zh_cn: 由于公制模式的间距，goBILDA 使用 8mm 间距的 :term:`chain <Chain>`，而不是 FTC 标准的 #25 英制 :term:`chain <Chain>`。这意味着其他套件的 :term:`chain <Chain>` 和 :term:`sprockets <Sprocket>` 无法与 goBILDA :term:`chain <Chain>` 和 :term:`sprockets <Sprocket>` 配合使用。

source: 7182 Mechanical Paradox Cubed's Rover Ruckus robot hanging on the lander
es_mx: 7182 Mechanical Paradox Cubed's Rover Ruckus robot colgado del módulo de aterrizaje
fr_ca: 7182 Le robot Rover Ruckus de Mechanical Paradox Cubed accroché à l'atterrisseur
zh_cn: 7182 机械矛盾立方体的漫游者 Ruckus 机器人挂在着陆器上

source: 7182 Mechanical Paradox Cubed's Rover Ruckus robot hanging on the field
es_mx: 7182 Mechanical Paradox Cubed's Rover Ruckus robot colgado en el campo
fr_ca: 7182 Le robot Rover Ruckus de Mechanical Paradox Cubed suspendu sur le terrain
zh_cn: 7182 Mechanical Paradox Cubed 的 Rover Ruckus 机器人挂在场地上

source: An example of a successful goBILDA based robot, 7182 Mechanical Paradox Cubed: Finalist Alliance 1st Pick (Detroit), Rover Ruckus
es_mx: Un ejemplo de éxito de un robot basado en goBILDA, 7182 Mechanical Paradox Cubed: Alianza Finalista 1ª Elección (Detroit), Rover Ruckus
fr_ca: Un exemple de robot réussi basé sur goBILDA, 7182 Mechanical Paradox Cubed : Finaliste Alliance 1st Pick (Detroit), Rover Ruckus
zh_cn: 基于 goBILDA 的成功机器人范例，7182 Mechanical Paradox Cubed：入围联盟第一选拔赛（底特律），Rover Ruckus
