Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/index.po
Languages: es_mx, fr_ca, zh_cn

source: Kit Options
es_mx: Opciones de Kit
fr_ca: Les options de kit
zh_cn: 套件选项

source: Kit and Hardware Guide
es_mx: Guía de Hardware y Kits
fr_ca: Guide de kit et de matériel
zh_cn: 套件和硬件指南

source: Before beginning your season, your team is presented with a crucial decision - one that will undoubtedly heavily influence the team's direction of hardware design in at least the first year. The *FIRST*\ |reg| storefront currently offers two kits for new teams: the TETRIX kit from Pitsco, and the REV Starter kit from REV Robotics. However, teams should carefully consider other options, such as goBILDA, before selecting a kit.
es_mx: Antes de comenzar tu temporada, tu equipo se enfrenta a una decisión crucial - una que sin duda influirá en gran medida en la dirección del diseño de hardware del equipo, al menos durante el primer año. La tienda *FIRST*\ |reg| actualmente ofrece dos kits para equipos nuevos: el kit TETRIX de Pitsco y el kit de inicio REV (REV Starter kit) de REV Robotics. Sin embargo, los equipos deben considerar cuidadosamente otras opciones, como goBILDA, antes de seleccionar un kit.
fr_ca: Avant de commencer votre saison, votre équipe doit prendre une décision cruciale - une décision qui influencera sans doute considérablement l'orientation du design matériel de l'équipe, du moins lors de la première année. Le FIRST® store propose actuellement deux kits pour les nouvelles équipes : le kit TETRIX de Pitsco et le kit REV Starter de REV Robotics. Cependant, les équipes doivent examiner attentivement d'autres options, comme goBILDA, avant de choisir un kit.
zh_cn: 在赛季开始前，您的团队将面临一个至关重要的决定--这个决定无疑将在很大程度上影响团队至少第一年的硬件设计方向。*FIRST*\ |reg| 商店目前为新团队提供两种套件：Pitsco 的 TETRIX 套件和 REV Robotics 的 REV 入门套件。不过，参赛队在选择套件之前，应仔细考虑其他选项，如 goBILDA。

source: Every build system has advantages and disadvantages, which we have highlighted in our detailed build system guides below. While the guide may not be fully objective, recommendations are based on our own experience with the different kits, so the slant is there with reason. As with pretty much anything in FTC\ |reg|, there is no one right answer - but there are better answers than others. Hopefully, this guide gives some solid advice on which kit might be the best for your team.
es_mx: Cada sistema de construcción tiene ventajas y desventajas, las cuales hemos resaltado en nuestras detalladas guías de sistemas de construcción a continuación. Si bien la guía puede no ser completamente objetiva, las recomendaciones se basan en nuestra propia experiencia con los diferentes kits, por lo que la inclinación está respaldada por una razón. Como con prácticamente cualquier cosa en FTC\ |reg|, no hay una única respuesta correcta, pero hay respuestas mejores que otras. Esperemos que esta guía brinde algunos consejos sólidos sobre qué kit podría ser el mejor para tu equipo.
fr_ca: Chaque système de construction présente des avantages et des inconvénients, que nous avons mis en évidence dans nos guides détaillés ci-dessous. Bien que le guide ne soit peut-être pas entièrement objectif, les recommandations sont basées sur notre propre expérience avec les différents kits, et il y a donc un biais, mais il est justifié. Comme pour presque tout dans la compétition FTC®, il n'y a pas de réponse unique et correcte, mais il y a des réponses meilleures que d'autres. Nous espérons que ce guide fournira de bons conseils sur le kit qui pourrait être le mieux adapté à votre équipe.
zh_cn: 每种构建系统都有优缺点，我们在下面的详细构建系统指南中重点介绍了这些优缺点。虽然指南可能并不完全客观，但推荐都是基于我们自己使用不同套件的经验，因此会有一些合理的倾向性。与 FTC\ |reg| 中的几乎所有内容一样，没有唯一正确的答案，但有比其他答案更好的答案。希望本指南能就哪种套件最适合你的团队提供一些可靠的建议。

source: Why Use a Kit?
es_mx: ¿Por qué usar un kit?
fr_ca: Pourquoi l'utilisation d'un kit?
zh_cn: 为什么使用套件？

source: After all, plenty of successful robots have not followed this framework. However, we still recommend new teams purchase a starter kit for one big reason. Established teams are all but guaranteed to have spare parts lying around to use to build their next bot. However, rookie teams, as is obvious, don't have the plethora of parts from previous seasons to use. Thus, new teams should purchase these parts themselves in order to have something to build from once the season starts, and starter kits offer these parts for less money than they would be if bought individually. As will be discussed, options that don't involve kits exist and are certainly very useful, but sticking to parts designed for FTC is recommended for new teams as a starting point.
es_mx: Después de todo, muchos robots exitosos no han seguido este marco de trabajo. Sin embargo, aún recomendamos que los nuevos equipos compren un kit de inicio por una gran razón. Los equipos establecidos tienen garantizados tener repuestos disponibles para usar en la construcción de su próximo robot. Sin embargo, los equipos novatos, como es obvio, no tienen la gran cantidad de repuestos de temporadas anteriores para usar. Por lo tanto, los nuevos equipos deben comprar estos repuestos por sí mismos para tener algo con qué construir una vez que comience la temporada, y los kits de inicio ofrecen estos repuestos por menos dinero de lo que costarían si se compraran individualmente. Como se discutirá, existen opciones que no implican kits y ciertamente son muy útiles, pero se recomienda que los nuevos equipos se adhieran a los kits diseñados para FTC como punto de partida.
fr_ca: Après tout, de nombreux robots réussis n'ont pas suivi ce cadre. Cependant, nous recommandons toujours aux nouvelles équipes d'acheter un kit de démarrage pour une grande raison. Les équipes établies ont pratiquement toujours des pièces de rechange à disposition pour construire leur prochain robot. Cependant, les équipes débutantes, comme il est évident, ne disposent pas de la multitude de pièces provenant des saisons précédentes. Ainsi, les nouvelles équipes devraient acheter ces pièces elles-mêmes afin d’avoir quelque chose avec quoi construire une fois que la saison commence, et les kits de démarrage offrent ces pièces à un prix inférieur à celui d'achats individuels. Comme il sera abordé, il existe des options qui ne nécessitent pas de kits et qui sont certainement très utiles, mais il est recommandé aux nouvelles équipes de commencer avec des pièces conçues pour la FTC.
zh_cn: 毕竟，很多成功的机器人都没有遵循这个框架。不过，我们仍然建议新团队购买入门套件，这其中有一个重要原因。成熟的团队几乎都能保证有备用零件，可以用来制作下一个机器人。然而，新手队伍显然没有前几个赛季的大量零件可用。因此，新队伍应该自己购买这些零件，以便在赛季开始后有零件可用，而入门套件提供的这些零件比单独购买要便宜。正如将要讨论的那样，不涉及套件的选择也是存在的，而且肯定非常有用，但建议新团队以坚持使用为 FTC 设计的部件为起点。

source: Which Kit Should One Choose?
es_mx: ¿Qué kit debería elegir uno?
fr_ca: Quel Kit Devriez-Vous Choisir?
zh_cn: 应该选择哪种套件？

source: Choice of a kit is a matter of many a debate in FTC forums, and each team has their favorites. If you are a rookie team and do not have any experience with any of the kits above, we would recommend starting with a kit from either REV Robotics or goBILDA. These kits provide a good selection of parts, reliability, and value for money. They are easily expandable and great part flexibility allows for customization. Keep in mind that compatibility between kits varies and will be impacted by the unit system used.
es_mx: Elección de un kit es motivo de mucho debate en los foros de FTC, y cada equipo tiene sus favoritos. Si eres un equipo novato y no tienes experiencia con ninguno de los kits mencionados anteriormente, te recomendamos comenzar con un kit de REV Robotics o goBILDA. Estos kits ofrecen una buena selección de piezas, confiabilidad y relación calidad-precio. Son fácilmente expandibles y su gran flexibilidad permite la personalización. Ten en cuenta que la compatibilidad entre los kits varía y se verá afectada por el sistema de unidades utilizado.
fr_ca: Le choix d'un kit est souvent sujet à débat dans les forums FTC, et chaque équipe a ses préférences. Si vous êtes une équipe débutante et que vous n'avez aucune expérience avec l'un des kits mentionnés ci-dessus, nous vous recommandons de commencer avec un kit de REV Robotics ou goBILDA. Ces kits offrent une bonne sélection de pièces, une fiabilité et un excellent rapport qualité-prix. Ils sont facilement extensibles, et la grande flexibilité des pièces permet une personnalisation. Gardez à l'esprit que la compatibilité entre les kits varie et sera influencée par le système d'unités utilisé.
zh_cn: 在 FTC 论坛上，套件的选择是一个争论不休的问题，每个团队都有自己的最爱。如果您是新手团队，没有使用过上述任何套件的经验，我们建议您从 REV Robotics 或 goBILDA 的套件开始。这些套件提供了丰富的零件选择、可靠性和性价比。它们易于扩展，零件灵活性高，可以进行定制。请记住，套件之间的兼容性各不相同，而且会受到所使用的单元系统的影响。

source: goBILDA (metric) is slightly more expensive, but is easier to get started with. It has an extensive parts catalog and can be adapted to other build systems like REV. However, its price point may deter some teams with lesser budgets.
es_mx: goBILDA (métrico) es ligeramente más caro, pero es más fácil de empezar. Tiene un extenso catálogo de piezas y se puede adaptar a otros sistemas de construcción como REV. Sin embargo, su precio puede disuadir a algunos equipos con presupuestos más bajos.
fr_ca: goBILDA (en système métrique) est légèrement plus cher, mais il est plus facile à utiliser pour débuter. Il dispose d'un catalogue de pièces étendu et peut être adapté à d'autres systèmes de construction comme REV. Cependant, son prix peut dissuader certaines équipes ayant un budget plus limité.
zh_cn: goBILDA（公制）稍贵，但更容易上手。它拥有丰富的零件目录，并可与 REV 等其他构建系统相匹配。不过，它的价位可能会让一些预算较少的团队望而却步。

source: REV Robotics (metric) is slightly cheaper but generally has a bit higher learning curve than most other kits, as it is :term:`extrusion <Extrusion>` rather than :term:`channel <Channel>` based. :term:`Extrusion` takes more effort to work with (you need to cut aluminum extrusion to length); however, it allows for maximum design freedom and adjustability. REV is also available from the *FIRST* storefront, which might be convenient for teams doing their purchasing through official school procurement systems.
es_mx: REV Robotics (métrico) es ligeramente más barato, pero generalmente tiene una curva de aprendizaje un poco más alta que la mayoría de los otros kits, ya que es <Extrusion>:term:`extrusión en lugar de basarse en :term:`canal <Channel>`. La :term:`extrusión` requiere más esfuerzo para trabajar con ella (necesitas cortar la extrusión de aluminio a la longitud adecuada); sin embargo, permite una máxima libertad de diseño y ajustabilidad. REV también está disponible en la tienda *FIRST*, lo cual puede ser conveniente para los equipos que realizan sus compras a través de los sistemas oficiales de adquisiciones escolares.
fr_ca: REV Robotics (en système métrique) est légèrement moins cher, mais présente généralement une courbe d'apprentissage un peu plus élevée que la plupart des autres kits, car il est basé sur <Extrusion>de l'extrusion plutôt que sur des profilés<Channel>. L'extrusion nécessite plus d'effort pour travailler avec (vous devez couper l'extrusion en aluminium à la longueur souhaitée) ; cependant, elle offre une liberté de conception maximale et une grande ajustabilité. REV est également disponible sur la boutique FIRST, ce qui peut être pratique pour les équipes qui effectuent leurs achats via des systèmes d'approvisionnement scolaire officiels.
zh_cn: REV Robotics（公制）略微便宜一些，但学习曲线一般比其他大多数套件要高一些，因为它是基于 :term:`铝型材 <Extrusion>` 而不是 :term:`通道梁 <Channel>` 的。:term:`铝型材` 需要更多的精力来操作（你需要将铝型材切割成一定的长度）；但是，它允许最大的设计自由度和可调整性。REV也可从 *FIRST* 商店购买，这对于通过学校官方采购系统进行采购的团队来说可能比较方便。

source: Tetrix (metric and imperial) is probably the simplest system to work with, but its part selection is limited, and the use of :term:`4.7mm shaft <Shaft>` with :term:`set screws <Set Screw>` is inferior to :term:`clamping hubs <Clamping Hub>` used in other systems.
es_mx: Tetrix (métrico e imperial) es probablemente el sistema más simple para trabajar, pero su selección de piezas es limitada, y el uso de un <Shaft>eje de 4.7 mm con <Set Screw>tornillos de fijación es inferior a los <Clamping Hub>cubos de sujeción utilizados en otros sistemas.
fr_ca: TETRIX (en système métrique et impérial) est probablement le système le plus simple à utiliser, mais son choix de pièces est limité, et l'utilisation d'un arbre de 4,7 mm<Shaft> avec des vis de fixation<Set Screw> est inférieure aux moyeux de serrage<Clamping Hub> utilisés dans d'autres systèmes.
zh_cn: Tetrix（公制和英制）可能是最简单的系统，但其零件选择有限，使用 :term:`4.7mm shaft<Shaft>` 和 :term:`set screws<Set Screw>` 时不如其他系统中使用的 :term:`clamping hubs<Clamping Hub>`。

source: While VEX also sells some parts aimed towards FTC, **Game Manual 0 cannot endorse or support any VEX Robotics/IFI (VEX's parent company) products in any manner.** We cannot in good conscience drive people to support a business with a history of extremely concerning accusations of workplace harassment, toxicity, and general behavior that does not align with the ideals of *FIRST*.
es_mx: Mientras VEX también vende algunas piezas dirigidas hacia FTC, **Game Manual 0 no puede respaldar ni apoyar de ninguna manera los productos de VEX Robotics/IFI (compañía matriz de VEX).** No podemos, con buena conciencia, impulsar a las personas a apoyar un negocio con un historial de acusaciones extremadamente preocupantes de acoso laboral, toxicidad y comportamiento general que no se alinea con los ideales de *FIRST*.
fr_ca: Bien que VEX vende également certaines pièces destinées à la FTC, le** Manuel de Jeu 0 ne peut approuver ni soutenir d'aucune manière les produits de VEX Robotics/IFI (la société mère de VEX)**. Nous ne pouvons, en toute conscience, encourager les gens à soutenir une entreprise ayant un passé marqué par des accusations extrêmement préoccupantes de harcèlement en milieu de travail, de toxicité et de comportements généraux qui ne correspondent pas aux idéaux de *FIRST*.
zh_cn: 虽然 VEX 也销售一些针对 FTC 的部件，但**Game Manual 0 不能以任何方式认可或支持任何 VEX Robotics/IFI（VEX 的母公司）的产品。**我们不能昧着良心驱使人们去支持一个曾被指控在工作场所进行骚扰、有毒和不符合 *FIRST* 理想的一般行为的企业。
