Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/kit-glossary.po
Languages: es_mx, fr_ca

source: Kit Glossary
es_mx: Glosario de Kit
fr_ca: Glossaire du kit

source: Channel
es_mx: Canal
fr_ca: Profilé

source: Channel (more precisely called C-Channel) is aluminum that is in the profile of a C. (It is also sometimes called U-Channel.) Channel, along with :term:`extrusion <Extrusion>`, is the most common structural build element in FTC\ |reg|, and is found in Tetrix, REV, Actobotics, and goBILDA kits.
es_mx: Canal (más precisamente llamado C-Channel) es aluminio que está en el perfil de una C. (También a veces se le llama U-Channel.) Canal, junto con :term: `extrusión<Extrusion>`, es el elemento de construcción estructural más común en FTC\ |reg|, y se encuentra en los kits de Tetrix, REV, Actobotics y goBILDA.
fr_ca: Le profilé (plus précisément appelé profilé en C) est de l'aluminium qui a le profil d'un C. (Il est aussi parfois appelé profilé en U.) Le profilé, avec :term:`extrusion <Extrusion>`, est l'élément de construction structurelle le plus courant dans les kits FTC, et on le trouve dans les kits Tetrix, REV, Actobotics, et goBILDA.

source: Channel is fixed pitch, which means that there are pre-drilled holes that limit mounting to finite locations. It can be used to easily construct drivetrains; however, be aware that :term:`gear <Gear>` and :term:`chain <Chain>` mesh may not be with channel.
es_mx: El canal es de paso fijo, lo que significa que dispone de orificios pretaladrados que limitan el montaje a ubicaciones finitas. Puede utilizarse para construir fácilmente chasises; sin embargo, tenga en cuenta que los :term:`engranes <Gear>` y la :term:`cadena <Chain>` pueden no conjugar con canal.
fr_ca: Le profilé est à pas fixe, ce qui signifie qu'il comporte des trous pré-percés qui limitent le montage à des emplacements finis. Il peut être utilisé pour construire facilement des châssis ; cependant, il faut savoir que les maillages des :term:`engrenages <Gear>` et des :term:`chaines<Chain>` peuvent ne pas être compatibles avec le profilé.

source: A piece of tetrix channel
es_mx: Un trozo de canal tetrix
fr_ca: Un morceau de profilé tétrix

source: Extrusion
es_mx: Extrusión

source: Extrusion is aluminum shaped into slotted profiles able to accept certain types of hardware. For FTC, the most common is the 15mm extrusion, used in the REV and Misumi products. 15mm extrusion accepts M3 bolts and nuts (note that only regular M3 nuts can fit inside the slot, not :term:`locknuts <Locknut>`).
es_mx: La extrusión es aluminio conformado en perfiles ranurados capaces de aceptar determinados tipos de hardware. En el caso de FTC, la más común es la extrusión de 15 mm, utilizada en los productos REV y Misumi. La extrusión de 15 mm admite tornillos y tuercas M3 (tenga en cuenta que en la ranura sólo caben tuercas M3 normales, no :term:`tuercas de seguridad <Locknut>`).
fr_ca: L'extrusion est de l'aluminium façonné en profils fendus capables d'accepter certains types de matériel. Pour FTC, l'extrusion la plus courante est celle de 15 mm, utilisée dans les produits REV et Misumi. L'extrusion de 15 mm accepte les boulons et les écrous M3 (notez que seuls les écrous M3 ordinaires peuvent s'insérer dans la fente, et non les :term:`locknuts <Locknut>`).

source: Extrusion is not a fixed pitch system, allowing teams to adjust components as they wish. This makes it simple to achieve correct tension and put mechanisms where :term:`channel <Channel>` would limit mounting. The adjustability of extrusion is especially useful in precise situations, such as intake geometry. However, extra care must be taken to ensure components do not shift under load.
es_mx: La extrusión no es un sistema de paso fijo, lo que permite a los equipos ajustar los componentes como deseen. Esto simplifica la obtención de la tensión correcta y la colocación de mecanismos allí donde el :term:`canal <Channel>` limitaría el montaje. La ajustabilidad de la extrusión es especialmente útil en situaciones precisas, como la geometría del intake. Sin embargo, hay que tener especial cuidado para que los componentes no se desplacen bajo carga.
fr_ca: L'extrusion n'est pas un système à pas fixe, ce qui permet aux équipes d'ajuster les composants comme elles le souhaitent. Il est ainsi facile d'obtenir une tension correcte et de placer des mécanismes là où le :term:`profilé <Channel>` limiterait le montage. L'ajustabilité de l'extrusion est particulièrement utile dans des situations précises, telles que la géométrie de l'admission. Toutefois, il faut veiller à ce que les composants ne se déplacent pas sous l'effet de la charge.

source: A piece of REV Robotics extrusion
es_mx: Una pieza de extrusión de REV Robotics
fr_ca: Un morceau d'extrusion REV Robotics

source: Ball Bearing
es_mx: Rodamiento de bolas
fr_ca: Roulement à billes

source: Ball bearings refer to bearings with steel balls arranged in a circular fashion. This allows rotation of an element with less friction than a bushing, primarily because the surface area (or contact area) is much less than in a :term:`bushing <Bushing>`.
es_mx: Los rodamientos de bolas son rodamientos con bolas de acero dispuestas de forma circular. Esto permite la rotación de un elemento con menos fricción que un casquillo, principalmente porque la superficie (o área de contacto) es mucho menor que en un :term:`casquillo <Bushing>`.
fr_ca: Les roulements à billes sont des roulements dont les billes en acier sont disposées de manière circulaire. Cela permet la rotation d'un élément avec moins de frottement qu'une bague, principalement parce que la surface (ou zone de contact) est beaucoup plus petite que dans une :term:`bague <Bushing>`.

source: Bearings are definitely recommended for drivetrain and high speed usage. Bearings are used in the Actobotics, goBILDA, and REV kits, and are commonly sold by most robotics vendors.
es_mx: Los rodamientos se recomiendan sin duda para el chasis y el uso a alta velocidad. Los rodamientos se utilizan en los kits de Actobotics, goBILDA y REV, y la mayoría de los proveedores de robótica los venden habitualmente.
fr_ca: Les roulements sont absolument recommandés pour la transmission et l'utilisation à grande vitesse. Les roulements sont utilisés dans les kits Actobotics, goBILDA et REV, et sont vendus par la plupart des vendeurs de robots.

source: Actobotics dual ball bearing hub
es_mx: Actobotics Cubo de doble rodamiento de bolas
fr_ca: Moyeu à double roulement à billes Actobotics

source: Servoblocks
es_mx: Servobloques

source: Servoblocks, sold by Servocity/Actobotics/goBILDA, are a way to mount :term:`servos <Servo>` to the goBILDA and Actobotics systems. It is by far the best way to mount servos because it decreases the load on the servo spline, which is the weakest part of the servo. This is because under load, the servo spline teeth can easily become stripped, rendering the servo unusable. While Servoblocks are not cheap, they are one of the best investments for teams to pursue.
es_mx: Los servobloques, vendidos por Servocity/Actobotics/goBILDA, son una forma de montar :term:`servos <Servo>` en los sistemas goBILDA y Actobotics. Es la mejor manera de montar servos, ya que disminuye la carga en la ranura del servo, que es la parte más débil del servo. Esto se debe a que, bajo carga, los dientes de la ranura del servo se pueden desprender fácilmente, haciendo que el servo sea inutilizable. Aunque los Servobloques no son baratos, son una de las mejores inversiones para los equipos.
fr_ca: Les Servoblocks, vendus par Servocity/Actobotics/goBILDA, sont un moyen de monter :term:`servos <Servo>` sur les systèmes goBILDA et Actobotics. C'est de loin la meilleure façon de monter les servos car elle diminue la charge sur la cannelure du servo, qui est la partie la plus faible du servo. En effet, sous l'effet de la charge, les dents de la cannelure du servo peuvent facilement se dénuder, ce qui rend le servo inutilisable. Bien que les Servoblocks ne soient pas bon marché, ils constituent l'un des meilleurs investissements pour les équipes.

source: An Actobotics Servoblock
es_mx: Un Servobloque Actobotics
fr_ca: Un Servoblock d'Actobotics

source: An example of a servoblock being used on a robot
es_mx: Ejemplo de uso de un servobloque en un robot
fr_ca: Exemple d'utilisation d'un servoblock sur un robot

source: Clamping Hub
es_mx: Cubo de Apriete
fr_ca: Moyeu de serrage

source: A clamping hub is used to fixate part such as :term:`sprockets <Sprocket>` or :term:`gears <Gear>` on shafts. It is also used to prevent shafts from moving laterally. Unlike shaft collars, clamping hubs use screws to apply clamping force around the entire shaft, giving a better hold. As a result, clamping hubs are recommended over shaft collars.
es_mx: Un cubo de apriete se utiliza para fijar piezas como :term:`piñones <Sprocket>` o :term:`engranes <Gear>` en ejes. También se utiliza para evitar que los ejes se muevan lateralmente. A diferencia de los collarines para ejes, los cubos de apriete utilizan tornillos para aplicar la fuerza de sujeción alrededor de todo el eje, lo que proporciona una mejor sujeción. Por ello, se recomiendan más que los collarines.
fr_ca: Un moyeu de serrage est utilisé pour fixer des pièces telles que des :term:`pignons <Sprocket>` ou des :term:`engrenages <Gear>` sur des arbres. Il est également utilisé pour empêcher les arbres de se déplacer latéralement. Contrairement aux collets d'arbre, les moyeux de serrage utilisent des vis pour appliquer une force de serrage autour de l'ensemble de l'arbre, ce qui permet un meilleur maintien. Par conséquent, les moyeux de serrage sont recommandés par rapport aux collets d'arbre.

source: An Actobotics clamping hub
es_mx: Un cubo de apriete Actobotics
fr_ca: Un moyeu de serrage Actobotics

source: Bevel gear
es_mx: Engranes cónico
fr_ca: Engrenage conique

source: Bevel gears are :term:`gears <Gear>` that transfer power along different axes, which are perpendicular to each other. Bevel gears are generally considered more inefficient than regular gears.
es_mx: Los engranes cónicos son :term:`engranes <Gear>` que transfieren potencia a lo largo de diferentes ejes, perpendiculares entre sí. Los engranes cónicos suelen considerarse más ineficaces que los engranes normales.
fr_ca: Les engrenages coniques sont des :term:`engrenages <Gear>` qui transmettent la puissance le long de différents axes, qui sont perpendiculaires l'un à l'autre. Les engrenages coniques sont généralement considérés comme plus inefficaces que les engrenages ordinaires.

source: However, bevel gears can be very useful, especially in areas of limited space where the motor can be placed perpendicular to the element it is driving, and not in the same plane.
es_mx: Sin embargo, los engranes cónicos pueden ser muy útiles, sobre todo en zonas de espacio limitado donde el motor puede colocarse perpendicular al elemento que acciona, y no en el mismo plano.
fr_ca: Cependant, les engrenages coniques peuvent être très utiles, en particulier dans les zones où l'espace est limité et où le moteur peut être placé perpendiculairement à l'élément qu'il entraîne, et non dans le même plan.

source: 3736 Serious Business' use of bevel gears in Rover Ruckus
es_mx: 3736 El uso de engranes cónicos de Serious Business en Rover Ruckus
fr_ca: 3736 Serious Business' utilise les engrenages conique dans Rover Ruckus

source: Lead Screw
es_mx: Tornillo de Avance
fr_ca: Vis filetée

source: A lead screw is very similar to a threaded rod. It is used for high load and high torque application such as hanging. However, due to the nature of the threaded rod, lead screws are generally quite slow compared to linear slides. The speed of a lead screw is determined by two factors. The first is how fast the motor outputs, and the second is the number of threads per inch (TPI).
es_mx: Un tornillo de avance es muy similar a una varilla roscada. Se utiliza para aplicaciones de carga y torque elevados, como el colgado. Sin embargo, debido a la naturaleza de la varilla roscada, los tornillos de avance suelen ser bastante lentos en comparación con las guías lineales. La velocidad de éste viene determinada por dos factores. El primero es la velocidad de salida del motor, y el segundo es el número de roscas por pulgada (TPI).
fr_ca: Une vis filetée est très similaire à une tige filetée. Elle est utilisée pour des applications nécessitant une forte charge et un couple élevé, comme les systèmes de suspension. Cependant, en raison de la nature même de la tige filetée, les vis filetées sont généralement plus lentes que les glissières linéaires. La vitesse d’une vis filetée dépend de deux facteurs : la vitesse de rotation du moteur et le nombre de filets par pouce (TPI, “threads per inch”).

source: A leadscrew
es_mx: Un tornillo de avance
fr_ca: Une vis sans fin

source: Shaft
es_mx: Eje
fr_ca: Arbre

source: A shaft is a piece of shaped metal used in power transmission. Shafts are the primary method to transfer power from motor to wheel. Generally, shafts are made out of steel, so do not use a bandsaw to cut a shaft. Rather, use a hacksaw, as hacksaw blades can cut through steel. There are different kinds of bores in FTC, which are listed below.
es_mx: Un eje es una pieza metálica perfilada que se utiliza en la transmisión de potencia. Los ejes son el método principal para transferir potencia del motor a la rueda. Generalmente, los ejes están hechos de acero, por lo que no se debe utilizar una sierra de cinta para cortar un eje. En su lugar, utilice una sierra para metales, ya que las hojas de sierra pueden cortar el acero. Hay diferentes tipos de ejes en FTC, que se enumeran a continuación.
fr_ca: Un arbre est une pièce métallique façonnée utilisée dans la transmission de puissance. Les arbres constituent la principale méthode de transfert de la puissance du moteur à la roue. En général, les arbres sont fabriqués en acier, il ne faut donc pas utiliser une scie à ruban pour couper un arbre. Utilisez plutôt une scie à métaux, car les lames de cette dernière peuvent couper l'acier. Il existe différents types d'alésages dans la FTC, qui sont énumérés ci-dessous.

source: Round shaft
es_mx: Eje redondo
fr_ca: Arbre rond

source: D-shaft: has a flat part for set screws, otherwise round
es_mx: Eje D: tiene una parte plana para los tornillos de ajuste, por lo demás es redondo
fr_ca: Arbre en D : comporte une partie plate pour les vis de réglage, sinon il est rond.

source: Hex shaft: six sided shaft
es_mx: Eje hexagonal: eje de seis caras
fr_ca: Arbre hexagonal : arbre à six côtés

source: Rounded Hex shaft: hex shaft that's been rounded so that it can run in round bearings
es_mx: Eje hexagonal redondeado: eje hexagonal que se ha redondeado para que pueda funcionar en cojinetes redondos.
fr_ca: Arbre hexagonal arrondi : arbre hexagonal arrondi pour pouvoir fonctionner dans des roulements ronds.

source: Keyed shaft: round shaft which has a keyway (a slot) through the shaft
es_mx: Eje con chaveta: eje redondo que tiene un chavetero (una ranura) a través del eje.
fr_ca: Arbre claveté : arbre rond traversé par une rainure de clavette (une fente).

source: Locknut
es_mx: Contratuerca
fr_ca: Contre-écrou

source: A locknut is a nut that resists vibration by the nyloc inside. Nyloc is a type of plastic that holds the bolt securely on to the nut when it is screwed in. It is advised that teams purchase locknuts instead of regular nuts as FTC mechanisms often become loose over time.
es_mx: Una contratuerca es una tuerca que resiste las vibraciones gracias al nyloc que lleva en su interior. El nyloc es un tipo de plástico que sujeta firmemente el tornillo a la tuerca cuando se enrosca. Se aconseja que los equipos compren contratuercas en lugar de tuercas normales, ya que los mecanismos FTC suelen aflojarse con el tiempo.
fr_ca: Un contre-écrou est un écrou qui résiste aux vibrations grâce au nyloc qu'il contient. Le nyloc est un type de plastique qui maintient fermement le boulon sur l'écrou lorsqu'il est vissé. Il est conseillé aux équipes d'acheter des contre-écrous plutôt que des écrous ordinaires, car les mécanismes FTC se desserrent souvent avec le temps.

source: Bushing
es_mx: Casquillo
fr_ca: Bague

source: A bushing is primarily mounted on the outside of a :term:`shaft <Shaft>`. It rotates in a pillow block, which holds the bushing. Generally, both are made out of a low-friction material such as Delrin or bronze.
es_mx: Un casquillo se monta principalmente en el exterior de un :term:`eje <Shaft>`. Gira en un bloque de almohada, que sujeta el casquillo. Por lo general, ambos están hechos de un material de baja fricción, como Delrin o bronce.
fr_ca: Une bague est principalement montée à l'extérieur d'un :term:`arbre <Shaft>`. Elle tourne dans un bloc d'appui qui la maintient. En général, les deux sont fabriqués dans un matériau à faible frottement tel que le Delrin ou le bronze.

source: Bushings are less efficient than :term:`ball bearings <Ball Bearing>` because they have a larger surface of contact, but are acceptable for low-load situations or low-budget teams.
es_mx: Los casquillos son menos eficientes que los :term:`rodamientos de bolas <Ball Bearing>` porque tienen una mayor superficie de contacto, pero son aceptables para situaciones de baja carga o equipos de bajo presupuesto.
fr_ca: Les bagues sont moins efficaces que les :term:`roulements à billes <Ball Bearing>` car elles ont une plus grande surface de contact, mais elles sont acceptables pour les situations de faible charge ou pour les équipes à petit budget.

source: A REV Robotics bushing
es_mx: Un casquillo REV Robotics
fr_ca: Une douille REV Robotics

source: REV Bushing
es_mx: Casquillo REV
fr_ca: Douille REV

source: A REV Robotics pillow block
es_mx: Un bloque de almohada de REV Robotics
fr_ca: Un palier REV Robotics

source: REV Pillow Block
es_mx: Un bloque de almohada de REV
fr_ca: Palier REV

source: Churro is a 1/2" or 3/8" hex product sold by AndyMark. It has a bore that is easily tapped to accommodate 1/4-20 and 1/4-28 bolts, and is commonly used as a large :term:`standoff <Standoff>`. It is light and cheap compared to other hex products.
es_mx: Churro es un producto hexagonal de 1/2" o 3/8" vendido por AndyMark. Tiene un agujero que es fácilmente roscado para acomodar 1/4-20 y 1/4-28 pernos, y se utiliza comúnmente como un gran :term:`standoff <Standoff>`. Es ligero y barato en comparación con otros productos hexagonales.
fr_ca: Churro est un produit hexagonal de 1/2" ou 3/8" vendu par AndyMark. Il possède un alésage facilement taraudable pour accueillir des boulons 1/4-20 et 1/4-28, et il est couramment utilisé comme grand :term:`entretoise <Standoff>`. Il est léger et bon marché par rapport à d'autres produits hexagonaux.

source: Using churro as :term:`shaft <Shaft>` is highly discouraged, as it is slightly undersized as well as prone to twisting.
es_mx: Se desaconseja utilizar churro como :term:`eje <Shaft>`, ya que su tamaño es ligeramente inferior y tiende a torcerse.
fr_ca: L'utilisation du churro comme :term:`arbre <Shaft>` est fortement déconseillée, car il est légèrement sous-dimensionné et a tendance à se tordre.

source: A piece of churro
es_mx: Un trozo de churro
fr_ca: Un morceau de churro

source: Set Screw
es_mx: Tornillo de ajuste
fr_ca: Vis de Réglage

source: A set screw is generally a hex socket screw that is used to fasten parts such as :term:`sprockets <Sprocket>` or :term:`gears <Gear>` to a :term:`shaft <Shaft>`, or to fix a shaft in place so that it doesn't move around. Due to the hex socket, allen keys must be used to tighten and loosen set screws.
es_mx: Un tornillo de ajuste suele ser un tornillo de hexágono interior que se utiliza para fijar piezas como :term:`piñones <Sprocket>` o :term:`engranes <Gear>` a un :term:`eje <Shaft>`, o para fijar un eje en su sitio de forma que no se mueva. Debido al hexágono interior, deben utilizarse llaves Allen para apretar y aflojar los tornillos de fijación.
fr_ca: Une vis de réglage est généralement une vis à six pans creux utilisée pour fixer des pièces telles que :term:`bagues <Sprocket>` ou des :term:`roulements à billes <Gear>` à un :term:`arbre <Shaft>`, ou pour fixer un arbre en place afin qu'il ne bouge pas. En raison de la douille hexagonale, il faut utiliser des clés Allen pour serrer et desserrer les vis de réglage.

source: **Set screws are not recommended for drivetrain and high-load applications** since there is very little surface area in contact with the shaft (only the tip of the screw). This makes the set screw likely to damage the shaft. Therefore, set screws can become loose very easily.
es_mx: **Los tornillos de ajuste no se recomiendan para aplicaciones de chasis y de alta carga**, ya que hay muy poca superficie en contacto con el eje (sólo la punta del tornillo). Esto hace que el tornillo de fijación pueda dañar el eje. Por lo tanto, los tornillos de ajuste pueden aflojarse muy fácilmente.
fr_ca: **Les vis de réglage ne sont pas recommandées pour les applications de transmission et les applications à forte charge**, car la surface en contact avec l'arbre est très faible (seule la pointe de la vis). La vis de réglage risque donc d'endommager l'arbre. Par conséquent, les vis de réglage peuvent se desserrer très facilement.

source: If set screws must be used, then it is imperative to use :term:`Loctite` to reduce the chance of them shaking loose.
es_mx: Si es necesario utilizar tornillos de ajuste, es imprescindible utilizar :term:`Loctite` para reducir la posibilidad de que se aflojen.
fr_ca: Si des vis de fixation doivent être utilisées, il est impératif d'utiliser :term:`Loctite` pour réduire le risque qu'elles se détachent.

source: :term:`Clamping hubs <Clamping Hub>` are much preferred to set screws, as clamping hubs apply pressure to the whole diameter of the shaft, as opposed to just one point.
es_mx: :term:`Los cubos de apriete <Clamping Hub>` son muy preferibles a los tornillos de ajuste, ya que los cubos de apriete ejercen presión sobre todo el diámetro del eje, en lugar de sobre un solo punto.
fr_ca: Les :term:`moyeux de serrage <Clamping Hub>` sont de loin préférables aux vis de réglage, car les moyeux de serrage exercent une pression sur tout le diamètre de l'arbre, et non sur un seul point.

source: A set screw
es_mx: Un tornillo de ajuste
fr_ca: Une vis de réglage

source: Shaft Collar
es_mx: Collarín del eje
fr_ca: Collier d'Arbre

source: A shaft collar, which has a :term:`set screw <Set Screw>`, is fitted on to a shaft in order to secure parts.
es_mx: Un collarín de eje, que tiene un :term:`tornillo de ajuste <Set Screw>`, se monta en un eje para fijar piezas.
fr_ca: Un collier d'arbre, avec :term:`vis de pression <Set Screw>`, est monté sur un arbre afin de fixer des pièces.

source: A shaft collar
es_mx: Un collar del eje
fr_ca: Un collier d'arbre

source: Bore
es_mx: Taladro
fr_ca: Alésage

source: The bore refers to the shape of the opening that the shaft is inserted into. For example, the bore for a 5 mm hex :term:`shaft <Shaft>` is the hexagonal shape.
es_mx: El taladro se refiere a la forma de la abertura en la que se inserta el eje. Por ejemplo, el orificio de un eje hexagonal de 5 mm del :term:`eje <Shaft>` tiene forma hexagonal.
fr_ca: L'alésage désigne la forme de l'ouverture dans laquelle l'arbre est inséré. Par exemple, l'alésage d'un :term:`arbre <Shaft>` hexagonal de 5 mm est de forme hexagonale.
