Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/kit-glossary.po
Languages: es_mx, fr_ca

source: "Stripping the bore" means that over time, the bore will lose its hexagonal shape, and become close to a circular shape, rendering the bore (and subsequently, the part it is on) useless.
es_mx: "Desnudar el taladro" significa que, con el tiempo, el taladro perderá su forma hexagonal, y se acercará a una forma circular, inutilizando el taladro (y, posteriormente, la pieza en la que se encuentra).
fr_ca: Le "décapage de l'alésage" signifie qu'avec le temps, l'alésage perd sa forme hexagonale et se rapproche d'une forme circulaire, ce qui rend l'alésage (et par la suite la pièce sur laquelle il se trouve) inutilisable.

source: A bearing with a hex bore
es_mx: Un rodamiento con agujero hexagonal
fr_ca: Un roulement avec un alésage hexagonal

source: Clamp Mounting
es_mx: Montaje con abrazadera
fr_ca: Montage par serrage

source: Clamp mounting refers to securing a motor primarily by using friction instead of screws attached to the motor itself. This is generally discouraged as the motor can become loosened over time.
es_mx: El montaje con abrazaderas se refiere a la fijación de un motor principalmente mediante fricción en lugar de tornillos fijados al propio motor. Por lo general, se desaconseja, ya que el motor puede aflojarse con el tiempo.
fr_ca: Le montage par serrage consiste à fixer un moteur principalement par friction au lieu d'utiliser des vis fixées au moteur lui-même. Cette méthode est généralement déconseillée, car le moteur peut se desserrer avec le temps.

source: Use friction tape around the surface of the motor that is clamped down so that it will have less chance of moving around.
es_mx: Utiliza cinta de fricción alrededor de la superficie del motor que está sujeta para que tenga menos posibilidades de moverse.
fr_ca: Utilisez du ruban adhésif autour de la surface du moteur qui est fixé afin qu'il ait moins de chance de bouger.

source: A TETRIX v1 motor attached with a TETRIX Clamp Mount
es_mx: Un motor TETRIX v1 fijado con un montaje de abrazadera TETRIX
fr_ca: Un moteur TETRIX v1 fixé à l’aide d’un support de serrage TETRIX

source: TETRIX clamp mount and v1 motor
es_mx: Montaje de abrazadera TETRIX y motor v1
fr_ca: Support de serrage TETRIX et moteur TETRIX v1

source: Face Mounting
es_mx: Montaje frontal
fr_ca: Montage frontal

source: Face mounting refers to mounting the motor by affixing the motor directly to the mount using bolts. This is the preferable way of mounting the motor (compared to :term:`clamp mounting <Clamp Mounting>`) because it is less likely to loosen over time, especially with the use of :term:`Loctite` on the bolts.
es_mx: El montaje frontal consiste en fijar el motor directamente al soporte mediante pernos. Esta es la forma preferible de montar el motor (en comparación con :term:`montaje de abrazadera <Clamp Mounting>`) porque es menos probable que se afloje con el tiempo, especialmente con el uso de :term:`Loctite` en los tornillos.
fr_ca: Le montage frontal consiste à fixer le moteur directement sur le support à l'aide de boulons. C'est la meilleure façon de monter le moteur (par rapport au :term:`montage en serrage <Clamp Mounting>`) car il est moins susceptible de se desserrer avec le temps, en particulier avec l'utilisation de :term:`Loctite` sur les boulons.

source: It is advisable that 4-6 bolts be used to face mount for redundancy.
es_mx: Es aconsejable utilizar de 4-6 tornillos para el montaje frontal por redundancia.
fr_ca: Il est conseillé d'utiliser 4-6 boulons pour le montage frontal afin d'assurer la redondance.

source: Additionally, there is no way that the motor might rotate and cause a loss of tension in :term:`belts <Timing Belt>` or :term:`chain <Chain>`.
es_mx: Además, no hay forma de que el motor gire y provoque una pérdida de tensión en :term:`correas <Timing Belt>` o :term:`cadena <Chain>`.
fr_ca: En outre, il est impossible que le moteur tourne et provoque une perte de tension des :term:`courroies <Timing Belt>` ou des :term:`profilés <Chain>`.

source: A REV Robotics v2 motor facemounted to a plate
es_mx: Un motor REV Robotics v2 montado en una placa
fr_ca: Un moteur REV Robotics v2 monté en face d'une plaque

source: REV v2 Motor Facemounted
es_mx: REV v2 Montaje frontal del motor
fr_ca: Moteur REV v2 monté en face
