Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/rev-robotics.po
Languages: es_mx, fr_ca, zh_cn

source: M3 bolts, especially those sold directly by REV, are prone to bending under higher load (such as when used as an :term:`axle <Shaft>` for a pulley)
es_mx: Los tornillos M3, especialmente los vendidos directamente por REV, son propensos a doblarse bajo cargas elevadas (como cuando se utilizan como :term:`eje <Shaft>` para una polea).
fr_ca: Les boulons M3, en particulier ceux vendus directement par REV, sont susceptibles de se plier sous une charge plus importante (comme lorsqu'ils sont utilisés comme l' :term:`axe <Shaft>` pour une poulie).
zh_cn: M3 螺栓，尤其是 REV 直接出售的那些，在较大负载下容易弯曲（例如用作 :term:`axle<Shaft>` 滑轮的轴时）

source: 5 mm hex :term:`shaft <Shaft>` is also prone to bending, especially if the :term:`shaft <Shaft>` is long.
es_mx: El :term:`eje <Shaft>` hexagonal de 5 mm también es propenso a doblarse, especialmente si el :term:`eje <Shaft>` es largo.
fr_ca: Un :term:`arbre <Shaft>` hexagonal de 5 mm est également susceptible de se déformer, surtout si l' :term:`arbre <Shaft>` est long.
zh_cn: 5 毫米六角 :term:`shaft<Shaft>` 也容易弯曲，尤其是在 :term:`shaft<Shaft>` 较长的情况下。

source: 7161 ViperBots Hydra's Relic Recovery robot
fr_ca: Récupération de la relique de 7161 ViperBots Hydra
zh_cn: 7161 ViperBots Hydra队伍的 Relic Recovery 机器人

source: 7161 ViperBots Hydra, Finalist Alliance 1st Pick (Houston), Relic Recovery
es_mx: 7161 ViperBots Hydra, Alianza Finalista 1er Pick (Houston), Relic Recovery
zh_cn: 7161 ViperBots Hydra，入围联盟第一选拔赛（于休斯顿举办），Relic Recovery

source: 9889 Cruise Control's Relic Recovery robot
fr_ca: 9889 Cruise Control robot Relic Recovery
zh_cn: 9889 Cruise Control队伍的 Relic Recovery机器人

source: 6299 ViperBots QuadX's Velocity Vortex robot
es_mx: 6299 ViperBots Robot Velocity Vortex de QuadX
zh_cn: 6299 ViperBots QuadX队伍的 Velocity Vortex 机器人

source: 11115 Gluten Free's Relic Recovery robot
zh_cn: 11115 Gluten Free队伍的 Relic Recovery 机器人

source: 11115 Gluten Free used both REV and Actobotics for the 2017-2018 season. Finalist Alliance Captain (Detroit), Relic Recovery
es_mx: 11115 Gluten Free utilizó tanto REV como Actobotics en la temporada 2017-2018.Capitán de la Alianza Finalista (Detroit), Relic Recovery.
fr_ca: 11115 Gluten Free a utilisé à la fois REV et Actobotics pour la saison 2017-2018. Finaliste Capitaine de l'Alliance (Détroit), Relic Recovery
zh_cn: 11115 Gluten Free队伍在 2017-2018 赛季同时使用了 REV 和 Actobotics。入围联盟队长（于底特律举办），Relic Recovery
