Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/rev-robotics.po
Languages: es_mx, fr_ca, zh_cn

source: REV Robotics
es_mx: Robótica REV
zh_cn: REV 机器人

source: The REV kit is an infinite-pitch, :term:`extrusion <Extrusion>` based building system which uses the metric system and M3 hardware.
es_mx: El kit REV es un sistema de construcción de paso infinito basado en :term:`extrusión <Extrusion>` que utiliza el sistema métrico decimal y herrajes M3.
fr_ca: Le kit REV est un système de construction à pas infini, :term:`extrusion <Extrusion>`, qui utilise le système métrique et la quincaillerie M3.
zh_cn: REV 套件是一种无限间距、基于 :term:`挤压式 <Extrusion>` 的建筑系统，使用公制系统和 M3 硬件。

source: Special Considerations
es_mx: Consideraciones especiales
fr_ca: Considérations particulières
zh_cn: 特殊考虑因素

source: The REV ecosystem is based upon 15x15mm aluminum :term:`extrusion <Extrusion>` and is complemented by 45x45mm :term:`channels <Channel>`.
es_mx: El ecosistema REV se basa en la :term:`extrusión <Extrusion>` de aluminio de 15x15 mm y se complementa con :term:`canales <Channel>` de 45x45 mm.
fr_ca: L'écosystème REV est basé sur une :term:`extrusion <Extrusion>` en aluminium de 15x15 mm et est complété par des :term:`profilés <Channel>` de 45x45 mm.
zh_cn: REV 生态系统以 15x15mm 铝 :term:`extrusion<Extrusion>` 为基础，辅以 45x45mm :term:`channels<Channel>`。

source: With :term:`extrusion <Extrusion>`, there are no fixed mounting holes, increasing adjustability and flexibility. For example, tensioning :term:`chain <Chain>` is simple when sliding the mount or bracket increases tension.
es_mx: Con :term:`extrusión <Extrusion>`, no hay orificios de montaje fijos, lo que aumenta la capacidad de ajuste y la flexibilidad. Por ejemplo, tensar la :term:`cadena <Chain>` es sencillo cuando al deslizar el montaje o el soporte se aumenta la tensión.
fr_ca: Avec :term:`extrusion <Extrusion>`, il n'y a pas de trous de fixation fixes, ce qui accroît la flexibilité et l'adaptabilité. Par exemple, il est facile de tendre la :term:`chaîne <Chain>` en faisant glisser le support ou l'étrier pour augmenter la tension.
zh_cn: 使用 :term:`extrusion<Extrusion>` 时，没有固定的安装孔，增加了可调节性和灵活性。例如，当滑动安装座或支架增加张力时，张紧 :term:`chain<Chain>` 非常简单。

source: The REV system uses metric dimensions (15 mm extrusion, M3 hardware), with the exception of #25 roller :term:`chain <Chain>` (FTC\ |reg| standard, imperial).
es_mx: El sistema REV utiliza dimensiones métricas (extrusión de 15 mm, tornillería M3), con la excepción del rodillo #25 :term:`cadena <Chain>` (FTC\ |reg| estándar, imperial).
fr_ca: Le système REV utilise des dimensions métriques (extrusion de 15 mm, quincaillerie M3), à l'exception du rouleau n° 25 :term:`chaîne <Chain>` (norme FTC\ |reg|, impériale).
zh_cn: REV 系统使用公制尺寸（15 毫米挤压结构，M3 硬件），但 #25 滚轮 :term:`chain<Chain>`（FTC||reg|标准，英制）除外。

source: REV has purposefully designed with compatibility in mind, as pattern adapters ease compatibility issues.
es_mx: REV ha diseñado a propósito pensando en la compatibilidad, ya que los adaptadores de patrones facilitan los problemas de compatibilidad.
fr_ca: REV a été conçu dans un souci de compatibilité, car les adaptateurs de modèles facilitent les problèmes de compatibilité.
zh_cn: REV 在设计时特意考虑了兼容性，因为模式适配器可以缓解兼容性问题。

source: Many REV parts are made of Delrin, a high-wear resistance plastic, which reduces overall cost. However, REV offers aluminum options for high-load parts as well.
es_mx: Muchas piezas REV están fabricadas de Delrin, un plástico de alta resistencia al desgaste, lo que reduce el coste total. Sin embargo, REV también ofrece opciones de aluminio para piezas de alta carga.
fr_ca: De nombreuses pièces REV sont fabriquées en Delrin, un plastique à haute résistance à l'usure, ce qui réduit le coût global. Toutefois, REV propose également des options en aluminium pour les pièces à forte charge.
zh_cn: REV的许多部件都由高耐磨塑料Delrin制成，从而降低了总体成本。不过，REV也为高负荷部件提供铝制选择。

source: REV does have a steeper learning curve than :term:`channel <Channel>` based build systems, owing to the fact that constructing structurally sound mechanisms requires just a little more thought.
es_mx: REV tiene una curva de aprendizaje más pronunciada que los sistemas de construcción basados en :term:`canales <Channel>`, debido a que la construcción de mecanismos estructuralmente sólidos requiere un poco más de reflexión.
fr_ca: REV a une courbe d'apprentissage plus raide que les systèmes de construction basés sur :term:`profilés <Channel>`, en raison du fait que la construction de mécanismes structurellement sains nécessite un peu plus de réflexion.
zh_cn: 与基于 :term:`channel<Channel>` 的构建系统相比，REV 的学习曲线确实要陡峭一些，因为构建结构合理的机构需要更多的思考。

source: Notable components
es_mx: Componentes destacados
fr_ca: Composants remarquables
zh_cn: 重要组件

source: REV's bread and butter is the 15x15mm aluminum :term:`extrusion <Extrusion>`. It accepts M3 hex screws which slide along the grooves.
es_mx: El pan de cada día de REV es el aluminio de 15x15mm :term:`extrusión <Extrusion>`. Acepta tornillos hexagonales M3 que se deslizan a lo largo de las ranuras.
fr_ca: Le produit phare de REV est l'extrusion en aluminium de 15x15 mm :term:`extrusion <Extrusion>`. Il accepte des vis hexagonales M3 qui glissent le long des rainures.
zh_cn: REV 的基础必需品是 15x15mm 铝型材 :term:`挤压结构 <Extrusion>`。它可以使用 M3 六角螺丝沿着凹槽滑动。

source: In addition, REV also offers both 45x45mm :term:`U-channel <Channel>` and 45x45mm :term:`C-channel <Channel>`, which is stronger than :term:`extrusion <Extrusion>` and provides stiffness and support when needed.
es_mx: Además, REV también ofrece el :term:`canal en U <Channel>` de 45x45 mm y el :term:`canal en C <Channel>` de 45x45 mm, que es más resistente que la :term:`extrusión <Extrusion>` y proporciona rigidez y soporte cuando es necesario.
fr_ca: En outre, REV propose également des :term:`profilés en U <Channel>` 45x45mm et des :term:`profilés en C <Channel>` 45x45mm, qui sont plus résistants que :term:`extrusion <Extrusion>` et qui offrent une rigidité et un soutien en cas de besoin.
zh_cn: 此外，REV 还提供 45x45mm :term:`U-channel<Channel>` 和 45x45mm :term:`C-channel<Channel>`，其强度高于 :term:`extrusion<Extrusion>`，并在需要时提供刚度和支撑。

source: REV also offers punch tubing for teams wanting a more permanent mounting system while having the flexibility of extrusion.
es_mx: REV también ofrece tubos perforados para los equipos que desean un sistema de montaje más permanente, pero con la flexibilidad de la extrusión.
fr_ca: REV propose également des tubes perforés pour les équipes qui souhaitent un système de montage plus permanent tout en bénéficiant de la flexibilité de l'extrusion.
zh_cn: REV 还提供冲压管，供需要更永久性安装系统的团队使用，同时具有挤压的灵活性。

source: REV uses 5 mm hex steel :term:`shafts <Shaft>` and a :term:`ball-bearing <Ball Bearing>` motion support system. The shaft may be cut to length, which can be very useful for certain use cases. Many vendors have added compatibility to 5 mm hex :term:`shaft <Shaft>`.
es_mx: REV utiliza ejes <Shaft>de acero hexagonal de 5 mm y un sistema de soporte de movimiento con rodamiento de bolas<Ball Bearing>. El eje puede cortarse a medida, lo que puede resultar muy útil para determinados casos de uso. Muchos proveedores han añadido compatibilidad con ejes <Shaft>hexagonales de 5 mm `.
fr_ca: REV utilise des :term:`arbres en acier hexagonal de 5 mm <Shaft>` et un :term:`roulement à billes <Ball Bearing>` système de support de mouvement. L'arbre peut être coupé à la longueur voulue, ce qui peut s'avérer très utile dans certains cas d'utilisation. De nombreux fournisseurs ont ajouté la compatibilité avec l'arbre :term:`shaft <Shaft>` hexagonal de 5 mm.
zh_cn: REV 使用 5 毫米六角钢 :term:`shafts<Shaft>` 和一个 :term:`ball-bearing<Ball Bearing>` 运动支撑系统。轴可按长度切割，这在某些情况下非常有用。许多供应商都增加了 5 毫米六角 :term:`shaft<Shaft>` 的兼容性。

source: REV offers 3 types of :term:`HD HEX motors <HD Hex Motor>`: spur gear, planetary, and UltraPlanetary motors. The UltraPlanetary has customizable planetary ring gear ratios for a very affordable price.
es_mx: REV ofrece 3 tipos de motores :term:`HD HEX <HD Hex Motor>`: de engranajes rectos, planetarios y UltraPlanetary. El UltraPlanetary tiene relaciones de engranaje planetario personalizables por un precio muy accesible.
fr_ca: REV propose 3 types de :term:`moteurs HD HEX <HD Hex Motor>` : moteurs à engrenages droits, moteurs planétaires et moteurs UltraPlanetary. Le moteur UltraPlanetary a des rapports de couronne planétaire personnalisables pour un prix très abordable.
zh_cn: REV 提供 3 种类型的 :term:`HD HEX 电机<HD Hex Motor>`：直齿轮电机、行星电机和 UltraPlanetary 电机。UltraPlanetary 具有可定制的行星环形齿轮比，价格非常实惠。

source: REV also has pattern adapters for other systems built into many parts such as the aluminum brackets.
es_mx: REV también tiene adaptadores de patrón para otros sistemas incorporados en muchas piezas, como los soportes de aluminio.
fr_ca: REV dispose également d'adaptateurs de modèles pour d'autres systèmes, intégrés dans de nombreuses pièces telles que les supports en aluminium.
zh_cn: REV 还在铝制支架等许多部件中内置了用于其他系统的模式适配器。

source: Verdict
es_mx: Veredicto
zh_cn: 建议

source: **The REV kit is good for teams willing to invest the time into an extrusion building system.** It is the most flexible kit as it is extrusion based, yet it has the ability to integrate :term:`channel <Channel>` along with :term:`extrusion <Extrusion>`. REV offers the option to upgrade parts for those wanting a further investment into the REV building system.
es_mx: **Es el kit más flexible, ya que se basa en la extrusión, pero tiene la capacidad de integrar :term:`canal <Channel>` junto con :term:`extrusión <Extrusion>`. REV ofrece la opción de actualizar las piezas para aquellos que deseen una mayor inversión en el sistema de construcción REV.
fr_ca: **C'est le kit le plus flexible car il est basé sur l'extrusion, mais il a la capacité d'intégrer le :term:`profilé <Channel>` en même temps que l' :term:`extrusion <Extrusion>`. REV offre la possibilité d'améliorer les pièces pour ceux qui souhaitent investir davantage dans le système de construction REV.
zh_cn: **REV套件适合愿意在挤压成型建筑系统上投入时间的团队。**它是最灵活的套件，因为它以挤压成型为基础，但也可以集成:term:`channel<Channel>`和:term:`extrusion<Extrusion>`。REV 为希望进一步投资 REV 建筑系统的用户提供升级部件的选择。

source: One advantage to the REV kit is the compatibility of 15x15mm MiSUMI :term:`extrusion <Extrusion>`.
es_mx: Una ventaja del kit REV es la compatibilidad con MiSUMI :term:`extrusión <Extrusion>` de 15x15 mm.
fr_ca: L'un des avantages du kit REV est la compatibilité avec le MiSUMI :term:`extrusion <Extrusion>` 15x15mm.
zh_cn: REV 套件的一个优势是兼容 15x15mm MiSUMI :term:`extrusion<Extrusion>`。

source: 15x15mm REV :term:`extrusion <Extrusion>` isn't as structurally strong as MiSUMI for two reasons.
es_mx: 15x15mm REV :term:`extrusión <Extrusion>` no es tan resistente estructuralmente como MiSUMI por dos razones.
fr_ca: 15x15mm REV :term:`extrusion <Extrusion>` n'est pas aussi solide structurellement que MiSUMI pour deux raisons.
zh_cn: 15x15mm REV :term:`extrusion<Extrusion>` 结构强度不如 MiSUMI，原因有二。

source: REV extrusion is 6063 aluminum, while MiSUMI :term:`extrusion <Extrusion>` is made out of A6N01SS-T5 aluminum, a stronger and stiffer alloy.
es_mx: La extrusión REV es de aluminio 6063, mientras que MiSUMI en :term:`extrusión <Extrusion>` está fabricado con aluminio A6N01SS-T5, una aleación más resistente y rígida.
fr_ca: L'extrusion REV est en aluminium 6063, tandis que MiSUMI :term:`extrusion <Extrusion>` est en aluminium A6N01SS-T5, un alliage plus solide et plus rigide.
zh_cn: REV 型材是 6063 铝，而 MiSUMI :term:`extrusion<Extrusion>` 是由 A6N01SS-T5 铝制成，这是一种强度更高、硬度更大的合金。

source: The MiSUMI :term:`extrusion <Extrusion>` has a larger surface area, so there is more area of contact.
es_mx: MiSUMI :term:`extrusion <Extrusion>` tiene una superficie mayor, por lo que hay más área de contacto.
fr_ca: Le MiSUMI :term:`extrusion <Extrusion>` a une plus grande surface, donc une plus grande surface de contact.
zh_cn: MiSUMI :term: `挤压结构<Extrusion>` 的表面积更大，因此接触面积也更大。

source: MiSUMI offers greater strength at a lower bulk cost. Additionally, MiSUMI will cut to the half millimeter for free, making it a great option for teams needing an exact cut. The drawback to MiSUMI is that it is quite a bit heavier than the REV :term:`extrusion <Extrusion>`. It is encouraged that teams use MiSUMI for drivetrain and structural support, and REV for mechanisms that will be under low to medium load.
es_mx: MiSUMI ofrece una mayor resistencia a un menor coste por mayoreo. Además, MiSUMI corta al medio milímetro de forma gratuita, por lo que es una gran opción para los equipos que necesitan un corte exacto. El inconveniente de MiSUMI es que es bastante más pesado que REV :term:`extrusion <Extrusion>`. Se recomienda a los equipos que utilicen MiSUMI para el chasis y el soporte estructural, y REV para los mecanismos que vayan a estar sometidos a una carga baja o media.
fr_ca: MiSUMI offre une plus grande résistance à un coût de gros inférieur. En outre, MiSUMI coupe gratuitement au demi-millimètre près, ce qui en fait une excellente option pour les équipes qui ont besoin d'une coupe exacte. L'inconvénient de MiSUMI est qu'il est un peu plus lourd que le REV :term:`extrusion <Extrusion>`. Il est recommandé aux équipes d'utiliser MiSUMI pour le groupe motopropulseur et le support structurel, et REV pour les mécanismes qui seront soumis à une charge faible à moyenne.
zh_cn: MiSUMI 以更低的批量成本提供更高的强度。此外，MiSUMI 还可以免费切割到半毫米，这对于需要精确切割的团队来说是个不错的选择。MiSUMI 的缺点是比 REV :term: `挤压结构<Extrusion>`重一些。我们鼓励参赛队将 MiSUMI 用于传动系统和结构支撑，而将 REV 用于承受中低负荷的机构。

source: REV also sells punch tubing, which is 15 mm aluminum tubing that allows teams to use the 15 mm REV building system without having the disadvantages of :term:`extrusion <Extrusion>`, such as that parts come loose over time.
es_mx: REV también vende tubos perforados, que son tubos de aluminio de 15 mm que permiten a los equipos utilizar el sistema de construcción REV de 15 mm sin tener las desventajas de :term:`extrusión <Extrusion>`, como que las piezas se suelten con el tiempo.
fr_ca: REV vend également des tubes perforés, qui sont des tubes en aluminium de 15 mm permettant aux équipes d'utiliser le système de construction REV de 15 mm sans avoir les inconvénients de :term:`extrusion <Extrusion>`, comme le fait que les pièces se détachent avec le temps.
zh_cn: REV 还销售冲压管，这是一种 15 毫米的铝管，可让团队使用 15 毫米的 REV 建筑系统，而不会有 :term: `挤压结构<Extrusion>` 的缺点，如部件会随着时间的推移而松动。

source: With punch tubing, teams must pre-drill holes and attach, unlike extrusion, where teams can slide and adjust mechanisms.
es_mx: Con los tubos perforados, los equipos deben taladrar previamente los agujeros y fijarlos, a diferencia de la extrusión, en la que los equipos pueden deslizar y ajustar los mecanismos.
fr_ca: Avec les tubes perforés, les équipes doivent pré-percer des trous et les fixer, contrairement à l'extrusion, où les équipes peuvent faire glisser et ajuster les mécanismes.
zh_cn: 使用冲压管时，团队必须预先钻孔并安装，而挤压则不同，团队可以滑动和调整机制。

source: Thus, it is recommended that teams use extrusion in prototyping/iterative design, and use punch tubing on the final iteration of their robot to save money. Punch tubing is compatible with the Metric Step Drill and 1/8" or 3.2mm pop-rivets.
es_mx: Por lo tanto, se recomienda que los equipos utilicen extrusión en la creación de prototipos/diseño iterativo, y utilicen tubos perforados en la iteración final de su robot para ahorrar dinero. El tubo perforado es compatible con la broca escalonada métrica y remaches de 1/8" o 3,2 mm.
fr_ca: Il est donc recommandé aux équipes d'utiliser l'extrusion pour le prototypage et la conception itérative, et d'utiliser les tubes perforés pour l'itération finale de leur robot afin d'économiser de l'argent. Le tube perforé est compatible avec la perceuse métrique et les rivets pop 1/8" ou 3,2 mm.
zh_cn: 因此，建议参赛队在原型/迭代设计中使用挤压，在机器人的最终迭代中使用冲压管，以节省成本。冲压管与公制阶梯钻和 1/8 英寸或 3.2 毫米弹铆钉兼容。

source: A piece of REV Robotics 15mm punch tubing
es_mx: Un trozo de tubo perforado de 15 mm de REV Robotics
fr_ca: Un morceau de tube perforé REV Robotics de 15 mm
zh_cn: 一段 REV 机器人 15 毫米冲压管

source: A piece of rev extrusion
es_mx: Una pieza de extrusión rev
fr_ca: Une pièce d'extrusion révisée
zh_cn: 一片 rev 型材

source: REV 15x15mm Extrusion
es_mx: REV 15x15mm Extrusión
fr_ca: Extrusion REV 15x15mm
zh_cn: REV 15x15mm 挤压

source: A technical drawing of MiSUMI Extrusion's profile
es_mx: Un dibujo técnico del perfil de MiSUMI Extrusion
fr_ca: Dessin technique du profil de MiSUMI Extrusion
zh_cn: 米苏米挤压型材的技术图纸

source: MiSUMI 15x15mm Extrusion Profile
es_mx: Perfil de extrusión MiSUMI 15x15mm
fr_ca: Profil d'extrusion MiSUMI 15x15mm
zh_cn: MiSUMI 15x15mm 挤压型材

source: Kit of Parts
es_mx: Kit de piezas
fr_ca: Kit de pièces
zh_cn: 配件包

source: `FTC Starter Kit V3 <https://www.revrobotics.com/rev-45-1883/>`_
es_mx: `FTC Kit de Inicio V3 <https://www.revrobotics.com/rev-45-1883/>`_
zh_cn: FTC 入门套件 V3<https://www.revrobotics.com/rev-45-1883/>`_

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: :term:`Extrusion` systems don't need to worry about tensioning as mounts are adjustable to your needs.
es_mx: :term:`Los sistemas de extrusión no necesitan preocuparse por el tensado, ya que los soportes se ajustan a sus necesidades.
fr_ca: :term:Les systèmes d'extrusion n'ont pas besoin de se préoccuper de la tension car les supports sont réglables en fonction de vos besoins.
zh_cn: :term:`Extrusion` 系统无需担心张紧问题，因为支架可根据需要进行调整。

source: :term:`Extrusion` allows teams to save space as opposed to :term:`channel <Channel>`, and is lighter than aluminum :term:`channel <Channel>`.
es_mx: La :term:`Extrusión` permite a los equipos ahorrar espacio frente al :term:`canal <Channel>`, y es más ligero que el :term:`canal <Channel>` de aluminio.
fr_ca: :term:`Extrusion` permet aux équipes de gagner de la place par rapport au :term:`profilé <Channel>`, et est plus léger que le :term:`profilél <Channel>` en aluminium.
zh_cn: 与:term:`channel<Channel>`相比，:term:`Extrusion`可以让团队节省空间，而且比铝制:term:`channel<Channel>`更轻。

source: :term:`Extrusion` allows infinite positioning options instead of being locked in to a specific distance - useful for fine-tuning a mechanism.
es_mx: La :term:`Extrusión` permite infinitas opciones de posicionamiento en lugar de estar bloqueado en una distancia específica - útil para el ajuste fino de un mecanismo.
fr_ca: :term:`Extrusion` permet des options de positionnement infinies au lieu d'être bloqué à une distance spécifique - utile pour affiner un mécanisme.
zh_cn: :term:`Extrusion` 允许无限的定位选项，而不是锁定在一个特定的距离 - 这对微调机构非常有用。

source: Delrin products are inexpensive yet durable for most use cases.
es_mx: Los productos Delrin son baratos y duraderos para la mayoría de los casos de uso.
fr_ca: Les produits en Delrin sont peu coûteux mais durables pour la plupart des cas d'utilisation.
zh_cn: Delrin产品价格低廉，但经久耐用，适用于大多数情况。

source: REV has the option to upgrade to aluminum parts if need be - something that no other build system offers. (not for all parts)
es_mx: REV tiene la opción de actualizar a piezas de aluminio si es necesario - algo que ningún otro sistema de construcción ofrece. (no para todas las piezas)
fr_ca: REV a la possibilité de passer à des pièces en aluminium si nécessaire - ce qu'aucun autre système de construction n'offre. (pas pour toutes les pièces)
zh_cn: 如果需要，REV可选择升级为铝制部件，这是其他构建系统无法提供的。(并非所有部件）

source: 5 mm hex is a robust :term:`shaft <Shaft>` and motion system and is easily adaptable to :term:`UltraHex` 1/2" hex :term:`shaft <Shaft>`. Other companies have adapting options with 5 mm hex.
es_mx: 5 mm hex es un robusto :term:`eje <Shaft>` y sistema de movimiento y es fácilmente adaptable al :term:`UltraHex` 1/2" hex :term:`eje <Shaft>`. Otras empresas disponen de opciones de adaptación con hexágono de 5 mm.
fr_ca: L'hexagone de 5 mm est un :term:``arbre <Shaft>` et un système de mouvement robuste, facilement adaptable au :term:`UltraHex` 1/2" hexagone :term:`arbre <Shaft>`. D'autres entreprises proposent des options d'adaptation à l'hexagone de 5 mm.
zh_cn: 5 毫米六角是一种坚固的 :term:`shaft<Shaft>` 和运动系统，可轻松与 :term:`UltraHex` 1/2" hex :term:`shaft<Shaft>` 适配。其他公司也有 5 毫米六角的适配选项。

source: Punch Tubing is a great final iteration option if you are sure about placement.
es_mx: El tubo perforado es una gran opción de iteración final si está seguro de la colocación.
fr_ca: Le tube perforé est une excellente option d'itération finale si vous êtes sûr de l'emplacement.
zh_cn: 如果您确定位置，冲压管是一个很好的最终迭代选择。

source: :term:`Channel` complements extrusion extremely well - having the adjustability of extrusion and the rigidity of channel makes it a very solid build system.
es_mx: El :term:`Canal` se complementa muy bien con la extrusión: la capacidad de ajuste de la extrusión y la rigidez del canal lo convierten en un sistema de construcción muy sólido.
fr_ca: Le :term:`profilé` complète très bien l'extrusion - la possibilité d'ajuster l'extrusion et la rigidité du profilé en font un système de construction très solide.
zh_cn: :term:`Channel` 与挤出系统相得益彰--挤出系统的可调节性和槽钢的坚固性使其成为非常稳固的构建系统。

source: Generally, REV products are designed with affordability in mind, and so the components are of good value for money.
es_mx: En general, los productos REV se diseñan pensando en su accesibilidad, por lo que los componentes tienen una buena relación calidad-precio.
fr_ca: En règle générale, les produits REV sont conçus dans un souci d'accessibilité financière et les composants présentent donc un bon rapport qualité-prix.
zh_cn: 一般来说，REV 产品的设计考虑到了经济性，因此组件物有所值。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: 15x15mm :term:`extrusion <Extrusion>` is not as sturdy as :term:`channel <Channel>` options under high stress loads.
es_mx: 15x15mm :term:`extrusión <Extrusion>` no es tan resistente como las opciones de :term:`canal <Channel>` bajo cargas de esfuerzo elevadas.
fr_ca: 15x15mm :term:`extrusion <Extrusion>` n'est pas aussi robuste que les options :term:`canal <Channel>` en cas de fortes contraintes.
zh_cn: 15x15mm :term: `挤压结构<Extrusion>` 在高应力负荷下不如 :term:`channel<Channel>` 坚固。

source: Steeper learning curve, more time consuming to measure and cut :term:`extrusion <Extrusion>` to length.
es_mx: Mayor curva de aprendizaje, más tiempo para medir y cortar la :term:`extrusión <Extrusion>` a la longitud deseada.
fr_ca: Courbe d'apprentissage plus prononcée, plus de temps pour mesurer et couper :term:`extrusion <Extrusion>` à la longueur voulue.
zh_cn: 学习曲线较长，测量和切割 :term: `挤压结构<Extrusion>` 长度更耗时。

source: Requires tools such as a saw and bandsaw.
es_mx: Requiere herramientas como una sierra y una sierra de cinta.
fr_ca: Nécessite des outils tels qu'une scie et une scie à ruban.
zh_cn: 需要锯和带锯等工具。

source: Requires forethought and planning of :term:`extrusion <Extrusion>` length and placement.
es_mx: Requiere previsión y planificación de :term:`extrusión <Extrusion>` longitud y colocación.
fr_ca: Nécessite une réflexion et une planification de la longueur et de l'emplacement de l' :terme:`extrusion <Extrusion>` .
zh_cn: 需要预先考虑和规划 :term: `挤压结构<Extrusion>` 长度和位置。

source: Parts loosen over time (to remediate: use punch tubing)
es_mx: Las piezas se aflojan con el tiempo (para remediarlo: utilizar tubos perforados)
fr_ca: Les pièces se desserrent avec le temps (pour y remédier : utiliser des tubes perforés)
zh_cn: 部件随着时间的推移而松动（补救措施：使用冲压管）
