Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/tetrix.po
Languages: es_mx, fr_ca, zh_cn

source: TETRIX is generally not recommended due to its restricted flexibility and low long-term reliability. This page serves as historical reference for teams that have and use TETRIX parts, but there is little reason to purchase them.
es_mx: En general, no se recomienda el TETRIX debido a su restringida flexibilidad y a su escasa fiabilidad a largo plazo. Esta página sirve como referencia histórica para los equipos que tienen y utilizan piezas TETRIX, pero hay pocas razones para comprarlas.
fr_ca: TETRIX n'est généralement pas recommandé en raison de sa flexibilité limitée et de sa faible fiabilité à long terme. Cette page sert de référence historique pour les équipes qui possèdent et utilisent des pièces TETRIX, mais il n'y a guère de raison de les acheter.
zh_cn: 由于 TETRIX 灵活性有限且长期可靠性低，一般不推荐使用。本页可作为拥有和使用 TETRIX 部件的车队的历史参考资料，但购买这些部件的理由并不充分。

source: The TETRIX build system is a fixed pitch, channel-based building system that uses both imperial and metric units.
es_mx: El sistema de construcción TETRIX es un sistema de construcción basado en canales de paso fijo que utiliza unidades imperiales y métricas.
fr_ca: Le système de construction TETRIX est un système de construction à pas fixe, basé sur des canaux, qui utilise des unités impériales et métriques.
zh_cn: TETRIX 建材包是一种固定间距、基于C形梁的建材包，同时使用英制和公制单位。

source: Special Considerations
es_mx: Consideraciones especiales
fr_ca: Considérations particulières
zh_cn: 特殊考虑因素

source: The TETRIX build system revolves around 32 mm aluminum :term:`c-channels <Channel>` and a 16mm bolt circle, on 16mm spacing (centers of the circles are 16mm apart). TETRIX is patterned along these :term:`channels <Channel>` to create many mounting options for building structures.
es_mx: El sistema de construcción TETRIX gira en torno a unos canales :term:`c` de aluminio de 32 mm <Channel>` y un círculo de pernos de 16 mm, con un espaciado de 16 mm (los centros de los círculos están separados 16 mm). TETRIX está diseñado a lo largo de estos :term:`canales <Channel>` para crear muchas opciones de montaje para estructuras de construcción.
fr_ca: Le système de construction TETRIX s'articule autour de :term:`profilés en c <Channel>` en aluminium de 32 mm et d'un cercle de boulons de 16 mm, avec un espacement de 16 mm (les centres des cercles sont espacés de 16 mm). TETRIX est structuré le long de ces :term:`profilés <Channel>` pour créer de nombreuses options de montage pour les structures de construction.
zh_cn: TETRIX 建筑系统围绕 32 毫米铝质 :term:`C形梁 <Channel>` 和 16 毫米螺丝圆圈展开，间距为 16 毫米（圆圈中心相距 16 毫米）。TETRIX 沿着这些 :term:`C形梁 <Channel>` 模板，为建筑结构提供多种安装选择。

source: These channels have a tendency to flex and bend under load, often requiring reinforcement using multiple :term:`channels <Channel>` to maintain their shape.
es_mx: Estos canales tienden a flexionarse y doblarse bajo carga, por lo que a menudo es necesario reforzarlos con varios :term:`canales <Channel>` para mantener su forma.
fr_ca: Ces profils ont tendance à fléchir et à se plier sous l'effet de la charge, ce qui nécessite souvent un renforcement à l'aide de plusieurs :term:`profilés <Channel>` pour conserver leur forme.
zh_cn: 这些槽钢在荷载作用下容易弯曲，通常需要使用多个 :term:`C形梁 <Channel>` 来加固，以保持其形状。

source: While TETRIX :term:`channel <Channel>` is measured in metric units, the system employs Imperial (SAE) bolts and Imperial :term:`chain <Chain>`. This mix of units means that things often don't quite line up how they're supposed to, causing unforeseen problems.
es_mx: Aunque TETRIX :term:`canal <Channel>` se mide en unidades métricas, el sistema emplea tornillos imperiales (SAE) y cadenas imperiales<Chain>`. Esta mezcla de unidades significa que las cosas a menudo no se alinean como deberían, causando problemas imprevistos.
fr_ca: Bien que le système de :term:`profilés <Channel>` TTRIX soit mesuré en unités métriques, il utilise des boulons impériaux (SAE) et des :term:`chaînes impériales <Chain>`. Ce mélange d'unités signifie que les choses ne s'alignent pas toujours comme elles le devraient, ce qui entraîne des problèmes imprévus.
zh_cn: 虽然 TETRIX :term:`C形梁 <Channel>` 以公制单位测量，但系统采用英制（SAE）螺丝和英制 :term:`链条 <Chain>`。 这种混合使用单位的情况意味着经常会出现排列不整齐的情况，从而造成无法预料的问题。

source: Additional tensioners are often required when using :term:`chain <Chain>` on TETRIX.
es_mx: A menudo se necesitan tensores adicionales cuando se utiliza :term:`cadena <Chain>` en TETRIX.
fr_ca: Des tendeurs supplémentaires sont souvent nécessaires lorsque l'on utilise :term:`chaîne <Chain>` sur TETRIX.
zh_cn: 在 TETRIX 上使用 :term:`链条 <Chain>` 时，通常需要额外的拉伸器。

source: TETRIX :term:`gears <Gear>` and :term:`sprockets <Sprocket>` offer very limited options for creating ratios. The aluminum :term:`gears <Gear>` tend to grind away very quickly, especially if they are not supported correctly on both sides.
es_mx: TETRIX :term:`engranes<Gear>` y :term:`piñones<Sprocket>` ofrecen opciones muy limitadas para crear ratios. Los :term:`engranes<Gear>` de aluminio tienden a desgastarse muy rápidamente, sobre todo si no se apoyan correctamente en ambos lados.
fr_ca: Les :term:`engramges <Gear>` et :term:`pignons <Sprocket>` TETRIX offrent des options très limitées pour créer des rapports. Les :term:`engrenages<Gear>` en aluminium ont tendance à s'effriter très rapidement, surtout s'ils ne sont pas soutenus correctement des deux côtés.
zh_cn: TETRIX :term:`齿轮 <Gear>` 和 :term:`链轮 <Sprocket>` 提供的转动比非常有限。铝制 :term:`齿轮 <Gear>` 容易很快磨损，尤其是在两侧支撑不正确的情况下。

source: Tetrix parts generally do not have the best track record for reliability and longevity due to subpar material choices.
es_mx: Por lo general, las piezas de Tetrix no tienen el mejor historial de fiabilidad y longevidad debido a la mala elección de los materiales.
fr_ca: Les pièces Tetrix n'ont généralement pas les meilleurs antécédents en matière de fiabilité et de longévité en raison du choix de matériaux de qualité inférieure.
zh_cn: 由于材料选择不当，TETRIX 零件的可靠性和使用寿命一般都不理想。

source: Tetrix parts are slightly overpriced and lack bang-for-your-buck value found in kits such as REV and goBILDA.
es_mx: Las piezas de Tetrix son un poco caras y carecen de la relación calidad-precio de kits como REV y goBILDA.
fr_ca: Les pièces Tetrix sont légèrement trop chères et n'ont pas le rapport qualité-prix que l'on trouve dans des kits tels que REV et goBILDA.
zh_cn: TETRIX零件价格略高，缺乏 REV 和 goBILDA 等套件的性价比。

source: Verdict
es_mx: Veredicto
zh_cn: 建议

source: While you may be considering TETRIX as a starter kit, we encourage you to explore your options before selecting a kit. While Tetrix does pick up quite a lot of flak from the community, it isn't a bad choice in terms of physical qualities such as strength, but the mounting options and hole patterns leave more to be desired and restrict teams in terms of flexibility.
es_mx: Aunque puede que estés considerando TETRIX como kit de iniciación, te animamos a que explores tus opciones antes de seleccionar un kit. Aunque Tetrix recibe bastantes críticas de la comunidad, no es una mala opción en cuanto a cualidades físicas como la resistencia, pero las opciones de montaje y los patrones de orificios dejan más que desear y restringen los equipos en términos de flexibilidad.
fr_ca: Même si vous envisagez d'utiliser le TETRIX comme kit de démarrage, nous vous encourageons à explorer vos options avant de choisir un kit. Bien que le Tetrix fasse l'objet de nombreuses critiques de la part de la communauté, il ne s'agit pas d'un mauvais choix en termes de qualités physiques telles que la résistance, mais les options de montage et les schémas de perçage laissent à désirer et limitent les équipes en termes de flexibilité.
zh_cn: 虽然您可能会考虑将 TETRIX 作为入门套件，但我们建议您在选择套件之前先了解一下自己的选择。虽然TETRIX在社区中受到不少批评，但就强度等物理特性而言，它并不是一个糟糕的选择，只是安装选项和孔型还有待改进，限制了团队的灵活性。

source: Kit of Parts
es_mx: Kit de piezas
fr_ca: Kit de pièces
zh_cn: 配件包

source: `Kit of Parts <https://www.pitsco.com/Competitions-Clubs-and-Programs/FIRST-Tech-Challenge/TETRIX-FTC-Competition-Set>`_
es_mx: `Kit de piezas <https://www.pitsco.com/Competitions-Clubs-and-Programs/FIRST-Tech-Challenge/TETRIX-FTC-Competition-Set>`_
fr_ca: `Kit de pièces <https://www.pitsco.com/Competitions-Clubs-and-Programs/FIRST-Tech-Challenge/TETRIX-FTC-Competition-Set>`_
zh_cn: `配件包 <https://www.pitsco.com/Competitions-Clubs-and-Programs/FIRST-Tech-Challenge/TETRIX-FTC-Competition-Set>`_

source: `2020-2021 Kit of Parts BoM <https://asset.pitsco.com/sharedimages/resources/ftcset_productlist-0719.pdf>`_
es_mx: `2020-2021 Kit de Piezas BoM <https://asset.pitsco.com/sharedimages/resources/ftcset_productlist-0719.pdf>`_
fr_ca: `2020-2021 Kit de pièces BoM <https://asset.pitsco.com/sharedimages/resources/ftcset_productlist-0719.pdf>`_
zh_cn: `2020-2021 零件套件 BoM <https://asset.pitsco.com/sharedimages/resources/ftcset_productlist-0719.pdf>`_

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: The TETRIX kit, being the most basic of all kit options, is easy to learn and provides a variety of options in building. The kit itself comes with :term:`c-channel <Channel>`, which is aluminum shaped in a C. It has pre-cut holes so motors, :term:`gears <Gear>`, or :term:`drive shafts <Shaft>` can be seamlessly integrated into the channel. For a beginner team with little to no experience, a TETRIX kit allows you to assemble a working drivetrain in a couple of hours (Note: Most other kits allow you to do the same thing, but with more customization options).
es_mx: El kit TETRIX, siendo el más básico de todas las opciones de kit, es fácil de aprender y proporciona una variedad de opciones en la construcción. El kit en sí viene con :term:`c-canal <Channel>`, que es aluminio en forma de C. Tiene agujeros precortados para que los motores, :term:`engranes <Gear>`, o :term:`ejes <Shaft>` se puedan integrar perfectamente en el canal. Para un equipo de principiantes con poca o ninguna experiencia, un kit TETRIX permite montar un chasis funcional en un par de horas (Nota: La mayoría de los demás kits permiten hacer lo mismo, pero con más opciones de personalización).
fr_ca: Le kit TETRIX, qui est le plus basique de tous les kits, est facile à apprendre et offre une grande variété d'options de construction. Le kit lui-même est livré avec un :term:`profilé en C <Channel>`, qui est un aluminium en forme de C. Il comporte des trous prédécoupés pour que les moteurs, :term:`engrenages <Gear>`, ou :term:`arbres <Shaft>` puissent être intégrés de manière transparente dans le profilé. Pour une équipe débutante avec peu ou pas d'expérience, un kit TETRIX vous permet d'assembler un châssis fonctionnel en quelques heures (Remarque : la plupart des autres kits vous permettent de faire la même chose, mais avec plus d'options de personnalisation).
zh_cn: TETRIX 套件是所有套件中最基本的一种，易于学习，并提供多种制作选择。套件本身带有 :term:`C形梁 <Channel>`， 它是一个 C 形的铝制材料。它有预切割孔，因此可以将电机、 :term:`齿轮 <Gear>` 或 :term:`传动轴 <Shaft>` 无缝集成到C形梁中。对于几乎没有经验的初学者来说，TETRIX 套件可以让您在几个小时内组装出一个可以工作的传动系统（注：大多数其他套件也可以让您做同样的事情，但有更多的定制选项）。

source: Furthermore, TETRIX is decent in terms of structural integrity, as long as the channels are loaded in the correct orientation. Typically, the orientation should be like an "n", with the top face upward. Connecting the channels with :term:`locknut <Locknut>` instead of regular nuts aids in longevity. However, TETRIX is the weakest of the build systems and is very prone to bending, especially with long pieces of channel that have multiple axes of load.
es_mx: Además, TETRIX es decente en términos de integridad estructural, siempre que los canales se carguen con la orientación correcta. Normalmente, la orientación debe ser como una "n", con la cara superior hacia arriba. La conexión de los canales con :term:`tuercas de seguridad<Locknut>` en lugar de tuercas normales contribuye a la longevidad. Sin embargo, TETRIX es el más débil de los sistemas de construcción y es muy propenso a la flexión, especialmente con piezas largas de canal que tienen múltiples ejes de carga.
fr_ca: En outre, TETRIX est satisfaisant en termes d'intégrité structurelle, à condition que les canaux soient chargés dans le bon sens. Typiquement, l'orientation doit être comme celle d'un "n", avec la face supérieure vers le haut. L’utilisation de :term:'locknut<Locknut>' plutôt que d’écrous ordinaires pour relier les canaux améliore la durabilité. Cependant, TETRIX est le système de construction le plus faible et est très enclin à se plier, en particulier avec de longues pièces de canal qui ont plusieurs axes de charge.
zh_cn: 此外，只要以正确的方向装载C形梁，TETRIX 的结构完整性也是不错的。通常情况下，方向应像 "n"，顶部朝上。用 :term:`防松螺母 <Locknut>` 代替普通螺母连接槽钢可以延长使用寿命。不过，TETRIX 是构建系统中最薄弱的一种，非常容易弯曲，尤其是对于有多个负载轴的长槽钢。

source: It is simple to build basic mechanisms such as an arm using the gears and d-shaft. However, there are potential drawbacks to doing so.
es_mx: Es sencillo construir mecanismos básicos, como un brazo, utilizando los engranajes y el eje d. Sin embargo, hacerlo puede tener sus inconvenientes.
fr_ca: Il est facile de construire des mécanismes de base tels qu'un bras à l'aide des engrenages et de l'arbre en d. Toutefois, cette méthode présente des inconvénients potentiels.
zh_cn: 使用齿轮和d轴构建基本机械装置，如机械臂，非常简单。不过，这样做也有潜在的缺点。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: The TorqueNADO motors are comparable with :term:`NeveRest <NeveRest Motor>` 60:1. They are usable, however have more limited uses due to their slow :term:`gear ratio <Gear Reduction>`, which means high torque but relatively slow output speed. The TorqueNADO uses spur gearboxes, and will not handle as much shock load as other planetary options, namely :term:`AndyMark 20 Orbitals <NeveRest Motor>`, :term:`REV HD Planetary <HD Hex Motor>`, or the :term:`goBILDA Yellow Jacket Planetaries <Yellow Jacket Motor>`.
es_mx: Los motores TorqueNADO son comparables con :term:`NeveRest <NeveRest Motor>` 60:1. Son utilizables, sin embargo tienen usos más limitados debido a su lenta :term:`relacion de engranajes <Gear Reduction>`, lo que significa un alto torque pero una velocidad de salida relativamente lenta. El TorqueNADO utiliza engranajes rectos, y no soportará tanta carga de choque como otras opciones planetarias, a saber :term:`AndyMark 20 Orbitals <NeveRest Motor>`, :term:`REV HD Planetary <HD Hex Motor>`, o el :term:`goBILDA Yellow Jacket Planetaries <Yellow Jacket Motor>`.
fr_ca: Les moteurs TorqueNADO sont comparables avec :term:`NeveRest <NeveRest Motor>` 60:1. Ils sont utilisables, mais leur utilisation est plus limitée en raison de leur :term:`rapport d'engrenage <Gear Reduction>` , ce qui signifie un couple élevé mais une vitesse de sortie relativement lente. Le TorqueNADO utilise des engrenages droits, et ne supportera pas autant de chocs que d'autres planétaires, notamment :term:`AndyMark 20 Orbitals <NeveRest Motor>`, :term:`REV HD Planetary <HD Hex Motor>`, ou les :term:`goBILDA Yellow Jacket Planetaries <Yellow Jacket Motor>`.
zh_cn: TorqueNADO 电机与 :term:`NeveRest电机 <NeveRest Motor>` 60:1 相当。它们是可用的，但由于其 :term:`齿轮比 <Gear Reduction>` 较慢，这意味着扭矩大，但输出速度相对较慢，因此用途较为有限。TorqueNADO 使用的是正齿轮变速箱，不能像其他行星齿轮变速箱那样承受较大的冲击负荷，如 :term:`AndyMark 20 Orbitals <NeveRest Motor>`、 :term:`REV HD Planetary <HD Hex Motor>` 或 :term:`goBILDA Yellow Jacket Planetaries <Yellow Jacket Motor>`。

source: The aluminum gears seem to grind against each other often, even with correct spacing, and do not last very long, especially under high torque situations.
es_mx: Los engranajes de aluminio parecen rechinar unos contra otros con frecuencia, incluso con el espaciado correcto, y no duran mucho, especialmente en situaciones de torque elevado.
fr_ca: Les engrenages en aluminium semblent grincer souvent les uns contre les autres, même avec un espacement correct, et ne durent pas très longtemps, en particulier dans des situations de couple élevé.
zh_cn: 即使间距正确，铝制齿轮似乎也会经常相互磨擦，使用寿命不长，尤其是在高扭矩情况下。

source: TETRIX hubs are :term:`6mm or 4.7mm round <Shaft>` and are based on :term:`set screws <Set Screw>` which are torque transferring. These :term:`set screws <Set Screw>` are notorious for coming loose under load, so special care must be taken to continuously tighten these screws. Additionally, it is highly recommended that teams use some sort of threadlocker on set screws, whether it be :term:`Loctite Blue (removable) or Loctite Red (nonremovable) <Loctite>`. A possible workaround is purchasing 6mm D :term:`clamping hubs <Clamping Hub>` from goBILDA to use on TETRIX :term:`shafts <Shaft>`, however, this also necessitates the use of a pattern adapter from the goBILDA pattern to TETRIX.
es_mx: Los hubs TETRIX son :term:`redondos de 6 mm o 4,7 mm <Shaft>` y se basan en :term:`tornillos de ajuste <Set Screw>` que transfieren el par de apriete. Estos :term:`tornillos de ajuste <Set Screw>` tienen fama de aflojarse bajo carga, por lo que debe prestarse especial atención a apretar continuamente estos tornillos. Además, se recomienda encarecidamente que los equipos utilicen algún tipo de fijador de roscas en los tornillos de fijación, ya sea :term:`Loctite Blue (extraíble) o Loctite Red (no extraíble) <Loctite>`. Una posible solución es comprar cubos de sujeción de 6 mm D :term:` <Clamping Hub>` de goBILDA para utilizarlos en ejes TETRIX :term:` <Shaft>`, sin embargo, esto también requiere el uso de un adaptador de patrón de goBILDA a TETRIX.
fr_ca: Les moyeux TETRIX sont :term:`6mm ou 4.7mm ronds <Shaft>` et sont basés sur des :term:`vis de réglage <Set Screw>` qui sont à transfert de couple. Ces :term:`vis de réglage <Set Screw>` sont réputées pour se desserrer sous la charge, et il faut donc veiller à les serrer constamment. En plus, il est fortement recommandé aux équipes d'utiliser une sorte de frein-filet sur les vis de réglage, qu'il s'agisse de :term:`Loctite Blue (amovible) ou de Loctite Red (inamovible) <Loctite>`. Une solution possible est d'acheter des :term:`moyens de serrage de 6mm D <Clamping Hub>` de goBILDA pour les utiliser sur les :term:`arbres de TETRIX <Shaft>`, mais cela nécessite aussi l'utilisation d'un adaptateur de modèle entre le modèle goBILDA et TETRIX.
zh_cn: TETRIX 轮毂为 :term:`6mm 或 4.7mm 圆形 <Shaft>`，基于 :term:`固定螺丝 <Set Screw>`，可传递扭矩。这些 :term:`固定螺丝 <Set Screw>` 在负载情况下会松动，因此必须特别注意持续拧紧这些螺丝。此外，强烈建议团队在固定螺丝上使用某种螺纹锁固剂，无论是 :term:`Loctite Blue（可拆卸）还是 Loctite Red（不可拆卸） <Loctite>`。一种可能的变通方法是从 goBILDA 购买 6mm D :term:`夹紧轮毂 <Clamping Hub>`，用于 TETRIX :term:`轴 <Shaft>`，但这也需要使用从 goBILDA 模式到 TETRIX 模式的模式转换器。

source: Due to using a metric based pattern but using imperial based holes and :term:`chain <Chain>` standards, :term:`chain <Chain>` will not have perfect tension when running from one hole in :term:`channel <Channel>` to another. An external :term:`tensioner <Idler>` will be required to implement chain systems.
es_mx: Debido a la utilización de un patrón basado en el sistema métrico pero con orificios basados en el sistema imperial y estándares en :term:`cadenas<Chain>`, Las :term:`cadenas<Chain>` no tendrá una tensión perfecta al pasar de un orificio del :term:`canal <Channel>` a otro. Será necesario un :term:`tensionador <Idler>` externo para implementar los sistemas de cadena.
fr_ca: En raison de l'utilisation d'un modèle métrique mais de trous et de normes :term:`chaîne <Chain>` impériaux, la :term:`chaîne <Chain>` ne sera pas parfaitement tendue lorsqu'elle passera d'un trou à l'autre dans le :term:`canal <Channel>`. Un :term:`tendeur <Idler>` externe sera nécessaire pour mettre en œuvre les systèmes de chaînes.
zh_cn: 由于使用公制模式，但使用英制孔和 :term:`链条 <Chain>` 标准，当 :term:`链条 <Chain>` 从 :term:`C形梁 <Channel>` 的一个孔运行到另一个孔时，不会有完美的张力。需要使用外部 :term:`转向器 <Idler>` 来实现链条系统。

source: TETRIX is also the most expensive kit on average while providing the most limited build options. Finally, the tight spacing and mix of units limits teams if they would want to integrate custom parts with TETRIX.
es_mx: TETRIX es también el kit más caro por término medio, al tiempo que ofrece las opciones de construcción más limitadas. Por último, el reducido espacio y la mezcla de unidades limitan a los equipos a la hora de integrar piezas personalizadas con TETRIX.
fr_ca: TETRIX est également le kit le plus cher en moyenne, tout en offrant les options de construction les plus limitées. Enfin, l'espacement réduit et le mélange d'unités limitent les équipes qui souhaiteraient intégrer des pièces personnalisées à TETRIX.
zh_cn: TETRIX 也是平均价格最昂贵的套件，同时提供的构建选项也最有限。最后，如果团队想将定制部件与 TETRIX 集成在一起，那么紧凑的间距和单元组合也会限制他们。

source: Set screws on TETRIX hubs can mar motor :term:`shafts <Shaft>`, and the :term:`bore <Bore>` of the hub itself can enlarge, leading to a wobbly or misaligned hub.
es_mx: Los tornillos de ajuste de los hubs TETRIX pueden estropear los :term:`ejes del motor <Shaft>`, y el :term:`taladro <Bore>` del propio hub puede agrandarse, lo que provoca que el hub se tambalee o se desalinee.
fr_ca: Les vis de réglage des moyeux TETRIX peuvent endommager les :term:`arbres du moteur <Shaft>`, et l' :term:`alésage <Bore>` du moyeu lui-même peut s'élargir, entraînant un moyeu bancal ou mal aligné.
zh_cn: TETRIX 轮毂上的固定螺丝会损坏电机 :term:`轴 <Shaft>`，轮毂本身的 :term:`内孔 <Bore>` 也会变大，导致轮毂摇摆或错位。

source: Tips for use
es_mx: Consejos de uso
fr_ca: Conseils d'utilisation
zh_cn: 使用提示
