Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/kit-and-hardware-guide/tetrix.po
Languages: es_mx, fr_ca, zh_cn

source: In any build system, it is important to properly support the structure of your robot. This includes supporting axles at two or more points of contact, or having multiple points of support for a piece of :term:`channel <Channel>`. Due to TETRIX's relatively fragile nature, this advice goes double with TETRIX. Instead of just supporting a :term:`shaft <Shaft>` at two points, it is recommended to support the :term:`shaft <Shaft>` at 4 or more (if you are using a 4.7mm standard). When mounting motors, it is recommended that :term:`two clamping motor mounts <Clamp Mounting>` are used to mount one motor. Using :term:`standoffs <Standoff>` inside :term:`channel <Channel>` to prevent the :term:`channel <Channel>` from bending inward or outward is also highly recommended.
es_mx: En cualquier sistema de construcción, es importante apoyar adecuadamente la estructura de su robot. Esto incluye apoyar los ejes en dos o más puntos de contacto, o tener múltiples puntos de apoyo para una pieza de :term:`canal <Channel>`. Debido a la naturaleza relativamente frágil de TETRIX, este consejo es doble en el caso de TETRIX. En lugar de sólo apoyar un :term:`eje <Shaft>` en dos puntos, se recomienda apoyar el :term:`eje <Shaft>` en 4 o más (si está utilizando un estándar de 4,7 mm). Al montar motores, se recomienda utilizar :term:`dos soportes de motor de sujeción <Clamp Mounting>` para montar un motor. También es muy recomendable utilizar :term:`standoffs <Standoff>` dentro del :term:`canal <Channel>` para evitar que el :term:`canal <Channel>` se doble hacia dentro o hacia fuera.
fr_ca: Dans tout système de construction, il est important de soutenir correctement la structure de votre robot. Il s'agit notamment de soutenir les axes en deux points de contact ou plus, ou d'avoir plusieurs points de support pour un morceau de :term:`canal <Channel>`. En raison de la nature relativement fragile de TETRIX, ce conseil s'applique en double à TETRIX. Au lieu de soutenir un :term:`shaft <Shaft>` en deux points, il est recommandé de soutenir le :term:`shaft <Shaft>` en 4 points ou plus (si vous utilisez un standard de 4,7 mm). Pour le montage des moteurs, il est recommandé d'utiliser :term:`deux supports de moteur à serrage <Clamp Mounting>`. L'utilisation de :term:`standoffs <Standoff>` à l'intérieur du :term:`canal <Channel>` pour empêcher le :term:`canal <Channel>` de se plier vers l'intérieur ou vers l'extérieur est également fortement recommandé.
zh_cn: 在任何构建系统中，正确支撑机器人结构都非常重要。这包括在两个或更多接触点上支撑轴，或为一块 :term:`C形梁 <Channel>` 提供多个支撑点。由于 TETRIX 相对脆弱的特性，该建议对 TETRIX 有双重作用。建议在 4 个或更多点支撑 :term:`轴 <Shaft>`，而不是只在两个点支撑 :term:`轴 <Shaft>` （如果您使用的是 4.7 毫米标准）。安装电机时，建议使用 :term:`两个夹紧电机支架 <Clamp Mounting>` 来安装一个电机。强烈建议在 :term:`C形梁 <Channel>` 内使用 :term:`支座 <Standoff>` 以防止 :term:`C形梁 <Channel>` 向内或向外弯曲。

source: 6022 To Be Determined's Velocity Vortex Robot
es_mx: Robot Velocity Vortex 6022 To Be Determined
zh_cn: 6022队伍待定的Velocity Vortex Robot

source: 6022 To Be Determined: Worlds Semifinalist (St. Louis), Velocity Vortex
es_mx: 6022 To Be Determined: Semifinalista de los Mundiales (St. Louis), Velocity Vortex
fr_ca: 6022 To Be Determined: Demi-finaliste mondial (St. Louis), Velocity Vortex
zh_cn: 6022队伍待定：世界赛半决赛选手（St. Louis），Velocity Vortex

source: TETRIX based robots have succeeded in competition, albeit it has become rarer in recent years.
es_mx: Los robots basados en TETRIX han tenido éxito en competición, aunque en los últimos años se ha vuelto más raro.
fr_ca: Les robots basés sur TETRIX ont réussi en compétition, bien que cela soit devenu plus rare ces dernières années.
zh_cn: 基于 TETRIX 的机器人在竞赛中取得了成功，尽管近年来这种情况越来越少。
