Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/collaboration-and-efficiency.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: **Communicate often** with your squad and your team. Communicating is incredibly important on a team, as you can get fast feedback on problems, spark new ideas, and leverage the creativity of everyone on your team.
es_mx: **Comunícate frecuentemente** con tu escuadrón y tu equipo. Comunicarse es increíblemente importante en un equipo, ya que puedes obtener comentarios rápidos sobre problemas, generar nuevas ideas y aprovechar la creatividad de todos en tu equipo.
fr_ca: **Communiquez souvent** avec votre groupe et votre équipe. La communication est extrêmement importante au sein d'une équipe, car elle permet d'obtenir rapidement des informations sur les problèmes, de susciter de nouvelles idées et de tirer parti de la créativité de tous les membres de l'équipe.
ru_ru: **Общайтесь чаще между собой.** Коммуникация невероятно важна в команде, так как позволяет быстро получать обратную связь по проблемам, придумывать новые идеи и использовать творческий потенциал каждого участника команды.
zh_cn: **经常沟通。** 沟通对于一个团队来说非常重要，因为你可以快速地得到问题的反馈，激发新的想法，并利用你团队中每个人的创造力。
