Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/collaboration-and-efficiency.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: Collaboration and Efficiency
es_mx: Colaboración y Eficiencia
fr_ca: Collaboration et efficacité
ru_ru: Сотрудничество и Эффективность
zh_cn: 协作与效率

source: FTC\ |reg| is built on collaboration, and there are several ways to make collaborating as efficient as possible. Here's how!
es_mx: FTC\ |reg| se basa en la colaboración, y hay varias formas de hacer que la colaboración sea lo más eficiente posible. ¡Aquí te decimos cómo!
fr_ca: La collaboration est au cœur de la vie de FTC. Il existe plusieurs façons de la rendre aussi efficace que possible. Voici comment!
ru_ru: FTC\|reg| основаны на сотрудничестве, и существует несколько способов сделать совместную работу максимально эффективной. Вот как этого добиться!
zh_cn: FTC\ |reg|是建立在协作的基础上的，有几种方法可以使协作尽可能高效。方法如下！

source: Why Collaborate?
es_mx: ¿Por qué Colaborar?
fr_ca: Pourquoi collaborer?
ru_ru: Зачем Сотрудничать?
zh_cn: 为什么要协作？

source: The benefit of collaboration is expanded creativity. Your team members aren't identical - each one has a different method of approaching problems. Combining these unique mindsets often leads to creative, efficient, and effective solutions to software and mechanical issues.
es_mx: El beneficio de la colaboración es para expandir la creatividad. Los miembros de su equipo no son idénticos: cada uno tiene un método diferente de abordar los problemas. La combinación de estas mentalidades únicas suele dar lugar a soluciones creativas, eficientes y eficaces para los problemas mecánicos y de software.
fr_ca: La collaboration a pour avantage de développer la créativité. Les membres de votre équipe ne sont pas identiques - chacun a une méthode différente d'aborder les problèmes. La combinaison de ces mentalités uniques permet souvent de trouver des solutions créatives, efficaces et efficientes aux problèmes logiciels et mécaniques.
ru_ru: Преимущество совместной работы заключается в расширении творческого потенциала. Участники вашей команды совсем не похожи друг на друга - у каждого из них свой метод решения проблем. Их объединение часто приводит к творческим, эффективным и результативным решениям проблем в инженерии и программировании.
zh_cn: 协作的好处是扩展创造力。你的团队成员并不相同 - 每个人都有不同的解决问题的方法。结合这些独特的思维方式，往往能够产生富有创意、高效和有效的软件和机械问题的解决方案。

source: General Collaboration
es_mx: Colaboración General
fr_ca: Collaboration générale
ru_ru: Общее Взаимодействие
zh_cn: 一般协作

source: Your team's leadership should communicate daily about the status of their squads - it's imperative to ensure smooth team operations. You can use platforms like Discord and Slack to facilitate organized conversations. In addition, collaborative platforms like Canva and Google Drive are ideal for hosting engineering documentation, judging presentations, and marketing materials. The more material your members can access, the more they can contribute to.
es_mx: Los líderes de tu equipo deben comunicarse a diario sobre el estado de sus escuadrones: es imprescindible para garantizar el buen funcionamiento del equipo. Puedes utilizar plataformas como Discord y Slack para facilitar conversaciones organizadas. Además, las plataformas de colaboración como Canva y Google Drive son ideales para alojar documentación de ingeniería, presentaciones con los jueces y materiales de marketing. Cuanto más material puedan consultar tus miembros, más podrán aportar.
fr_ca: Les responsables de votre équipe doivent communiquer quotidiennement sur l'état de leurs sous équipes - c'est impératif pour assurer le bon fonctionnement de l'équipe. Vous pouvez utiliser des plateformes telles que Discord et Slack pour faciliter les conversations organisées. En outre, les plateformes collaboratives telles que Canva et Google Drive sont idéales pour héberger la documentation technique, les présentations aux juges et le matériel de marketing. Plus vos membres ont accès à du matériel, plus ils peuvent y contribuer.
ru_ru: Ответственные за каждую из групп вашей команды должны ежедневно сообщать о состоянии дел и прогрессе в своей сфере для обеспечения непрерывной работы команды. Для организации дистанционных собраний команды можно использовать такие платформы, как Discord и Slack. Кроме того, такие платформы для совместной работы, как Canva и Google Drive, идеально подходят для размещения инженерной документации, презентаций для экспертов и других материалов. Чем больше их будет доступно другим участникам команды, тем больший вклад они смогут внести.
zh_cn: 你的团队领导应该每天沟通他们的小队的状态 - 这是确保团队顺畅运作的必要条件。你可以使用像Discord和Slack这样的平台来促进有组织的对话。此外，像Canva和Google Drive这样的协作平台非常适合托管工程文档、评审演示和营销材料。你的成员能够访问的材料越多，他们就能够贡献越多。

source: Ideally, every member will also be openly documenting the projects they work on. This way, if another member needs to take over or work to improve a project, they can utilize publicly available documentation to work effectively.
es_mx: Lo ideal es que cada miembro documente abiertamente los proyectos en los que trabaja. De este modo, si otro miembro necesita hacerse cargo de un proyecto o trabajar para mejorarlo, podrá utilizar la documentación disponible públicamente para trabajar con eficacia.
fr_ca: Idéalement, chaque membre documentera ouvertement les projets sur lesquels il travaille. Ainsi, si un autre membre doit reprendre ou améliorer un projet, il pourra utiliser la documentation publiquement disponible pour travailler efficacement.
ru_ru: В идеале каждый участник должен документировать и загружать в открытый доступ проекты, над которыми он работает. Таким образом, если другому человеку потребуется взять на себя ответственность за модуль или внести какие-либо доработки, он сможет воспользоваться общедоступной документацией для более быстрого и эффективного начала работы.
zh_cn: 理想情况下，每个成员也会公开记录他们正在进行的项目。这样，如果另一个成员需要接管或改进一个项目，他们就可以利用公开可用的文档来有效地工作。

source: Host mandatory team meetings at least once a week, and share each squad's progress. This will give your team up-to-date knowledge about your robot and allow everyone to offer ideas at every stage of the design, programming, and outreach process.
es_mx: Organice reuniones de equipo obligatorias al menos una vez a la semana y comparta los progresos de cada escuadrón. De este modo, el equipo estará al día sobre el robot y todos podrán aportar ideas en cada fase del proceso de diseño, programación y difusión.
fr_ca: Organisez des réunions d'équipe obligatoires au moins une fois par semaine et partagez les progrès de chaque équipe. Cela permettra à votre équipe d'avoir des connaissances actualisées sur votre robot et à chacun de proposer des idées à chaque étape de la conception, de la programmation et du processus de sensibilisation.
ru_ru: Проводите обязательные для всех собрания команды не реже одного раза в неделю и делитесь информацией о прогрессе по каждому модулю. Это позволит команде вовремя получать актуальную информацию о роботе и предлагать свои идеи на всех этапах работы с ним.
zh_cn: 每周至少举行一次强制性的团队会议，并分享每个小队的进展。这将让你的团队了解你的机器人的最新情况，并让每个人在设计、编程和外联过程的每个阶段提供意见。

source: Design Collaboration
es_mx: Colaboración en el Diseño
fr_ca: Collaboration en matière de conception
ru_ru: Совместная Инженерная Работа
zh_cn: 设计协作

source: Your designers probably have different styles of design and mechanical preferences, and their unique preferences can improve each of the different mechanisms on your robot.
es_mx: Sus diseñadores probablemente tengan diferentes estilos de diseño y preferencias mecánicas, y sus preferencias únicas pueden mejorar cada uno de los diferentes mecanismos de su robot.
fr_ca: Vos concepteurs ont probablement des styles de conception et des préférences mécaniques différents, et leurs préférences uniques peuvent améliorer chacun des différents mécanismes de votre robot.
ru_ru: Ваши инженеры, вероятно, имеют разные стили проектирования и мнения при выборе механизма. Индивидуальный подход каждого участника может сильно улучшить модули вашего робота.
zh_cn: 你的设计师可能有不同的设计风格和机械偏好，他们独特的偏好可以改善你的机器人上不同的机构。

source: Competitive Design
es_mx: Diseño Competitivo
fr_ca: Conception compétitive
ru_ru: Параллельная Разработка
zh_cn: 竞争性设计

source: One way to maximize your designers' creativity is to competitively prototype. 2-3 designers pick a mechanism and develop their own take on the design, then physically prototype them to test against certain criteria. The most successful design integrates the most successful components of each and is iteratively improved by a singular designer.
es_mx: Una forma de maximizar la creatividad de tus diseñadores es prototipar de manera competitiva. 2-3 diseñadores eligen un mecanismo y desarrollan su propia versión del diseño, luego lo prototipan físicamente para probarlo según ciertos criterios. El diseño más exitoso integra los componentes más exitosos de cada uno y es mejorado de forma iterativa por un diseñador único.
fr_ca: L'un des moyens de maximiser la créativité de vos concepts est de procéder à un prototypage compétitif. 2-3 concepteurs choisissent un mécanisme et développent leur propre conception, puis réalisent un prototype physique pour le tester en fonction de certains critères. La conception la plus réussie intègre les éléments les plus performants de chacun et est améliorée de manière itérative par un seul concept.
ru_ru: Одним из способов использования творческого потенциала каждого из инженеров по максимуму является параллельное проектирование. 2-3 инженера выбирают механизм и разрабатывают свой собственный вариант конструкции, а затем создают физические прототипы для их проверки на соответствие определенным критериям. Итоговый механизм обычно объединяет в себе наиболее эффективные компоненты каждого из прототипов, а также постепенно совершенствуется одним из инженеров.
zh_cn: 提高设计师创造力的一种方法是竞争性原型。2-3名设计师选择一个机构，并开发自己对设计的看法，然后进行物理原型测试，以便根据一定的标准进行测试。最成功的设计集成了每个设计中最成功的组件，并由单一设计师进行迭代改进。

source: The biggest benefit to this approach is that you can integrate aspects of each designers' personal techniques.
es_mx: El mayor beneficio de este enfoque es que puedes integrar aspectos de las técnicas personales de cada diseñador.
fr_ca: Le plus grand avantage de cette approche est qu'elle permet d'intégrer des aspects des techniques personnelles de chaque concepteur.
ru_ru: Самое большое преимущество такого подхода заключается в объединении сильных сторон каждого инженера.
zh_cn: 这种方法最大的好处是你可以整合每个设计师的个人技巧。

source: 7149 Enforcers, PowerPlay, Example of Competitive Prototyping. Two of their designers built an intake, with the final optimized design utilizing the best aspects from each prototype.
es_mx: 7149 Enforcers, PowerPlay, Ejemplo de Prototipado Competitivo. Dos de sus diseñadores construyeron un intake, con el diseño final optimizado utilizando los mejores aspectos de cada prototipo.
fr_ca: 7149 Enforcers, PowerPlay, exemple de prototypage compétitif. Deux de leurs concepteurs ont construit une prise d'air, le design final optimisé utilisant les meilleurs aspects de chaque prototype.
ru_ru: 7149 Enforcers, PowerPlay, пример параллельного проектирования. Два инженера сконструировали свои захваты, при этом в окончательном оптимизированном варианте были использованы наилучшие стороны каждого из прототипов.
zh_cn: 队伍7149 ，英文队名Enforcers 在 PowerPlay 赛季中竞争性原型的例子。他们的两名设计师制作了一个拾取结构，最终优化的设计利用了每个原型的最佳方面。

source: Cloud CAD
es_mx: CAD en la Nube
fr_ca: Nuage informatique CAO
ru_ru: Облачный САПР
zh_cn: 云CAD

source: Your design team (and the rest of the team, if possible) should have access to your full suite of designs. Sharing your designs allows for teammates to help each other improve by sharing techniques and tricks, and allows your outreach team to easily create renders for presentations and marketing.
es_mx: Tu equipo de diseño (y el resto del equipo, si es posible) debería tener acceso a tu conjunto completo de diseños. Compartir tus diseños permite que los compañeros de equipo se ayuden mutuamente a mejorar, compartiendo técnicas y trucos, y permite que tu equipo de divulgación cree fácilmente representaciones (renders) para presentaciones y marketing.
fr_ca: Votre équipe de conception (et le reste de l'équipe, si possible) doit avoir accès à l'ensemble de vos conceptions. Le partage de vos créations permet à vos coéquipiers de s'aider mutuellement à s'améliorer en échangeant des techniques et des astuces, et à votre équipe de sensibilisation de créer facilement des rendus pour les présentations et le marketing.
ru_ru: Ваша команда инженеров (и, по возможности, остальные участники команды) должна иметь доступ ко всем вашим 3D-моделям. Общий доступ к проектам позволяет участникам команды помогать друг другу в их совершенствовании, обмениваясь разными методиками и приемами, а также дает быстрый доступ медиа-команде к рендеру моделей.
zh_cn: 你的设计团队（如果可能的话，还有其他团队成员）应该能够访问你的全部设计。分享你的设计可以让队友互相帮助，分享技巧和窍门，也可以让你的外联团队轻松地为演示和营销制作渲染图。

source: This can be accomplished by using CAD software built around shared folders like Onshape or Fusion 360. It can also be accomplished with other CAD software, like Solidworks or Inventor, but this is generally significantly more complicated to set up.
es_mx: Esto se puede lograr utilizando software CAD basado en carpetas compartidas como Onshape o Fusion 360. También se puede lograr con otro software CAD, como Solidworks o Inventor, pero generalmente esto es significativamente más complicado de configurar.
fr_ca: Pour ce faire, il est possible d'utiliser un logiciel de CAO basé sur des dossiers partagés, comme Onshape ou Fusion 360. Il est également possible d'utiliser d'autres logiciels de CAO, tels que Solidworks ou Inventor, mais leur mise en place est généralement beaucoup plus compliquée.
ru_ru: Для этого можно использовать облачные программные обеспечения САПР, такие как Onshape или Fusion 360. Можно также использовать другие программы, например Solidworks и Inventor, но настраивать их обычно значительно сложнее.
zh_cn: 这可以通过使用像Onshape或Fusion 360这样基于共享文件夹的CAD软件来实现。也可以用其他CAD软件，比如Solidworks或Inventor，但这通常要复杂得多才能设置好。

source: Software Collaboration
es_mx: Colaboración de Software
fr_ca: Collaboration logicielle
ru_ru: Совместная Работа над Программным Кодом
zh_cn: 软件协作

source: Software collaboration is easier to facilitate. Robot code should be version controlled regardless of the size of your software squad, so teaching your members how to share a team Github is an easy way to collaborate. Additionally, you can utilize pair programming (multiple members writing software together on one computer) to help catch bugs.
es_mx: La colaboración de software es más fácil de facilitar. El código del robot debe ser controlado por versiones sin importar el tamaño de tu equipo de software, por lo que enseñar a tus miembros cómo compartir un equipo de Github es una forma fácil de colaborar. Además, puedes utilizar la programación en pareja (varios miembros escribiendo software juntos en una computadora) para ayudar a detectar errores.
fr_ca: La collaboration logicielle est plus facile à faciliter. Le code du robot doit être contrôlé par version, quelle que soit la taille de votre équipe logicielle. Apprendre à vos membres à partager un Github d'équipe est donc un moyen facile de collaborer. En outre, vous pouvez utiliser la programmation en binôme (plusieurs membres qui écrivent un logiciel ensemble sur un ordinateur) pour aider à détecter les bogues.
ru_ru: Организовать совместную работу над кодом намного проще. Код робота должен иметь некую версионность независимо от количества программистов, поэтому легче всего просто научить всех пользоваться GitHub. Кроме того, можно применять парное программирование (когда несколько участников совместно пишут код на одном компьютере) — это помогает выявлять ошибки.
zh_cn: 软件协作更容易促进。无论你的程序小组有多大，机器人代码应该进行版本控制，所以教你的成员如何共享一个团队Github是一种简单的协作方式。此外，你还可以利用配对编程（多个成员在一台电脑上一起编写软件）来帮助捕捉错误。

source: Efficiency
es_mx: Eficiencia
fr_ca: Efficacité
ru_ru: Эффективность
zh_cn: 效率

source: Collaboration only works if exercised efficiently. Here are some tips!
es_mx: La colaboración solo funciona si se ejerce de manera eficiente. ¡Aquí hay algunos consejos!
fr_ca: La collaboration ne fonctionne que si elle est exercée de manière efficace. Voici quelques conseils !
ru_ru: Совместная работа хороша только в том случае, если она осуществляется эффективно. Поэтому вот несколько советов!
zh_cn: 协作只有在有效地执行时才有效。以下是一些提示！

source: **Work from home.** Team meetings should be used as time to catch up between squads, make decisions, and physically test parts of the robot. CAD design iterations can be created and reviewed at home, and software can be written outside of practice hours. This will allow you more time to test and reflect.
es_mx: **Trabaja desde casa.** Las reuniones de equipo deben utilizarse como tiempo para ponerse al día entre los equipos, tomar decisiones y probar físicamente partes del robot. Las iteraciones de diseño CAD se pueden crear y revisar en casa, y el software se puede escribir fuera del horario de práctica. Esto te permitirá tener más tiempo para probar y reflexionar.
fr_ca: **Travaillez de la maison**Les réunions d'équipe devraient être utilisées pour rattraper le temps perdu entre les sous-équipes, prendre des décisions et tester physiquement certaines parties du robot. Les itérations de conception CAO peuvent être créées et révisées à la maison, et les logiciels peuvent être écrits en dehors des heures de pratiques. Vous aurez ainsi plus de temps pour tester et réfléchir.
ru_ru: **Работайте из дома.** Встречи команды должны использоваться как время для общения между участниками, принятия решений и тестирования модулей робота. САПР-проекты можно создавать и просматривать дома, а программный код можно писать в нерабочее время. Это позволит вам получить больше времени для тестирования и размышлений над возникающими проблемами.
zh_cn: **在家工作。** 团队会议应该用来在小队之间交流，做出决定，并对机器人的部件进行实体测试。CAD设计迭代可以在家创建和审查，软件也可以在练习时间之外编写。这将让你有更多的时间来测试和反思。

source: **Delegate tasks effectively.** Squad leads should serve as facilitators, assigning tasks to squad members depending on their ability. If work is hoarded by one or two people, the overall workflow is slowed down immensely. Trust your teammates.
es_mx: **Delegar tareas de manera efectiva.** Los líderes de equipo deben actuar como facilitadores, asignando tareas a los miembros del equipo según su capacidad. Si el trabajo es acaparado por una o dos personas, el flujo de trabajo en general se atrasa enormemente. Confía en tus compañeros de equipo.
fr_ca: **Séparez les tâches de manière efficace**Les chefs d'équipe doivent jouer le rôle de facilitateurs et assigner des tâches aux membres de l'équipe en fonction de leurs capacités. Si le travail est accaparé par une ou deux personnes, le flux de travail global est considérablement ralenti. Faites confiance à vos coéquipiers.
ru_ru: **Распределяйте задачи между участниками равномерно и эффективно.** Лидеры каждой из групп должны выступать в роли координаторов, раздавая задания в своей части команды в зависимости от их способностей. Если работа перекладывается на одного-двух человек, то общий рабочий процесс сильно замедляется. Доверяйте своим товарищам по команде.
zh_cn: **有效地分配任务。** 小队领导应该充当协调者，根据他们的能力分配任务给小队成员。如果工作被一两个人独占，整个工作流程就会大大减慢。信任你的队友。

source: **Follow deadlines and don't procrastinate.** Setting deadlines allows you to plan your season, and the earlier you start before a deadline, the more time you have to ask for help, tackle unexpected problems, and iterate more.
es_mx: **Sigue los plazos/metas y no procrastines.** Establecer plazos/metas te permite planificar tu temporada, y cuanto antes comiences antes de un plazo, más tiempo tendrás para pedir ayuda, abordar problemas inesperados e iterar más.
fr_ca: **Respectez les délais et ne procrastinez pas**Fixer des échéances vous permet de planifier votre saison, et plus vous commencez tôt avant une échéance, plus vous avez le temps de demander de l'aide, de résoudre des problèmes inattendus et d'itérer davantage.
ru_ru: **Соблюдайте сроки и не откладывайте работу на потом.** Установка дедлайнов позволяет эффективно планировать работу на сезон, и чем раньше вы приступите к выполнению задачи, тем больше времени у вас будет, чтобы попросить помощи или решить неожиданно появившиеся проблемы.
zh_cn: **遵守截止日期，不要拖延。** 设定截止日期可以让你规划你的赛季，而且你越早开始完成截止日期之前的工作，你就有更多的时间寻求帮助，解决意外问题，并进行更多的迭代。

source: **Share.** If a team member has to search for documentation you were supposed to complete or an email you were supposed to send out, it creates a massive amount of administrative headache. Make sure you CC the correct people on emails and share your work with your entire team.
es_mx: **Comparte.** Si un miembro del equipo tiene que buscar documentación que se suponía que debías completar o un correo electrónico que se suponía que debías enviar, crea una gran cantidad de dolores de cabeza administrativos. Asegúrate de incluir en copia a las personas correctas en los correos electrónicos y comparte tu trabajo con todo tu equipo.
fr_ca: **Partagez**Si un membre de l'équipe doit rechercher une documentation que vous étiez censé compléter ou un courriel que vous étiez censé envoyer, cela crée un énorme casse-tête administratif. Veillez à indiquer les bonnes personnes sur les courriels et à partager votre travail avec l'ensemble de votre équipe.
ru_ru: **Делитесь .** Если участнику команды приходится тратить время на поиск документации, которую вы должны были написать, или электронное письмо, которое должны были отправить, это создает множество проблем. Убедитесь в том, что отправляете всю нужную информацию правильным людям и делитесь своей работой со всей командой.
zh_cn: **分享。** 如果一个团队成员不得不搜索你应该完成的文档或者你应该发送的电子邮件，这会造成大量的行政麻烦。确保你在电子邮件上抄送正确的人，并与你的整个团队分享你的工作。

source: **Don't hide problems.** If you broke something or calculated something incorrectly, don't shove it under the rug. Your teammates should (and will) be incredibly understanding and will help to fix the problem. Being correct all the time is impossible, and everyone makes mistakes!
es_mx: **No ocultes los problemas.** Si rompiste algo o calculaste algo incorrectamente, no lo escondas debajo de la alfombra. Tus compañeros de equipo deberían (y lo harán) ser increíblemente comprensivos y te ayudarán a solucionar el problema. Estar correcto todo el tiempo es imposible, ¡y todos cometemos errores!
fr_ca: **Ne cachez pas vos problèmes**Si vous avez cassé quelque chose ou calculé quelque chose de manière incorrecte, ne le cachez pas. Vos coéquipiers devraient être (et seront) incroyablement compréhensifs et vous aideront à résoudre le problème. Il est impossible d'être toujours correct, et tout le monde fait des erreurs !
ru_ru: **Не скрывайте возникнувшие проблемы.** Если вы что-то сломали или неправильно рассчитали, ни в коем случае не молчите об этом! Ваши сокомандники должны (и будут) с пониманием отнестись к проблеме и помочь ее решить. Делать все идеально невозможно, а ошибки бывают у всех.
zh_cn: **不要隐藏问题。** 如果你弄坏了什么或者计算错误了什么，不要把它藏起来。你的队友应该（而且会）非常理解并帮助你解决问题。人不可能一直正确，每个人都会犯错！
