Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/how-to-ask-effective-questions.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: **Ask for an outline of someone else's problem solving process.** How did someone else solve the problem? How can you use this process to solve more of your own problems in the future?
es_mx: **Pide un resumen del proceso de resolución de problemas de otra persona.** ¿Cómo resolvió el problema otra persona? ¿Cómo puedes utilizar este proceso para resolver tus propios problemas en el futuro?
fr_ca: **Demandez un aperçu du processus de résolution de problèmes de quelqu'un d'autre.** Comment cette personne a-t-elle résolu le problème ? Comment pouvez-vous utiliser ce processus pour résoudre davantage de vos propres problèmes à l'avenir ?
ru_ru: **Попросите рассказать о процессе решения чужой проблемы.** Как человек решил проблему? Как вы можете использовать этот процесс для решения своих собственных проблем в будущем?
zh_cn: **询问别人解决问题的过程大纲。** 别人是如何解决问题的？今后如何利用这一过程来解决自己的更多问题？

source: **Find gaps in your knowledge.** What information were you missing that led to the problem? How can you develop this area of your knowledge?
es_mx: **¿Qué información te faltaba para resolver el problema? ¿Cómo puedes desarrollar esta área de tus conocimientos?
fr_ca: **Quelles sont les informations qui vous manquent et qui sont à l'origine du problème ? Comment pouvez-vous développer ce domaine de vos connaissances ?
ru_ru: **Найдите пробелы в своих знаниях.** Какой информации вам не хватало, что привело к возникновению проблемы? Как вы можете развить эту область своих знаний?
zh_cn: **找出你的知识空白** 你缺少哪些信息导致了问题的出现？如何发展这方面的知识？

source: If the answer to one of these questions is not apparent, ask the person who helped you and have them provide some more insight. If they were willing to help you figure out the initial problem, they will probably help you to understand the solution as well.
es_mx: Si la respuesta a una de estas preguntas no es evidente, pregúntele a la persona que le ayudó y pídale que le proporcione más información. Si estuvieron dispuestos a ayudarte a resolver el problema inicial, probablemente también te ayudarán a entender la solución.
fr_ca: Si la réponse à l'une de ces questions n'est pas évidente, demandez à la personne qui vous a aidé de vous éclairer. Si elle a accepté de vous aider à résoudre le problème initial, elle vous aidera probablement aussi à comprendre la solution.
ru_ru: Если ответ на один из этих вопросов не очевиден, обратитесь к человеку, который вам помогал, и попросите его рассказать о ситуации. Если они были готовы помочь вам разобраться в исходной проблеме, то, скорее всего, они помогут вам разобраться и с решением.
zh_cn: 如果其中一个问题的答案不明显，请询问帮助过您的人，让他们提供更多的见解。如果他们愿意帮你找出最初的问题，那么他们很可能也会帮助你了解解决方案。

source: If you solve the problem on your own but already posted a question, post a response which describes how you solved the issue. This clarification can help someone in the future solve the problem in much less time.
es_mx: Si resuelves el problema por tu cuenta pero ya has publicado una pregunta, publica una respuesta en la que describas cómo resolviste el problema. Esta aclaración puede ayudar a alguien en el futuro a resolver el problema en mucho menos tiempo.
fr_ca: Si vous avez résolu le problème vous-même, mais que vous avez déjà posé une question, postez une réponse décrivant la manière dont vous avez résolu le problème. Cette clarification peut aider quelqu'un à l'avenir à résoudre le problème en beaucoup moins de temps.
ru_ru: Если вы самостоятельно решили проблему, но уже задали вопрос публично — обязательно оставьте ответ с описанием найденного решения. Такое уточнение может в будущем помочь другим участникам справиться с аналогичной задачей за значительно меньшее время.
zh_cn: 如果您自行解决了问题，但已经发布了问题，请在回复中说明您是如何解决问题的。这样的说明可以帮助其他人在更短的时间内解决问题。

source: **Reddit and Discord** - The `FTC Subreddit <https://www.reddit.com/r/FTC/>`_ and Discord Server (:doc:`../useful-resources`) can also be useful places to find previous answers or to ask your own. Try searching through the past questions with keywords relating to your own.
fr_ca: **Reddit et Discord** – Le Subreddit `FTC <https://www.reddit.com/r/FTC/>_` et le serveur Discord (:doc:../useful-resources) peuvent également être des ressources utiles pour trouver des réponses précédentes ou poser vos propres questions. Essayez de rechercher parmi les questions passées en utilisant des mots-clés liés à votre situation.
ru_ru: Reddit и Discord — Сабреддит FTC <https://www.reddit.com/r/FTC/>_ и сервер в Discord (:doc:../useful-resources) также могут быть полезными площадками для поиска готовых ответов или задавания собственных вопросов. Рекомендуем воспользоваться поиском по прошлым обсуждениям, используя ключевые слова, связанные с вашей темой.
zh_cn: **Reddit 和 Discord** - `FTC Subreddit <https://www.reddit.com/r/FTC/>`_ 和 Discord 服务器（:doc:`.../useful-resources`）也是查找以前的答案或提出自己的问题的好地方。请尝试用合适的关键字搜索过去的问题。
