Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/how-to-ask-effective-questions.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: How to Ask Effective Questions
es_mx: Cómo formular preguntas eficaces
fr_ca: Comment poser des questions efficaces
ru_ru: Как Задавать Эффективные Вопросы
zh_cn: 如何提出有效的问题

source: Asking questions effectively is one of the most important skills to develop, especially for your life outside of robotics. Being able to learn from your questions properly is crucial and as such, you should be able to ask good questions, help those who want to help you, and make the most of what you are taught.
es_mx: Hacer preguntas de forma eficaz es una de las habilidades más importantes que debes desarrollar, especialmente para tu vida fuera de la robótica. Ser capaz de aprender de tus preguntas adecuadamente es crucial y, como tal, debes ser capaz de hacer buenas preguntas, ayudar a los que quieren ayudarte y sacar el máximo de lo que te enseñan.
fr_ca: Poser des questions de manière efficace est l'une des compétences les plus importantes à développer, en particulier pour votre vie en dehors de la robotique. Il est essentiel de pouvoir tirer des enseignements de vos questions et, à ce titre, vous devez être en mesure de poser de bonnes questions, d'aider ceux qui veulent vous aider et de tirer le meilleur parti de ce que l'on vous enseigne.
ru_ru: Умение эффективно задавать вопросы - один из самых важных навыков, который необходимо развивать, особенно для жизни вне робототехники. Умение правильно учиться на своих вопросах очень важно, поэтому вы должны уметь задавать хорошие вопросы, помогать тем, кто хочет помочь вам, и извлекать максимум пользы из того, чему вас учат.
zh_cn: 有效提问是最重要的技能之一，尤其是在机器人学习以外的生活中。因此，你应该能够提出好问题，帮助那些想帮助你的人，并充分利用所学知识。

source: Research First
es_mx: Primero la investigación
fr_ca: La recherche d'abord
ru_ru: Сначала Исследование
zh_cn: 研究优先

source: Before you ask a question, you should do your own research to find the answer. This will take more time and more effort, but it is crucial to learn to find solutions on your own, and learn how to research effectively to find solutions to your problems. In the end, this research will pay off in the long run, helping you to learn about topics relevant to your question, and often helping you to understand the roots of the problems you encounter.
es_mx: Antes de hacer una pregunta, debes investigar por tu cuenta para encontrar la respuesta. Esto te llevará más tiempo y más esfuerzo, pero es crucial para aprender a encontrar soluciones por ti mismo, y aprender a investigar eficazmente para encontrar soluciones a tus problemas. Al final, esta investigación te compensará a largo plazo, ya que te ayudará a aprender sobre temas relevantes para tu pregunta y, a menudo, te ayudará a comprender las raíces de los problemas que encuentres.
fr_ca: Avant de poser une question, vous devez faire vos propres recherches pour trouver la réponse. Cela vous demandera plus de temps et d'efforts, mais il est essentiel d'apprendre à trouver des solutions par vous-même et d'apprendre à faire des recherches efficaces pour trouver des solutions à vos problèmes. En fin de compte, ces recherches seront payantes à long terme, car elles vous aideront à vous informer sur des sujets en rapport avec votre question et, souvent, à comprendre l'origine des problèmes que vous rencontrez.
ru_ru: Прежде чем задать вопрос, вам следует провести собственное исследование, чтобы найти ответ. Это потребует больше времени и усилий, но очень важно научиться находить решения самостоятельно и научиться эффективно проводить исследования, чтобы найти решение своих проблем. В конце концов, эти исследования окупятся в долгосрочной перспективе, помогая вам узнать о темах, имеющих отношение к вашему вопросу, и часто помогая вам понять корни проблем, с которыми вы сталкиваетесь.
zh_cn: 在你提出问题之前，你应该自己研究，找到答案。这需要花费更多的时间和精力，但关键是要学会自己寻找解决方案，学会如何有效地进行研究，找到解决问题的办法。从长远来看，这种研究最终会给你带来回报，帮助你了解与你的问题相关的主题，并经常帮助你了解你所遇到的问题的根源。

source: Here are some steps that you could take to research your problem:
es_mx: He aquí algunos pasos que podrías dar para investigar tu problema:
fr_ca: Voici quelques mesures que vous pouvez prendre pour étudier votre problème :
ru_ru: Вот несколько шагов, которые вы можете предпринять для изучения своей проблемы:
zh_cn: 以下是您可以采取的一些研究问题的步骤：

source: **Checking Official Documentation** - If documentation or instructions are available, make sure to carefully examine the relevant sections of them. Your problem may already be addressed, or may be caused by you misreading something.
es_mx: **Checando documentación oficial** - Si dispone de documentación o instrucciones, asegúrese de examinar detenidamente las secciones pertinentes de las mismas. Es posible que su problema ya esté resuelto o que se deba a que ha leído algo mal.
fr_ca: **Vérification de la documentation officielle** - Si une documentation ou des instructions sont disponibles, veillez à examiner attentivement les sections correspondantes. Il se peut que votre problème soit déjà résolu ou qu'il soit dû à une mauvaise lecture.
ru_ru: **Проверка Официальной Документации** - Если имеется документация или инструкции, внимательно изучите соответствующие разделы. Возможно, ваша проблема уже решена или вызвана тем, что вы что-то неправильно поняли.
zh_cn: **检查官方文档** - 如果有文档或说明，请务必仔细检查其中的相关部分。您的问题可能已经得到解决，也可能是您误读了某些内容。

source: **Google** - Simply search your problem. You will be surprised by how often this solves the issue. Try word the question in many different ways to find similar questions that may have already been asked. Focus on including keywords about your problem and if it is about programming, include relevant error messages and codes.
es_mx: **Google** - Simplemente busque su problema. Te sorprenderá la frecuencia con la que esto resuelve la cuestión. Intenta redactar la pregunta de muchas formas diferentes para encontrar preguntas similares que puede que ya se hayan planteado. Céntrate en incluir palabras clave sobre tu problema y, si es sobre programación, incluye mensajes de error y códigos relevantes.
fr_ca: **Google** - Faites une recherche sur votre problème. Vous serez surpris par le nombre de fois où cela permet de résoudre le problème. Essayez de formuler la question de différentes manières pour trouver des questions similaires qui ont peut-être déjà été posées. Concentrez-vous sur l'inclusion de mots-clés relatifs à votre problème et, s'il s'agit de programmation, incluez les messages d'erreur et les codes pertinents.
ru_ru: **Поиск в интернете** - просто наберите в поисковике вашу проблему. Вы будете удивлены тем, как часто это помогает решить проблему. Попробуйте сформулировать вопрос по-разному, чтобы найти похожие вопросы, которые, возможно, уже были заданы. Сосредоточьтесь на включении ключевых слов о вашей проблеме, а если речь идет о программировании, включите соответствующие сообщения об ошибках и коды.
zh_cn: **搜索引擎** - 只需搜索您的问题。你会惊讶地发现，这样做往往能解决问题。尝试用多种不同的方式来表达问题，以找到可能已经有人问过的类似问题。重点包含与您的问题有关的关键词，如果问题与编程有关，则包含相关的错误信息和代码。

source: When looking for past documents or sections of textbooks, add "filetype:pdf" to the beginning of your search to filter the search results into only .pdf documents.
es_mx: Cuando busque documentos anteriores o secciones de libros de texto, añada "filetype:pdf" al principio de la búsqueda para filtrar los resultados de la búsqueda en sólo documentos .pdf.
fr_ca: Lorsque vous recherchez des anciens documents ou des sections de manuels, ajoutez "filetype:pdf" au début de votre recherche pour filtrer les résultats de la recherche en ne retenant que les documents .pdf.
ru_ru: При поиске прошлых документов или разделов учебников добавьте в начало поиска «filetype:pdf», чтобы отфильтровать результаты поиска только по документам в формате .pdf.
zh_cn: 在查找过去的文件或教科书章节时，请在搜索开头添加 "filetype:pdf"，以便将搜索结果过滤为仅 .pdf 文件。

source: **YouTube** - There are many great resources on YouTube which can help with even obscure problems.
es_mx: **YouTube** - Hay muchos recursos en YouTube que pueden ayudar incluso con problemas poco conocidos.
fr_ca: **YouTube** - Il existe de nombreuses ressources intéressantes sur YouTube qui peuvent aider à résoudre même de rares problèmes .
ru_ru: **YouTube** - На YouTube есть множество отличных ресурсов, которые помогут разобраться даже с непонятными проблемами.
zh_cn: **视频网站** - YouTube 或者 Bilibili 上有许多很好的资源，甚至可以帮助解决一些晦涩难懂的问题。

source: **Reddit and Discord** - The `FTC Subreddit <https://www.reddit.com/r/ftc/>`_ and Discord Server (:doc:`../useful-resources`) can also be useful places to find previous answers or to ask your own. Try searching through the past questions with keywords relating to your own.
es_mx: **Reddit y Discord** - `FTC Subreddit <https://www.reddit.com/r/ftc/>`_ y Discord Server (:doc:`../useful-resources`) también pueden ser lugares útiles para encontrar respuestas anteriores o para preguntar las tuyas propias. Intenta buscar entre las preguntas anteriores con palabras clave relacionadas con la tuya.

source: **Past Examples** - Try find past implementations of whatever problem you are trying to solve. This step may take more time, as it requires finding the example, and then deciphering how someone else figured out the solution, but this process can be super valuable. For programming, digging through another person's repository can be very insightful. Likewise, for mechanical design, taking a look at a teams technical binder or CAD release.
es_mx: **Ejemplos anteriores** - Intenta encontrar implementaciones anteriores del problema que intentas resolver. Este paso puede tomar más tiempo, ya que requiere encontrar el ejemplo, y luego descifrar cómo alguien más encontró la solución, pero este proceso puede ser muy valioso. Para la programación, escarbar en el repositorio de otra persona puede ser muy revelador. Del mismo modo, para el diseño mecánico, echar un vistazo a la carpeta técnica de un equipo o a una publicación CAD.
fr_ca: **Exemples antérieurs** - Essayez de trouver des mises en œuvre antérieures du problème que vous essayez de résoudre. Cette étape peut prendre plus de temps, car il faut trouver l'exemple, puis déchiffrer comment quelqu'un d'autre a trouvé la solution, mais ce processus peut s'avérer très utile. Pour la programmation, fouiller dans le référentiel d'une autre personne peut s'avérer très instructif. De même, pour la conception mécanique, jeter un coup d'œil au classeur technique d'une équipe ou à une version de CAO.
ru_ru: **Прошлые примеры** - Попробуйте найти прошлые реализации той проблемы, которую вы пытаетесь решить. Этот шаг может занять больше времени, поскольку требует поиска примера, а затем расшифровки того, как кто-то другой нашел решение, но этот процесс может быть очень ценным. Для программирования копание в чужом репозитории может быть очень полезным. Аналогичным образом, для инженерного проектирования можно посмотреть на техническую папку команды или 3D-модель.
zh_cn: **过去的例子** - 无论你想解决什么问题，都要尝试找到过去的实现方法。这一步可能需要花费更多时间，因为它需要找到示例，然后解读别人是如何找出解决方案的，但这个过程可能非常有价值。对于编程来说，从别人的资料库中挖掘出的东西会让你受益匪浅。同样，对于机械设计来说，看看团队的技术资料夹或 CAD 版本也是很有帮助的。

source: For programming questions, it can sometimes be helpful to find past implementations through `GitHub Code Search <https://github.com/search?type=code>`_. Note this currently requires a GitHub account. Even if you don't find the solution, examining other codebases can teach you a lot about general strategies and functions you may not have seen before.
es_mx: Para cuestiones de programación, a veces puede ser útil encontrar implementaciones anteriores a través de `GitHub Code Search <https://github.com/search?type=code>`_. Tenga en cuenta que esto requiere actualmente una cuenta de GitHub. Incluso si no encuentras la solución, examinar otras bases de código puede enseñarte mucho sobre estrategias generales y funciones que puede que no hayas visto antes.
fr_ca: Pour les questions de programmation, il peut parfois être utile de trouver des implémentations antérieures via `GitHub Code Search <https://github.com/search?type=code>`_. Notez que cela nécessite actuellement un compte GitHub. Même si vous ne trouvez pas la solution, l'examen d'autres bases de code peut vous apprendre beaucoup de choses sur les stratégies générales et les fonctions que vous n'avez peut-être pas vues auparavant.
ru_ru: Для вопросов программирования иногда полезно найти прошлые реализации через `GitHub Code Search <https://github.com/search?type=code>`_. Обратите внимание, что в настоящее время для этого требуется учетная запись на GitHub. Даже если вы не найдете решение, изучение других кодов может научить вас многому об общих стратегиях и функциях, которые вы, возможно, не видели раньше.
zh_cn: 对于编程问题，通过 `GitHub 代码搜索 <https://github.com/search?type=code>`_ 查找过去的实现有时会有所帮助。请注意，这目前需要一个 GitHub 账户。即使找不到解决方案，研究其他代码库也能让你学到很多以前可能没见过的一般策略和功能。

source: Be Specific
es_mx: Sea específico
fr_ca: Soyez précis
ru_ru: Будьте Конкретны
zh_cn: 问题要具体

source: For others to be able to provide a good solution to your problem, they need the specifics. This means doing the following:
es_mx: Para que otros puedan ofrecer una buena solución a tu problema, necesitan los datos concretos. Esto significa hacer lo siguiente:
fr_ca: Pour que d'autres puissent apporter une bonne solution à votre problème, il faut qu'ils en connaissent les détails. Cela signifie qu'il faut faire ce qui suit :
ru_ru: Чтобы другие могли предложить хорошее решение вашей проблемы, им нужна конкретная информация. Это означает, что нужно сделать следующее:
zh_cn: 要让其他人能够为您的问题提供好的解决方案，他们需要了解具体情况。这意味着要做到以下几点：

source: **Break down the problem.**
es_mx: **Desglosa el problema.
fr_ca: **Décomposer le problème.**
ru_ru: **Определите Проблему.**
zh_cn: **分解问题。**

source: You should try to pinpoint the problem as much as possible. For example, when encountering robot crashes, try to collect as much data as possible around the times when your robot crashes. You may not understand this information yourself, but it may allow others to solve your issue. It can also be useful to explain why you're asking. It can be easy to get stuck on a specific solution to a problem when it would be better solved in an entirely different way; this is known as the `XY Problem <https://xyproblem.info/>`_.
es_mx: Debes intentar localizar el problema en la medida de lo posible. Por ejemplo, si el robot se bloquea, intenta recopilar todos los datos posibles sobre los momentos en los que se bloquea. Puede que tú mismo no entiendas esta información, pero puede que permita a otros resolver tu problema. También puede ser útil explicar por qué preguntas. Puede ser fácil atascarse en una solución específica a un problema cuando éste se resolvería mejor de una manera totalmente diferente; esto se conoce como el `Problema XY <https://xyproblem.info/>`_.
fr_ca: Vous devez essayer de cerner le problème autant que possible. Par exemple, lorsque vous rencontrez des pannes de robot, essayez de collecter autant de données que possible sur les moments où votre robot tombe en panne. Vous ne comprendrez peut-être pas vous-même ces informations, mais elles permettront peut-être à d'autres de résoudre votre problème. Il peut également être utile d'expliquer pourquoi vous posez cette question. Il peut être facile de rester bloqué sur une solution spécifique à un problème alors qu'il serait préférable de le résoudre d'une manière totalement différente ; c'est ce que l'on appelle le "problème XY" <https://xyproblem.info/>`_.
ru_ru: Вы должны постараться как можно точнее определить проблему. Например, при возникновении сбоев в работе робота постарайтесь собрать как можно больше данных о моментах, когда робот ломается. Возможно, вы сами не поймете эту информацию, но она может помочь другим решить вашу проблему. Также может быть полезно объяснить, почему вы спрашиваете. Очень легко застрять на конкретном решении проблемы, когда ее лучше решить совершенно другим способом; это известно как `Проблема XY` <https://xyproblem.info/>`_.
zh_cn: 您应尽可能找出问题所在。例如，在遇到机器人崩溃时，应尽量收集机器人崩溃前后的数据。您自己可能不了解这些信息，但这些信息可能会让其他人解决您的问题。解释您提出问题的原因也很有用。您可能很容易被某个问题的具体解决方案所困扰，而这个问题最好用完全不同的方法来解决；这就是所谓的 `XY 问题 <https://xyproblem.info/>`_。

source: **Provide some context.**
es_mx: **Proporciona algo de contexto.**
fr_ca: **Fournissez du contexte.**
ru_ru: **Укажите Контекст.**
zh_cn: **提供一些背景情况。**

source: It is often helpful to provide context for example, what skills you are new to and hence, could be the root of the issues. Furthermore, information about your resources can help others to determine solutions which are feasible and effective within your own constraints. For example, you might be competing within a week and looking for a quick fix; make sure to mention this in your question if so.
es_mx: Suele ser útil contextualizar, por ejemplo, qué habilidades son nuevas para usted y, por tanto, podrían ser la raíz de los problemas. Además, la información sobre tus recursos puede ayudar a los demás a determinar soluciones viables y eficaces dentro de tus propias limitaciones. Por ejemplo, es posible que tengas que competir en una semana y busques una solución rápida; asegúrate de mencionarlo en tu pregunta si es así.
fr_ca: Il est souvent utile de préciser le contexte, par exemple les compétences que vous n'avez jamais acquises et qui pourraient donc être à l'origine des problèmes. En outre, des informations sur vos ressources peuvent aider les autres à déterminer des solutions réalisables et efficaces dans le cadre de vos propres contraintes. Par exemple, il se peut que vous soyez en compétition dans une semaine et que vous cherchiez une solution rapide ; assurez-vous de le mentionner dans votre question si c'est le cas.
ru_ru: Часто бывает полезно рассказать о контексте, например, о том, какие навыки у вас появились недавно и, следовательно, могут быть причиной проблем. Кроме того, информация о ваших ресурсах может помочь другим определить решения, которые будут осуществимы и эффективны в рамках ваших собственных ограничений. Например, вы можете участвовать в соревнованиях через неделю и искать быстрое решение; обязательно укажите это в своем вопросе, если это так.
zh_cn: 提供背景信息通常很有帮助，例如，你刚掌握哪些技能，因此可能是问题的根源。此外，有关您的资源的信息可以帮助他人确定在您自身限制条件下可行且有效的解决方案。例如，您可能要在一周内参加比赛，并寻求快速解决方案；如果是这样，请确保在问题中提及这一点。

source: **Share your progress.**
es_mx: **Comparte tus progresos.**
fr_ca: **Partagez vos progrès.**
ru_ru: **Делитесь своими успехами.**
zh_cn: **分享你的进展。**

source: Explain the steps you have already taken to address the problem. This may include specific troubleshooting methods, or examples of what you have been changing to try solve the issue. This helps others to gain a better understanding of the problem and avoid suggesting solutions that you have already tried.
es_mx: Explica los pasos que ya has dado para solucionar el problema. Esto puede incluir métodos específicos de solución de problemas o ejemplos de lo que has ido cambiando para intentar resolver el problema. Esto ayuda a los demás a comprender mejor el problema y evita sugerir soluciones que tú ya has probado.
fr_ca: Expliquez les mesures que vous avez déjà prises pour résoudre le problème. Il peut s'agir de méthodes de dépannage spécifiques ou d'exemples de ce que vous avez modifié pour tenter de résoudre le problème. Cela permet aux autres de mieux comprendre le problème et d'éviter de suggérer des solutions que vous avez déjà essayées.
ru_ru: Объясните, какие шаги вы уже предприняли для решения проблемы. Это может включать конкретные методы устранения неполадок или примеры того, что вы меняли, пытаясь решить проблему. Это поможет другим лучше понять проблему и не предлагать решения, которые вы уже испробовали.
zh_cn: 解释您为解决问题已经采取的步骤。这可能包括具体的故障排除方法，或举例说明您为尝试解决问题而做出的改变。这有助于他人更好地了解问题，避免提出您已经尝试过的解决方案。

source: **Don't just use words.**
es_mx: **No uses sólo palabras.**
fr_ca: **Ne vous contentez pas d'utiliser des mots.**
ru_ru: **Не используйте только слова.**
zh_cn: **不要只用语言。**

source: You should always try to provide some additional media related to the problem. This may be relevant sections of code, CAD files, images or videos. All of these provide others with a much better understanding of your problem.
es_mx: Siempre debe intentar proporcionar algún medio adicional relacionado con el problema. Puede tratarse de secciones relevantes del código, archivos CAD, imágenes o vídeos. Todo ello permite a los demás comprender mejor el problema.
fr_ca: Vous devez toujours essayer de fournir des documents supplémentaires en rapport avec le problème. Il peut s'agir de sections de code, de fichiers CAO, d'images ou de vidéos. Tous ces éléments permettent aux autres de mieux comprendre votre problème.
ru_ru: Всегда старайтесь предоставить дополнительные материалы, связанные с проблемой. Это могут быть соответствующие участки кода, 3D-модели, изображения или видео. Все это поможет другим лучше понять вашу проблему.
zh_cn: 您应尽量提供与问题相关的其他媒体。这可以是相关的代码段、CAD 文件、图片或视频。所有这些都能让他人更好地了解您的问题。

source: Understand the Solution
es_mx: Comprender la solución
fr_ca: Comprendre la solution
ru_ru: Поймите Решение
zh_cn: 了解解决方案

source: The final step for asking a question is understanding the solution. This is your own responsibility. No matter how good a teacher is, if you do not ask clarifying questions, you limit your own learning. To really understand the solution, you should do the following.
es_mx: El último paso para formular una pregunta es comprender la solución. Esto es responsabilidad tuya. Por muy bueno que sea un profesor, si no haces preguntas aclaratorias, limitas tu propio aprendizaje. Para comprender realmente la solución, debes hacer lo siguiente.
fr_ca: La dernière étape pour poser une question est de comprendre la solution. C'est votre propre responsabilité. Quelle que soit la qualité de l'enseignant, si vous ne posez pas de questions de clarification, vous limitez votre propre apprentissage. Pour bien comprendre la solution, vous devez faire ce qui suit.
ru_ru: Последний шаг к тому, чтобы задать вопрос, - это понимание решения. Это ваша собственная ответственность. Каким бы хорошим ни был учитель, если вы не задаете уточняющих вопросов, вы ограничиваете собственное обучение. Чтобы действительно понять решение, вам следует сделать следующее.
zh_cn: 提出问题的最后一步是了解解决方案。这是你自己的责任。无论老师有多好，如果你不提出明确的问题，就会限制自己的学习。要真正理解解题思路，你应该做到以下几点。

source: **Understand why the problem is solved.** How was your problem fixed? Why does this fix work?
es_mx: **Entiende por qué se ha solucionado el problema.** ¿Cómo se solucionó tu problema? ¿Por qué funciona esta solución?
fr_ca: **Comprendre pourquoi le problème est résolu **Comment votre problème a-t-il été résolu ? Pourquoi cette solution fonctionne-t-elle ?
ru_ru: **Поймите, почему проблема решена.** Как была решена ваша проблема? Почему это решение работает?
zh_cn: **了解问题解决的原因。** 你的问题是如何解决的？为什么这种修复方法有效？

source: **Figure out why the problem occurred.** What was the root cause of the problem? How can you stop it happening again?
es_mx: **Averigua por qué se ha producido el problema. ¿Cuál ha sido la causa principal del problema? ¿Cómo puedes evitar que se repita?
fr_ca: **Découvrez pourquoi le problème s'est produit.** Quelle était la cause profonde du problème ? Comment pouvez-vous éviter qu'il ne se reproduise ?
ru_ru: **Выясните, почему возникла проблема.** Какова ее первопричина? Как вы можете предотвратить ее повторение?
zh_cn: **找出问题发生的原因** 问题的根本原因是什么？如何防止问题再次发生？
