Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/outreach-basics.po
Languages: fr_ca, zh_cn

source: Outreach Basics
fr_ca: Les bases de la sensibilisation
zh_cn: 外联基础

source: What is Outreach in *FIRST*?
fr_ca: Qu'est-ce que la sensibilisation dans *FIRST* ?
zh_cn: 什么是 *FIRST* 中的 "外联"？

source: Outreach is a team's way of establishing its values for *FIRST* and STEM throughout the community. This can involve activities like networking with professionals, visiting robotics labs nearby, coaching and mentoring other *FIRST* teams, volunteering, and STEM|hyphen|related activities, and so much more.
fr_ca: La sensibilisation est le moyen pour une équipe d'établir ses valeurs pour *FIRST* et STIM au sein de la communauté. Il peut s'agir d'activités telles que le réseautage avec des professionnels, la visite de laboratoires de robotique à proximité, le coaching et le mentorat d'autres équipes *FIRST*, le bénévolat et les activités liées aux STIM, et bien d'autres choses encore.
zh_cn: 外联是一个团队在整个社区树立其 *FIRST* 和 STEM 价值观的方式。这些活动包括与专业人士建立联系、参观附近的机器人实验室、指导其他 *FIRST* 团队、志愿服务、STEM|hyphen|related 相关活动等。

source: Why is Outreach Important?
fr_ca: Pourquoi la Sensibilisation est-elle Importante ?
zh_cn: 外联为何重要？

source: Outreach is important because it allows your team to demonstrate how it made an impact on the STEM community and spread *FIRST* values. A few awards, such as Connect, Motivate, and Inspire (the highest|hyphen|ranked award), are all based on a team's outreach. Outreach usually takes up 2|hyphen|3 pages of the Engineering Portfolio, which is typically 16 pages. Judges are looking for a diverse set of outreach events that have been done throughout the year and demonstrate a clear impact and Gracious Professionalism. If your FTC team isn't sure how to establish good outreach, here are some tips and tricks for where to find opportunities.
fr_ca: La sensibilisation est importante parce qu'elle permet à votre équipe de montrer comment elle a eu un impact sur la communauté des STIM et a diffusé les valeurs *FIRST*. Quelques prix, tels que Connexion, Motivation et Inspiration (le prix le plus prestigieux), sont tous basés sur la sensibilisation de l'équipe. L'action sociale occupe généralement 2|hyphen|3 pages du dossier d'ingénierie, qui en compte généralement 16. Les juges recherchent un ensemble varié d'activités de sensibilisation réalisées tout au long de l'année et démontrant un impact clair et un professionnalisme coopératif. Si votre équipe de FTC n'est pas sûre de savoir comment établir une bonne communication, voici quelques conseils et astuces pour trouver des opportunités.
zh_cn: 拓展活动非常重要，因为它可以让您的团队展示如何对 STEM 社区产生影响并传播 *FIRST* 价值观。一些奖项，如 "联系"、"激励 "和 "启发"（排名最高的奖项），都是基于团队的外联工作。外联通常占工程作品集的 2|hyphen|3 页，而工程作品集通常有 16 页。评委们需要的是全年开展的各种外联活动，这些活动要能体现出明显的影响力和亲切的专业精神。如果您的 FTC 团队不确定如何建立良好的外联活动，这里有一些寻找机会的技巧和窍门。

source: What Do You Care About?
fr_ca: Qu’est-ce qui vous tient à cœur ?
zh_cn: 你关心什么？

source: A concerning amount of teams see outreach as a means to obtain awards. While it is true that the Motivate and Connect Awards rely on outreach performance as award criteria, outreach is so much more than that, and as FTC\ |reg| teams, we are poised to make a unique impact. In order to make the most of your potential, you should target outreach that you care about.
fr_ca: Un nombre préoccupant d’équipes considèrent le rayonnement comme un simple moyen d’obtenir des récompenses. Bien qu’il soit vrai que les prix Motivation et Connexion reposent sur les performances en matière de sensibilisation comme critère de sélection, la sensibilisation va bien au-delà de cela. En tant qu’équipes FTC\ |reg| , nous sommes en position de créer un impact unique. Pour exploiter pleinement votre potentiel, vous devriez cibler des actions de sensibilisation qui vous tiennent réellement à cœur.
zh_cn: 有很多团队把外联看作是获得奖项的手段。虽然激励奖和联系奖确实依赖于外联表现作为评奖标准，但外联不仅仅是这样，作为 FTC\ |reg| 团队，我们有能力做出独特的影响。为了充分发挥你的潜力，你应该针对你关心的外联。

source: From a judging perspective, it is also easier to talk about topics you care deeply about and are invested in.
fr_ca: D’un point de vue de l’évaluation, il est également plus facile de parler de sujets qui vous tiennent profondément à cœur et dans lesquels vous êtes réellement investi.
zh_cn: 从评委面试的角度来看，谈论你深深关心和投入的话题也更容易。

source: Many teams often hope to create large-scale programs that impact tens of thousands. However, many smaller outreach programs can often be more impactful than one big, unwieldy program that may never get off the ground. Consider what your local area needs - maybe your library needs volunteers to teach STEM, or your local FLL team requires mentorship. Maybe there are no other FLL or FTC teams in your area. Regardless, your goal should be to advocate for STEM and *FIRST*\ |reg| in your area.
fr_ca: De nombreuses équipes espèrent souvent créer des programmes à grande échelle ayant un impact sur des dizaines de milliers de personnes. Cependant, de nombreux petits programmes de sensibilisation peuvent être plus impactants qu’un grand programme difficile à mettre en place, qui pourrait ne jamais aboutir. Réfléchissez à ce dont votre région a besoin : peut-être que votre bibliothèque a besoin de bénévoles pour enseigner les STIM, ou que votre équipe FLL locale a besoin de mentorat. Peut-être qu’il n’y a pas d’autres équipes FLL ou FTC dans votre secteur. Quoi qu’il en soit, votre objectif devrait être de promouvoir les STIM et *FIRST*\ |reg| dans votre région.
zh_cn: 许多团队经常希望创建影响数万人的大规模项目。然而，许多小型的外联项目往往比一个庞大、笨重、可能永远无法启动的项目更有影响力。考虑一下你所在地区的需求 - 也许你的图书馆需要志愿者教授STEM，或者你当地的FLL团队需要指导。也许你所在地区没有其他FLL或FTC团队。无论如何，你的目标应该是在你所在地区倡导STEM和 *FIRST*\ |reg| 。

source: Create a plan! Any set of outreaches should be outlined in a business plan, documenting how they serve as a way to expand your program's reach. This plan should also contain your team's vision, budget goals, and growth objectives.
fr_ca: Créez un plan ! Toute série d’actions de sensibilisation doit être décrite dans un plan d'affaires, documentant la manière dont elles servent à étendre la portée de votre programme. Ce plan doit également inclure la vision de votre équipe, les objectifs budgétaires et les objectifs de croissance.
zh_cn: 制定一个计划！任何一组外联活动都应该在一个商业计划中概述，说明它们如何作为扩大你的项目影响力的一种方式。这个计划还应该包含你的团队愿景、预算目标和增长目标。

source: How to establish outreach:
fr_ca: Comment établir des contacts :
zh_cn: 如何建立外联：

source: Cold email professionals and ask to be mentored
fr_ca: Envoyer des courriels à des professionnels et leur demander d'être mentorés
zh_cn: 直接给专业人士发邮件，请求指导

source: This may seem intimidating, but there are many templates online that can help you reach out to professionals.
fr_ca: Cela peut sembler intimidant, mais il existe de nombreux modèles en ligne qui peuvent vous aider à contacter des professionnels.
zh_cn: 这似乎有些令人胆怯，但网上有很多模板可以帮助您联系专业人士。

source: Simply search 'How to ask for a mentor over email' and Google should provide many options.
fr_ca: Il suffit de chercher "Comment demander un mentor par courrier électronique" et Google devrait fournir de nombreuses options.
zh_cn: 只需搜索 "如何通过电子邮件请求导师"，谷歌就会提供很多选项。

source: Research science fairs/events nearby
fr_ca: Rechercher des foires scientifiques/événements dans les environs
zh_cn: 研究附近的科学展览会/活动

source: Start by compiling a list of science events nearby in a document or spreadsheet.
fr_ca: Commencez par dresser une liste des événements scientifiques organisés à proximité dans un document ou une feuille de calcul.
zh_cn: 首先，在文档或电子表格中编制一份附近的科学活动清单。

source: Local events could be found on Eventbrite, on blog pages, and in magazines.
fr_ca: Les événements locaux pourraient être trouvés sur Eventbrite, sur des pages de blog et dans des magazines.
zh_cn: 本地活动可以在 Eventbrite、博客页面和杂志上找到。

source: Note the date of the event and whether they allow exhibitors to sign up, and if not, then contact them directly!
fr_ca: Notez la date de l'événement et indiquez s'il permet aux exposants de s'inscrire. Si ce n'est pas le cas, contactez-les directement !
zh_cn: 注意活动日期以及是否允许参展者报名，如果不允许，则直接与他们联系！

source: Sign up to demo at STEM showcases
fr_ca: S'inscrire pour faire des démonstrations lors des salons STIM
zh_cn: 报名参加 STEM 展示会的演示活动

source: Many elementary and middle schools have science fairs or STEM nights that allow people to demonstrate things like robots, coding, and engineering practices.
fr_ca: De nombreuses écoles primaires et secondaires organisent des foires scientifiques ou des soirées STIM qui permettent de présenter des choses telles que les robots, le codage et les pratiques d'ingénierie.
zh_cn: 许多中小学都有科学展或 STEM 之夜，让人们展示机器人、编码和工程实践等内容。

source: Check out the local schools in your area and see if there are any opportunities like that nearby.
fr_ca: Consultez les écoles locales de votre région et voyez s'il existe des possibilités de ce type à proximité.
zh_cn: 查看您所在地区的学校，看看附近是否有这样的机会。

source: Ask nearby *FIRST* teams if they need any help or want a mentor
fr_ca: Demander aux équipes *FIRST* voisines si elles ont besoin d'aide ou d'un mentor.
zh_cn: 询问附近的 *FIRST* 团队是否需要帮助或需要导师

source: Mentoring or helping other teams is an amazing way to give back to the *FIRST* community.
fr_ca: Le mentorat ou l'aide à d'autres équipes est une excellente façon de rendre à la communauté *FIRST* ce qu'elle a reçu.
zh_cn: 指导或帮助其他团队是回馈 *FIRST* 社区的绝佳方式。

source: You can connect with a team on the *FIRST* Mentor Network if an 18+ team member makes an account as a mentor, or by asking local FTC teams either online, through social media, or using connections.
fr_ca: Vous pouvez entrer en contact avec une équipe sur le réseau de mentorat *FIRST* si un membre de l'équipe âgé de plus de 18 ans crée un compte en tant que mentor, ou en interrogeant les équipes locales de FTC en ligne, par le biais des médias sociaux ou en utilisant des relations.
zh_cn: 如果有 18 岁以上的团队成员注册了导师账户，您可以在 *FIRST* 导师网络上与团队建立联系，也可以通过在线、社交媒体或利用关系向当地的 FTC 团队询问。

source: Mentoring can involve providing advice to a team, helping a rookie team learn about *FIRST*, providing feedback on engineering portfolios, and more.
fr_ca: Le mentorat peut consister à donner des conseils à une équipe, à aider une équipe débutante à se familiariser avec *FIRST*, à fournir un retour d'information sur les dossiers d'ingénierie, etc.
zh_cn: 指导可以包括向团队提供建议、帮助新手团队了解 *FIRST*、就工程组合提供反馈意见等。

source: Ask more experienced teams for their mentorship
fr_ca: Demander à des équipes plus expérimentées de vous encadrer
zh_cn: 向更有经验的团队请教

source: Take note of any very skilled teams in the area and consider reaching out to them and asking for their mentorship.
fr_ca: Prenez note des équipes très compétentes dans la région et envisagez de les contacter pour leur demander un mentorat.
zh_cn: 注意该地区任何非常熟练的团队，并考虑与他们联系，请求他们的指导。

source: That way, you can get invaluable advice on engineering, teamwork, programming, and more.
fr_ca: Vous pourrez ainsi bénéficier de conseils précieux en matière d'ingénierie, de travail d'équipe, de programmation, etc.
zh_cn: 这样，您就可以获得有关工程、团队合作、编程等方面的宝贵建议。

source: Chances are, a team would say yes since that means they get some outreach out of it.
fr_ca: Il y a de fortes chances qu'une équipe réponde par l'affirmative, car cela signifie qu'elle bénéficie d'un certain rayonnement.
zh_cn: 团队很可能会答应，因为这意味着他们能从中获得一些外联。

source: Volunteer in STEM|hyphen|related activities
fr_ca: Faire du bénévolat dans des activités liées aux STIM.
zh_cn: 志愿参加 STEM|hyphen|related 相关活动

source: Spreading The Word
fr_ca: Faire Passer Le Mot
zh_cn: 传播信息

source: Once you've zeroed in on the programs you'd like to create or contribute to, figure out who you need to contact and what you need to pitch. See :doc:`./pitching-your-team` for more tips on how to write your pitch out.
fr_ca: Une fois que vous avez identifié les programmes que vous souhaitez créer ou auxquels vous souhaitez contribuer, déterminez qui vous devez contacter et ce que vous devez présenter. Voir :doc:`./pitching-your-team` pour plus de conseils sur la rédaction de votre proposition.
zh_cn: 一旦你确定了你想要创建或参与的项目，就要弄清楚你需要联系谁以及你需要提出什么建议。请参阅 :doc:`./pitching-your-team` (推广你的团队) 以获取更多关于如何撰写建议的提示。

source: Motivate
fr_ca: Motiver
zh_cn: 激励

source: Let's say you've decided to go with hosting weekly STEM nights at your local library.
fr_ca: Disons que vous avez décidé d'organiser des soirées STIM hebdomadaires à votre bibliothèque locale.
zh_cn: 假设你决定在当地图书馆举办每周一次的STEM之夜。

source: *The Pitch: STEM night hosted by x members of local robotics team on x weeknight, for x weeks.*
fr_ca: *La proposition : Soirée STIM organisée par X membres de l’équipe de robotique locale, chaque X soir de la semaine, pendant X semaines.*
zh_cn: *建议：STEM之夜由当地机器人团队的x名成员在x个工作日晚上主办，为期x周。*

source: Write an email to your library's administration and CC (carbon copy) a librarian you know, introducing your team and describing your idea. Stress that you will dedicate team resources and members to this idea and see it through for the timeframe you specify.
fr_ca: Écrivez un courriel à l'administration de votre bibliothèque et mettez en CC ( copie conforme) un bibliothécaire que vous connaissez, en présentant votre équipe et en décrivant votre idée. Insistez sur le fait que vous consacrerez les ressources et les membres de l'équipe à cette idée et que vous la mènerez à bien dans un délai respectable.
zh_cn: 给图书馆管理层写一封电子邮件，并抄送一个你认识的图书馆员，介绍你的团队并描述你的想法。强调你将把团队资源和成员投入到这个想法中，并按照你指定的时间范围完成它。

source: Assign specific members to this program and loop them into the conversation as well.
fr_ca: Assignez des membres spécifiques à ce programme et incluez-les également dans la conversation.
zh_cn: 指派特定成员参与这个项目，并把他们加入到对话中。

source: Work with the library to determine a time each week to host your STEM night.
fr_ca: Travaillez avec la bibliothèque pour déterminer un horaire chaque semaine afin d’organiser votre soirée STIM.
zh_cn: 与图书馆协商每周举办STEM之夜的时间。

source: Finally, assigned members work together to write lesson plans in advance and create promotional materials to share on social media and with friends/family.
fr_ca: Enfin, les membres assignés travaillent ensemble pour rédiger des plans de leçon à l’avance et créer du matériel promotionnel à partager sur les réseaux sociaux et avec leurs amis et leur famille.
zh_cn: 最后，指派成员提前合作编写教案，并创建宣传材料，在社交媒体上分享，并与亲友分享。

source: Fundraising
fr_ca: Collecte de fonds
zh_cn: 筹款

source: Your team has a fundraising idea to bag at a local supermarket.
fr_ca: Votre équipe a une idée de collecte de fonds : faire de l’emballage dans un supermarché local.
zh_cn: 你的团队有一个在当地超市打包袋子赚取小费的筹款想法。

source: *The Pitch: Support local STEM students by allowing local robotics team to bag at your store!*
fr_ca: *Le discours : Soutenez les étudiants locaux en STIM en permettant à l'équipe de robotique locale d'emballer dans votre magasin !
zh_cn: *建议：支持当地STEM学生，让当地机器人团队在你的商店打包袋子！*

source: Visit your local supermarket and talk to a manager or customer service rep to politely introduce your team.
fr_ca: Rendez-vous dans votre supermarché local et parlez à un directeur ou à un représentant du service clientèle pour présenter poliment votre équipe.
zh_cn: 访问你当地的超市，并与经理或客服代表礼貌地介绍你的团队。

source: Respectfully ask if they would be willing to let you bag for customers and set up tip jars.
fr_ca: Demandez-leur respectueusement s'ils sont prêts à vous laisser mettre des sacs pour les clients et à installer des boîtes à pourboires.
zh_cn: 尊重地询问他们是否愿意让你为顾客打包袋子并设置小费罐。

source: Obtain contact information of the person you spoke to, and write a follow-up email to them thanking them and confirming a date and time.
fr_ca: Obtenez les coordonnées de la personne à qui vous avez parlé et envoyez-lui un courriel de suivi pour la remercier et confirmer une date et une heure.
zh_cn: 获取你所说话的人的联系信息，并给他们写一封感谢信，并确认日期和时间。

source: Assign members to create promotional materials to share on social media and with friends/family.
fr_ca: Désigner des membres pour créer du matériel promotionnel à partager sur les réseaux sociaux et avec les amis/famille.
zh_cn: 指派成员创建宣传材料，在社交媒体上分享，并与亲友分享。

source: Connect / Sponsorship
fr_ca: Connexion / Commanditaire
zh_cn: 联系/赞助

source: Outreach to create connections and obtain sponsorships are relatively similar. Send lots of emails to local companies asking for either help or sponsorship. You should try to tie the engineering problems you are encountering in the season to the specific company you are requesting aid from; this can make it easier for the company to justify donating their money or time.
fr_ca: Les actions de sensibilisation visant à créer des liens et à obtenir des commanditaires sont relativement similaires. Envoyez de nombreux courriels aux entreprises locales pour leur demander de l'aide ou un parrainage. Essayez de lier les problèmes d'ingénierie que vous rencontrez au cours de la saison à l'entreprise spécifique à laquelle vous demandez de l'aide ; il sera ainsi plus facile pour l'entreprise de justifier le don de son argent ou de son temps.
zh_cn: 创建联系和获得赞助的外联活动相对类似。给当地公司发送大量电子邮件，请求他们提供帮助或赞助。你应该尝试把你在赛季中遇到的工程问题与你请求帮助的特定公司联系起来；这可以让公司更容易为捐赠他们的钱或时间找到理由。

source: A great way to find businesses to reach out to is through your local Chamber of Commerce (use Google to find their website), who generally will provide a large list of member businesses in the area. Try to send one email to every business on that list. In addition, target companies in the nearest metro area.
fr_ca: Un excellent moyen de trouver des entreprises à contacter est de s'adresser à la chambre de commerce locale (utilisez Google pour trouver son site web), qui fournit généralement une liste importante d'entreprises membres dans la région. Essayez d'envoyer un courriel à chaque entreprise figurant sur cette liste. En outre, ciblez les entreprises de la zone métropolitaine la plus proche.
zh_cn: 寻找要联系的企业的一个好方法是通过你当地的商会（用谷歌搜索他们的网站），他们通常会提供一个包含该地区会员企业的大型列表。尽量给列表上的每个企业发送一封电子邮件。此外，还要针对最近的大都市地区的公司。

source: Promotional materials should be striking and feature your team's branding, with an emphasis on succinct design. Your goal is to maximize information delivery using as few words as possible.
fr_ca: Le matériel promotionnel doit être percutant et présenter la marque de votre équipe, tout en mettant l'accent sur une conception succincte. Votre objectif est de maximiser la transmission d'informations en utilisant le moins de mots possible.
zh_cn: 宣传材料应该引人注目，体现你团队的品牌形象，强调简洁的设计。你的目标是用尽可能少的文字来传递最多的信息。

source: Outreach in the Portfolio
fr_ca: La Sensibilisation dans le Portfolio
zh_cn: 项目组合中的外联活动

source: Outreach should be described in a specific way in the portfolio to be deemed impactful. A few strategies some teams have used:
fr_ca: La Sensibilisation doit être décrite de manière spécifique dans le portfolio pour être jugée efficace. Quelques stratégies utilisées par certaines équipes :
zh_cn: 外联活动应在作品集中以特定方式加以描述，才能被视为具有影响力。一些团队采用了以下几种策略：

source: Categorizing whether the impact: local, state, national vs. international
fr_ca: Catégorisation de l'impact : local, étatique, national ou international
zh_cn: 对影响进行分类：地方、州、国家 vs.国际影响

source: Use numbers! Share how many people your volunteering reached, and what communities benefited
fr_ca: Utilisez des chiffres ! Indiquez le nombre de personnes touchées par votre bénévolat et les communautés qui en ont bénéficié.
zh_cn: 用数据说话！分享您的志愿服务惠及了多少人，哪些社区从中受益

source: Keep it brief! Describe each activity in 1|hyphen|2 sentences
fr_ca: Soyez bref ! Décrivez chaque activité en 1|hyphen|2 phrases
zh_cn: 简明扼要！用 1|hyphen|2 句话描述每项活动

source: Track your hours: using a spreadsheet helps, and that way your portfolio can have quantitative impact
fr_ca: Suivez vos heures : l'utilisation d'une feuille de calcul est utile, et votre portefeuille peut ainsi avoir un impact quantitatif.
zh_cn: 跟踪你的工作时间：使用电子表格会有所帮助，这样你的投资组合就能产生量化影响

source: Include photos, images, and logos that add visual appeal and illustrate your impact
fr_ca: Inclure des photos, des images et des logos qui ajoutent un attrait visuel et illustrent votre impact.
zh_cn: 包括照片、图像和徽标，以增加视觉吸引力并说明您的影响力

source: Be specific; if the sentence can describe any outreach activity, it can't describe any!
fr_ca: Soyez précis ; si la phrase peut décrire n'importe quelle activité de sensibilisation, elle ne peut en décrire aucune !
zh_cn: 要具体；如果这个句子可以描述任何外联活动，就不能描述您的任何活动！

source: General Outreach Tips
fr_ca: Conseils généraux pour la sensibilisation
zh_cn: 一般外联技巧

source: **Reach out for donations early.** Companies are most willing to donate money from September-November, when they are closing out the fiscal year. Reach out for sponsorships and donations around this time, as you will encounter more success.
fr_ca: **Les entreprises sont plus disposées à faire des dons entre septembre et novembre, lorsqu'elles clôturent l'année fiscale. C'est à cette période que vous pouvez solliciter des parrainages et des dons, car vous obtiendrez plus de succès.
zh_cn: **尽早争取捐赠。** 公司在9月至11月结算财年时最愿意捐款。在这个时候寻求赞助和捐赠，你会更容易成功。

source: **Raise more money than you need.** You never know when you'll need to buy parts in an emergency, or qualify for the World Championship unexpectedly. Having extra money is never a bad thing.
fr_ca: Vous ne savez jamais quand vous aurez besoin d'acheter des pièces détachées en cas d'urgence ou de vous qualifier pour le championnat du monde de façon inattendue. **Avoir de l'argent en plus n'est jamais une mauvaise chose.**
zh_cn: **筹集比你需要的更多的钱。** 你永远不知道你什么时候需要紧急购买零件，或者意外地获得世界锦标赛的资格。有多余的钱从来不是坏事。

source: **Be consistent.** It is easy to let outreach fall by the wayside when building a robot. However, programs that survive long periods of time are defined by their consistent outreach, as it creates inroads into their community for recruitment and funding.
fr_ca: **Soyez cohérents.** Il est facile de laisser l’encadrement communautaire de côté lorsqu’on construit un robot. Cependant, les programmes qui durent dans le temps se distinguent par la régularité de leurs activités de sensibilisation, car elles créent des liens avec leur communauté pour le recrutement et le financement.
zh_cn: **保持一致。** 当建造机器人时，很容易让外联被忽视。然而，能够长期生存的项目是由他们持续的外联所定义的，因为它为他们在社区中招募和筹集资金创造了机会。

source: **Be persistent.** If your idea doesn't work the first time or doesn't find the success you hoped, don't give up! Evaluate what went wrong and try again.
fr_ca: **Soyez persévérants.** Si votre idée ne fonctionne pas du premier coup ou n’apporte pas le succès espéré, ne baissez pas les bras ! Évaluez ce qui n’a pas marché et réessayez.
zh_cn: **要坚持不懈。** 如果你的想法第一次没有成功，或者没有取得预期的成功，不要放弃！评估寻找一下哪里出了问题，然后再试一次。

source: **Diversify.** Try to do as many unique outreach events as possible, as it'll be fun and enriching!
fr_ca: **Diversifiez.** Essayez d’organiser autant d’activités de sensibilisation uniques que possible, car ce sera à la fois amusant et enrichissant !
zh_cn: **多样化。** 尽可能地做更多独特的外联活动，这会很有趣和丰富！

source: **Maintain your relationships.** Send thank you notes to organizations who host you and work with you, and keep them updated about your team's progress. It is easier to ask for a favor from an organization that likes your team.
fr_ca: **Entretenez vos relations.** Envoyez des notes de remerciement aux organisations qui vous accueillent et collaborent avec vous, et tenez-les informées des progrès de votre équipe. Il est plus facile de demander une faveur à une organisation qui apprécie votre équipe.
zh_cn: **维护你的关系。** 给那些接待你和与你合作的组织发送感谢信，并让他们了解你的团队进展。从一个喜欢你的团队的组织那里请求帮助会更容易。
