Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/outreach-basics.po
Languages: fr_ca, zh_cn

source: **(Respectful) email spam always works.** Send lots of emails. Your fundraising, Connect, and sponsorship email target should be 100+ a season - per category. The more emails you send, the higher the chance you will get a response.
fr_ca: **Le “spam” d’e-mails (respectueux) fonctionne toujours.** Envoyez-en beaucoup. Votre objectif de courriels pour la collecte de fonds, Connexion et les commandites devrait dépasser 100 par saison – par catégorie. Plus vous envoyez d’e-mails, plus vous augmentez vos chances d’obtenir une réponse.
zh_cn: **（恭敬的）邮件轰炸总是有效的。** 发送大量电子邮件。你的筹款、连接和赞助电子邮件目标应该是每个类别每季度100多封。你发送的电子邮件越多，你得到回复的机会就越大。

source: **Visit in person.** It is much harder to ignore an in-person visit you pay to a company than it is to ignore an email. Prepare a one-page flyer and elevator pitch, and remember you have a limited amount of time to make an impression on the person you're talking to.
fr_ca: **Rendez visite en personne.** Il est beaucoup plus difficile d’ignorer une visite en face à face à une entreprise qu’un simple courriel. Préparez un dépliant d’une page et un discours bref et percutant, et n’oubliez pas que vous disposez d’un temps limité pour faire bonne impression sur votre interlocuteur.
zh_cn: **亲自拜访。** 忽视你对公司的亲自拜访比忽视一封电子邮件要困难得多。准备一张一页的传单和电梯演讲，并记住你只有有限的时间给你所说话的人留下印象。

source: Housekeeping
fr_ca: Entretien ménager
zh_cn: 日常管理

source: Keep a list of the programs your team has created or contributed to. Ensure you take photos at every event with team members. Keep track of your **Reach** (tangible interaction or observation of your team), **Engagement** (how many people interacted with your team/you interacted with, e.g. by attending events), **Impact** (how many people are directly impacted by your outreach events), and **Conversion** (how many people get involved with your program.)
fr_ca: Tenez une liste des programmes que votre équipe a créés ou auxquels elle a contribué. Assurez-vous de prendre des photos à chaque événement avec les membres de l’équipe. Suivez votre Portée (interaction tangible ou observation de votre équipe), votre Engagement (combien de personnes ont interagi avec votre équipe / avec qui vous avez interagi, par exemple lors d’événements), votre **Impact** (combien de personnes sont directement touchées par vos activités de sensibilisation) et votre **Conversion** (combien de personnes s’impliquent dans votre programme).
zh_cn: 建立一个你的团队创建或参与的项目的列表。确保在每个活动中与团队成员拍照。记录你的 **效果** （对你的团队有实际互动或观察）、 **参与度** （有多少人与你的团队/你互动，例如通过参加活动）、 **影响力** （有多少人直接受到你的外展活动的影响）和 **转化度** （有多少人参与了你的计划。）

source: If looking to include these statistics in your judged presentation or portfolio, ensure you adhere to the "Awards Definitions" located in the appendix of |gm1| that outline terms relating to outreach. These terms are: *Started*, *Mentored*, *Assisted*, *Provided Published Resources*, *Ran*, *Hosted*, *Reached*, and *Advocated*.
fr_ca: Si vous souhaitez inclure ces statistiques dans votre présentation ou votre portfolio, assurez-vous de respecter les "Définitions des prix" qui se trouvent dans l'annexe de |gm1| et qui décrivent les termes relatifs à la sensibilisation. Ces termes sont les suivants : *Démarré*, *Mentoré*, *Assisté*, *Fourni des ressources publiées*, *Ran*, *Hébergé*, *Réalisé*, et *Conseillé*.
zh_cn: 如果想在评审演示或作品集中包含这些统计数据，请确保遵守 |gm1| 附录中关于外联相关术语的“奖项定义”。这些术语是：*开始*、*指导*、*协助*、*提供已发布资源*、*运行*、*主办*、*影响* 和 *倡导*。
