Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/pitching-your-team.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: Pitching Your Team
es_mx: Presentar a tu Equipo
fr_ca: Présenter Son Équipe
ru_ru: Представь Свою Команду!
zh_cn: 推广你的团队

source: Reaching out and getting attention is hard. Here's some tips on how to sell your team!
es_mx: Llegar y llamar la atención es difícil. ¡ Aquí tienes algunos consejos para vender tu equipo!
fr_ca: Il n'est pas facile de se faire remarquer et d'attirer l'attention. Voici quelques conseils pour vendre votre équipe !
ru_ru: Рассказать о себе и привлечь внимание очень сложно. Поэтому вот несколько советов о том, как хорошо презентовать свою команду!
zh_cn: 外联并获得关注是很难的。这里有一些关于如何推广你的团队的建议！

source: Types of Pitches
es_mx: Tipos de Presentaciones
fr_ca: Types de Présentations
ru_ru: Виды Презентаций
zh_cn: 提案的类型

source: As part of outreach, you'll generally be pitching some form of idea to some person or organization. Here's a couple examples of different pitch structures:
es_mx: Como parte de las actividades de divulgación, generalmente tendrás que presentar algún tipo de idea a alguna persona u organización. Aquí hay un par de ejemplos de diferentes estructuras de presentación:
fr_ca: Dans le cadre de vos activités de sensibilisation, vous devrez généralement présenter une idée à une personne ou à une organisation. Voici quelques exemples de structures de présentation :
ru_ru: Как правило, в рамках агитационно-просветительской деятельности вам регулярно придётся презентовать различные идеи людям и организациям. Вот несколько примеров различных форматов презентаций:
zh_cn: 作为外联的一部分，你通常会向某个人或组织提出某种形式的想法。下面是一些不同的提案结构的例子：

source: Cold Call
es_mx: Llamada en Frío
fr_ca: Appel à Froid
zh_cn: 陌生呼叫

source: This is probably the most common type of pitch you'll make. Cold calling involves reaching out to someone unprompted, and can take the form of an email or phone call.
es_mx: Probablemente sea la forma más habitual de comunicación. La llamada en frío consiste en ponerse en contacto con alguien sin que nadie te lo pida, ya sea por correo electrónico o por teléfono.
fr_ca: Il s'agit probablement du type de présentation le plus courant. L'appel à Froid consiste à contacter quelqu'un sans y être invité et peut prendre la forme d'un courrier électronique ou d'un appel téléphonique.
ru_ru: Скорее всего, это будет самый частый формат ваших презентаций. Cold calls предполагают обращение к человеку без предварительного согласия и могут осуществляться по электронной почте или телефону.
zh_cn: 这可能是你最常做的一种推广。陌生呼叫涉及到在没有提示的情况下联系某个人，可以是电子邮件或电话。

source: "Startup"
es_mx: "Puesta en Marcha"
ru_ru: *Стартапы*
zh_cn: “创业”

source: Startup pitches are delivered when meeting with a potential connection or sponsor. Normally given as a slideshow, they introduce your team identity and unique goals, differentiate you from other teams, and tell a story of "why us?".
es_mx: Las presentaciones de los startups o "puesta en marcha" se realizan en reuniones con posibles contactos o patrocinadores. Suelen presentarse en forma de diapositivas y sirven para presentar la identidad del equipo y sus objetivos exclusivos, diferenciarse de otros equipos y contar la historia de "¿por qué nosotros?
fr_ca: La présentation d'une startup se fait lors d'une rencontre avec un partenaire ou un sponsor potentiel. Normalement présentés sous forme de diaporama, ils introduisent l'identité et les objectifs uniques de votre équipe, vous différencient des autres équipes et racontent l'histoire du "pourquoi nous?".
ru_ru: Презентации стартапов проводятся при встрече с потенциальным партнером или спонсором. Обычно их делают в виде слайд-шоу и рассказывают об индивидуальности и уникальных целях вашей команды, выделяют вас среди других и объясняют "почему стоит выбрать именно нас?".
zh_cn: “创业”推广是在与潜在的联系人或赞助商会面时进行的。通常以幻灯片的形式呈现，它们介绍了你的团队身份和独特的目标，区分了你和其他团队，并讲述了“为什么选择我们”的故事。

source: Elevator
es_mx: Ascensor
fr_ca: Ascension
ru_ru: "Презентация для лифта"
zh_cn: 电梯

source: Elevator pitches are "designed to be given on an elevator ride", as your "ask" is condensed into 30 seconds. You should use this when visiting local businesses or networking events to grab attention quickly.
es_mx: Los discursos de ascensor están "diseñados para darlos en un viaje en ascensor", ya que tu "petición" se condensa en 30 segundos. Deberías utilizarlo cuando visites negocios locales o eventos de networking para captar la atención rápidamente.
fr_ca: Les discours d'ascension sont "conçus pour être prononcés pendant un trajet en ascenseur", car votre "demande" est condensée en 30 secondes. Vous devriez l'utiliser lorsque vous visitez des entreprises locales ou que vous participez à des événements de réseautage, afin d'attirer rapidement l'attention.
ru_ru: Презентация для лифта – это вид презентации вашего проекта, укладывающийся в 30 секунд, так как он "предназначен для того, чтобы его можно было рассказать во время поездки в лифте". Его стоит использовать при посещении местных предприятий или мероприятий для налаживания связей, чтобы быстро привлечь внимание.
zh_cn: 电梯推广是“设计用于在电梯里进行”的，因为你的“要求”被压缩到30秒内。当你拜访当地企业或社交活动时，你应该使用这种方法来快速吸引注意力。

source: Social Media
es_mx: Redes Sociales
fr_ca: Médias Sociaux
ru_ru: Социальные Сети
zh_cn: 社交媒体

source: This is a social media post designed to promote something - be it your recruitment campaign, an event you're holding, or a fundraiser. Your pitch should be short and pop on whatever design you build around it.
es_mx: Se trata de una publicación en las redes sociales diseñada para promocionar algo, ya sea una campaña de reclutamiento, un evento o una recaudación de fondos. El mensaje debe ser breve y llamativo, independientemente del diseño que le des.
fr_ca: Il s'agit d'un message sur les médias sociaux destiné à promouvoir quelque chose - qu'il s'agisse de votre campagne de recrutement, d'un événement que vous organisez ou d'une collecte de fonds. Votre message doit être court et percutant, quel que soit le design que vous lui donnez.
ru_ru: Это публикация в социальных сетях, предназначенная для рекламы чего-либо - будь то ваша кампания по набору участников, проводимое мероприятие или сбор средств. Ваше сообщение должно быть коротким и ярким, а визуальное оформление — привлекать внимание и побуждать к действию.
zh_cn: 这是一个社交媒体帖子，旨在宣传某件事 - 无论是你的招募活动、你举办的活动，还是你的筹款活动。你的推广应该简短而突出，无论你围绕它建立了什么样的设计。

source: Follow Up
es_mx: Seguimiento
fr_ca: Suivi
ru_ru: Последующее Напоминание
zh_cn: 跟进

source: Perhaps the most important type of pitch. A follow up can serve to highlight an email that was never responded to or confirm an event, sponsorship, or connection. You "secure the bag" with a follow up that is concise and echoes the main points of the original email.
es_mx: Quizá el tipo de lanzamiento más importante. Un seguimiento puede servir para destacar un correo electrónico al que nunca se respondió o confirmar un evento, patrocinio o conexión. Se "asegura" con un seguimiento conciso y que se haga eco de los puntos principales del correo electrónico original.
fr_ca: Il s'agit peut-être du type d'argumentaire le plus important. Un suivi peut servir à mettre en évidence un courriel auquel on n'a pas répondu ou à confirmer un événement, un parrainage ou une connexion. Vous "sécurisez le sac" avec un suivi concis qui reprend les principaux points de l'e-mail d'origine.
ru_ru: Возможно, это самый важный тип коммуникации. Последующее напоминание помогает привлечь внимание к письму, оставшемуся без ответа, или подтвердить событие, спонсорскую договорённость и установленный контакт. Именно благодаря лаконичному напоминанию, повторяющему ключевые моменты исходного письма, вы "гарантируете результат".
zh_cn: 这可能是最重要的一种提案。跟进可以用来强调从未得到回复的电子邮件或确认活动、赞助或联系。你用一个简洁并回应原始电子邮件的主要要点的跟进来“锁定胜利”。

source: The Art of Persuasion
es_mx: El Arte de la Persuasión
fr_ca: L'art de la Persuasion
ru_ru: Искусство Убеждения
zh_cn: 说服的艺术

source: Your pitch should utilize rhetorical and psychological techniques to convince your audience more effectively.
es_mx: Su discurso debe utilizar técnicas retóricas y psicológicas para convencer a su público con mayor eficacia.
fr_ca: Votre argumentaire doit utiliser des techniques rhétoriques et psychologiques pour convaincre plus efficacement votre public.
ru_ru: Чтобы звучать убедительнее на своем выступлении, следует использовать некоторые риторические и психологические приемы.
zh_cn: 你的推广应该利用修辞和心理技巧来更有效地说服你的听众。

source: Rhetorical Techniques
es_mx: Técnicas Retóricas
fr_ca: Techniques Rhétoriques
ru_ru: Риторические Приемы
zh_cn: 修辞技巧

source: There are 3 main rhetorical appeals: pathos, ethos, and logos. Pathos "tugs on the heartstrings" of someone's emotions. Ethos is the idea of "social credibility" and leverages a speaker's authority. Logos relates to ideas of logic, reasoning, and analysis. When creating a pitch, you will use all 3 of these appeals to persuade your listener effectively.
es_mx: Hay 3 apelaciones retóricas principales: pathos, ethos y logos. El pathos "toca la fibra sensible" de las emociones. Ethos es la idea de "credibilidad social" y refuerza la autoridad del orador. El logos está relacionado con la lógica, el razonamiento y el análisis. Al crear un discurso, utilizarás los tres recursos para persuadir a tu oyente de forma eficaz.
fr_ca: Il existe trois principaux appels rhétoriques : le pathos, l'ethos et le logos. Le pathos "tire sur la corde sensible" des émotions d'une personne. L'ethos est l'idée de "crédibilité sociale" et renforce l'autorité de l'orateur. Le logos se rapporte aux idées de logique, de raisonnement et d'analyse. Lors de la création d'un argumentaire, vous utiliserez ces 3 types d'appel pour persuader efficacement votre auditeur.
ru_ru: Существует 3 основных риторических приема: пафос, этос и логос. Пафос "дергает за струны" души. Этос представляет собой идею "социального доверия", позволяющую использовать авторитет оратора. Логос же связан больше с логикой, аргументами и анализом. В презентации стоит применять их все, чтобы убедить слушателя в своих доводах.
zh_cn: 有3种主要的修辞诉求：情感诉求、道德诉求和理性诉求。情感诉求是指“触动某人情感的心弦”。道德诉求是指“社会信誉”的概念，利用说话者的权威。理性诉求是指与逻辑、推理和分析相关的观点。在推广时，你将使用这三种诉求来有效地说服你的听众。

source: Here's a brief example of a fundraising email that utilizes these 3 appeals:
es_mx: He aquí un breve ejemplo de un correo electrónico de recaudación de fondos que utiliza estas 3 apelaciones:
fr_ca: Voici un bref exemple d'un courriel de collecte de fonds qui utilise ces 3 appels :
ru_ru: Вот краткий пример письма для сбора средств, в котором используются все 3 приема убеждения:
zh_cn: 以下是利用这3个修辞技巧的筹款电子邮件的简要示例：

source: Dear Company Name,
es_mx: Estimado Nombre de la Empresa,
fr_ca: Nom de l'Entreprise,
ru_ru: Уважаемая Компания,
zh_cn: 亲爱的公司名称：

source: We are *FIRST*\ |reg| Tech Challenge Robotics Team #XXXX, representing Our School or Organization. Our team competes against 6,500 teams worldwide, and after a hard-fought season from September to now, was selected to represent our region at the *FIRST* World Championship and compete alongside 191 other teams (x% of teams worldwide)!
es_mx: Somos el equipo de robótica *FIRST* |reg| Tech Challenge #XXXX, representando a nuestra escuela u organización. Nuestro equipo compite contra 6,500 equipos en todo el mundo, y después de una temporada bien luchada desde septiembre hasta ahora, fuimos seleccionados para representar nuestra región en el Campeonato Mundial de *FIRST* y competir junto a otros 191 equipos (x% de los equipos en todo el mundo)!
fr_ca: Nous sommes l'équipe de robotique Défi Techno*FIRST*\ |reg| Robotics Team #XXXX, représentant Notre École ou Notre Organisation. Notre équipe est en compétition avec 6 500 équipes dans le monde entier et, après une saison très disputée de septembre à aujourd'hui, a été sélectionnée pour représenter notre région au Championnat du Monde *FIRST* et concourir aux côtés de 191 autres équipes (x% des équipes dans le monde) !
ru_ru: Мы - команда направления *FIRST*\ |reg| Tech Challenge #XXXX, представляющая школу/организацию №XXX. Наша команда участвует в соревнованиях с 6500 командами по всему миру, и после напряженного сезона, длившегося с сентября по настоящее время, были выбраны для представления нашего региона на чемпионате мира *FIRST*, где будем соревноваться с 191 командой (x% команд по всему миру)!
zh_cn: 我们是 *FIRST*\ |reg| Tech Challenge Robotics Team #XXXX，代表我们的学校或组织。我们的队伍与全球6500支队伍同台竞技，经过从9月到现在的一个艰苦赛季，我们被选中代表本地区参加 *FIRST* 世界锦标赛，与其他191支队伍（占全球队伍的x%）同台竞技！

source: However, we now have to raise $y for registration, transportation, and housing to successfully compete. As a community organization, we rely on the businesses and organizations around us to help us develop future STEM professionals and spread science and technology throughout our region. Even a $z donation would help us greatly in attending the championship, and we would love to feature your company's logo on our robot with a donation above $n.
es_mx: Sin embargo, ahora tenemos que recaudar $y para la inscripción, el transporte y alojamiento para competir con éxito. Como organización comunitaria, dependemos de las empresas y organizaciones que nos rodean para que nos ayuden a formar futuros profesionales de STEM y a difundir la ciencia y la tecnología por toda nuestra región. Incluso una donación de $z nos ayudaría enormemente a asistir al campeonato, y nos encantaría incluir el logotipo de su empresa en nuestro robot con una donación superior a $n.
fr_ca: Cependant, nous devons maintenant collecter y $ pour l'inscription, le transport et le logement afin de réussir la compétition. En tant qu'organisation communautaire, nous comptons sur les entreprises et les organisations qui nous entourent pour nous aider à former de futurs professionnels des STIM et à diffuser les sciences et les technologies dans toute notre région. Même un don de $z nous aiderait grandement à participer au championnat, et nous serions ravis de faire figurer le logo de votre entreprise sur notre robot avec un don supérieur à $n.
ru_ru: Однако для успешного участия в соревнованиях нам теперь необходимо собрать $y на регистрацию, транспорт и жилье. Будучи общественной организацией, мы надеемся на окружающие нас предприятия и организации, которые заинтересованы в развитии будущих специалистов в области STEM и распространении науки и технологий в нашем регионе. Даже пожертвование в размере $z очень поможет нам, а при пожертвовании свыше $n мы с удовольствием разместим логотип вашей компании на нашем роботе.
zh_cn: 但是，我们现在必须筹集y美元用于注册、交通和住宿，才能成功地参加比赛。作为一个社区组织，我们依靠我们周围的企业和组织来帮助我们培养未来的STEM专业人才，并在我们的地区传播科学和技术。即使z美元的捐款也会对我们参加锦标赛有很大的帮助，如果您捐款超过n美元，我们很乐意在我们的机器人上展示您公司的标志。

source: Thank you for your time! We hope you will consider contributing to this monumental opportunity.
es_mx: ¡Gracias por su tiempo! Esperamos que considere la posibilidad de contribuir a esta monumental oportunidad.
fr_ca: Nous vous remercions pour votre temps ! Nous espérons que vous envisagerez de contribuer à cette occasion monumentale.
ru_ru: Спасибо за уделенное нам время! Надеемся, что вы решите внести свой вклад в эту грандиозную возможность.
zh_cn: 感谢您的时间！我们希望您会考虑为这个重大的机会做出贡献。

source: Our Team.
es_mx: Nuestro Equipo.
fr_ca: Notre Équipe.
ru_ru: Наша Команда.
zh_cn: 我们的团队。

source: Here are examples of the various appeals in this letter.
es_mx: He aquí algunos ejemplos de las distintas apelaciones de esta carta.
fr_ca: Voici des exemples des différents appels de cette lettre.
ru_ru: Вот примеры различных риторических приемов в этом письме:
zh_cn: 以下是这封信中各种呼吁的例子。

source: Pathos
ru_ru: Пафос
zh_cn: 情感诉求

source: "...we rely on the businesses and organizations around us" conveys the desperate need for funding.
es_mx: "...dependemos de las empresas y organizaciones de nuestro entorno" transmite la desesperada necesidad de financiación.
fr_ca: "...nous dépendons des entreprises et des organisations qui nous entourent" traduit le besoin désespéré de financement.
ru_ru: "...мы надеемся на окружающие нас предприятия и организации" передает отчаянную потребность в финансировании.
zh_cn: “…我们依靠我们周围的企业和组织”传达了对资金的迫切需求。

source: "...(x% of teams worldwide)" creates a heightened sense of importance for qualifying for worlds.
es_mx: "...(x% de los equipos de todo el mundo)" crea una mayor sensación de importancia para la clasificación mundial.
fr_ca: "...(x% des équipes dans le monde)" crée un sentiment d'importance accrue pour la qualification aux championnats du monde.
ru_ru: "...(x% команд по всему миру)" - создает ощущение важности участия в чемпионате мира.
zh_cn: “…（占全球队伍的x%）”营造了一个对于获得世界赛资格重要性的高度感。

source: "Hard-fought season from September to now" highlights the length of time your team dedicates to building robots and shows to recipients that your team means business!
es_mx: La "dura temporada desde septiembre hasta ahora" pone de relieve el tiempo que tu equipo dedica a construir robots y demuestra a los destinatarios que tu equipo va en serio.
fr_ca: La mention "Saison de lutte acharnée de septembre à aujourd'hui" souligne le temps que votre équipe consacre à la construction de robots et montre aux destinataires que votre équipe n'a pas froid aux yeux !
ru_ru: "после напряженного сезона, длившегося с сентября по настоящее время" - подчеркивает продолжительность времени, которое ваша команда посвящает созданию роботов, и показывает получателям, что ваша команда может стать действительно хорошим партнером!
zh_cn: “从9月到现在的艰苦奋斗”突出了你们团队为建造机器人投入的时间长度，并向收件人表明你们团队是认真的！

source: Logos
ru_ru: Логос
zh_cn: 理性诉求

source: "Develop future STEM professionals and spread science and technology" appeals to the company's logical need for more employees in the future, or an individual's desire for the advancement of society.
es_mx: "Desarrollar futuros profesionales STEM y difundir la ciencia y la tecnología" apela a la necesidad lógica de la empresa de contar con más empleados en el futuro, o al deseo de un individuo por el avance de la sociedad.
fr_ca: "Développer les futurs professionnels des STIM et diffuser la science et la technologie" fait appel au besoin logique de l'entreprise d'avoir plus d'employés à l'avenir, ou au désir d'un individu de faire progresser la société.
ru_ru: "Которые заинтересованы в развитии будущих специалистов в области STEM и распространении науки и технологий в нашем регионе" - взывает к логической потребности компании в увеличении числа сотрудников в будущем или стремлению человека к развитию общества.
zh_cn: “培养未来的STEM专业人才，并在我们的地区传播科学和技术”吸引了公司对于未来更多员工的逻辑需求，或者个人对于社会进步的愿望。

source: "Feature your company's logo on our robot" conveys a tangible marketing benefit for the company you are reaching out to.
es_mx: "Incluir el logotipo de su empresa en nuestro robot" transmite un beneficio de marketing tangible para la empresa a la que se dirige.
fr_ca: "Le fait d'apposer le logo de votre entreprise sur notre robot présente un avantage marketing tangible pour l'entreprise à laquelle vous vous adressez.
ru_ru: "разместим логотип вашей компании на нашем роботе" - дает ощущение маркетинговой выгоды для компании, к которой вы обращаетесь.
zh_cn: “在我们的机器人上展示您公司的标志”传达了一个具体的营销利益，供你联系的公司考虑。

source: Ethos
ru_ru: Этос
zh_cn: 道德诉求

source: "Develop future STEM professionals and spread science and technology" also appeals to ethos, as your team (direct recipients of these benefits) are speaking to the continued benefits that stem from this donation.
es_mx: "Desarrollar futuros profesionales STEM y difundir la ciencia y la tecnología" también apela al ethos, ya que su equipo (destinatarios directos de estos beneficios) habla de los beneficios continuados que se derivan de esta donación.
fr_ca: "Développer les futurs professionnels des STIM et diffuser la science et la technologie" fait également appel à l'éthique, car votre équipe (les bénéficiaires directs de ces avantages) parle des avantages continus qui découlent de ce don.
ru_ru: "Которые заинтересованы в развитии будущих специалистов в области STEM и распространении науки и технологий в нашем регионе " - также взывает к этике и доверию, поскольку ваша команда (непосредственные получатели этих благ) говорит о постоянных выгодах, вытекающих из этого пожертвования.
zh_cn: “培养未来的STEM专业人才，并在我们的地区传播科学和技术”也呼应了道德诉求，因为你们团队（这些捐赠直接受益者）正在谈论从这次捐赠中延续下来的好处。

source: Psychological Techniques
es_mx: Técnicas Psicológicas
fr_ca: Techniques Psychologiques
ru_ru: Психологические Приемы
zh_cn: 心理技巧

source: Two major psychological techniques you can use to improve your pitch are the self-reference effect and the primacy-recency effect.
es_mx: Dos técnicas psicológicas importantes que puede utilizar para mejorar su tono son el efecto de autorreferencia y el efecto de primicía-recencia.
fr_ca: Les deux principales techniques psychologiques que vous pouvez utiliser pour améliorer votre discours sont l'effet d'autoréférence et l'effet de primauté-récence.
ru_ru: Два основных психологических приёма, которые помогут улучшить ваше предложение, — это эффект самоотнесения и эффект первичности и новизны (эффект края).
zh_cn: 你可以使用两种主要的心理技巧来改善你的推广：自我参照效应和首尾效应。

source: The **self-reference effect** is defined as "a tendency for people to encode information differently depending on whether they are implicated in the information" - which basically means that people remember information better if they believe they are connected in some way to it. If you find connections between your pitch and your contact, they will be more likely to remember you and your ideas!
es_mx: El **efecto de autorreferencia** se define como "una tendencia de las personas a codificar la información de forma diferente dependiendo de si están implicadas en la información", lo que básicamente significa que las personas recuerdan mejor la información si creen que están conectadas de algún modo con ella. Si encuentras conexiones entre tu discurso y tu contacto, será más probable que se acuerden de ti y de tus ideas.
fr_ca: **L'effet d'autoréférence** est défini comme "une tendance des gens à encoder l'information différemment selon qu'ils sont impliqués ou non dans l'information" - ce qui signifie essentiellement que les gens se souviennent mieux de l'information s'ils pensent qu'ils y sont liés d'une manière ou d'une autre. Si vous trouvez des liens entre votre présentation et votre contact, il sera plus enclin à se souvenir de vous et de vos idées !
ru_ru: **Эффект самоотнесения** определяется как "тенденция людей кодировать информацию по-разному в зависимости от их вовлечённости в эту информацию". Проще говоря, люди лучше запоминают информацию, если считают, что имеют к ней какое-то отношение. Если вы найдёте связи между вашим предложением и вашим собеседником, он с большей вероятностью запомнит вас и ваши идеи!
zh_cn: **自我参照效应** 被定义为“人们根据他们是否与信息相关而对信息进行不同编码”的倾向 - 这基本上意味着如果人们相信他们与信息有某种联系，他们就更容易记住信息。如果你在你的推广和你的联系人之间找到联系，他们就更有可能记住你和你的想法！
