Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/pitching-your-team.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: The **primacy-recency effect** is "the observation that new information is most easily absorbed and retained at the beginning and end of a learning session". This means that information presented at the beginning and end of a pitch is the information that your audience is most likely to remember. To adapt for the primacy-recency effect, your presentations and pitches should contain its most powerful content at the beginning and end.
es_mx: El **efecto de primacía-recencia** es "la observación de que la información nueva se absorbe y retiene más fácilmente al principio y al final de una sesión de aprendizaje". Esto significa que la información presentada al principio y al final de un discurso es la que el público recordará con más facilidad. Para adaptarse al efecto de primicia-recencia, sus presentaciones y lanzamientos deben contener su contenido más potente al principio y al final.
fr_ca: L'effet **primacy-recency** est "l'observation selon laquelle les nouvelles informations sont plus facilement absorbées et retenues au début et à la fin d'une session d'apprentissage". Cela signifie que les informations présentées au début et à la fin d'une présentation sont celles dont votre public est le plus susceptible de se souvenir. Pour s'adapter à l'effet de primauté-récence, vos présentations et vos pitchs doivent contenir leur contenu le plus puissant au début et à la fin.
ru_ru: **Эффект первичности и новизны** — это «явление, при котором новая информация легче всего усваивается и сохраняется в памяти в начале и в конце обучающего занятия». Это означает, что информация, представленная в начале и конце презентации, с наибольшей вероятностью запомнится аудиторией. Чтобы использовать этот эффект, размещайте наиболее убедительные тезисы и факты во вступлении и заключении вашего выступления.
zh_cn: **首尾效应** 就是“新信息最容易在学习过程的开始和结束时被吸收和保留”。这意味着在推广的开始和结束呈现的信息是你的听众最有可能记住的信息。为了适应首尾效应，你的演示和推广应该在开始和结束时包含最有力的内容。

source: Be Concise!
es_mx: ¡Se Conciso!
fr_ca: Soyez Concis !
ru_ru: Будьте Лаконичны!
zh_cn: 简明扼要！

source: All of the pitches listed at the beginning of this article rely on the principle of being concise. People that deal with tens, hundreds, or thousands of people asking for their money and aid generally have short attention spans. To stand out, you need to distill a lot of information and rhetoric into a few short sentences or slides.
es_mx: Todos los argumentos enumerados al principio de este artículo se basan en el principio de la concisión. Las personas que tratan con decenas, cientos o miles de personas que les piden dinero y ayuda suelen tener períodos de atención cortos. Para destacar, hay que destilar mucha información y retórica en unas pocas frases o diapositivas breves.
fr_ca: Toutes les présentations énumérées au début de cet article reposent sur le principe de la concision. Les personnes qui ont affaire à des dizaines, des centaines ou des milliers de personnes qui leur demandent de l'argent et de l'aide ont généralement une durée d'attention courte. Pour vous démarquer, vous devez distiller beaucoup d'informations et de rhétorique en quelques phrases ou diapositives courtes.
ru_ru: Все типы презентаций, перечисленные в начале статьи, основаны на принципе лаконичности. Люди, которые ежедневно сталкиваются с десятками, сотнями или тысячами просьб о финансировании и поддержке, обычно обладают ограниченной продолжительностью концентрации внимания. Чтобы выделиться, необходимо сжать большой объём информации и аргументации до нескольких кратких предложений или слайдов.
zh_cn: 文章开头列出的所有提案都依赖于简洁明了的原则。那些要处理成千上万个向他们要钱和帮助的人的人通常注意力持续很短。要想脱颖而出，你需要把大量的信息和修辞浓缩成几句话或几张幻灯片。

source: Figure out how your team relates to the contact you are approaching, and develop your pitch around this relation; finding common ground is a great way to relate yourself to your contact and leverage the self-reference effect! You can do this by researching the company's core values and initiatives in advance. For instance, if a company is very invested in community STEM education programs, highlight that your team develops STEM professionals in a unique way. Once you've figured out what connects your team with your contact, create the content of your pitch around these ideas.
es_mx: Averigua cómo se relaciona tu equipo con el contacto al que te diriges y desarrolla tu discurso en torno a esta relación; encontrar puntos en común es una forma estupenda de relacionarte con tu contacto y aprovechar el efecto de autorreferencia. Para ello, investigue previamente los valores e iniciativas fundamentales de la empresa. Por ejemplo, si una empresa invierte mucho en programas de educación STEM en la comunidad, destaque que su equipo desarrolla profesionales STEM de una forma única. Una vez que hayas averiguado qué es lo que conecta a tu equipo con tu contacto, crea el contenido de tu presentación en torno a estas ideas.
fr_ca: Déterminez les liens entre votre équipe et le contact que vous approchez, et développez votre discours en fonction de ces liens ; trouver un terrain d'entente est un excellent moyen de vous rapprocher de votre contact et de tirer parti de l'effet d'autoréférence ! Pour ce faire, vous pouvez vous renseigner à l'avance sur les valeurs fondamentales et les initiatives de l'entreprise. Par exemple, si une entreprise est très investie dans les programmes communautaires d'éducation aux STIM, soulignez que votre équipe forme des professionnels des STIM d'une manière unique. Une fois que vous avez déterminé ce qui relie votre équipe à votre contact, créez le contenu de votre présentation autour de ces idées.
ru_ru: Определите, как ваша команда связана с организацией, к которой вы обращаетесь, и стройте презентацию вокруг этой связи. Поиск общих ценностей — отличный способ установить взаимопонимание и задействовать эффект самоотнесения! Для этого заранее изучите основные принципы и инициативы компании. Например, если компания активно инвестирует в образовательные STEM-программы, подчеркните, что ваша команда готовит будущих специалистов в этой сфере уникальным способом. Как только вы определили точки соприкосновения, формируйте содержание презентации вокруг этих идей.
zh_cn: 找出你的团队与你接触的联系人之间的关系，并围绕这种关系制定你的推广；找到共同点是一种很好的方式，可以让你与你的联系人建立关系，并利用自我参照效应！你可以通过提前研究公司的核心价值观和倡议来做到这一点。例如，如果一个公司非常投入于社区STEM教育项目，那么就强调你的团队以一种独特的方式培养STEM专业人才。一旦你弄清楚了什么连接了你的团队和你的联系人，就根据这些想法创建你的推广内容。

source: After developing your pitch, ensure that all information is relevant. Cutting content that doesn't connect with the company or organization you are presenting to is a surefire way to save time. If you choose to present a slideshow, keep your slides bare. An overloaded slide will draw attention away from your team, which is bad - people connect better with people than walls of text. Also, while reviewing your script or pitch, ensure each idea is stated only once. Overall, your goal is to create a clear picture of your team, impact, and connection in as few words as possible.
es_mx: Después de desarrollar su discurso, asegúrese de que toda la información sea relevante. Recortar el contenido que no guarde relación con la empresa u organización a la que se presenta es una forma segura de ahorrar tiempo. Si optan por dar una presentación de diapositivas, procuren no sobrecargarlas. Una diapositiva sobrecargada desviará la atención de tu equipo, lo cual es malo: la gente conecta mejor con las personas que con los muros de texto. Además, al revisar el guión o la presentación, asegúrate de que cada idea se expone una sola vez. En general, su objetivo es crear una imagen clara de su equipo, su impacto y su conexión con el menor número de palabras posible.
fr_ca: Après avoir élaboré votre présentation, assurez-vous que toutes les informations sont pertinentes. Couper le contenu qui n'est pas en rapport avec l'entreprise ou l'organisation à laquelle vous vous adressez est un moyen infaillible de gagner du temps. Si vous choisissez de présenter un diaporama, veillez à ce que vos diapositives soient dépouillées. Une diapositive surchargée détournera l'attention de votre équipe, ce qui n'est pas une bonne chose - les gens s'identifient mieux aux personnes qu'aux murs de texte. De même, lorsque vous relisez votre script ou votre pitch, veillez à ce que chaque idée ne soit énoncée qu'une seule fois. Globalement, votre objectif est de créer une image claire de votre équipe, de votre impact et de vos relations en aussi peu de mots que possible.
ru_ru: После разработки презентации убедитесь в релевантности всей информации. Удаление материалов, не связанных с тематикой компании или организации, — гарантированный способ экономии времени. Если вы используете слайды, сохраняйте их лаконичными. Перегруженный слайд переключит внимание с вашей команды на текст, а это нежелательно — люди лучше взаимодействуют с выступающими, чем с «стенами текста». Также проверьте, чтобы каждая идея была представлена без повторов. Ваша цель — создать четкое представление о команде, её влиянии и связи с аудиторией, используя минимум слов.
zh_cn: 在制定好你的推广后，确保所有信息都是相关的。删掉与你要展示的公司或组织无关的内容是节省时间的绝佳方法。如果你选择用幻灯片来展示，保持你的幻灯片简洁。一个过于拥挤的幻灯片会分散对你团队的注意力，这是不好的 - 人与人之间的联系总比一整面文字更好。另外，在审查你的脚本或推广时，确保每个想法只说一次。总之，你的目标是用尽可能少的文字来创建一个清晰的团队、影响力和联系的画面。

source: Putting It All Together
es_mx: Unanlo
fr_ca: La Mise en Place de l'Ensemble
ru_ru: Соберите Все Воедино!
zh_cn: 把它们整合起来

source: Now that you have these tips and techniques at your disposal, integrate them into your presentations, flyers, and networking events! With passion and hard work, you'll hopefully find your rate of success skyrocketing :)
es_mx: Ahora que tienes estos consejos y técnicas a tu disposición, integrenlos en sus presentaciones, folletos y eventos de networking. Con pasión y trabajo duro, es de esperar que su tasa de éxito se dispare :)
fr_ca: Maintenant que vous disposez de ces conseils et techniques, intégrez-les dans vos présentations, vos dépliants et vos événements de réseautage ! Avec de la passion et du travail, vous verrez, je l'espère, votre taux de réussite monter en flèche :)
ru_ru: Теперь, когда эти советы и методики в вашем распоряжении, интегрируйте их в свои презентации, флаеры и мероприятия по нетворкингу! Благодаря увлеченности и упорному труду, ваш показатель успеха взлетит до небес :)
zh_cn: 现在你已经掌握了这些提示和技巧，把它们融入到你的演示、传单和社交活动中吧！有了激情和努力，你会发现你的成功率飙升 :)
