Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/starting-a-team.po
Languages: es_mx, fr_ca, ja_jp, ru_ru, zh_cn

source: Starting a Team
es_mx: Comenzando un equipo
fr_ca: Création d'une équipe
ja_jp: チームを始める
ru_ru: Создание Команды
zh_cn: 创建一个团队

source: So you want to start an FTC\ |reg| team - here's how! Here's a few tips on how to get up and running. This article covers recruiting members and mentors, structuring your team, and pitching your budget.
es_mx: Entonces quieres comenzar un equipo de FTC - ¡aquí está cómo! Aquí tienes algunos consejos sobre cómo empezar y ponerte en marcha. Este artículo cubre reclutar miembros y mentores, estructurar tu equipo y presentar tu presupuesto.
fr_ca: Vous voulez créer une équipe FTC\ |reg| - voici comment ! Voici quelques conseils pour vous aider à démarrer. Cet article traite du recrutement des membres et des mentors, de la structuration de votre équipe et de la présentation de votre budget.
ru_ru: Итак, вы хотите создать команду FTC\ |reg| — вот как это сделать! В этой статье вы найдете практические рекомендации по старту команды: от поиска участников и наставников до формирования структуры и обоснования бюджета.
zh_cn: 所以你想组建一个FTC\ |reg|团队——方法如下！这里有一些关于如何启动和运行的技巧。这篇文章涵盖了招募成员和导师、构建团队以及投资预算。

source: Reach out locally to recruit members.
es_mx: Acércate localmente para reclutar miembros.
fr_ca: S'adresser au niveau local pour recruter des membres.
ja_jp: 地域に働きかけてメンバーを募集する
ru_ru: Набирайте участников в своём регионе.
zh_cn: 在当地招募成员

source: Chances are, if you're interested in robotics, you'll find quite a few people in your area interested in the same thing! Recruiting them is all about spreading your message and sparking interest in your team, and for that, advertising is everything. Make a catchy flyer and hold a couple interest meetings! A handy tip to get people to attend is to bring food - people love free food...
es_mx: Es probable que, si estás interesado en la robótica, encontrarás a varias personas en tu área interesadas en lo mismo. Reclutarlos se trata de difundir tu mensaje y despertar interés en tu equipo, y para eso, la publicidad lo es todo. ¡Haz un volante llamativo y organiza un par de reuniones de interés! Un consejo útil para que la gente asista es llevar comida, a la gente le encanta la comida gratis...
fr_ca: Si vous vous intéressez à la robotique, il y a de fortes chances que vous trouviez dans votre région un grand nombre de personnes intéressées par la même chose ! Pour les recruter, il faut diffuser votre message et susciter l'intérêt pour votre équipe, et pour cela, la publicité est essentielle. Faites un prospectus accrocheur et organisez quelques réunions d'intérêt ! Un conseil pratique pour inciter les gens à participer est d'apporter de la nourriture - les gens aiment la nourriture gratuite...
ru_ru: Скорее всего, если вас интересует робототехника, вы обнаружите, что в вашем районе немало людей с такими же интересами! Главное в их привлечении — распространить информацию и пробудить интерес к вашей команде, а для этого важна эффективная реклама. Создайте броский флаер и проведите несколько ознакомительных встреч! Практический совет: чтобы привлечь людей на встречи, предложите угощение — все любят бесплатную еду...
zh_cn: 如果你对机器人技术感兴趣，你很有可能会发现你所在地区有很多人对同样的事情感兴趣！招募他们就是要传播你的信息，激发他们对你的团队的兴趣，为此，广告就是一切。制作一张吸引人的传单，举行几次兴趣会议！让人们参加的一个便捷窍门是带些吃的——人们喜欢免费的食物…

source: At these interest events, discuss how FTC is interesting and beneficial to those who participate. Make sure to have information for both parents and students! While you're recruiting, make sure to be inclusive - people may not have figured out that their passions lie within the scope of *FIRST*\ |reg|, and they may do so in creative ways when given the opportunity!
es_mx: En estos eventos de interés, discuta cómo FTC es interesante y beneficioso para aquellos que participan. ¡Asegúrese de tener información tanto para padres como para estudiantes! Mientras reclutas, asegúrese de ser inclusivo: las personas pueden no haber descubierto que sus pasiones se encuentran dentro del alcance de *FIRST*\ |reg|, ¡y pueden hacerlo de manera creativa cuando se les brinde la oportunidad!
fr_ca: Lors de ces manifestations d'intérêt, expliquez en quoi FTC est intéressant et bénéfique pour ceux qui y participent. Veillez à fournir des informations aux parents et aux élèves ! Pendant que vous recrutez, assurez-vous d'être inclusif - les gens n'ont peut-être pas encore compris que leurs passions s'inscrivent dans le cadre de *FIRST*\ |reg|, et ils peuvent le faire de manière créative lorsqu'on leur en donne l'occasion !
ru_ru: На этих ознакомительных мероприятиях расскажите, почему FTC — это интересно и полезно для участников. Обязательно подготовьте информацию как для родителей, так и для участников! В процессе набора будьте открыты для всех — некоторые могут ещё не осознавать, что их увлечения лежат в сфере *FIRST*\ |reg|, и они способны раскрыть свой потенциал самыми неожиданными способами, получив такую возможность!
zh_cn: 在这些兴趣活动中，讨论FTC对参与者来说是多么有趣和有益。确保为家长和学生提供信息！当你招聘的时候，确保包容——人们可能没有意识到他们的热情其实在 *FIRST*\ |reg|的范围内，当有机会的时候，他们可能会以创造性的方式这样做！

source: To ensure a sustainable team, you should recruit from grades 7 upwards if possible to allow for a constant flow of members. The key to sustainability is new faces!
es_mx: Para asegurar un equipo sostenible, debes reclutar a partir de primero de secundaria (12 años) en adelante, si es posible, para permitir un flujo constante de miembros. ¡La clave para la sostenibilidad son caras nuevas!
fr_ca: Pour assurer la pérennité de l'équipe, vous devez recruter à partir de la 7e année, si possible, afin d'assurer un flux constant de membres. La clé de la durabilité, c'est l'arrivée de nouveaux visages !
ja_jp: 持続可能なチームを確保するためには、メンバーの流動性を常に確保できるように、可能であれば中学1年生(グレード7)以上から採用する必要があります。持続可能性の鍵は新しい顔だ!
ru_ru: Для обеспечения устойчивого развития команды желательно привлекать участников, начиная с 7-го класса и старше — это создаст постоянный приток новых участников. Ключ к долгосрочному существованию команды — регулярное пополнение новыми лицами!
zh_cn: 为了确保一个可持续发展的团队，如果可能的话，你应该从7年级以上招募成员，以允许成员的持续流动。可持续性的关键是新面孔！

source: Make sure to get everyone's contact information so you can reach out to keep them interested.
es_mx: Asegúrate de obtener la información de contacto de todos para poder comunicarte y mantener su interés.
fr_ca: Veillez à obtenir les coordonnées de tous les participants afin de pouvoir les contacter pour maintenir leur intérêt.
ru_ru: Обязательно собирайте контактные данные всех заинтересованных лиц, чтобы поддерживать их вовлеченность.
zh_cn: 确保获得每个人的联系信息，这样你就可以联系他们以保持他们的兴趣。

source: Find mentors.
es_mx: Encuentra mentores.
fr_ca: Trouver des mentors.
ja_jp: メンターを探す
ru_ru: Найдите наставников.
zh_cn: 寻找导师们

source: It's understandable if you have difficulty with this step, but it is critically important: good mentors can make the difference between a great season and a horrible one! Note the phrase mentors, rather than mentor. A strong structure of facilitators can assist you with the wide variety of the engineering and business problems you will be tackling throughout the season, while a single mentor can be a valuable asset but only has so much time and expertise to give.
es_mx: Es comprensible si tienes dificultades con este paso, pero es de vital importancia: ¡los buenos mentores pueden marcar la diferencia entre una temporada excelente y una horrible! Observa la frase mentores, en lugar de mentor. Una estructura sólida de facilitadores puede ayudarte con la amplia variedad de problemas de ingeniería y negocios a los que te enfrentarás durante la temporada, mientras que un solo mentor puede ser un recurso valioso, pero solo tiene tanto tiempo y experiencia para ofrecer.
fr_ca: Il est compréhensible que vous ayez du mal à franchir cette étape, mais elle est d'une importance capitale : de bons mentors peuvent faire la différence entre une bonne et une mauvaise saison ! Notez l'expression "mentors" plutôt que "mentor". Une structure solide de facilitateurs peut vous aider à résoudre la grande variété de problèmes techniques et commerciaux auxquels vous serez confrontés tout au long de la saison, tandis qu'un seul mentor peut être un atout précieux, mais il n'a que peu de temps et d'expertise à offrir.
ru_ru: Вполне понятно, если этот шаг вызывает у вас затруднения, но он критически важен: хорошие наставники могут определить разницу между успешным и провальным сезоном! Обратите внимание на формулировку «наставники» (во множественном числе). Продуманная структура наставничества поможет вам справиться с широким спектром технических и организационных задач на протяжении всего сезона, в то время как единственный наставник, бесспорно, ценен, но ограничен во времени и экспертизе.
zh_cn: 如果你在这一步上有困难，这是可以理解的，但这一点至关重要：好的导师们可以决定一个赛季是伟大的还是糟糕的！注意是导师“们”，而不是导师。强大的导师结构可以帮助你解决整个赛季将要解决的各种工程和业务问题，而单个导师虽然是一笔宝贵的财富，但TA的时间和专业知识是有限的。

source: Now, to find mentors: reaching out to STEM teachers in your area is a great way to find interest, but you can also reach out to local businesses to see if any of their employees would be interested in lending a hand! (See the email guide for more tips.) New recruits can ease this process a little, and if a new mentor knows a team member it'll make it easier for them to mesh with the rest of the team. Receiving mentorship over text and video is generally less recommended, as in-person mentors can communicate and demonstrate mechanical and software concepts more efficiently.
es_mx: Ahora, para encontrar mentores: contactar a los profesores de STEM en tu área es una excelente manera de encontrar interés, pero también puedes comunicarte con empresas locales para ver si alguno de sus empleados estaría interesado en echar una mano! (Consulta la guía de correo electrónico para obtener más consejos). Los nuevos reclutas pueden facilitar un poco este proceso, y si un nuevo mentor conoce a un miembro del equipo, será más fácil para ellos integrarse con el resto del equipo. Recibir mentoría a través de texto y video generalmente es menos recomendado, ya que los mentores en persona pueden comunicar y demostrar conceptos mecánicos y de software de manera más eficiente.
fr_ca: Maintenant, pour trouver des mentors : tendre la main aux professeurs de STEM de votre région est un excellent moyen de trouver de l'intérêt, mais vous pouvez également tendre la main aux entreprises locales pour voir si l'un de leurs employés serait intéressé à donner un coup de main ! (Les nouvelles recrues peuvent faciliter ce processus, et si un nouveau mentor connaît un membre de l'équipe, il lui sera plus facile de s'intégrer au reste de l'équipe.) Il est généralement moins recommandé de recevoir un mentorat par texte ou par vidéo, car les mentors en personne peuvent communiquer et démontrer les concepts mécaniques et logiciels plus efficacement.
ru_ru: Теперь о поиске наставников: обращение к учителям естественно-научных дисциплин в вашем районе — замечательный способ найти заинтересованных людей, но вы также можете связаться с местными компаниями и узнать, не захотят ли их сотрудники предложить свою помощь! (Подробнее — в руководстве по составлению писем.) Новые участники могут несколько облегчить этот процесс — если наставник уже знаком с кем-то из команды, это поможет ему быстрее влиться в коллектив. Дистанционное наставничество (через текст и видео) обычно менее эффективно, поскольку личное присутствие позволяет наставникам доходчивее объяснять и демонстрировать технические и программные концепции.
zh_cn: 现在，寻找导师们：联系你所在地区的STEM老师是寻找兴趣的好方法，但你也可以联系当地企业，看看他们的员工是否有兴趣伸出援手！（有关更多提示，请参阅电子邮件指南。）新招募的人可以稍微简化这个过程，如果新导师了解团队成员，这将使他们更容易与团队的其他成员交流。通常不建议通过文本和视频接受指导，因为面授的导师可以更有效地交流和演示机械和软件概念。

source: To compete, teams are required to have at least two mentors over the age of 18. Additional mentors can be younger than 18. All mentors must pass the *FIRST* Youth Protection Screening, a once-per-year background check for mentors and volunteers. This is all handled by *FIRST*, and is free.
es_mx: Para competir, los equipos deben tener al menos dos mentores mayores de 18 años. Los mentores adicionales pueden ser menores de 18 años. Todos los mentores deben pasar la *Evaluación de Protección Juvenil* de *FIRST*, una verificación de antecedentes anual para mentores y voluntarios. Todo esto es manejado por *FIRST* y es gratuito.
fr_ca: Pour concourir, les équipes doivent avoir au moins deux mentors âgés de plus de 18 ans. Les mentors supplémentaires peuvent être âgés de moins de 18 ans. Tous les mentors doivent passer le *FIRST* Youth Protection Screening, une vérification annuelle des antécédents des mentors et des bénévoles. Cette vérification est effectuée par *FIRST* et est gratuite.
ru_ru: Для участия в соревнованиях у команды должны быть как минимум два наставника старше 18 лет, остальные ее менторы могут быть чуть младше. Все наставники должны пройти бесплатную проверку *FIRST* Youth Protection Screening которая проводится раз в год для наставников и волонтеров.
zh_cn: 参赛队伍需要有至少两名18岁以上的导师。额外的导师可以小于18岁。所有导师都必须通过 *FIRST* 的青少年保护筛选，这是每年一次的导师和志愿者背景调查。这一切都由 *FIRST* 处理，并且是免费的。

source: While parents and other family members can be helpful mentors in a pinch, it's important to have outside mentorship so that your team can survive even after you graduate.
es_mx: Mientras que los padres y otros miembros de la familia pueden ser mentores útiles en caso de apuro, es importante contar con mentoría externa para que tu equipo pueda sobrevivir incluso después de que te gradúes.
fr_ca: Si les parents et les autres membres de la famille peuvent être des mentors utiles en cas de besoin, il est important de bénéficier d'un mentorat extérieur pour que votre équipe puisse survivre même après l'obtention de votre diplôme.
ru_ru: Хотя родители и другие члены семьи могут выручить в качестве наставников в крайнем случае, важно привлекать внешних специалистов — это гарантирует сохранение команды даже после вашего выпуска.
zh_cn: 虽然父母和其他家庭成员在紧要关头可以成为有用的导师，但有外部导师是很重要的，这样你的团队即使在你毕业后也能生存下来。

source: Generally mentors fall into a few primary roles. Some mentors may be purely technical, offering advice on your robot and engineering documentation; some mentors focus on "soft skills" such as leadership, fundraising, marketing, and team logistics. Many mentors blur the lines between these roles, but some prefer to stick to one area or another.
es_mx: Generalmente los mentores se dividen en algunos roles principales. Algunos mentores pueden ser puramente técnicos, ofreciendo consejos sobre tu robot y documentación de ingeniería; algunos mentores se enfocan en "habilidades blandas" como liderazgo, recaudación de fondos, marketing y logística del equipo. Muchos mentores difuminan las líneas entre estos roles, pero algunos prefieren enfocarse en un área u otra.
fr_ca: En général, les mentors ont plusieurs rôles principaux. Certains mentors peuvent être purement techniques, offrant des conseils sur votre robot et la documentation technique ; d'autres mentors se concentrent sur les "compétences non techniques" telles que le leadership, la collecte de fonds, le marketing et la logistique de l'équipe. De nombreux mentors font la distinction entre ces rôles, mais certains préfèrent se cantonner à l'un ou l'autre domaine.
ru_ru: Обычно наставники выполняют несколько основных ролей. Одни могут специализироваться на технических вопросах, помогая с роботом и инженерной документацией; другие сосредотачиваются на «гибких навыках» — лидерстве, фандрайзинге, маркетинге и организации работы команды. Многие наставники совмещают эти функции, но некоторые предпочитают придерживаться определённого направления.
zh_cn: 一般来说，导师分为几个主要角色。有些导师可能纯粹是技术型的，为你的机器人和工程笔记提供建议；有些导师专注于“软技能”，如领导力、筹款、市场营销和团队后勤。许多导师模糊了这些角色之间的界限，但有些人更倾向专注于某一领域。

source: Don't be afraid to involve mentors who aren't self proclaimed as highly "technical". They're sometimes the best ones.
es_mx: No tengas miedo de involucrar a mentores que no se autoproclamen como altamente "técnicos". A veces son los mejores.
fr_ca: N'ayez pas peur de faire appel à des mentors qui ne se proclament pas hautement "techniques". Ce sont parfois les meilleurs.
ru_ru: Не бойтесь привлекать наставников, которые не считают себя «технарями». Иногда именно они оказываются лучшими помощниками.
zh_cn: 不要害怕让那些自称不是高度“技术性”的导师参与进来。他们有时是最好的。

source: Pick a comfortable structure for your team.
es_mx: Elige una estructura cómoda para tu equipo.
fr_ca: Choisissez une structure confortable pour votre équipe.
ja_jp: チームにとって最適なチーム構造を選択する
ru_ru: Выберите структуру для своей команды.
zh_cn: 为您的团队选择一个合适的结构

source: There are 3 common team structures, each with advantages and disadvantages:
es_mx: Hay 3 estructuras de equipo comunes, cada una con ventajas y desventajas.
fr_ca: Il existe 3 structures d'équipe courantes, chacune présentant des avantages et des inconvénients :
ja_jp: 一般的なチーム構造は 3 つあり、それぞれに長所と短所があります。
ru_ru: Существует 3 распространённые модели организации команды, каждая со своими преимуществами и недостатками:
zh_cn: 有3种常见的团队结构，每种结构都有优点和缺点：

source: School Team
es_mx: Equipo Escolar
fr_ca: Équipe de l'école
ja_jp: 学校ベースのチーム
ru_ru: Школьная Команда
zh_cn: 学校团队

source: Run as a school-affiliated team/club with school funding. Watch for red tape regarding funds and parts. Also watch for it on the field :)
es_mx: Ejecutar como un equipo/club afiliado a la escuela con financiamiento escolar. Estar atentos a la burocracia en relación a los fondos y las piezas. También estar atentos a ello en el campo :)
fr_ca: Organiser une équipe/un club affilié à l'école et financé par l'école. Attention aux formalités administratives concernant les fonds et les pièces. Surveillez-les également sur le terrain :)
ja_jp: 学校付属のチーム／クラブとして、学校の資金で運営する。資金や部品に関する面倒な手続きには注意してください。(日本のチームの場合、活動場所やそれらが使用できる時間・曜日が限られている場合が多くあります)
ru_ru: Создайте команду/клуб при школе с финансированием от учебного заведения. Внимание: возможны бюрократические трудности при использовании средств и заказе деталей. И да — следите за оборудованием на игровом поле :)
zh_cn: 以学校资助的学校附属团队/社团的形式运行。注意有关资金和零件的繁文缛节。在场地上也要注意 :)

source: If starting a school team, make sure you figure out whether you can accept external sponsorships. This can affect your financial planning and fundraising.
es_mx: Si estás comenzando un equipo escolar, asegúrate de averiguar si puedes aceptar patrocinios externos. Esto puede afectar tu planificación financiera y recaudación de fondos.
fr_ca: Si vous créez une équipe scolaire, assurez-vous de savoir si vous pouvez accepter des parrainages extérieurs. Cela peut avoir une incidence sur la planification financière et la collecte de fonds.
ja_jp: 学校チームを立ち上げる場合、外部からのスポンサーを受け入れることができるかどうか、必ず確認しておいてください。これは、予算計画や資金調達に影響を与える可能性があります。
ru_ru: Если вы создаёте команду при учебном заведении, обязательно уточните, можете ли вы привлекать сторонних спонсоров. Это повлияет на ваше финансовое планирование и организацию сбора средств.
zh_cn: 如果成立一个校队，一定要弄清楚你是否可以接受外部赞助。这会影响你的财务规划和筹款。

source: Advantages:
es_mx: Ventajas:
fr_ca: Avantages :
ja_jp: メリット
ru_ru: Преимущества:
zh_cn: 优点：

source: Easier to sustain
es_mx: Más fácil de mantener
fr_ca: Plus facile à soutenir
ja_jp: 維持・継続がしやすい
ru_ru: Легче поддерживать команду
zh_cn: 更容易维持

source: Potential for consistent funding
es_mx: Potencial para financiamiento constante
fr_ca: Possibilité d'un financement cohérent
ja_jp: 学校から資金提供を受けた場合は、安定した収入を得ることができる
ru_ru: Возможность постоянного финансирования команды
zh_cn: 持续供资的潜力

source: Disadvantages:
es_mx: Desventajas:
fr_ca: Inconvénients :
ja_jp: デメリット
ru_ru: Недостатки:
zh_cn: 缺点：

source: Less practice schedule freedom
es_mx: Menos libertad en el horario de práctica
fr_ca: Moins de liberté dans les horaires d'entraînement
ja_jp: 練習スケジュールの自由度が低い
ru_ru: График работы зависит не только от вас
zh_cn: 练习时间自由度降低

source: Arbitrary part sourcing restrictions
es_mx: Restricciones arbitrarias en la obtención de piezas.
fr_ca: Restrictions arbitraires en matière d'approvisionnement en pièces
ja_jp: 部品の購入や調達が制限される可能性がある
ru_ru: Некоторые ограничения на поставку комплектующих
zh_cn: 采购零件会有较多限制

source: Competing for funding yearly
es_mx: Compitiendo por financiamiento anualmente
fr_ca: En concurrence chaque année pour l'obtention d'un financement
ja_jp: 資金調達で毎年競争が必要な場合がある
ru_ru: Ежегодная конкуренция за финансирование
zh_cn: 每年都要争取资金

source: Limited/no summer practice
es_mx: Práctica de verano limitada/no existente
fr_ca: Pas ou peu d'entraînement d'été
ja_jp: 夏休み期間の練習などに制限される可能性がある
ru_ru: Отсутствие или ограничения на работу летом
zh_cn: 有限的/无暑假的练习

source: Home Team
es_mx: Equipo Local
fr_ca: Équipe locale
ja_jp: ホームチーム
ru_ru: Домашняя команда
zh_cn: 家庭团队

source: Run out of a house or garage. Budget is whatever fundraising you can acquire.
es_mx: Quedarse sin una casa o garaje. El presupuesto es cualquier recaudación de fondos que puedas obtener.
fr_ca: L'activité se déroule dans une maison ou un garage. Le budget correspond à la collecte de fonds que vous pouvez acquérir.
ja_jp: 自宅や ガレージから実行する。予算は、獲得できる資金なら何でも良い。
ru_ru: Создайте команду просто в доме или гараже. Бюджет – любые средства, которые вы сможете найти.
zh_cn: 家庭团队在家里或车库里活动。你能获得多少筹款，你就有多少预算。

source: Freer practice schedule
es_mx: Horario de práctica libre
fr_ca: Horaire d'entraînement plus libre
ja_jp: より自由な練習スケジュール
ru_ru: Свободный график
zh_cn: 更自由的练习时间

source: No part sourcing constraints
es_mx: Sin restricciones en la obtención de piezas
fr_ca: Pas de contraintes d'approvisionnement en pièces
ja_jp: 部品調達の制約がない
ru_ru: Нет ограничений по поиску нужных компонентов
zh_cn: 没有零件采购的限制

source: Harder to obtain sponsorships
es_mx: Más difícil obtener patrocinios
fr_ca: Plus difficile d'obtenir des parrainages
ja_jp: スポンサーの獲得が難しい
ru_ru: Трудно найти спонсоров
zh_cn: 更难获得赞助

source: Space/residential constraints
es_mx: Espacio/restricciones residenciales
fr_ca: Contraintes spatiales/résidentielles
ja_jp: スペース/住居の制約
ru_ru: Ограничения площади работы
zh_cn: 空间/居住条件的限制

source: Community Team
es_mx: Equipo de la comunidad
fr_ca: Équipe communautaire
ja_jp: コミュニティチーム
ru_ru: Общественная команда
zh_cn: 社区团队

source: Run out of a 501(c)3. Generally the hardest to set up, but offers the most flexibility.
es_mx: Quedarse sin un 501(c)3 (exentos del impuesto federal sobre el ingreso en E.U.A.). Generalmente el más difícil de establecer, pero ofrece la mayor flexibilidad.
fr_ca: Géré par un organisme de type 501(c)3. C'est généralement la plus difficile à mettre en place, mais c'est celle qui offre le plus de flexibilité.
ja_jp: 501(c)3から運営される。一般的に設立が最も難しいが、最も柔軟性がある。( 501(c)3はアメリカにおける非営利団体の一種で、日本での特定非営利活動法人に当たります。日本でチームを設立する場合は、まずは任意団体として動くことをおすすめします。)
ru_ru: Работает на базе 501(c)3. Как правило, такую команду сложнее всего создать, зато ее структура обеспечивает наибольшую гибкость в работе.
zh_cn: 由501(c)3非盈利组织运行。（译者注：501(c)3组织是指根据《美国法典》第26章第501(c)3条免税条款规定的不用缴纳联邦所得税的公司、信托、非公司协会或其他类型的组织。）通常最难建立，但也提供了最大的灵活性。
