Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/starting-a-team.po
Languages: es_mx, fr_ca, ja_jp, ru_ru, zh_cn

source: Chances are, if you’re interested in robotics, you’ll find quite a few people in your area interested in the same thing! Recruiting them is all about spreading your message and sparking interest in your team, and for that, advertising is everything. Make a catchy flyer and hold a couple interest meetings! A handy tip to get people to attend is to bring food - people love free food…
ja_jp: あなたがロボット工学に興味があるとしたら、あなたの住んでいる地域にも同じ事を思っている人が沢山いるはずです！彼らを採用するには、あなたのメッセージ(想い)を伝え、チームへの関心を高めることが重要で、そのためにはポスターなどの広告が重要です。キャッチーなポスターやチラシを作成して、興味を持って貰うための説明会(ミーティング)を何回か開催しましょう。参加者を集めるためのヒントは、食べ物を持参することです。人々は無料の食べ物を好みます…(日本では、SNS等を活用してメンバーを集めることも効果的です。まずは、自分の身近な人などに声をかけてみましょう。または、他の日本のFTCやFRCチームにコンタクトを取り、どのようにメンバーを集めているか、聞いて見ることをおすすめします。<原文には記載されていません>)

source: At these interest events, discuss how FTC is interesting and beneficial to those who participate. Make sure to have information for both parents and students! While you’re recruiting, make sure to be inclusive - people may not have figured out that their passions lie within the scope of FIRST, and they may do so in creative ways when given the opportunity!
ja_jp: 説明会(ミーティング)では、FTCがどれほど面白く、参加者に取って有益であるかを説明・議論しましょう。また、参加者本人だけでは無く、保護者にも情報を共有することが重要です。メンバーを募集する際は、誰もが入れるように配慮をして下さい。その人は、自分の情熱がFIRSTの範囲内にあることを理解していないかもしれませんし、機会があれば創造的な方法で情熱を注ぐかもしれません。

source: Make sure to get everyone’s contact information so you can reach out to keep them interested.
ja_jp: 必ず全員の連絡先情報を入手して、興味を持ち続けてもらえるように働きかけましょう。

source: It’s understandable if you have difficulty with this step, but it is critically important: good mentors can make the difference between a great season and a horrible one! Note the phrase mentors, rather than mentor. A strong structure of facilitators can assist you with the wide variety of the engineering and business problems you will be tackling throughout the season, while a single mentor can be a valuable asset but only has so much time and expertise to give.
ja_jp: このステップを進めるのが難しいのは理解できますが、非常に重要です。良いメンターがいるかいないかが、素晴らしいシーズンになるか、最悪のシーズンとなるかの分かれ道となります！一方、一人のメンターは貴重な戦力となるものの、与えられる時間と専門知識は限られています。

source: Now, to find mentors: reaching out to STEM teachers in your area is a great way to find interest, but you can also reach out to local businesses to see if any of their employees would be interested in lending a hand! (See the email guide for more tips.) New recruits can ease this process a little, and if a new mentor knows a team member it’ll make it easier for them to mesh with the rest of the team. Receiving mentorship over text and video is generally less recommended, as in-person mentors can communicate and demonstrate mechanical and software concepts more efficiently.
ja_jp: メンターを見つけるために、あなたの地域のSTEM分野に詳しい先生に連絡を取ることは、興味を持ってもらうための素晴らしい方法ですが、それだけでは無く、地元の企業に連絡を取って、その企業の従業員が協力をしてくれるかどうかを試すこともできます。(詳細なヒントについては、電子メールガイドを参照してください。) 新しいメンターがチームメンバーを知っていれば、チームの他のメンバーとの連携を容易にすることができます。通常、テキストやビデオでメンターシップを受けることはあまり推奨されていません。対面でサポートしてくれるメンターは、機械やソフトウェアの概念をより効率的にメンバーに教え、実証することができるためです。

source: To compete, teams are required to have at least two mentors over the age of 18. Additional mentors can be younger than 18. All mentors must pass FIRST’s Youth Protection Screening, a once-per-year background check for mentors and volunteers. This is all handled by FIRST, and is free.
ja_jp: 大会へ出場するには、18歳以上のメンターが2名以上いることが求められます。追加のメンターは18歳未満でもかまいません。すべてのメンターは、FIRSTの青少年保護審査（メンターとボランティアのための年1回のバックグラウンドチェック）に合格する必要があります。この審査はすべてFIRSTが行い、費用は無料です。

source: While parents and other family members can be helpful mentors in a pinch, it’s important to have outside mentorship so that your team can survive even after you graduate.
ja_jp: 親や家族はいざというときに役立つメンターですが、卒業後もチームが存続できるように、外部のメンターがいることが重要です。

source: Generally mentors fall into a few primary roles. Some mentors may be purely technical, offering advice on your robot and engineering documentation; some mentors focus on “soft skills” such as leadership, fundraising, marketing, and team logistics. Many mentors blur the lines between these roles, but some prefer to stick to one area or another.
ja_jp: 一般的に、メンターはいくつかの主要な役割に分類されます。ロボットや技術資料についてアドバイスする純粋な技術職のメンターもいれば、リーダーシップ、資金調達、マーケティング、チームの運営など、「ソフトスキル」に重点を置くメンターもいます。多くのメンターはこれらの役割を曖昧にしていますが、中には一つの分野に固執することを好む人もいます。

source: Don’t be afraid to involve mentors who aren’t self proclaimed as highly “technical”. They’re sometimes the best ones.
ja_jp: 技術力の無いメンターを巻きこむことを恐れないで下さい。それらは時に最高の物になります。

source: For home teams, pitch to your parents or guardians! They’ll probably be dealing with a majority of the headache anyways so be nice :)
ja_jp: ホームチームの場合は、保護者の方に伝えてみましょう。どうせ頭痛の種の大半を扱うことになるのだから、親切にしてあげましょう)

source: If you’re pitching to a community nonprofit, make sure you highlight how FIRST will help them grow. Offer to volunteer your and your teammates’ time to help the organization with their programs, especially STEM ones, to create a mutually beneficial relationship.
ja_jp: 地域の非営利団体に売り込む場合は、FIRSTがその団体の発展にどのように役立つかを強調するようにします。その団体のプログラム、特にSTEMプログラムに対して、あなたやチームメイトの時間をボランティアとして提供することを提案し、お互いに有益な関係を作りましょう。

source: All 3 pitches should follow a similar structure; the easiest and most efficient involves a slide deck presentation. Make sure you highlight the value proposition (benefits that will be delivered) by starting an FTC team: educational experience, building future STEM professionals, increasing the potential of the area’s technology economy, etc. You may not think it’s important, but many decision-makers take these factors into account when deciding to approve your FTC team!
ja_jp: 交渉のためのプレゼンテーションはすべて同じような構成で、最も簡単で効率的なのはPowerPointによるプレゼンテーションです。FTCチームを立ち上げることで、教育的経験、将来のSTEM人材の育成、地域の技術経済の可能性の向上など、価値提案（提供される利益）を強調するようにしましょう。あなたは重要視していないかもしれませんが、多くの意思決定者は、FTCチームの承認を決定する際に、これらの要素を考慮します！

source: Don’t underpitch your budget needs!
ja_jp: 予算の必要性を過小評価しないこと！

source: Here’s a breakdown of a typical FTC season budget:
ja_jp: ここでは、一般的なFTCシーズンの予算の内訳を紹介します。

source: FIRST Registration is $295, and allows you to obtain your team number and compete.
ja_jp: FIRSTへの登録は295ドルで、チーム番号を取得し、大会に参加することができます。(ただし、アメリカ・カナダ以外の大会に参加する場合は、FIRST本部への登録料金はかかりません)

source: Region and competition costs vary depending on your region, ranging from $250 to $800 or more. Check with your region’s Program Delivery Partner for more information.
ja_jp: 大会の費用は、250ドルから800ドル以上と、地域によって異なります。詳しくは、お住まいの地域のプログラムデリバリーパートナー(PDP)にご確認ください。(2023年現在、日本から一番近い韓国地区大会は300ドルです。)

source: FIRST’s Control and Communication set will cost you $265, and their Electronics set will cost $282. Buying an additional Expansion Hub to maximize your robot’s actuation will cost another $250. If you’re careful, these are one-time purchases.
ja_jp: FIRSTのControl and Communicationセットは265ドル、Electronicsセットは282ドルです。ロボットの動作を最大限に高めるために拡張ハブを追加購入すると、さらに250ドルかります。きちんと検討して購入すれば、これらは1回限りの購入で済みます。(日本への送料はとても高額なため、チームにとって何が必要か、購入元などは良く考えましょう)

source: Extra money for sensors and servos - each can run you up to $100 each! Assuming 2 servos and 3 sensors, that’s $500.
ja_jp: センサーとサーボの追加費用 - それぞれ100ドル程度で済みます！サーボ2個、センサー3個と仮定すると、約500ドルです。

source: **Fundraising and sponsorship** are essential ways to ensure a team’s survival. See the fundraising guide (coming soon) for more.
ja_jp: **資金調達とスポンサーシップ**は、チームを存続させるために不可欠な方法です。詳しくはファンドレイジングガイド（近日公開予定）をご覧ください。
