Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/starting-a-team.po
Languages: es_mx, fr_ca, ja_jp, ru_ru, zh_cn

source: If going the community team route, consider finding a local nonprofit to work with. This can greatly reduce the work and time required compared to starting your own, and many are happy to expand into STEM if you pitch it convincingly! Some common nonprofits include 4-H groups, Scout posts, homeschool groups, and libraries.
es_mx: Si optas por seguir el camino del equipo comunitario, considera encontrar una organización sin fines de lucro local con la cual colaborar. Esto puede reducir considerablemente el trabajo y el tiempo requeridos en comparación con comenzar tu propia organización, ¡y muchos estarán encantados de expandirse hacia STEM si lo presentas convincentemente! Algunas organizaciones sin fines de lucro comunes incluyen grupos 4-H (organizaciones para jóvenes), puestos de Scouts, grupos de educación en el hogar y bibliotecas.
fr_ca: Si vous optez pour l'équipe communautaire, envisagez de trouver une association locale à but non lucratif avec laquelle travailler. Cela peut réduire considérablement le travail et le temps nécessaires par rapport à la création de votre propre équipe, et beaucoup d'entre elles sont heureuses d'étendre leurs activités aux STIM si vous les présentez de manière convaincante ! Parmi les organisations à but non lucratif les plus courantes, citons les groupes 4-H, les postes de scouts, les groupes d'enseignement à domicile et les bibliothèques.
ja_jp: コミュニティ・チームとして活動する場合は、地元の非営利団体と協力することを検討しましょう。自分で立ち上げるよりも労力と時間を大幅に削減でき、説得力のある提案をすれば、STEM分野への進出も喜んで引き受けてくれるところが多い！よくある非営利団体には、4-Hグループ、スカウト隊、ホームスクールグループ、図書館などがあります。(日本では、まず日本に存在する他のFTCチームに相談しましょう。その後、任意団体として動くことをおすすめします。日本で他のNPO法人や非営利法人の中の新しい事業としてFTCチームを運営することは困難です。)
ru_ru: Если вы выбираете путь создания нешкольной команды, рассмотрите возможность сотрудничества с местной некоммерческой организацией. Это значительно сократит затраты сил и времени по сравнению с созданием собственной структуры, а многие из них охотно расширят свою деятельность в сферу STEM, если вы убедительно это преподнесёте! Среди распространённых вариантов — отделения 4-H, скаутские организации, ассоциации домашнего обучения и библиотеки.
zh_cn: 如果走社区团队路线，考虑找一个当地的非营利组织合作。与自己创办相比，这可以大大减少所需的工作和时间。如果你能说服他们，许多非营利组织也乐于扩展到STEM领域！一些常见的非营利组织包括4-H团体（译者注：4-H groups 是一种面向青少年的非营利组织，旨在通过参与各种项目和活动，培养他们的领导力、公民意识和生活技能。4-H 的名称来自四个代表健康、心灵、忠诚和服务的H字母）、童子军分部、家庭教育团体和图书馆。

source: Potential dedicated practice space
es_mx: Espacio potencial dedicado para practicar
fr_ca: Possibilité d'un espace dédié à l'exercice de la profession
ja_jp: 専用の練習場所を確保する事ができる可能性がある
ru_ru: Выделенное место для занятий
zh_cn: 潜在的专用练习空间

source: Freedom of practice schedule
es_mx: Libertad de horario de práctica
fr_ca: Liberté de l'horaire de pratique
ja_jp: 自由な練習スケジュール
ru_ru: Свободный график работы
zh_cn: 自由安排练习时间

source: Lucrative for donors (through tax write-offs!)
es_mx: Lucrativo para los donantes (¡a través de deducciones fiscales!)
fr_ca: Lucrative pour les donateurs (grâce aux déductions fiscales !)
ja_jp: 寄付者に有利(税金対策として)(日本の場合は、認定NPOでない限りは税制的優遇は無いので、注意が必要です。)
ru_ru: Выгодно для спонсоров (за счет списания налогов!)
zh_cn: 捐助者有利可图（通过税务减免！）

source: Harder to sustain
es_mx: Más difícil de sostener
fr_ca: Plus difficile à maintenir
ja_jp: 持続させることが難しい
ru_ru: Труднее поддерживать
zh_cn: 更难维持

source: Many administrative tasks
es_mx: Muchas tareas administrativas
fr_ca: Nombreuses tâches administratives
ja_jp: 運営に当たって沢山の管理業務が必要になる
ru_ru: Много административных задач
zh_cn: 许多行政任务

source: Find funding and create your team!
es_mx: ¡Encuentra financiamiento y crea tu equipo!
fr_ca: Trouvez des financements et créez votre équipe !
ja_jp: 資金を見つけ、チームを作りましょう！
ru_ru: Найди финансирование и создай команду!
zh_cn: 寻找资金并创建您的团队！

source: Ultimately, the way you fund your team is dependent on which team structure you use.
es_mx: En última instancia, la forma en que financias a tu equipo depende de la estructura de equipo que utilices.
fr_ca: En fin de compte, la manière dont vous financez votre équipe dépend de la structure de l'équipe que vous utilisez.
ja_jp: 最終的には、どのようなチーム編成にするかによって、資金調達の方法が変わってきます。
ru_ru: В конечном счете, способ финансирования команды зависит от того, какую структуру команды вы используете.
zh_cn: 最终，您资助团队的方式取决于您使用的团队结构。

source: If you decide to run a school team, you should reach out to your superintendent, school board, and principal. Make sure to loop in a STEM teacher or two, and maybe even a curriculum administrator.
es_mx: Si decides dirigir un equipo escolar, debes comunicarte con tu superintendente, junta escolar y director. Asegúrate de incluir a un profesor de STEM o dos, e incluso a un administrador de currículo.
fr_ca: Si vous décidez de diriger une équipe scolaire, vous devez prendre contact avec le directeur de l'école, le conseil scolaire et le directeur de l'école. Assurez-vous d'y associer un ou deux professeurs de STIM et peut-être même un administrateur du programme scolaire.
ja_jp: 学校ベースのチームとして運営することに決めたら、まずは身近な先生や学校の校長先生などに声をかけてください。その際、STEMの先生等にも声をかけると良いです。
ru_ru: Если команда основана на базе школы, необходимо обратиться к заведующему, школьному совету и директору. Обязательно привлеките к этому двух преподавателей из области STEM и, возможно, даже завуча по учебной программе.
zh_cn: 如果你决定管理一个学校团队，你应该联系你的主管、学校董事会和校长。确保让一两位STEM教师参与其中，甚至可能还需要一个课程管理员。

source: For home teams, pitch to your parents or guardians! They'll probably be dealing with a majority of the headache anyways so be nice :)
es_mx: Para los equipos locales, habla con tus padres o tutores. Probablemente ellos estarán lidiando con la mayoría de los dolores de cabeza de todos modos, así que sé amable :)
fr_ca: Pour les équipes à domicile, présentez votre projet à vos parents ou à vos tuteurs ! Ils auront probablement à faire face à la majorité des maux de tête de toute façon, alors soyez gentils :)
ru_ru: Для команды на дому спонсорами могут быть либо родители, либо опекуны. От этого, вероятно, они начнут иметь дело с постоянной головной болью, так что будьте вежливы :)
zh_cn: 对于家庭团队，向你的父母或监护人推广吧！无论如何，他们可能会处理大部分让人头痛的问题，所以要友善 :)

source: If you're pitching to a community nonprofit, make sure you highlight how *FIRST* will help them grow. Offer to volunteer your and your teammates' time to help the organization with their programs, especially STEM ones, to create a mutually beneficial relationship.
es_mx: Si estás presentando a una organización sin fines de lucro de la comunidad, asegúrate de resaltar cómo *FIRST* los ayudará a crecer. Ofrece tu tiempo y el de tus compañeros de equipo como voluntarios para ayudar a la organización con sus programas, especialmente los relacionados con STEM, para crear una relación mutuamente beneficiosa.
fr_ca: Si vous vous adressez à un organisme communautaire à but non lucratif, assurez-vous de souligner comment *FIRST* l'aidera à se développer. Proposez à vos coéquipiers et à vous-même de donner de votre temps pour aider l'organisation à mettre en œuvre ses programmes, en particulier les programmes STIM, afin de créer une relation mutuellement bénéfique.
ru_ru: Если вы представляете программу некоммерческой организации, обязательно подчеркните, как FIRST поможет её развитию. Предложите волонтёрскую помощь — своё время и время участников команды — для поддержки программ организации, особенно в сфере STEM, чтобы создать взаимовыгодное партнёрство.
zh_cn: 如果你正在向一个社区非营利组织推广，确保你强调 *FIRST* 将如何帮助他们成长。提出自愿用你和你的队友的时间来帮助组织开展他们的项目，尤其是与STEM学科相关的，以建立互惠互利的关系。

source: All 3 pitches should follow a similar structure; the easiest and most efficient involves a slide deck presentation. Make sure you highlight the value proposition (benefits that will be delivered) by starting an FTC team: educational experience, building future STEM professionals, increasing the potential of the area's technology economy, etc. You may not think it's important, but many decision-makers take these factors into account when deciding to approve your FTC team!
es_mx: Todas las 3 presentaciones deben seguir una estructura similar; la más fácil y eficiente implica una presentación de diapositivas. Asegúrate de resaltar la propuesta de valor (beneficios que se entregarán) al comenzar un equipo de FTC: experiencia educativa, formación de futuros profesionales de STEM, aumento del potencial de la economía tecnológica del área, etc. Puede que no pienses que es importante, ¡pero muchos tomadores de decisiones toman en cuenta estos factores al decidir aprobar tu equipo de FTC!
fr_ca: Les 3 présentations doivent suivre une structure similaire ; la plus simple et la plus efficace consiste à présenter un jeu de diapositives. Veillez à mettre en évidence la proposition de valeur (les avantages qui seront offerts) en débutant une équipe FTC: expérience éducative, formation de futurs professionnels des STIM, augmentation du potentiel de l'économie technologique de la région, etc. Vous ne pensez peut-être pas que c'est important, mais de nombreux décideurs prennent ces facteurs en compte lorsqu'ils décident d'approuver votre équipe de FTC !
ru_ru: Все 3 варианта презентации должны иметь схожую структуру; самый простой и эффективный способ — подготовить презентацию в виде слайд-шоу. Обязательно выделите ценностное предложение (конкретные преимущества) от создания команды FTC: образовательный опыт, подготовка будущих специалистов в области STEM, развитие технологического потенциала региона и т.д. Вам это может казаться несущественным, но многие принимающие решения лица учитывают именно эти факторы при одобрении вашей заявки!
zh_cn: 所有3个推广都应该遵循类似的结构；最简单和最有效的方式包括使用幻灯片演示。一定要突出通过开始一个FTC团队所能带来的价值主张（将要提供的好处）：教育经验、培养未来的STEM专业人才、提高该地区技术经济的潜力等。你可能不觉得这很重要，但许多决策者在决定是否批准你的FTC团队时会考虑这些因素！

source: Don't underpitch your budget needs!
es_mx: ¡No subestimes tus necesidades de presupuesto!
fr_ca: Ne sous-estimez pas vos besoins budgétaires !
ru_ru: Не занижайте свои финансовые потребности при составлении бюджета!
zh_cn: 不要低估你的预算需求！

source: Here's a breakdown of a typical FTC season budget:
es_mx: Aquí hay un desglose de un presupuesto típico de una temporada de FTC.
fr_ca: Voici la répartition d'un budget type pour une saison de FTC :
ru_ru: Вот структура типичного бюджета на сезон FTC:
zh_cn: 以下是一个典型的FTC赛季预算的细分：

source: *FIRST* Registration is $295, and allows you to obtain your team number and compete.
es_mx: *FIRST* El registro es de $295 dólares y te permite obtener tu número de equipo y competir.
fr_ca: *FIRST* inscription est 295 $ et vous permet d'obtenir votre numéro d'équipe et de participer à la compétition.
ru_ru: Регистрационный взнос *FIRST* составляет 295$ и позволяет получить номер команды и право участвовать в соревнованиях.
zh_cn: *FIRST* 的注册费用是295美元，可以让你获得你的团队编号和参赛资格。

source: Region and competition costs vary depending on your region, ranging from $250 to $800 or more. Check with your region's Program Delivery Partner for more information.
es_mx: La región y los costos de competencia varían dependiendo de tu región, oscilando entre $250 dólares y $800 dólares o más. Consulta con el Program Delivery Partner (Socio Distribuidor del Programa) de tu región para obtener más información.
fr_ca: Les coûts liés à la région et au concours varient en fonction de votre région, allant de 250 $ à 800 $ ou plus. Pour plus d'informations, veuillez vous adresser au partenaire de votre région chargé de la mise en œuvre du programme.
ru_ru: Стоимость участия в региональных и отборочных соревнованиях варьируется в зависимости от региона и составляет от 250$ до 800$ или более. Для уточнения информации обратитесь к Партнёру по Реализации Программ (Program Delivery Partner) вашего региона.
zh_cn: 地区和比赛费用因您所在的地区而异，从250美元到800美元或更多不等。有关详细信息，请与你所在地区的PDP联系以获取更多信息。

source: A full competition game set will run you $450 / season.
es_mx: Un juego completo de competencia te costará $450 dólares / temporada.
fr_ca: Un jeu de compétition complet vous coûtera 450 $ / saison.
ru_ru: Полный комплект игровых элементов обойдется вам в $450 за сезон.
zh_cn: 一个完整的比赛套装将花费你450美元/赛季。

source: A competition field will also run you $659, and - unless you take care with the tiles that make it up - it will cost you additional money to replace every 2-3 years.
es_mx: Un campo de competencia también te costará $659 dólares, y - a menos que tengas cuidado con las baldosas que lo componen - te costará dinero adicional reemplazarlas cada 2-3 años.
fr_ca: Un terrain de compétition vous coûtera également 659 $, et - à moins que vous ne preniez soin des tuiles qui le composent - il vous en coûtera davantage pour le remplacer tous les 2-3 ans.
ja_jp: 競技や練習に使用する競技フィールドは659ドルで、それを構成するタイルの手入れを行わないと、2、3年ごとにタイル等を交換するための追加費用がかかります。
ru_ru: Стоимость игрового поля для соревнований составляет 659$, и — если не проявлять аккуратность с плитками, из которых оно состоит — каждые 2-3 года потребуются дополнительные расходы на замену самого поля.
zh_cn: 一个比赛场地也将花费你659美元，而且除非你小心照顾组成它的地垫，否则每2-3年就需要花额外的钱来更换。

source: The *FIRST* Control and Communication set will cost you $265, and their Electronics set will cost $282. Buying an additional Expansion Hub to maximize your robot's actuation will cost another $250. If you're careful, these are one-time purchases.
es_mx: El conjunto de Control y Comunicación de *FIRST* te costará $265 dólares, y su conjunto de Electrónica costará $282 dólares. Comprar un Hub de Expansión adicional para maximizar la actuación de tu robot costará otros $250 dólares. Si tienes cuidado, estas son compras únicas.
fr_ca: L'ensemble *FIRST* de contrôle et de communication vous coûtera 265 $, et l'ensemble électronique 282 $. L'achat d'un Hub d'expansion supplémentaire pour maximiser l'actionnement de votre robot vous coûtera 250 $ de plus. Si vous faites attention, il s'agit d'achats uniques.
ru_ru: Набор *FIRST* Control and Communication обойдётся в 265$, а комплект электроники — в 282$. Покупка дополнительного Expansion Hub для максимального увеличения функциональности робота будет стоить ещё 250$. При аккуратном использовании эти приобретения становятся разовыми.
zh_cn: *FIRST* 的控制和通信套装将花费你265美元，他们的电子套装将花费282美元。购买一个额外的扩展中心来最大化你的机器人的动作将花费另外250美元。如果你小心使用，这些都是一次性购买。

source: The goBILDA FTC Starter Kit, which is recommended to start you with basic hardware, will run you $600 (with the FTC discount). If you CAD design your robot in advance, you can go cheaper.
es_mx: El Kit de Inicio de goBILDA FTC, que se recomienda para comenzar con el hardware básico, te costará $600 dólares (con el descuento de FTC). Si diseñas tu robot en CAD de antemano, puedes ahorrar dinero.
fr_ca: Le kit de démarrage goBILDA FTC, qui est recommandé pour commencer avec le matériel de base, vous coûtera 600 $ (avec la réduction FTC). Si vous concevez votre robot en CAD à l'avance, vous pouvez faire moins cher.
ja_jp: 最初に始めるのにおすすめなgoBILDA FTCスターターキットは、600ドル（FTC割引あり）で購入できます。事前にCADでロボットの設計を行ってから必要なパーツを購入することで、費用を抑えることができます。
ru_ru: Стартовый комплект goBILDA для FTC, рекомендованный для начала работы с базовыми компонентами, обойдётся в 600$ (с учётом скидки FTC). Если вы предварительно создадите 3D-модель робота, можно сократить расходы.
zh_cn: goBILDA FTC入门套件，建议你用基本的硬件开始，将花费你600美元（享受FTC折扣）。如果你提前用CAD设计你的机器人，你可以更便宜。

source: Extra money for sensors and servos - each can run you up to $100 each! Assuming 2 servos and 3 sensors, that's $500.
es_mx: Dinero extra para sensores y servos - ¡cada uno puede costarte hasta $100 dólares cada uno! Suponiendo 2 servos y 3 sensores, eso es $500 dólares.
fr_ca: Il faut prévoir de l'argent supplémentaire pour les capteurs et les servos - qui peuvent coûter jusqu'à 100 $ chacun ! En supposant 2 servos et 3 capteurs, cela fait 500 $.
ru_ru: Дополнительные расходы на датчики и сервоприводы — каждый из них может обойтись в 100$! При условии покупки 2 сервоприводов и 3 датчиков получается 500$.
zh_cn: 额外的钱用于传感器和伺服器 - 每个都可以花费你高达100美元！假设2个伺服器和3个传感器，那就是500美元。

source: The above budget adds up to $4,000 in startup costs, and roughly $2,500 per year. You can definitely start a team on a budget much cheaper than this, but if you have the opportunity to pitch a larger budget, seize it!
es_mx: El presupuesto anterior suma $4,000 dólares en costos de inicio y aproximadamente $2,500 dólares por año. Definitivamente puedes comenzar un equipo con un presupuesto mucho más barato que este, pero si tienes la oportunidad de presentar un presupuesto más grande, ¡aprovéchala!
fr_ca: Le budget ci-dessus s'élève à 4 000 $ pour les frais de démarrage et à environ 2 500 $ par an. Il est tout à fait possible de créer une équipe avec un budget bien inférieur, mais si vous avez l'occasion de présenter un budget plus important, saisissez-la !
ja_jp: 上記の予算は、立ち上げ費用として4,000ドル、 継続する場合は、1年あたりおよそ2,500ドルになります。これよりずっと安い予算でチームを立ち上げることも可能ですが、もっと多くの予算を投じることができるチャンスがあるのであれば、予算を多く投じた方がより良い活動ができます。
ru_ru: Указанные выше расходы складываются в сумму около 4000$ на стартовые затраты и примерно 2500$ в год. Безусловно, можно создать команду и с более скромным бюджетом, но если у вас есть возможность запросить больше средств — обязательно воспользуйтесь этим!
zh_cn: 以上预算加起来是4000美元的初始成本，并且之后每年大约2500美元。你当然可以用比这更便宜的预算开始一个团队，但如果你有机会投入更多的预算，就抓住它！

source: If you are unable to achieve this amount of funding, you can make this budget more manageable through several methods:
es_mx: Si no puedes lograr esta cantidad de financiamiento, puedes hacer que este presupuesto sea más manejable a través de varios métodos:
fr_ca: Si vous n'êtes pas en mesure d'atteindre ce montant, vous pouvez rendre ce budget plus gérable grâce à plusieurs méthodes :
ja_jp: もし、この金額が達成できない場合、いくつかの方法で必要な予算を削減することができます。
ru_ru: Если вам не удалось получить финансирование в таком объёме, вы можете сократить бюджет несколькими способами:
zh_cn: 如果您无法获得这笔资金，您可以通过以下几种方法使预算更易于管理：

source: **Fundraising and sponsorship** are essential ways to ensure a team's survival. See the fundraising guide (coming soon) for more.
es_mx: **La recaudación de fondos y los patrocinios** son formas esenciales para garantizar la supervivencia de un equipo. Consulta la guía de recaudación de fondos (próximamente) para obtener más información.
fr_ca: **La collecte de fonds et le parrainage** sont des moyens essentiels pour assurer la survie d'une équipe. Pour en savoir plus, consultez le guide de la collecte de fonds (à venir).
ru_ru: **Фандрайзинг и поиск спонсоров** — ключевые условия для успешного существования команды. Подробнее см. в руководстве по привлечению средств (скоро будет опубликовано).
zh_cn: **筹款和赞助** 是确保团队生存的重要方式。更多信息，请参阅筹款指南（即将推出）。

source: Several general **cost-saving measures** can be employed throughout the season. These include:
es_mx: Varias medidas generales de **ahorro de costos** se pueden emplear durante toda la temporada. Estas incluyen:
fr_ca: Plusieurs **mesures générales d'économie** peuvent être appliquées tout au long de la saison. Il s'agit notamment de:
ja_jp: シーズン中、いくつかの一般的な**コスト削減策**を採用することができます。これらは以下の通りです。
ru_ru: На протяжении сезона можно применять различные общие **меры по экономии средств**. Например:
zh_cn: 几个一般的 **节约成本措施** 可以在整个赛季中使用。其中包括：

source: Keeping stock of your inventory and not over-ordering parts.
es_mx: Mantener un registro de tu inventario y no pedir en exceso piezas.
fr_ca: Garder l'inventaire de votre stock et ne pas commander trop de pièces.
ru_ru: Всегда следить за состоянием и количеством комплектующих, не допускать избыточных заказов компонентов.
zh_cn: 保持库存，并避免过度订购零件。

source: Treating your parts well.
es_mx: Tratando bien tus partes.
fr_ca: Bien traiter ses pièces.
ru_ru: Бережно относиться ко всем деталям.
zh_cn: 妥善对待你的零件。

source: Using #black-market on the FTC Discord to obtain used parts.
es_mx: Usando #black-market en el FTC Discord para obtener piezas usadas.
fr_ca: Utilisation de #black-market sur le Discord de FTC pour obtenir des pièces d'occasion.
ru_ru: Использовать канал #black_market в Discord-сервере FTC для получения б/у деталей.
zh_cn: 在FTC Discord上的 #black-market 获取二手零件。

source: Applying for seasonal FTC grants and the goBILDA FTC Discount.
es_mx: Solicitando becas de FTC de temporada y el descuento de FTC goBILDA.
fr_ca: Demande de subventions saisonnières de FTC et de la réduction goBILDA FTC.
ru_ru: Подать заявку на сезонные FTC-гранты и скидку от FTC на набор goBILDA.
zh_cn: 申请季节性的FTC补助金和goBILDA FTC折扣。

source: Investing in a 3D printer to fabricate your own parts.
es_mx: Invertir en una impresora 3D para fabricar tus propias piezas.
fr_ca: Investir dans une imprimante 3D pour fabriquer ses propres pièces.
ru_ru: Вложиться в покупку 3D-принтера для дальнейшего изготовления собственных деталей.
zh_cn: 投资一台3D打印机来制造自己的零件。

source: If using custom metal parts, utilizing SendCutSend or Fabworks, which are generally more financially viable than in-house CNC machining.
es_mx: Si se utilizan piezas de metal personalizadas, es más rentable utilizar SendCutSend o Fabworks que el mecanizado CNC interno.
fr_ca: En cas d'utilisation de pièces métalliques personnalisées, utiliser SendCutSend ou Fabworks, qui sont généralement plus viables financièrement que l'usinage CNC en interne.
ru_ru: При заказе изготовки металлических деталей можно воспользоваться услугами SendCutSend или Fabworks, которые, как правило, выгоднее с финансовой точки зрения, чем собственная обработка на станках с ЧПУ.
zh_cn: 如果使用定制金属零件，请使用SendCutsend或Fabworks，这些通常比自己用CNC加工更划算

source: As a last resort, **team fees** can be collected from members as a requirement to participate. These can bar less fortunate individuals from participating, so they are not recommended. **Minimum fundraising requirements** for your members can boost your budget similarly and without hardship for these members.
es_mx: Como último recurso, se pueden recolectar **cuotas de equipo** de los miembros como requisito para participar. Estas pueden excluir a personas menos afortunadas de participar, por lo que no se recomiendan. **Requisitos mínimos de recaudación de fondos** para tus miembros pueden aumentar tu presupuesto de manera similar y sin dificultades para estos miembros.
fr_ca: En dernier recours, des **cotisations d'équipe** peuvent être perçues auprès des membres comme condition de participation. Ces frais peuvent empêcher des personnes moins fortunées de participer et ne sont donc pas recommandés. Les **exigences minimales de collecte de fonds** pour vos membres peuvent augmenter votre budget de manière similaire et sans que ces membres ne subissent de difficultés.
ru_ru: В крайнем случае, можно взимать **взносы за участие** как обязательное условие участия в команде. Проблема заключается в том, что они могут лишить возможности участия некоторых людей, поэтому их не рекомендуется вводить. Установление обязательного **минимума средств, которые должен привлечь каждый участник**, может аналогично пополнить бюджет, не создавая финансовой нагрузки для членов команды.
zh_cn: 最后的手段是向成员收取 **团队费用** 作为参与的要求。这可能会阻止一些不幸的人参与，所以不推荐。对你的成员设定 **最低筹款要求** 可以类似地提高你的预算，而不会给这些成员带来困难。

source: Now what?
es_mx: ¿Ahora qué?
fr_ca: Et maintenant ?
ru_ru: А что теперь?
zh_cn: 现在怎么办？

source: You have your team, you have mentors, and you have a budget. Now it's time to be a team!
es_mx: Tienes tu equipo, tienes mentores y tienes un presupuesto. ¡Ahora es tiempo de ser un equipo!
fr_ca: Vous avez votre équipe, vous avez des mentors et vous avez un budget. Il est maintenant temps de former une équipe !
ru_ru: У нас есть участники, у нас есть наставники, у нас есть бюджет. Время становиться командой!
zh_cn: 你已经拥有了队伍、导师和预算。接下来就要成为一个团队了！

source: So you want to start an FTC team - here’s how! Here’s a few tips on how to get up and running. This article covers recruiting members and mentors, structuring your team, and pitching your budget.
ja_jp: FTCチームを立ち上げたいと考えていますか？ その方法はここに記載されています！ここでは、立ち上げのためのヒントをいくつか紹介します。また、メンバーやメンターの募集、チームの構成、予算の設定について説明します。
