Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/team-organization.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: When new members join your team, some of them will probably not know how to build and program a robot, or may have experiences with different techniques and software. Document a specific onboarding program for your new members - what logins will you have to give them? What software will they need to learn? What are some design techniques they will have to learn? Assign dedicated members to teach younger members about these techniques and to share their knowledge.
fr_ca: Lorsque de nouveaux membres rejoignent votre équipe, certains d'entre eux ne savent probablement pas comment construire et programmer un robot, ou peuvent avoir des expériences avec des techniques et des logiciels différents. Documentez un programme d'intégration spécifique pour vos nouveaux membres - quels identifiants devrez-vous leur donner ? Quels logiciels devront-ils apprendre ? Quelles sont les techniques de conception qu'ils devront apprendre ? Désignez des membres dévoués pour enseigner ces techniques aux plus jeunes et pour partager leurs connaissances.
zh_cn: 当新成员加入您的团队时，他们中的一些人可能不知道如何制作和编程机器人，或者可能有使用不同技术和软件的经验。为新成员制定一个具体的入职计划--你需要给他们提供哪些登录名？他们需要学习哪些软件？他们需要学习哪些设计技术？指派专职成员向年轻成员传授这些技术并分享他们的知识。
