Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/being-a-team/team-organization.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: Team Organization
es_mx: Organización del Equipo
fr_ca: Organisation de l'équipe
ru_ru: Организация команды
zh_cn: 团队组织

source: A group of individuals is nothing without structure and organization. Learning the individual strengths of each of your teammates to create robots together will turn you into a force fit to conquer even the toughest game challenges. This article covers team organization and collaboration, knowledge sharing, gracious professionalism, and fostering a safe team environment.
es_mx: Un grupo de individuos no es nada sin estructura y organización. Aprender las fortalezas individuales de cada uno de tus compañeros de equipo para crear robots juntos los convertirá en una fuerza apta para conquistar incluso los retos de juego más difíciles. Este artículo trata de la organización y colaboración en equipo, el intercambio de conocimientos, la profesionalidad con gracia (gracious professionalism) y el fomento de un entorno de equipo seguro.
fr_ca: Un groupe d'individus n'est rien sans structure ni organisation. En apprenant à exploiter les forces individuelles de chacun de vos coéquipiers pour créer des robots ensemble, vous deviendrez une force capable de relever les défis les plus difficiles. Cet article traite de l'organisation de l'équipe et de la collaboration, du partage des connaissances, du professionnalisme gracieux et de la création d'un environnement d'équipe sûr.
ru_ru: Группа людей - ничто без структуры и организации. Изучение индивидуальных сильных сторон каждого из участников команды для совместного создания роботов превратит вас в силу, способную победить даже самые сложные игровые задачи. В этой статье речь пойдет об организации и сотрудничестве в команде, обмене знаниями, благородном профессионализме и создании безопасной командной среды.
zh_cn: 一群个体如果没有结构和组织，就一无是处。了解你的每个队友的个人优势，共同创造机器人，将使你成为一个能够征服最艰难的比赛挑战的力量。本文涵盖了团队组织和协作、知识分享、高尚的专业精神和培养安全的团队环境等方面。

source: Team Structure
es_mx: Estructura del Equipo
fr_ca: Structure de l'équipe
ru_ru: Структура команды
zh_cn: 团队结构

source: The first step to organizing a team is determining who does what. Generally, FTC\ |reg| teams are organized into design, assembly / mechanical, software, and outreach squads, with different sub-squads for different tasks - for example, an outreach squad could have a sub-squad working on industry connections. In addition, your team will probably form cross-squad teams, such as your drive team and scouting team.
es_mx: El primer paso para organizar un equipo es determinar quién hace qué. Generalmente, los equipos de FTC se organizan en equipos de diseño, ensamblaje/mecánica, software y divulgación, con diferentes subequipos para diferentes tareas, por ejemplo, un subequipo de divulgación podría trabajar en conexiones con la industria. Además, es probable que tu equipo forme equipos interdisciplinarios, como el equipo de conducción y el equipo de exploración (scouting).
fr_ca: La première étape de l'organisation d'une équipe consiste à déterminer qui fait quoi. En général, les équipes FTC sont organisées en équipes de conception, d'assemblage/mécanique, de logiciels et de sensibilisation, avec différentes sous-équipes pour différentes tâches - par exemple, une équipe de sensibilisation peut avoir une sous-équipe qui travaille sur les relations avec l'industrie. En outre, votre équipe formera probablement des équipes transversales, telles que l'équipe de conduite et l'équipe de reconnaissance.
zh_cn: 组织一个团队的第一步是确定谁负责什么。一般来说，FTC\ |reg| 团队分为设计、装配/机械、软件和外联四个小组，每个小组根据不同的任务再分为不同的子小组——例如，外联小组可以有一个负责与行业联系的子小组。此外，你的团队可能还会形成跨小组的团队，比如操作团队和侦察团队。

source: To effectively manage these squads, you will need to set a carefully chosen leadership structure - leads should possess good delegation skills and be willing to facilitate learning experiences for those assigned to their squad. Optionally, a captain can be chosen as well to oversee squad leads.
es_mx: Para gestionar eficazmente estos escuadrones, tendrás que establecer una estructura de liderazgo cuidadosamente elegida: los líderes deben poseer buenas habilidades de delegación y estar dispuestos a facilitar experiencias de aprendizaje para los asignados a su escuadrón. Opcionalmente, también se puede elegir un capitán que supervise a los líderes de escuadrón.
fr_ca: Pour gérer efficacement ces sous-équipe, vous devrez mettre en place une structure de commandement soigneusement choisie - les chefs doivent posséder de bonnes capacités de délégation et être prêts à faciliter les expériences d'apprentissage pour ceux qui sont affectés à leur escouade. En option, un capitaine peut également être choisi pour superviser les chefs d'escouade.
ru_ru: Для более эффективного процесса и отслеживания работы в этих группах необходимо тщательно продумать систему управления командой - лидеры должны обладать хорошими навыками делегирования полномочий и быть готовыми содействовать обучению тех, кто входит в их группу и/или можно выбрать капитана, который будет контролировать работу всех групп.
zh_cn: 为了有效地管理这些小组，你需要设定一个精心选择的领导结构——领导者应该具备良好的委派能力，并愿意为他们所负责的小组成员提供学习经验。你也可以选择一个队长来监督各个小组的领导者。

source: Each individual member should decide which squad they would like to participate in, as people work better on tasks they care about! In addition, each member should be involved with outreach in some form, to get them involved in the community and teach them the importance of service. In addition, this will improve your judged presentations.
es_mx: Cada miembro debe decidir en qué escuadrón le gustaría participar, ya que la gente trabaja mejor en tareas que le interesan. Además, cada miembro debería participar de alguna forma en actividades de divulgación/impacto, para que se impliquen en la comunidad y aprendan la importancia del servicio. Además, esto mejorará sus presentaciones con jueces.
fr_ca: Chaque membre doit décider de l'équipe à laquelle il souhaite participer, car les gens travaillent mieux sur des tâches qui leur tiennent à cœur ! En outre, chaque membre devrait participer à des activités de sensibilisation sous une forme ou une autre, afin de l'impliquer dans la communauté et de lui enseigner l'importance du service. En outre, cela améliorera vos présentations jugées.
ru_ru: Каждый участник команды должен высказать, кем именно он хочет быть в команде, так как любое дело выходит намного лучше, когда оно тебе интересно! Кроме того, все должны быть вовлечены в развитие социальной жизни команды в той или иной форме, чтобы приобщиться к работе в нашем обществе, также это улучшит качество выступлений вашей команды на собеседовании.
zh_cn: 每个团队成员都应该根据自己的兴趣选择参与哪个小组，因为人们在自己关心的任务上工作效果更好！此外，每个成员都应该以某种形式参与外联工作，让他们融入社区并了解服务的重要性。另外，这也会提高你们的评审表现。

source: Finally, your team will need to decide when it meets. Week to week, this will largely depend on the amount of work that needs to get done, but it is recommended to schedule 1-2 mandatory meetings a week to facilitate collaboration.
es_mx: Por último, su equipo tendrá que decidir cuándo se reúne. Semana a semana, esto dependerá en gran medida de la cantidad de trabajo que haya que hacer, pero se recomienda programar 1-2 reuniones obligatorias a la semana para facilitar la colaboración.
fr_ca: Enfin, votre équipe devra décider quand elle se réunira. D'une semaine à l'autre, cela dépendra en grande partie de la quantité de travail à accomplir, mais il est recommandé de prévoir 1-2 réunions obligatoires par semaine pour faciliter l'avancement de l'équipe.
zh_cn: 最后，你的团队需要决定什么时候开会。每周的安排主要取决于需要完成的工作量，但建议每周安排1-2次必须参加的会议，以促进协作。

source: Obtaining Knowledge
es_mx: Obtener Conocimientos
fr_ca: Obtenir des connaissances
ru_ru: Получение знаний
zh_cn: 获取知识

source: Teams should strive to increase their knowledge of FTC design, software, and outreach both before and during the season. The more you know and experience, the easier it will be to tackle engineering challenges you encounter.
es_mx: Los equipos deben esforzarse por aumentar sus conocimientos sobre el diseño, el software y la divulgación de FTC, tanto antes como durante la temporada. Cuanto más sepan y experimenten, más fácil les resultará afrontar los retos de ingeniería que se les presenten.
fr_ca: Les équipes doivent s'efforcer d'accroître leurs connaissances en matière de conception, de logiciel et de vulgarisation de la FTC avant et pendant la saison. Plus vous en saurez et plus vous aurez d'expérience, plus il vous sera facile de relever les défis techniques que vous rencontrerez.
zh_cn: 团队应该在赛季前后努力提高自己在FTC设计、软件和外联方面的知识。你了解和经历的越多，你就越容易应对你遇到的工程挑战。

source: Practice over the summer.
es_mx: Práctica durante el verano.
fr_ca: S'entraîner pendant l'été.
ru_ru: Работа в летнее время
zh_cn: 暑期练习

source: Summer projects are a great way to explore robot concepts and start outreach. For instance, your team could research different lift designs and create a decision matrix of strengths and weaknesses. More often than not, the designs you research will make it onto your competition robot in the upcoming season - and regardless, the mechanical techniques you learn will be helpful. Reaching out to STEM businesses before the season will help you gain insights that could be helpful for the upcoming year, and planning and implementing outreach initiatives in your community will give you a headstart for the season.
es_mx: Los proyectos de verano son una forma estupenda de explorar conceptos robóticos e iniciar actividades de divulgación. Por ejemplo, tu equipo podría investigar diferentes diseños de ascensores y crear una matriz de decisión de puntos fuertes y débiles. En la mayoría de los casos, los diseños que investigues se incorporarán a tu robot de competición en la próxima temporada y, en cualquier caso, las técnicas mecánicas que aprendas te serán útiles. Ponerse en contacto con las empresas STEM antes de la temporada te ayudará a obtener información que podría ser útil para el próximo año, y la planificación y ejecución de iniciativas de divulgación/impacto en tu comunidad te dará una ventaja para la temporada.
fr_ca: Les projets d'été sont un excellent moyen d'explorer les concepts de robots et de commencer à les faire connaître. Par exemple, votre équipe pourrait étudier différents modèles d'élévateurs et créer une matrice de décision des forces et des faiblesses. Plus souvent qu'autrement, les conceptions que vous étudiez seront intégrées à votre robot de compétition au cours de la saison à venir - et quoi qu'il en soit, les techniques mécaniques que vous apprendrez vous seront utiles. Tendre la main aux entreprises des STIM avant la saison vous aidera à acquérir des connaissances qui pourraient être utiles pour l'année à venir, et la planification et la mise en œuvre d'initiatives de sensibilisation dans votre communauté vous donneront une longueur d'avance pour la saison.
ru_ru: Летние проекты - это отличная возможность изучить новые механизмы или библиотеки для улучшения программной части робота и начать распространять свои идеи в сообществе. Например, ваша команда может изучить различные конструкции подъемных механизмов и сравнить сильные и слабые стороны каждой из них. Чаще всего изученные конструкции будут использоваться в предстоящем сезоне на соревнованиях, и в любом случае полученные знания по механике будут полезны. Обращение к STEM-компаниям до начала сезона поможет вам получить информацию, которая может пригодиться в следующем году, а планирование и реализация инициатив по распространению ваших идей и направлений даст вам преимущество перед началом сезона.
zh_cn: 暑期项目是探索机器人概念和开始外联的好方法。例如，你的团队可以研究不同的举升设计，并创建一个优缺点的决策矩阵。很多时候，你研究的设计会出现在你下个赛季的竞赛机器人上——而且无论如何，你学到的机械技巧都会有帮助。在赛季开始前与STEM企业联系，将帮助你获得对未来一年有用的见解，而且在你的社区中规划和实施外联活动，将让你在赛季开始时领先一步。

source: Create and utilize resources.
es_mx: Crea y utiliza recursos.
fr_ca: Créer et utiliser des ressources.
ru_ru: Создание и использование новых источников информации.
zh_cn: 创建和利用资源。

source: To start the learning process, |gm0| may be useful! Have your team peruse the resources here, and use that as a starting point for your own knowledge base. Make sure to check out the :doc:`/docs/useful-resources` section, where other resources are cataloged. Additionally, compiling your own resources will allow your team to explore different techniques and materials, and provide useful documentation for future team members. You could create a library of FTC legal sensors and goBILDA kits. Make sure to include all your members in these processes.
es_mx: Para comenzar el proceso de aprendizaje, ¡|gm0| puede ser útil! Haz que tu equipo examine los recursos aquí y utilízalos como punto de partida para tu propia base de conocimientos. Asegúrate de revisar la sección :doc:`/docs/useful-resources`, donde se catalogan otros recursos. Además, compilar tus propios recursos permitirá a tu equipo explorar diferentes técnicas y materiales, y proporcionar documentación útil para futuros miembros del equipo. Podrías crear una biblioteca de sensores legales de FTC y kits goBILDA. Asegúrate de incluir a todos tus miembros en estos procesos.
fr_ca: Pour commencer le processus d'apprentissage, |gm0| peut être utile ! Demandez à votre équipe de parcourir les ressources ici, et utilisez-les comme point de départ pour votre propre base de connaissances. N'oubliez pas de consulter la section :doc:`/docs/useful-resources`, où d'autres ressources sont répertoriées. En outre, la compilation de vos propres ressources permettra à votre équipe d'explorer différentes techniques et matériaux, et fournira une documentation utile aux futurs membres de l'équipe. Vous pourriez créer une bibliothèque de capteurs juridiques de la FTC et de kits goBILDA. Veillez à inclure tous vos membres dans ces processus.
zh_cn: 要开始学习过程， |gm0| 可能会有用！让你的团队浏览这里的资源，并以此作为你自己知识库的起点。一定要查看 :doc:`/docs/useful-resources` 部分，那里有其他资源的目录。此外，编制自己的资源将使你的团队能够探索不同的技术和材料，并为未来的团队成员提供有用的文档。你可以创建一个FTC合法传感器和goBILDA套件的库。确保让你所有的成员参与这些过程。

source: Cross-train your members.
es_mx: Entrenen a sus miembros.
fr_ca: Entraînez vos membres d'une façon a ce qu'ils soient à l'aise à faire plus qu'une tâche.
zh_cn: 对成员进行交叉培训。

source: This is the most important knowledge-related pointer, in my opinion. Having all your members learn at least one skill outside of their expertise will go a long way towards increasing collaboration and efficiency. Programmers who CAD will be able to design and integrate their own sensor cases, reducing design team workload. Designers who know outreach will be able to write their parts and speak to their designs more effectively in judging. Outreach people who know the mechanical and software processes on their robot are more effective.
es_mx: En mi opinión, este es el punto más importante relacionado con el conocimiento. Hacer que todos sus miembros aprendan al menos una habilidad ajena a su especialidad contribuirá en gran medida a aumentar la colaboración y la eficacia. Los programadores que sepan CAD podrán diseñar e integrar sus propias cajas de sensores, lo que reducirá la carga de trabajo del equipo de diseño. Los diseñadores que sepan divulgación podrán escribir sus partes y hablar de sus diseños con más eficacia con los jueces. Los divulgadores que conozcan los procesos mecánicos y de software de su robot serán más eficaces.
fr_ca: Il s'agit, à mon avis, de l'indicateur le plus important en matière de connaissances. Le fait que tous les membres de l'équipe apprennent au moins une compétence en dehors de leur domaine d'expertise contribuera grandement à améliorer la collaboration et l'efficacité. Les programmeurs qui connaissent la CAO seront en mesure de concevoir et d'intégrer leurs propres boîtiers de capteurs, ce qui réduira la charge de travail de l'équipe de conception. Les concepteurs qui connaissent la vulgarisation seront en mesure d'écrire leurs pièces et de parler de leurs conceptions de manière plus efficace lors du jugement. Les personnes chargées de la sensibilisation qui connaissent les processus mécaniques et logiciels de leur robot sont plus efficaces.
ru_ru: По нашему мнению, это самый важный пункт в мануале, связанный с получением новых знаний. Если все члены вашей команды освоят хотя бы один навык, выходящий за рамки их основной деятельности, это значительно повысит эффективность вашей командной работы. Программисты, владеющие САПР, смогут разрабатывать и интегрировать свои собственные корпуса датчиков, что снизит нагрузку на группу инженеров. Инженеры, имеющие какие-либо навыки в медиасфере, смогут эффективнее писать про свои детали и рассказывать о своих разработках на собеседовании. Ребята из медиа-команды, знающие основы механики и программирования, работают над портфолио команды намного эффективнее.
zh_cn: 在我看来，这是最重要的与知识相关的指导。让你所有的成员至少学习一项超出他们专长范围的技能，将大大提高团队的协作和效率。会CAD的程序员将能够设计和集成他们自己的传感器外壳，减少设计团队的工作量。懂得外联的设计师将能够更有效地撰写他们的部分并在评委面试中展示他们的设计。了解他们机器人上的机械和软件流程的外联人员更有效率。

source: Create a training program for your recruits.
es_mx: Creen un programa de formación para sus reclutas.
fr_ca: Créez un programme de formation pour vos recrues.
ru_ru: Создайте программу обучения для новичков.
zh_cn: 为你的新成员创建一个培训计划

source: When new members join your team, some of them will probably not know how to build and program a robot, or may have experiences with different techniques and softwares. Document a specific onboarding program for your new members - what logins will you have to give them? What softwares will they need to learn? What are some design techniques they will have to learn? Assign dedicated members to teach younger members about these techniques and to share their knowledge.
es_mx: Cuando se incorporen nuevos miembros a su equipo, es probable que algunos de ellos no sepan cómo construir y programar un robot, o tengan experiencia con diferentes técnicas y programas informáticos. Documenten un programa de incorporación específico para sus nuevos miembros: ¿qué datos de acceso tendrá que darles? ¿Qué programas tendrán que aprender? ¿Qué técnicas de diseño tendrán que aprender? Asigna a miembros dedicados a enseñar estas técnicas a los más jóvenes y a compartir sus conocimientos.

source: Gracious Professionalism
es_mx: Profesionalismo con Gracia/ Gracious Professionalism
fr_ca: Le professionnalisme coopératif
zh_cn: 高尚的专业精神

source: Teams should be gracious and professional both at practice and events - stress to your members that each of them is a representative of your team. Encourage them to actively assist other teams both at events and online. Finally, keep an eye on your team and ensure everyone is getting along well and being respectful.
es_mx: Los equipos deben ser amables y profesionales tanto en los entrenamientos como en los eventos: insista a sus miembros en que cada uno de ellos es un representante de su equipo. Anímalos a que ayuden activamente a otros equipos tanto en los eventos como en Internet. Por último, vigilen a su equipo y asegúrense de que todos se lleven bien y que sean respetuosos.
fr_ca: Les équipes doivent faire preuve de courtoisie et de professionnalisme, que ce soit à l'entraînement ou lors des événements - insistez auprès de vos membres sur le fait que chacun d'entre eux représente votre équipe. Encouragez-les à aider activement les autres équipes lors des événements et en ligne. Enfin, gardez un œil sur votre équipe et assurez-vous que tout le monde s'entend bien et se respecte.
ru_ru: Команды должны вести себя благородно и профессионально как на тренировках, так и на мероприятиях - подчеркните своим участникам, что каждый из них является представителем вашей команды. Поощряйте их активно помогать другим командам как на соревнованиях, так и в интернете. Наконец, следите за своей командой и убедитесь, что все хорошо ладят друг с другом и уважают друг друга.
zh_cn: 团队在练习和比赛中都应该保持高尚和专业的态度——对你的成员强调他们每个人都是你的团队的代表。鼓励他们在比赛现场和在线上积极地帮助其他团队。最后，关注你的团队，确保每个人都相处融洽，彼此尊重。

source: Fostering a Safe Environment
es_mx: Fomentar un Entorno Seguro
fr_ca: Favoriser un environnement sûr
ru_ru: Создание комфортной среды для совместной работы
zh_cn: 培养安全的环境

source: Your team should strive to be as inclusive as possible. Ensure other members are not making homophobic, sexist, racist and/or transphobic jokes, and educate them on why they should refrain from doing so. Be actively mindful to not create a "boys club" culture where women are objectified and sidelined, and make sure every member feels comfortable in their position. Everyone should feel comfortable in your team environment.
es_mx: Su equipo debe esforzarse por ser lo más integrador posible. Asegúrate de que otros miembros no hagan bromas homofóbicas, sexistas, racistas o transfobicas, y enséñales por qué deben abstenerse de hacerlo. Ten cuidado de no crear una cultura de "club de hombres" en la que las mujeres sean tratadas como objetos y marginadas, y asegúrate de que todos los miembros se sientan cómodos en su puesto. Todos deben sentirse cómodos en el entorno de tu equipo.
fr_ca: Votre équipe doit s'efforcer d'être aussi inclusive que possible. Veillez à ce que les autres membres ne fassent pas de blagues homophobes, sexistes, racistes et/ou transphobes, et expliquez-leur pourquoi ils doivent s'en abstenir. Veillez activement à ne pas créer une culture de "boys club" où les femmes sont objectivées et mises à l'écart, et assurez-vous que chaque membre se sente à l'aise dans son poste. Chacun doit se sentir à l'aise dans votre équipe.
ru_ru: Ваша команда должна стремиться быть максимально всесторонней. Нужно следить за тем, чтобы другие члены команды не отпускали гомофобных, сексистских, расистских и/или трансфобных шуток, и объяснять им, почему следует воздерживаться от них. Активно следите за тем, чтобы не создавать "мальчишеский клуб", в котором девушки объективируются и отодвигаются на второй план, и следите за тем, чтобы каждому было приятно находиться на своем месте. Каждый должен чувствовать себя комфортно в коллективе.
zh_cn: 你的团队应该尽可能地包容多样性。确保其他成员不要开同性恋、性别歧视、种族歧视和/或跨性别恐惧的玩笑，并教育他们为什么应该避免这样做。积极地注意不要形成一个“男孩俱乐部”的文化，其中女性被物化和边缘化，并确保每个成员在自己的位置上感到舒适。每个人都应该在你的团队环境中感到舒适。

source: Team Identity
es_mx: Identidad del Equipo
fr_ca: Identité de l'équipe
ru_ru: Особенности вашей команды
zh_cn: 团队形象

source: Create a logo design for your team, and a corresponding style guide on fonts and colors to keep consistency when creating marketing materials. This will make it easier for you to design posters, flyers, t-shirts, stickers, and even branded plates for your robot!
es_mx: Crea un logotipo para tu equipo, y una guía de estilo correspondiente sobre fuentes y colores para mantener la coherencia al crear materiales de marketing. Esto te facilitará el diseño de carteles, folletos, camisetas, pegatinas e incluso placas con la marca de tu robot.
fr_ca: Créez un logo pour votre équipe et un guide de style correspondant sur les polices et les couleurs afin d'assurer une cohérence lors de la création de matériel de marketing. Il vous sera ainsi plus facile de concevoir des affiches, des dépliants, des t-shirts, des autocollants et même des plaques de marque pour votre robot !
ru_ru: Придумайте логотип и выберите основные цвета, вашей команды и выберите ваш стиль для документации. Также мы советуем всем командам обзавестись своим мерчем: делайте свои футболки, наклейки, магниты - все что захотите!
zh_cn: 为你的团队创建一个logo，并制定一个相应的字体和颜色的风格指南，以保持在创建营销材料时的一致性。这将使你更容易设计海报、传单、T恤、贴纸，甚至是你的机器人的品牌板！
