Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/connectors-and-wires.po
Languages: es_mx, fr_ca, zh_cn

source: Connectors and Wires
es_mx: Conectores y Cables
fr_ca: Connecteurs et câbles
zh_cn: 连接器和导线

source: There are many types of connectors for use in FTC\ |reg|. Here are the most common connectors you will find on an FTC robot.
es_mx: Hay muchos tipos de conectores para usar en FTC\ |reg|. Aquí están los conectores más comunes que encontrarás en un robot FTC.
fr_ca: Il existe de nombreux types de connecteurs à utiliser dans les robots FTC. Voici les connecteurs les plus courants que vous trouverez sur un robot FTC.
zh_cn: 有许多类型的连接器可用于FTC。以下是FTC机器人上最常见的连接器。

source: Anderson PowerPole
zh_cn: 安德森动力杆

source: Anderson PowerPole is a connector used by AndyMark on their :term:`NeveRest motors <NeveRest Motor>`. PowerPole connectors are extremely reliable, and are an excellent choice for high-usage connectors, such as batteries. There are adapters available to/from other systems. PowerPole connectors are crimped onto wires.
es_mx: Anderson PowerPole es un conector utilizado por AndyMark en sus motores :term:`NeveRest <NeveRest Motor>`. Los conectores PowerPole son extremadamente fiables, y son una excelente opción para conectores de alto uso, como las baterías. Hay adaptadores disponibles para/desde otros sistemas. Los conectores PowerPole se engarzan en los cables.
fr_ca: Anderson PowerPole est un connecteur utilisé par AndyMark sur ses :term:`NeveRest motors <NeveRest Motor>`. Les connecteurs PowerPole sont extrêmement fiables et constituent un excellent choix pour les connecteurs à usage intensif, tels que les batteries. Il existe des adaptateurs pour d'autres systèmes. Les connecteurs PowerPole sont sertis sur les fils.
zh_cn: 安德森动力杆是 AndyMark 在其 :term:`NeveRest motors<NeveRest Motor>` 上使用的连接器。PowerPole 连接器非常可靠，是电池等高用量连接器的最佳选择。可提供与其他系统的适配器。PowerPole 连接器压接在导线上。

source: While OEM Anderson brand PowerPole connectors are extremely reliable, off-brand PowerPole connectors, commonly available on sites like Amazon, often have major reliability issues. When purchasing PowerPole connectors, only purchase ones specifically listed as Anderson brand.
es_mx: Mientras que los conectores PowerPole de la marca Anderson OEM son extremadamente fiables, los conectores PowerPole de otras marcas, que suelen estar disponibles en sitios como Amazon, a menudo tienen importantes problemas de fiabilidad. Al comprar conectores PowerPole, sólo compre los que aparecen específicamente como marca Anderson.
fr_ca: Alors que les connecteurs PowerPole de marque Anderson sont extrêmement fiables, les connecteurs PowerPole d'une autre marque, couramment disponibles sur des sites tels qu'Amazon, présentent souvent des problèmes de fiabilité importants. Lorsque vous achetez des connecteurs PowerPole, n'achetez que ceux qui sont spécifiquement répertoriés comme étant de marque Anderson.
zh_cn: 虽然原装的安德森品牌 PowerPole 连接器非常可靠，但亚马逊等网站上常见的非品牌 PowerPole 连接器往往存在严重的可靠性问题。在购买 PowerPole 连接器时，只能购买特别标明为安德森品牌的连接器。

source: Additionally, it is important to use crimpers specifically designed for PowerPole connectors. The `IWISS iCrimp AP-11 <https://www.amazon.com/dp/B01MSQPTDS>`_ crimpers are a solid choice at a reasonable price point on Amazon, though any quality crimpers specifically designed for PowerPole should work fine.
es_mx: Además, es importante utilizar crimpadoras diseñadas específicamente para conectores PowerPole. Las crimpadoras `IWISS iCrimp AP-11 <https://www.amazon.com/dp/B01MSQPTDS>`_ son una opción sólida a un precio razonable en Amazon, aunque cualquier crimpadora de calidad diseñada específicamente para PowerPole debería funcionar bien.
fr_ca: De plus, il est important d'utiliser des pinces à sertir spécialement conçues pour les connecteurs PowerPole. Les pinces `IWISS iCrimp AP-11 <https://www.amazon.com/dp/B01MSQPTDS>`_ sont un choix solide à un prix raisonnable sur Amazon, mais toutes les pinces de qualité spécialement conçues pour les PowerPole devraient faire l'affaire.
zh_cn: 此外，使用专门为 PowerPole 连接器设计的连接器也很重要。在亚马逊上， `IWISS iCrimp AP-11 <https://www.amazon.com/dp/B01MSQPTDS>`_压连接器是一个价格合理的可靠选择，不过任何专门为 PowerPole 设计的高质量连接器都可以正常工作。

source: A PowerPole connector
es_mx: Un conector PowerPole
fr_ca: Un connecteur PowerPole
zh_cn: 一个 PowerPole 连接器

source: 3.5mm Bullet
es_mx: Bala de 3,5 mm
fr_ca: Bullet 3,5 mm
zh_cn: 3.5 毫米子弹头

source: A power connector used on the goBILDA Yellow Jacket motors. Bullet connectors are soldered onto wires.
es_mx: Conector de alimentación utilizado en los motores goBILDA Yellow Jacket. Los conectores de bala se sueldan a los cables.
fr_ca: Connecteur d'alimentation utilisé sur les moteurs goBILDA Yellow Jacket. Les connecteurs Bullet sont soudés sur les fils.
zh_cn: goBILDA Yellow Jacket 电机上使用的电源连接器。子弹头连接器焊接在导线上。

source: Due to the relatively strong holding force and the small size, it is common for teams to unplug these connectors by pulling on the wires instead of pulling on the connectors. This will cause fatigue and eventually failure. If you find yourself often operating these connectors, it is recommended to replace them with a connector that can be easily unplugged without damaging the connector, such as the :term:`JST VH` or :term:`Anderson PowerPole` connectors.
es_mx: Debido a la fuerza de sujeción relativamente fuerte y al pequeño tamaño, es habitual que los equipos desenchufen estos conectores tirando de los cables en lugar de tirar de los conectores. Esto provocará fatiga y, finalmente, fallos. Si utiliza a menudo estos conectores, se recomienda sustituirlos por un conector que pueda desenchufarse fácilmente sin dañarlo, como los conectores :term:`JST VH` o :term:`Anderson PowerPole`.
fr_ca: En raison de la force de maintien relativement importante et de la petite taille, il est fréquent que les équipes débranchent ces connecteurs en tirant sur les fils au lieu de tirer sur les connecteurs. Cela entraîne une fatigue et, à terme, une défaillance. Si vous utilisez souvent ces connecteurs, il est recommandé de les remplacer par des connecteurs qui peuvent être facilement débranchés sans les endommager, tels que les connecteurs :term:`JST VH` ou :term:`Anderson PowerPole`.
zh_cn: 由于这些连接器的夹持力相对较强，而且体积较小，因此团队通常会通过拉电线而不是拉连接器来拔下这些连接器。这会造成金属疲劳，最终导致故障。如果您发现自己经常操作这些连接器，建议更换为可轻松拔出而不会损坏连接器的连接器，如 :term:`JST VH` 或 :term:`Anderson PowerPole` 连接器。

source: A 3.5mm Bullet connector
es_mx: Un conector de Bala de 3,5 mm
fr_ca: Un connecteur Bullet de 3,5 mm
zh_cn: 一个 3.5 毫米子弹头连接器

source: Dupont 0.1" (TJC8)
zh_cn: 杜邦 0.1 英寸 ( TJC8 )

source: A small pinheader connector commonly used on servos and occasionally on some sensors. Dupont connectors are crimped onto wires.
es_mx: Pequeño conector de cabeza de alfiler utilizado habitualmente en servos y, ocasionalmente, en algunos sensores. Los conectores Dupont se engarzan en los cables.
fr_ca: Un petit connecteur à tête d'épingle couramment utilisé sur les servos et occasionnellement sur certains capteurs. Les connecteurs Dupont sont sertis sur les fils.
zh_cn: 一种小型针头连接器，通常用于伺服系统，偶尔也用于某些传感器。杜邦连接器压接在导线上。

source: Some vendors sell versions of the 3-pin female connector that are locking, which significantly improve the reliability of using servo extension wires. BackBayRC on Amazon sells `servo extension wires with locking connectors <https://www.amazon.com/BackBayRC-Extension-Strands-Vehicles-bikes/dp/B0CXR2YBS4/>`_; and Ferra Components sells both `pre-made servo extension wires with locking connectors <https://ferracomponents.com/products/20awg-locking-servo-wire>`_, and `packs of locking connectors you can crimp yourself <https://ferracomponents.com/products/servo-locking-connector>`_.
es_mx: Algunos proveedores venden versiones del conector hembra de 3 pines que son de bloqueo, lo que mejora significativamente la fiabilidad de la utilización de cables de extensión servo. BackBayRC en Amazon vende `cables de extensión de servo con conectores de bloqueo <https://www.amazon.com/BackBayRC-Extension-Strands-Vehicles-bikes/dp/B0CXR2YBS4/>`_; y Ferra Components vende tanto `cables de extensión de servo prefabricados con conectores de bloqueo <https://ferracomponents.com/products/20awg-locking-servo-wire>`_, como `paquetes de conectores de bloqueo que puedes crimpar tú mismo <https://ferracomponents.com/products/servo-locking-connector>`_.
fr_ca: Certains vendent des versions du connecteur femelle à 3 broches qui sont verrouillables, ce qui améliore considérablement la fiabilité de l'utilisation des fils d'extension de servo. BackBayRC sur Amazon vend des "fils d'extension servo avec connecteurs verrouillables <https://www.amazon.com/BackBayRC-Extension-Strands-Vehicles-bikes/dp/B0CXR2YBS4/>" ; et Ferra Components vend à la fois des "fils d'extension servo pré-fabriqués avec connecteurs verrouillables <https://ferracomponents.com/products/20awg-locking-servo-wire>", et des "paquets de connecteurs verrouillables que vous pouvez sertir vous-même <https://ferracomponents.com/products/servo-locking-connector>".
zh_cn: 有些供应商出售带锁的 3 针母连接器，这大大提高了使用伺服延长线的可靠性。亚马逊上的 BackBayRC 出售 "带锁定连接器的伺服延长线 <https://www.amazon.com/BackBayRC-Extension-Strands-Vehicles-bikes/dp/B0CXR2YBS4/>`_; 和Ferra Components 出售 "预制的带锁定连接器的伺服延长线<https://ferracomponents.com/products/20awg-locking-servo-wire>`_，以及 "成包的锁定连接器，您可以自己压接<https://ferracomponents.com/products/servo-locking-connector>`_。

source: Locking female 3-pin Dupont connectors
es_mx: Conectores Dupont hembra de 3 pines con bloqueo
fr_ca: Connecteurs femelles verrouillables à 3 broches Dupont
zh_cn: 杜邦锁定式 3 针母连接器

source: A servo extension wire with 3-pin Dupont connectors
es_mx: Un cable de extensión servo con conectores Dupont de 3 pines
fr_ca: Un câble d'extension de servo avec des connecteurs Dupont à 3 broches
zh_cn: 带 3 针杜邦连接器的伺服延长线

source: The XT30 connector is commonly used by batteries (such as the goBILDA Nested Battery and the REV Slim Battery), the robot power switch, the REV Control Hub and Expansion Hub, the :term:`REV Grounding Strap <Grounding Strap>`, and others. XT30 connectors are soldered onto wires.
es_mx: El conector XT30 es comúnmente utilizado por las baterías (como la batería goBILDA Nested Battery y la batería REV Slim Battery), el interruptor de alimentación del robot, el REV Control Hub y el Expansion Hub, la correa de puesta a tierra :term:`REV <Grounding Strap>`, y otros. Los conectores XT30 se sueldan a los cables.
fr_ca: Le connecteur XT30 est couramment utilisé par les batteries (telles que la batterie imbriquée goBILDA et la batterie mince REV), l'interrupteur d'alimentation du robot, le concentrateur de commande et le concentrateur d'extension REV, la :term:``Sangle de mise à la terre REV <Grounding Strap>`, et d'autres. Les connecteurs XT30 sont soudés sur les fils.
zh_cn: XT30 连接器通常用于电池（如 goBILDA 嵌套电池和 REV 超薄电池）、机器人电源开关、 Control Hub 和 Expansion Hub 、:term:`REV 接地带<Grounding Strap>`等。XT30 连接器焊接在导线上。

source: The pins in the XT30 connectors on the Control Hub and Expansion Hub often compress over time, causing loose power connectivity. See `XT30 Pins are Compressed - Expansion Hub Troubleshooting <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_ for details on the issue and how to fix it.
es_mx: Las pines de los conectores XT30 del Control Hub y Expansion Hub suelen comprimirse con el tiempo, lo que provoca una pérdida de conectividad eléctrica. Consulte `XT30 Pins are Compressed - Expansion Hub Troubleshooting <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_ para obtener más información sobre el problema y cómo solucionarlo.
fr_ca: Les broches des connecteurs XT30 du Control Hub et de l'Expansion Hub se compriment souvent avec le temps, ce qui entraîne une perte de connectivité électrique. Voir ``Les broches XT30 sont comprimées - Dépannage du Concentrateur d'Expansion <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_ pour plus de détails sur le problème et la façon de le résoudre.
zh_cn: Control Hub 和 Expansion Hub 上 XT30 连接器的针脚经常会随着时间的推移而压缩，导致电源连接松动。请参阅 "XT30 引脚被 Compressed - Expansion Hub 故障排除 <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/expansion-hub-troubleshooting#xt30-pins-are-compressed>`_了解有关问题的详情和修复方法。

source: A XT30 connector
es_mx: Un conector XT30
fr_ca: Un connecteur XT30
zh_cn: 一个XT30连接器

source: JST VH is a type of connector used by FTC motors to interface with the REV Control Hub and Expansion Hub. It is keyed and locks into place for excellent reliability. JST VH connectors are crimped onto wires.
es_mx: JST VH es un tipo de conector utilizado por los motores FTC para interactuar con el REV Control Hub y el Expansion Hub. Es clave y se bloquea en su lugar para una excelente fiabilidad. Los conectores JST VH se engarzan en los cables.
fr_ca: JST VH est un type de connecteur utilisé par les moteurs FTC pour l'interface avec le REV Control Hub et le Expansion Hub. Il est claveté et se verrouille en place pour une excellente fiabilité. Les connecteurs JST VH sont sertis sur les fils.
zh_cn: JST VH 是 FTC 电机用于连接 REV Control Hub和 Expansion Hub 的一种连接器。它带有键控，可锁定到位，具有极佳的可靠性。JST VH 连接器压接在导线上。

source: A JST VH connector
es_mx: Un conector JST VH
fr_ca: Un connecteur JST VH
zh_cn: 一个 JST VH 连接器

source: JST PH is a type of connector used by the REV Control/Expansion Hubs and various electronics, such as sensors. On the REV Control/Expansion Hubs, the 4-pin connector is used for encoder, I2C, analog, and digital connections. The 3-pin connector is used for the RS-485 connection between the Control Hub and Expansion Hub. JST PH connectors are crimped onto wires.
es_mx: JST PH es un tipo de conector utilizado por los REV Control/Expansion Hubs y varios componentes electrónicos, como sensores. En los REV Control/Expansion Hubs, el conector de 4 pines se utiliza para conexiones de encoder, I2C, analógicas y digitales. El conector de 3 pines se utiliza para la conexión RS-485 entre el Control Hub y el Expansion Hub. Los conectores JST PH se engarzan en los cables.
fr_ca: Le JST PH est un type de connecteur utilisé par le Control/Expansion Hubs REV et divers appareils électroniques, tels que les capteurs. Sur les control/expansion Hubs REV, le connecteur à 4 broches est utilisé pour les connexions d'encodeur, I2C, analogiques et numériques. Le connecteur à 3 broches est utilisé pour la connexion RS-485 entre le concentrateur de contrôle et le concentrateur d'expansion. Les connecteurs JST PH sont sertis sur les fils.
zh_cn: JST PH 是一种连接器，用于 REV Control/Expansion Hubs 和各种电子设备，如传感器。在 REV Control/Expansion Hubs 上，4 针连接器用于编码器、I2C、模拟和数字连接。3 针连接器用于控制 hub 和扩展 hub 之间的 RS-485 连接。JST PH 连接器压接在导线上。

source: JST PH and JST XH connectors
es_mx: Conectores JST PH y JST XH
fr_ca: Connecteurs JST PH et JST XH
zh_cn: JST PH 和 JST XH 连接器

source: JST XH connectors are used for the encoder connections on goBILDA (MATRIX) and AndyMark NeveRest motors. Both vendors sell adapters from JST XH to the :term:`JST PH` encoder ports on the REV Control/Expansion Hubs. These connectors are also occasionally found on some third party sensors. JST XH connectors are crimped onto wires.
es_mx: Los conectores JST XH se utilizan para las conexiones de codificador en los motores goBILDA (MATRIX) y AndyMark NeveRest. Ambos vendedores venden adaptadores de JST XH a los puertos de codificador :term:`JST PH` en los REV Control/Expansion Hubs. Estos conectores también se encuentran ocasionalmente en algunos sensores de terceros. Los conectores JST XH se engarzan en los cables.
fr_ca: Les connecteurs JST XH sont utilisés pour les connexions des encodeurs sur les moteurs goBILDA (MATRIX) et AndyMark NeveRest. Les deux fournisseurs vendent des adaptateurs de JST XH aux ports d'encodeur :term:`JST PH` sur les concentrateurs de contrôle/expansion REV. Ces connecteurs sont également présents sur certains capteurs tiers. Les connecteurs JST XH sont sertis sur les fils.
zh_cn: JST XH 连接器用于 goBILDA (MATRIX) 和 AndyMark NeveRest 电机的编码器连接。这两家供应商都出售从 JST XH 到 REV Control/Expansion Hubs 上的 :term:`JST PH` 编码器端口的适配器。这些连接器偶尔也会出现在一些第三方传感器上。JST XH 连接器压接在导线上。

source: Tamiya
zh_cn: Tamiya连接器

source: Used on some batteries, such as the Modern Robotics battery that was sold by goBILDA prior to goBILDA's own battery design being allowed by the competition manual.
es_mx: Se utiliza en algunas baterías, como la batería Modern Robotics que vendía goBILDA antes de que el manual de competición permitiera el diseño de baterías propias de goBILDA.
fr_ca: Utilisé sur certaines batteries, comme la batterie Modern Robotics qui a été vendue par goBILDA avant que la conception de la batterie de goBILDA ne soit autorisée par le manuel de la compétition.
zh_cn: 用于某些电池，例如在比赛手册允许 goBILDA 自行设计电池之前，goBILDA 出售的 Modern Robotics 电池。

source: Do not use these connectors! The metal connectors are fragile and will lead to random disconnects. It is highly recommended to replace any of thse connectors with a reliable type of connector, such as the :term:`Anderson PowerPole` connectors.
es_mx: No utilice estos conectores. Los conectores metálicos son frágiles y provocan desconexiones aleatorias. Se recomienda encarecidamente sustituir cualquiera de estos conectores por un tipo de conector fiable, como los conectores :term:`Anderson PowerPole`.
fr_ca: N'utilisez pas ces connecteurs ! Les connecteurs métalliques sont fragiles et provoquent des déconnexions aléatoires. Il est fortement recommandé de remplacer ces connecteurs par des connecteurs plus fiables, tels que les connecteurs :term:`Anderson PowerPole`.
zh_cn: 请勿使用这些连接器！金属连接器很脆弱，会导致随机断开。强烈建议使用可靠的连接器，如 :term:`Anderson PowerPole` 连接器替换这些连接器。

source: A Tamiya connector
es_mx: Un conector Tamiya
fr_ca: Un connecteur Tamiya
zh_cn: 一个Tamiya连接器
