Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/control-system.po
Languages: es_mx, fr_ca, zh_cn

source: Control Systems
es_mx: Sistemas de Control
fr_ca: Systèmes de contrôle
zh_cn: 控制系统

source: The FTC\ |reg| control system is based around a ":term:`Robot Controller`" and a ":term:`Driver Station`". The :term:`Robot Controller` is mounted on the robot. It is either embedded within or connected to special "Hub(s)", which in turn connect to motors, servos, and sensors. The :term:`Robot Controller` is linked to the :term:`Driver Station` through WiFi or WiFi Direct.
es_mx: El sistema de control de la FTC\ |reg| se basa en un ":term:`Controlador de Robot`" y una ":term:`Estación del Conductor`". El :term:`Controlador de Robot` está montado en el robot. Está integrado dentro o conectado a "Hub(s)" especiales, que a su vez se conectan a motores, servos y sensores. El :term:`Controlador de Robot` está vinculado a la :term:`Estación del Conductor` a través de WiFi o WiFi Direct.
fr_ca: Le système de contrôle FTC est basé sur un ":term:`Contrôleur de robot`" et une ":term:`Station de pilotage`". Le :term:`Contrôleur de robot` est monté sur le robot. Il est soit intégré, soit connecté à des "Hub(s)" spéciaux, qui à leur tour se connectent aux moteurs, aux servos et aux capteurs. Le :term:`Robot Controller` est relié à la :term:`Station de pilotage` par WiFi ou WiFi Direct.
zh_cn: FTC\ |reg| 控制系统由 ":term:`Robot Controller`" 和 ":term:`Driver Station`" 组成。 :term:`Robot Controller` 安装在机器人上。它嵌入或连接到特殊的“集线器”，而“集线器”又连接到电机、舵机和传感器。 :term:`Robot Controller` 通过 WiFi 或 WiFi Direct 与 :term:`Driver Station` 相连。

source: REV Robotics is the sole manufacturer of legal FTC control system components. The REV Expansion Hub connects to motors, servos, sensors, and a :term:`Robot Controller`. A REV Control Hub has the same functionality of an Expansion Hub but with a built-in :term:`Robot Controller`.
es_mx: REV Robotics es el único fabricante de componentes legales del sistema de control FTC. El REV Expansion Hub se conecta a motores, servos, sensores y a un :term:`Controlador de Robot`. Un REV Control Hub tiene la misma funcionalidad que un Expansion Hub pero con un :term:`Controlador de Robot` integrado.
fr_ca: REV Robotics est le seul fabricant des composants légaux du système de contrôle FTC. Le REV Expansion Hub se connecte aux moteurs, servos, capteurs et à un :term:`Robot Controller`. Un REV Control Hub possède les mêmes fonctionnalités qu'un Expansion Hub, mais avec un :term:`Robot Controller` intégré.
zh_cn: REV Robotics 是合法 FTC 控制系统组件的唯一制造商。REV Expansion Hub 可连接电机、舵机、传感器和一个 :term:`Robot Controller` 。REV Control Hub具有与Expansion Hub相同的功能，但内置一个 :term:`Robot Controller`。

source: More information about the FTC Control System can be found below:
es_mx: A continuación encontrará más información sobre el Sistema de Control FTC:
fr_ca: De plus amples informations sur le système de contrôle de FTC sont disponibles ci-dessous :
zh_cn: 有关 FTC 控制系统的更多信息，请参见下文：

source: `Official Control System Documentation on FTC Docs <https://ftc-docs.firstinspires.org/en/latest/programming_resources/shared/control_system_intro/The-FTC-Control-System.html>`_
es_mx: `Documentación oficial del sistema de control en FTC Docs <https://ftc-docs.firstinspires.org/en/latest/programming_resources/shared/control_system_intro/The-FTC-Control-System.html>`_
fr_ca: `Documentation officielle du système de contrôle sur FTC Docs <https://ftc-docs.firstinspires.org/en/latest/programming_resources/shared/control_system_intro/The-FTC-Control-System.html>`_
zh_cn: `FTC 官方提供的控制系统文档 <https://ftc-docs.firstinspires.org/en/latest/programming_resources/shared/control_system_intro/The-FTC-Control-System.html>`_

source: `REV Control System Documentation <https://docs.revrobotics.com/duo-control/>`_
es_mx: `Documentación del Sistema de Control REV <https://docs.revrobotics.com/duo-control/>`_
fr_ca: `REV Documentation du système de contrôle <https://docs.revrobotics.com/duo-control/>`_
zh_cn: `REV 控制系统文件 <https://docs.revrobotics.com/duo-control/>`_

source: `Official troubleshooting guide <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-system-troubleshooting-guide.pdf>`_
es_mx: Guía oficial de solución de problemas <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-system-troubleshooting-guide.pdf>
fr_ca: `Guide officiel de dépannage <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-system-troubleshooting-guide.pdf>`_
zh_cn: `官方故障排除指南 <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/control-system-troubleshooting-guide.pdf>`_

source: There are two possible control systems that can be run on an FTC robot legally:
es_mx: Hay dos posibles sistemas de control que se pueden utilizar legalmente en un robot FTC.
fr_ca: Deux systèmes de commande peuvent être utilisés sur un robot FTC en toute légalité :
zh_cn: 有两种可能的控制系统可以在 FTC 机器人上合法运行：

source: :term:`RC Phone <Robot Controller>` + REV Expansion Hub(s)
es_mx: :term:`RC Teléfono <Robot Controller>` + REV Expansion Hub(s)
zh_cn: :term:`RC Phone <Robot Controller>` + REV Expansion Hub

source: Beginning in the 2024-2025 season, an :term:`RC Phone <Robot Controller>` will no longer be legal to use as a Robot Controller. Teams will be required to use a REV Control Hub as their :term:`Robot Controller`.
es_mx: A partir de la temporada 2024-2025, un :term:`RC Teléfono <Robot Controller>` ya no será legal para usar como Controlador de Robot. Los equipos deberán usar un REV Control Hub como su :term:`Controlador de Robot`.
zh_cn: 从 2024-2025 赛季开始， :term:`RC Phone <Robot Controller>`将不再合法用作机器人控制器。参赛队必须使用 REV Control Hub 作为 :term:`Robot Controller`。

source: It is of vital importance to update the firmware on REV Expansion hubs to at least version 1.8.2. It includes better protection against disconnects and improves program performance. See the `REV Expansion Hub firmware update docs`_.
es_mx: Es de vital importancia actualizar el firmware en los REV Expansion Hubs a al menos la versión 1.8.2. Incluye una mejor protección contra desconexiones y mejora el rendimiento del programa. Consulta la documentación de actualización del firmware del `REV Expansion Hub`_.
fr_ca: Il est essentiel de mettre à jour le micrologiciel des Expansion Hub de REV avec au moins la version 1.8.2. Cette version offre une meilleure protection contre les déconnexions et améliore les performances du programme. Voir la `documentation sur la mise à jour du micrologiciel du REV Expansion Hub`_.
zh_cn: 将 REV Expansion Hub的固件更新到至少 1.8.2 版本至关重要。它包括更好的断开连接保护，并提高了程序性能。请参阅 `REV Expansion Hub firmware update docs`_。

source: This is the standard control system for teams starting out in FTC.
es_mx: Este es el sistema de control estándar para equipos que comienzan en FTC.
fr_ca: Il s'agit du système de contrôle standard pour les équipes qui débutent en FTC.
zh_cn: 这是 FTC 初创团队的标准控制系统。

source: The Control Hub connects to the Expansion Hub through either a RS-485 connection, or a USB-A (Control Hub side) to mini-USB (Expansion Hub-side) connection. In either case, proper strain relief and cable management should be used.
es_mx: El Control Hub se conecta al Expansion Hub a través de una conexión RS-485 o una conexión USB-A (lado del Control Hub) a mini-USB (lado del Expansion Hub). En ambos casos, se debe utilizar un alivio de tensión y una gestión de cables adecuado.
fr_ca: Le Control Hub se connecte au Expansion Hub soit par une connexion RS-485, soit par une connexion USB-A (côté Control Hub) vers mini-USB (côté Expansion Hub). Dans les deux cas, une décharge de traction et une gestion des câbles appropriées doivent être utilisées.
zh_cn: Control Hub 通过 RS-485 连接或 USB-A（控制集线器端）转mini-USB 线 与Expansion Hub相连。无论哪种情况，都应使用适当的应力消除和电缆管理。

source: For more information on setting up the Control Hub and configuring the robot, head to `REV Robotics' Technical Resources Control Hub Guide <https://docs.revrobotics.com/duo-control/control-hub-gs>`_.
es_mx: Para obtener más información sobre cómo configurar el Control Hub y configurar el robot, dirígete a la Guía del Control Hub de los Recursos Técnicos de REV Robotics <https://docs.revrobotics.com/duo-control/control-hub-gs>.
fr_ca: Pour plus d'informations sur l'installation du Control Hub et la configuration du robot, rendez-vous sur `REV Robotics' Technical Resources Control Hub Guide <https://docs.revrobotics.com/duo-control/control-hub-gs>`_.
zh_cn: 有关设置Control Hub和配置机器人的更多信息，请访问 `REV Robotics' Technical Resources Control Hub Guide <https://docs.revrobotics.com/duo-control/control-hub-gs>`_。

source: A diagram of the Control Hub + Expansion Hub control system
es_mx: Un diagrama del sistema de control del Control Hub + Expansion Hub.
fr_ca: Schéma du système de contrôle Control Hub + Expansion Hub
zh_cn: Control Hub + Expansion Hub控制系统示意图

source: RC Phone + REV Expansion Hub(s)
es_mx: RC Teléfono + REV Expansion Hub(s)
fr_ca: Téléphone RC + Expansion Hub(s) REV
zh_cn: RC Phone + REV Expansion Hub

source: The Expansion Hub connects to the :term:`Robot Controller` phone through its mini USB port. The REV Expansion Hub is reliable, as long as proper strain relief and wiring is carried out. This includes the :term:`USB Retention Mount`, as well as 3D printing :term:`XT30` stress relief mounts.
es_mx: El Expansion Hub se conecta al teléfono :term:`Controlador del robot` a través de su puerto mini USB. El REV Expansion Hub es confiable, siempre y cuando se realice un alivio adecuado de la tensión y el cableado. Esto incluye el :term:`USB Montaje de Retención`, así como los soportes de alivio de tensión :term:`XT30` de impresión 3D.
fr_ca: L'Expansion Hub se connecte au téléphone :term:`Robot Controller` par l'intermédiaire de son port mini USB. L'Expansion Hub est fiable, tant qu'une décharge de traction et un câblage adéquats sont effectués. Cela inclut le :term:`Montant de rétention USB`, ainsi que les supports de décharge de traction :term:`XT30` imprimés en 3D.
zh_cn: Expansion Hub通过 mini USB 端口连接到 :term:`Robot Controller` 手机。只要进行适当的应力消除和布线，REV Expansion Hub 是可靠的。这包括 :term:`USB 固定支架`，以及 3D 打印 :term:`XT30` 应力消除支架。

source: For more information on setting up the Expansion Hub and configuring the robot, head to `REV Robotics' Technical Resources Expansion Hub Guide <https://docs.revrobotics.com/duo-control/legacy/expansion-hub-gs>`_.
es_mx: Para obtener más información sobre cómo configurar el Expansion Hub y configurar el robot, dirígete a la Guía del Expansion Hub de los Recursos Técnicos de REV Robotics <https://docs.revrobotics.com/duo-control/legacy/expansion-hub-gs>.
fr_ca: Pour plus d'informations sur l'installation de l'Expansion Hub et la configuration du robot, rendez-vous sur le site `REV Robotics' Technical Resources Expansion Hub Guide <https://docs.revrobotics.com/duo-control/legacy/expansion-hub-gs>`_.
zh_cn: 有关设置扩展集线器和配置机器人的更多信息，请访问 `REV Robotics' Technical Resources Expansion Hub Guide <https://docs.revrobotics.com/duo-control/legacy/expansion-hub-gs>`_。

source: `USB Retention Mount <https://www.revrobotics.com/rev-41-1214/>`_
es_mx: USB Retention Mount/Montaje de retención USB <https://www.revrobotics.com/rev-41-1214/>
fr_ca: `Montant de rétention USB <https://www.revrobotics.com/rev-41-1214/>`_
zh_cn: `USB 固定安装 <https://www.revrobotics.com/rev-41-1214/>`_

source: `XT30 Stress Relief <https://www.thingiverse.com/thing:2887045>`_
es_mx: XT30 Alivio del Estrés <https://www.thingiverse.com/thing:2887045>
zh_cn: ``XT30 缓解压力 <https://www.thingiverse.com/thing:2887045>`_

source: A diagram of the RC Phone + Expansion Hub(s) control system
es_mx: Un diagrama del sistema de control del RC Teléfono + Expansion Hub(s)
fr_ca: Un schéma du téléphone RC + Le système de contrôle du Expansion Hub(s)
zh_cn: RC Phone + Expansion Hub控制系统示意图
