Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/driver-station-guide.po
Languages: es_mx, fr_ca, zh_cn

source: Driver Station Guide
es_mx: Guía del Driver Station
fr_ca: Guide de la station de pilotage
zh_cn: 操作站指南

source: The Driver Station (DS) is the way drivers interact with the robot. Through it, you configure settings, configure hardware, start and stop OpModes, use gamepads, and receive telemetry data from the robot. There are two main different choices for a Driver Station: the REV Robotics Driver Hub and an Android phone.
es_mx: La Driver Station (DS) es la forma en que los conductores interactúan con el robot. A través de ella, se configuran los ajustes, se configura el hardware, se inician y detienen los OpModes, se utilizan los gamepads y se reciben datos de telemetría del robot. Hay dos opciones principales diferentes para una Driver Station: el REV Robotics Driver Hub y un teléfono Android.
fr_ca: La station de pilotage (DS) est le moyen par lequel les pilotes interagissent avec le robot. Elle permet de configurer les paramètres et le matériel, de démarrer et d'arrêter les OpModes, d'utiliser les manettes de jeu et de recevoir des données télémétriques du robot. Il existe deux choix principaux pour la station de conduite : le REV Robotics Driver Hub et un téléphone Android.
zh_cn: 操作站（DS）是操作手与机器人互动的途径。通过它，您可以配置设置、配置硬件、启动和停止运行模式、使用游戏手柄以及接收机器人的遥测数据。操作站主要有两种不同的选择：REV Robotics Driver Hub 和安卓手机。

source: REV Driver Hub
fr_ca: Driver Hub REV

source: The REV Robotics Driver Hub is effectively an Android phone with built in USB ports. It is purpose built for FTC\ |reg|, and has several advantages over traditional Android phones.
es_mx: El REV Robotics Driver Hub es un teléfono Android con puertos USB integrados. Está diseñado específicamente para FTC\ |reg|, y tiene varias ventajas sobre los teléfonos Android tradicionales.
fr_ca: Le REV Robotics Driver Hub est en fait un téléphone Android avec des ports USB intégrés. Il est spécialement conçu pour FTC\ |reg|, et présente plusieurs avantages par rapport aux téléphones Android traditionnels.
zh_cn: REV Robotics Driver Hub 实际上是一款内置 USB 端口的安卓手机。它专为 FTC\ |reg| 而设计，与传统的安卓手机相比具有多项优势。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Full sized USB ports do not require flimsy On The Go (micro-USB connector to USB-A port) cables
es_mx: Los puertos USB de tamaño completo no requieren cables endebles On The Go (conector micro-USB a puerto USB-A)
fr_ca: Les ports USB de taille normale ne nécessitent pas de câbles "On The Go" (connecteur micro-USB vers port USB-A).
zh_cn: 全尺寸 USB 端口，故不需要脆弱的 On The Go（micro-USB 接口连接 USB-A 端口）电缆

source: Charges from USB-C including fast charging Power Delivery modes
es_mx: Carga desde USB-C, incluyendo los modos de carga rápida Power Delivery
fr_ca: Chargement à partir de l'USB-C, y compris les modes de charge rapide Power Delivery
zh_cn: 使用 USB-C 充电，包括快速充电 Power Delivery 模式

source: Larger screen than many Android phones
es_mx: Pantalla más grande que muchos teléfonos Android
fr_ca: Écran plus grand que celui de nombreux téléphones Android
zh_cn: 屏幕比许多安卓手机都大

source: Case is more robust then a standard Android phone
es_mx: La carcasa es más robusta que la de un teléfono Android estándar
fr_ca: Le boîtier est plus robuste qu'un téléphone Android standard
zh_cn: 外壳比普通安卓手机更坚固

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Price: A Driver Hub costs $250.00, whereas legal Android phones can be purchased secondhand for less
es_mx: Precio: Un Driver Hub cuesta 250,00 dólares, mientras que los teléfonos Android legales se pueden comprar de segunda mano por menos.
fr_ca: Le prix : Un Driver Hub coûte 250.00 $, alors que les téléphones Android légaux peuvent être achetés d'occasion pour moins cher.
zh_cn: 价格: 一个 Driver Hub 需要 250.00 美元，而合法的安卓手机只需更低的价格就能买到二手货。

source: Power Issues: Teams have reported random losses of power coming from an improperly sized battery.
es_mx: Problemas de alimentación: Los equipos han informado de pérdidas aleatorias de energía procedentes de una batería de tamaño inadecuado.
fr_ca: Problèmes d'alimentation : Des équipes ont signalé des pertes aléatoires d'énergie provenant d'une batterie de taille inappropriée.
zh_cn: 电源问题：有团队报告称，若电池尺寸不合适，会导致随机断电。

source: Battery Issues: Teams have reported high battery drain in sleep mode, leading to hubs dying faster then expected
es_mx: Problemas de batería: Los equipos han informado de un alto consumo de batería en el modo de suspensión, lo que lleva a los centros de morir más rápido de lo esperado
fr_ca: Problèmes de batterie : Des équipes ont signalé une forte consommation de la batterie en mode veille, entraînant la mort des concentrateurs plus rapidement que prévu.
zh_cn: 电池问题：有团队报告称，睡眠模式下电池电量消耗很大，导致hub比预期死机得更快

source: Wifi Issues: The wifi driver will occasionally crash when the device goes to sleep, requiring a device restart
es_mx: Problemas con el wifi: El controlador wifi se bloquea ocasionalmente cuando el dispositivo entra en reposo, lo que obliga a reiniciarlo.
fr_ca: Problèmes de wifi : Le pilote wifi se bloque occasionnellement lorsque l'appareil se met en veille, ce qui nécessite un redémarrage de l'appareil.
zh_cn: Wifi 问题：设备睡眠模式时，WIFI 驱动程序偶尔会崩溃，需要重启设备

source: If you purchase a Driver Hub and experience issues, refer to the `REV Driver Hub troubleshooting page <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/driver-hub-troubleshooting>`_. The unexpected power off fix may be done preemptively to prevent a shutdown during a match.
es_mx: Si adquiere un Driver Hub y tiene problemas, consulte la página de solución de problemas de `REV Driver Hub <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/driver-hub-troubleshooting>`_. La corrección del apagado inesperado puede realizarse de forma preventiva para evitar un apagado durante un partido.
fr_ca: Si vous achetez un Driver Hub et que vous rencontrez des problèmes, reportez-vous à la page de dépannage du Driver Hub <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/driver-hub-troubleshooting>`_. La correction de la mise hors tension inattendue peut être effectuée de manière préventive afin d'éviter un arrêt pendant un match.
zh_cn: 如果您购买了Driver Hub并遇到问题，请参阅 "REV Driver Hub排除 "页面 <https://docs.revrobotics.com/duo-control/troubleshooting-the-control-system/driver-hub-troubleshooting>`_。意外的断电修复可能是为防止在比赛期间关机而做的准备。

source: Android Phones
es_mx: Teléfonos Android
fr_ca: Téléphones Android
zh_cn: 安卓手机

source: As of 2023-2024, Android phones are still legal for competition use.
es_mx: A partir de 2023-2024, los teléfonos Android seguirán siendo legales para su uso en competición.
fr_ca: À partir de 2023-2024, les téléphones Android seront toujours autorisés pour la compétition.
zh_cn: 截至 2023-2024 年，安卓手机仍可合法用于比赛。

source: Android phones can be very cheap when purchased secondhand
es_mx: Los teléfonos Android pueden ser muy baratos si se compran de segunda mano
fr_ca: Les téléphones Android peuvent être très bon marché lorsqu'ils sont achetés d'occasion
zh_cn: 购买二手安卓手机非常便宜

source: Android phones generally are reliable out of the box
es_mx: Los teléfonos Android suelen ser fiables nada más sacarlos de la caja
fr_ca: Les téléphones Android sont généralement fiables dès leur sortie de l'emballage
zh_cn: 安卓手机一般开箱即可靠

source: The lack of a full size USB A port means that flimsy On The Go cables must be used
es_mx: La falta de un puerto USB A de tamaño completo obliga a utilizar cables On The Go endebles.
fr_ca: L'absence d'un port USB A de taille normale oblige à utiliser des câbles On The Go peu solides.
zh_cn: 没有全尺寸 USB A 端口意味着必须使用易损的OTG电线

source: The phones themselves should be protected with a case to prevent damage
es_mx: Los teléfonos deben protegerse con una funda para evitar daños.
fr_ca: Les téléphones eux-mêmes doivent être protégés par un étui pour éviter tout dommage.
zh_cn: 手机本身应该有保护壳，以防损坏

source: A 5 GHz phone is preferred over the standard 2.4 GHz phone to reduce ping issues. Have you ever noticed that your team's robot seems to lag at competitions only? This is because most school WiFi bands run on 2.4 GHz, which means that 2.4 GHz channels will be more crowded on competition day. This can lead to noticeably higher ping/lag which adversely affects driver and robot performance.
es_mx: Se prefiere un teléfono de 5 GHz al estándar de 2,4 GHz para reducir los problemas de ping. ¿Te has dado cuenta alguna vez de que el robot de tu equipo parece ir con retraso sólo en las competiciones? Esto se debe a que la mayoría de las bandas WiFi de las escuelas funcionan a 2,4 GHz, lo que significa que los canales de 2,4 GHz estarán más saturados el día de la competición. Esto puede provocar un ping/lag notablemente mayor, lo que afecta negativamente al rendimiento del conductor y del robot.
fr_ca: Il est préférable d'utiliser un téléphone à 5 GHz plutôt qu'un téléphone standard à 2,4 GHz afin de réduire les problèmes de ping. Avez-vous déjà remarqué que le robot de votre équipe semble être à la traîne uniquement lors des compétitions ? Cela est dû au fait que la plupart des bandes WiFi des écoles fonctionnent sur 2,4 GHz, ce qui signifie que les canaux 2,4 GHz seront plus encombrés le jour de la compétition. Cela peut conduire à un ping/lag sensiblement plus élevé qui affecte négativement les performances du pilote et du robot.
zh_cn: 最好使用支持 5GHz 频段传输数据的手机，而不是标准的2.4 GHz频段传输数据手机，以减少延迟过高的问题。您是否曾注意到，您团队的机器人似乎只在比赛时才会出现延迟现象？这是因为大多数学校的 WiFi 频段都是2.4GHz，这意味着比赛当天2.4GHz 频道会比较拥挤。这会导致明显的丢包或延迟现象，从而对操作员和机器人的性能产生不利影响。

source: USB and :term:`OTG <Micro USB On The Go (OTG) Cable>` connections can be a possible source of disconnects during a match. This is generally caused by poor quality cables/adapters between the driver station and the gamepads. **It generally is worth it to purchase higher quality cables and adapters as opposed to the cheapest options.**
es_mx: Las conexiones USB y :term:`OTG <Micro USB On The Go (OTG) Cable>` pueden ser una posible fuente de desconexiones durante un partido. Esto suele deberse a cables/adaptadores de mala calidad entre la estación de control y los gamepads. **Por lo general, merece la pena comprar cables y adaptadores de mayor calidad en lugar de las opciones más baratas.
fr_ca: Les connexions USB et :term:`OTG <Micro USB On The Go (OTG) Cable>` peuvent être une source possible de déconnexions pendant un match. Cela est généralement dû à des câbles/adaptateurs de mauvaise qualité entre la station de pilotage et les manettes de jeu. **Il vaut généralement la peine d'acheter des câbles et des adaptateurs de meilleure qualité plutôt que les options les moins chères.
zh_cn: USB 和 :term:`OTG <Micro USB On The Go (OTG) Cable>` 连接可能是比赛中断开连接的原因之一。这通常是由驱动站和游戏手柄之间的劣质电线/排插(转接器)造成的。**一般来说，队伍应该购买质量较高的电线和排插(转接器)，而不是最便宜的选择。

source: `Recommended USB to OTG Cable <https://www.amazon.com/gp/product/B00YOX4JU6?pf_rd_r=PY8B4WPEQRQ80XYJCMSH&pf_rd_p=edaba0ee-c2fe-4124-9f5d-b31d6b1bfbee/>`_
es_mx: `Cable USB a OTG recomendado <https://www.amazon.com/gp/product/B00YOX4JU6?pf_rd_r=PY8B4WPEQRQ80XYJCMSH&pf_rd_p=edaba0ee-c2fe-4124-9f5d-b31d6b1bfbee/>`_
fr_ca: `Câble USB à OTG recommandé <https://www.amazon.com/gp/product/B00YOX4JU6?pf_rd_r=PY8B4WPEQRQ80XYJCMSH&pf_rd_p=edaba0ee-c2fe-4124-9f5d-b31d6b1bfbee/>`_
zh_cn: 推荐的 USB 转 OTG 电线： <https://www.amazon.com/gp/product/B00YOX4JU6?pf_rd_r=PY8B4WPEQRQ80XYJCMSH&pf_rd_p=edaba0ee-c2fe-4124-9f5d-b31d6b1bfbee/>`_

source: Term
es_mx: Término
fr_ca: Définition
zh_cn: 术语

source: Micro USB On The Go (OTG) Cable
es_mx: Cable Micro USB On The Go (OTG)
fr_ca: Câble Micro USB On The Go (OTG)
zh_cn: micro-USB On The Go (OTG) 连接线

source: The Micro USB OTG cable connects the :term:`Driver Station` phone with the Logitech controller that the driver uses in order to control the robot.
es_mx: El cable Micro USB OTG conecta el teléfono :term:`Driver Station` con el controlador Logitech que el controlador utiliza para controlar el robot.
fr_ca: Le câble Micro USB OTG relie le téléphone :term:`Driver Station` au contrôleur Logitech que le pilote utilise pour contrôler le robot.
zh_cn: Micro USB OTG电线会将队伍的Driver Station或手机与驾驶员用于控制机器人的Logitech控制器所连接。

source: It is recommended that teams purchase a couple spares due to faulty OTG cable connections and their low price.
es_mx: Se recomienda que los equipos adquieran un par de repuestos debido a las conexiones defectuosas del cable OTG y a su bajo precio.
fr_ca: Il est recommandé aux équipes d'acheter quelques pièces de rechange en raison des connexions défectueuses du câble OTG et de leur faible prix.
zh_cn: 由于 OTG 电线较易出现连接故障及其低廉的价格，建议团队购买几条备用电线。

source: A USB OTG Cable
es_mx: Un cable USB OTG
fr_ca: Un câble USB OTG
zh_cn: 一条 USB OTG 电线

source: Controllers
es_mx: Controladores
fr_ca: Contrôleurs
zh_cn: 控制器

source: **LEGAL CONTROLLERS:** As of the 2021-2022 season, the following controllers are `legal for competition: <https://web.archive.org/web/20220131114951/https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/legal-illegal-parts-list.pdf>`_
es_mx: **CONTROLADORES LEGALES:** A partir de la temporada 2021-2022, los siguientes controladores son `legales para la competición: <https://web.archive.org/web/20220131114951/https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/legal-illegal-parts-list.pdf>`_
fr_ca: **CONTRÔLEURS LÉGAUX:** À partir de la saison 2021-2022, les contrôleurs suivants sont `légaux pour la compétition : <https://web.archive.org/web/20220131114951/https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/legal-illegal-parts-list.pdf>`_

source: Xbox 360 Controller for Windows
es_mx: Control Xbox 360 para Windows
fr_ca: Manette Xbox 360 pour Windows
zh_cn: 适用于 Windows 的 Xbox 360 手柄

source: Logitech F310 Controller
es_mx: Control Logitech F310
fr_ca: Manette Logitech F310
zh_cn: Logitech的 F310 手柄

source: ETPark Wired Controller for PS4
es_mx: Control con cable ETPark para PS4
fr_ca: Contrôleur filaire ETPark pour PS4
zh_cn: 用于 PS4 的 ETPark 有线手柄

source: Sony DualShock 4 Wireless Controller for PS4 (Must be connected wired over USB)
es_mx: Control inalámbrico Sony DualShock 4 para PS4 (debe conectarse por cable a través de USB)
fr_ca: Sony DualShock 4 Wireless Controller for PS4 (Doit être connecté par USB)
zh_cn: 用于 PS4 的索尼 DualShock 4 无线手柄（必须通过 USB 有线连接）

source: In the past, the Xbox 360 controller was preferred by many top teams over the Logitech F310. This is mostly as the Xbox controller has less of a dead spot. A dead spot is basically the area where the joystick can move but not communicate that the stick has shifted slightly. This means that when the joystick is moved to a position where the controller can detect it, the robot will sometimes have a tendency to lurch forward. Dead spots make it difficult for the driver to execute fine-tuned and precise movements. **This is likely a non-issue for the large majority of teams. Also, keep in mind that there are very specific models of the Xbox controller that are legal, so they can be hard to find new.**
es_mx: En el pasado, muchos de los mejores equipos preferían el control de Xbox 360 al de Logitech F310. Esto se debe principalmente a que el control de Xbox tiene menos puntos muertos. Un punto muerto es básicamente la zona en la que el joystick puede moverse pero sin comunicar que el stick se ha desplazado ligeramente. Esto significa que cuando el joystick se mueve a una posición en la que el mando puede detectarlo, el robot a veces tiende a tambalearse hacia delante. Los puntos muertos dificultan al conductor la ejecución de movimientos afinados y precisos. **Es probable que esto no sea un problema para la gran mayoría de los equipos. Además, hay que tener en cuenta que hay modelos muy específicos del control de Xbox que son legales, por lo que pueden ser difíciles de encontrar nuevos.**
fr_ca: Dans le passé, de nombreuses équipes de haut niveau ont préféré la manette Xbox 360 à la Logitech F310. Cela s'explique principalement par le fait que la manette Xbox présente moins de points morts. Un point mort est en fait la zone où le joystick peut bouger sans que l'on puisse communiquer qu'il s'est légèrement déplacé. Cela signifie que lorsque le joystick est déplacé dans une position où la manette peut le détecter, le robot aura parfois tendance à s'incliner vers l'avant. Les zones mortes rendent difficile l'exécution de mouvements fins et précis par le conducteur. **Il s'agit probablement d'un problème sans importance pour la grande majorité des équipes. N'oubliez pas non plus qu'il existe des modèles très spécifiques de manettes Xbox qui sont légales, et qu'il peut donc être difficile d'en trouver de nouvelles**.
zh_cn: 过去，与Logitech F310 相比，Xbox 360 控制器是许多顶级团队的首选。这主要是因为 Xbox 手柄的盲点较少。盲点基本上是指摇杆可以微操，但手柄却无法传达遥杆微操的区域给机器人。这意味着，当摇杆移动到手柄可以检测到的位置时，机器人有时会有向前冲的趋势。盲点使驾驶员难以执行微调和精确的动作(编者注：事实上就是你的微操机器人无法行使)。**对于大多数团队来说，这可能不是问题。此外，请记住，Xbox 控制器只有特定型号是合规的，因此很难找到新的型号。

source: Starting with the 2020-2021 season, the ETPark and Sony PS4 Controllers are legal and provide numerous advantages over Xbox 360 Controllers. Some of these advantages include, better trigger and bumper control, a more usable dpad, and trackpad support as of the 2021-2022 season. Use of the PS4 controller is slightly different because the locations of the Left Stick and DPAD are swapped and `some button names are different. <https://github.com/OpenFTC/OpenRC-Turbo/blob/2d1e527d3d53c3ac7da701a73d342b85cf407835/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L884>`_ **Pro Tip: Make sure your drivers have experience with the controller they plan to use for competition.**
es_mx: A partir de la temporada 2020-2021, los controles ETPark y Sony PS4 son legales y ofrecen numerosas ventajas sobre los controles Xbox 360. Algunas de estas ventajas incluyen un mejor control del gatillo y el parachoques, un dpad más utilizable y compatibilidad con el trackpad a partir de la temporada 2021-2022. El uso del control de PS4 es ligeramente diferente porque las ubicaciones del Stick izquierdo y el DPAD están intercambiadas y `algunos nombres de botones son diferentes. <https://github.com/OpenFTC/OpenRC-Turbo/blob/2d1e527d3d53c3ac7da701a73d342b85cf407835/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L884>**Consejo profesional: Asegúrate de que tus conductores tienen experiencia con el mando que piensan usar en competición.**
fr_ca: À partir de la saison 2020-2021, les manettes ETPark et Sony PS4 sont légales et offrent de nombreux avantages par rapport aux manettes Xbox 360. Parmi ces avantages, citons un meilleur contrôle des gâchettes et des bumper, un dpad plus utilisable et la prise en charge du trackpad à partir de la saison 2021-2022. L'utilisation de la manette PS4 est légèrement différente car l'emplacement du stick gauche et du DPAD est inversé et ``certains noms de boutons sont différents. <https://github.com/OpenFTC/OpenRC-Turbo/blob/2d1e527d3d53c3ac7da701a73d342b85cf407835/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L884>**Conseil professionnel : Assurez-vous que vos pilotes ont de l'expérience avec la manette qu'ils prévoient d'utiliser en compétition**.
zh_cn: 从 2020-2021 赛季开始，ETPark 和索尼 PS4 手柄是合规的，与 Xbox 360 控制器相比具有众多优势。其中一些优势包括：更好的扳机和保险杠控制、更实用的触控板以及从 2021-2022 赛季开始的触控板支持。PS4 手柄的使用略有不同，因为左摇杆和 Dpad 的位置互换了，而且 "一些按钮的名称也不同"。 <https://github.com/OpenFTC/OpenRC-Turbo/blob/2d1e527d3d53c3ac7da701a73d342b85cf407835/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L884>`_ **专业提示：确保您的操纵手对他们计划在比赛中使用的操纵端有使用经验。

source: Generally it is the opinion that the PS4 controllers are better than the other options. Among the options for PS4 controllers, the choice is really up to you. The Sony controller has slightly better buttons, but the ETPark controller is half the cost and a more solid connecting wire. **Keep in mind that the drivers can use different controllers, so pick the one most comfortable to you.**
es_mx: Generalmente se opina que los controles de PS4 son mejores que las demás opciones. Entre las opciones de controles para PS4, la elección depende realmente de ti. El control de Sony tiene botones ligeramente mejores, pero el control de ETPark cuesta la mitad y tiene un cable de conexión más sólido. **Ten en cuenta que los controladores pueden usar diferentes mandos, así que elige el que te resulte más cómodo.**
fr_ca: En général, on estime que les manettes PS4 sont meilleures que les autres options. Parmi les options de manettes PS4, le choix est vraiment le vôtre. La manette Sony a des boutons légèrement meilleurs, mais la manette ETPark est deux fois moins chère et son fil de connexion est plus solide. **Gardez à l'esprit que les pilotes peuvent utiliser des manettes différentes, alors choisissez celle qui vous convient le mieux.
zh_cn: 一般认为，PS4 手柄比其他选择更好。在 PS4 控制器的各种选择中，真正的选择取决于您。索尼手柄的按键略胜一筹，但 ETPark 手柄的成本仅为索尼手柄的一半，而且连接线时更牢固。**请记住，操作手可以使用不同的手柄，因此请选择最适合您的手柄。

source: A phone holder and :term:`OTG <Micro USB On The Go (OTG) Cable>` strain relief connector can be useful as it may help to prevent connections from loosening. Especially if teams are running dual controller configuration, ensuring that the USB hub is secure won't hurt.
es_mx: Un soporte para el teléfono y un conector de alivio de tensión :term:`OTG <Micro USB On The Go (OTG) Cable>` pueden ser útiles, ya que pueden ayudar a evitar que las conexiones se aflojen. Especialmente si los equipos están ejecutando la configuración de controlador dual, asegurarse de que el concentrador USB está seguro no le hará daño.
fr_ca: Un support de téléphone et un connecteur de décharge de traction :term:`OTG <Micro USB On The Go (OTG) Cable>` peuvent être utiles pour empêcher les connexions de se desserrer. En particulier si les équipes utilisent une configuration à deux contrôleurs, s'assurer que le concentrateur USB est bien fixé n'est pas une mauvaise chose.
zh_cn: 手机支架和:term:`OTG <Micro USB On The Go (OTG) Cable>`电缆密封套可以有助于防止连接松动。特别是在团队运行双手柄配置时，确保 USB Hub的稳定不会有任何问题。

source: **LEGAL CONTROLLERS:** As of the 2021-2022 season, the following controllers are `legal for competition: <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/legal-illegal-parts-list.pdf>`_
zh_cn: **合规控制器：** 自 2021-2022 赛季起，以下控制器为 "合规的比赛控制器"： <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/legal-illegal-parts-list.pdf>`_
