Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/index.po
Languages: es_mx, fr_ca, zh_cn

source: Electronics and Motion Components
es_mx: Electrónica y Componentes de Movimiento
fr_ca: Composants Électroniques et de Mouvement
zh_cn: 电子和运动部件

source: This chapter contains information on electric power and electronics of the robot, including information on wiring, batteries, motors, and control system.
es_mx: Este capítulo contiene información sobre la energía eléctrica y la electrónica del robot, incluyendo información sobre el cableado, las baterías, los motores y el sistema de control.
fr_ca: Ce chapitre contient des informations sur l'alimentation électrique et l'électronique du robot, y compris des informations sur le câblage, les batteries, les moteurs et le système de contrôle.
zh_cn: 本章包含机器人的电力和电子信息，包括布线、电池、电机和控制系统的信息。

source: Glossary
es_mx: Glosario
fr_ca: Glossaire
zh_cn: 术语表

source: Gauge
es_mx: Calibre
fr_ca: Calibre
zh_cn: 规格

source: Wire gauge refers to the diameter of wire. AWG stands for American Wire Gauge, the general system used in the US. The larger the gauge number, the smaller the wire diameter. Generally, :term:`servo <Servo>` wires are 22 AWG and motor wires are 18 AWG.
es_mx: El calibre del cable se refiere al diámetro del cable. AWG significa American Wire Gauge (Calibre de Alambre Estadounidense CAE), el sistema general utilizado en los Estados Unidos. Cuanto mayor sea el número de calibre, menor será el diámetro del alambre. Generalmente, los cables del :term:`servo <Servo>` son de calibre 22 AWG y los cables de motor son de calibre 18 AWG.
fr_ca: Le calibre du fil fait référence au diamètre du fil. AWG signifie American Wire Gauge, le système général utilisé aux États-Unis. Plus le numéro du calibre est grand, plus le diamètre du fil est petit. En général, <Servo>les fils des servos sont du calibre 22 AWG et les fils des moteurs sont du calibre 18 AWG.
zh_cn: 线规是指电线的直径。AWG 代表美国线规，是美国使用的通用系统。线规数字越大，导线直径越小。一般来说， :term:`servo <Servo>` 导线为 22 AWG，电机线为 18 AWG。

source: Grounding Strap
es_mx: Correa de puesta a tierra
fr_ca: Bracelet de mise au sol
zh_cn: 接地带

source: The REV Grounding Strap is used to ground the metal frame of the robot to the :term:`XT30` port of the Expansion Hub. It is currently the only legal way to ground your robot.
es_mx: La Correa de Puesta a Tierra REV se utiliza para poner a tierra el marco metálico del robot al puerto :term:`XT30` del Expansion Hub. Actualmente, es la única forma legal de poner a tierra tu robot.
fr_ca: Le REV Grounding Strap est utilisé pour mettre au sol le cadre métallique du robot via le port XT30 du Expansion Hub. C'est actuellement la seule méthode légale pour mettre au sol votre robot.
zh_cn: REV 接地带用于将机器人的金属框架与 Expansion Hub 的 :term:`XT30` 端口接地。这是目前唯一合法的机器人接地方式。

source: A REV Robotics grounding strap
es_mx: Una correa de puesta a tierra de REV Robotics
fr_ca: Bracelet de mise au sol REV Robotics
zh_cn: REV 机器人接地带

source: USB Retention Mount
es_mx: Montaje de retención USB
fr_ca: Support de Rétention USB
zh_cn: USB 固定支架

source: The USB Retention Mount, sold by REV, is a plastic part affixed to the Expansion Hub that relieves stress on the USB Mini port. This is especially important because if the USB cable is loose or disconnected, the robot phone cannot communicate with the Expansion Hub, causing a disconnect.
es_mx: El soporte de retención USB, vendido por REV, es una pieza de plástico fijada al Expansion Hub que alivia el estrés en el puerto USB Mini. Esto es especialmente importante porque si el cable USB está suelto o desconectado, el teléfono del robot no puede comunicarse con el Expansion Hub, lo que causa una desconexión.
fr_ca: Le Support de Rétention USB, vendu par REV, est une pièce en plastique fixée au Expansion Hub qui réduit la tension sur le port USB Mini. Cela est particulièrement important, car si le câble USB est lâche ou déconnecté, le téléphone du robot ne peut pas communiquer avec l'Expansion Hub, ce qui entraîne une perte de connexion.
zh_cn: 由 REV 出售的 USB 固定支架是一种固定在Expansion Hub上的塑料部件，可减轻 micro-USB 端口的压力。这一点尤为重要，因为如果 USB 电缆松动或断开，机器人控制器就无法与 Expansion Hub 通信，从而导致断线。

source: For teams using an expansion hub, it is highly recommended for teams to purchase the USB retention mount.
es_mx: Para los equipos que utilizan un expansion hub, se recomienda encarecidamente que los equipos compren el montage de retención USB.
fr_ca: Pour les équipes utilisant un Expansion Hub, il est fortement recommandé d'acheter le Support de Rétention USB
zh_cn: 对于使用 Expansion Hub 的团队，强烈建议购买 USB 固定支架。

source: A USB retention mount attached to a REV Expansion Hub
es_mx: Un montage de retención USB adjunto a un REV Expansion Hub.
fr_ca: un Support de Rétention USB attché a un Expansion Hub
zh_cn: 连接到 REV Expansion Hub 的 USB 固定支架
