Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/sensor-glossary.po
Languages: es_mx, fr_ca

source: Sensor Glossary
es_mx: Glosario de sensores
fr_ca: Glossaire des capteurs

source: Sensors are used in a variety of applications within FTC\ |reg|. Sensors can give external feedback regarding the position of the robot (for example, relative to the field wall or to a vision target) or internal feedback (velocity, distance traveled, voltage, etc.). Sensors can also be used to determine the rotation of a mechanism and detect color.
es_mx: Los sensores se utilizan en diversas aplicaciones dentro FTC |reg|. Los sensores pueden proporcionar información externa sobre la posición del robot (por ejemplo, en relación con la pared del campo o con un objetivo de visión) o información interna (velocidad, distancia recorrida, voltaje, etc.). Los sensores también pueden utilizarse para determinar la rotación de un mecanismo y detectar el color.
fr_ca: Les capteurs sont utilisés dans une variété d'applications au sein de FTC\ |reg|. Les capteurs peuvent fournir un retour d'information externe concernant la position du robot (par exemple, par rapport au mur du champ ou à une cible de vision) ou un retour d'information interne (vitesse, distance parcourue, tension, etc.). Les capteurs peuvent également être utilisés pour déterminer la rotation d'un mécanisme et détecter la couleur.

source: Encoders/Potentiometers
es_mx: Codificadores/Potenciómetros
fr_ca: Codeurs/Potentiomètres

source: Rotational
es_mx: Rotacional
fr_ca: Rotation

source: Absolute (+ Potentiometers)
es_mx: Absoluto (+ Potenciómetros)
fr_ca: Absolu (+ Potentiomètres)

source: Potentiometer (`REV-31-1155 <https://www.revrobotics.com/rev-31-1155/>`_)
es_mx: Potenciómetro (`REV-31-1155 <https://www.revrobotics.com/rev-31-1155/>`_)
fr_ca: Potentiomètre (`REV-31-1155 <https://www.revrobotics.com/rev-31-1155/>`_)

source: REV Through Bore Encoder (`REV-11-1271 <https://www.revrobotics.com/rev-11-1271/>`_). It has absolute support but over PWM, which is inaccessible within the FTC control system.
es_mx: Codificador pasante REV (`REV-11-1271 <https://www.revrobotics.com/rev-11-1271/>`_). Tiene soporte absoluto pero sobre PWM, que es inaccesible dentro del sistema de control FTC.
fr_ca: REV Through Bore Encoder (`REV-11-1271 <https://www.revrobotics.com/rev-11-1271/>`_). Il dispose d'un support absolu mais sur PWM, qui est inaccessible dans le système de contrôle de FTC.

source: Generic (`Sparkfun Rotary Encoder <https://www.sparkfun.com/products/9117>`_)
es_mx: Genérico (`Codificador giratorio Sparkfun <https://www.sparkfun.com/products/9117>`_)
fr_ca: Générique (`Sparkfun Rotary Encoder <https://www.sparkfun.com/products/9117>`_)

source: Positional
es_mx: Posicional
fr_ca: Positionnement

source: Linear Potentiometers Slide Pot (`Sparkfun Slide Pot <https://www.sparkfun.com/products/9119>`_)
es_mx: Potenciómetros lineales Slide Pot (`Sparkfun Slide Pot <https://www.sparkfun.com/products/9119>`_)
fr_ca: Potentiomètres linéaires Slide Pot (`Sparkfun Slide Pot <https://www.sparkfun.com/products/9119>`_)

source: Physical
es_mx: Físico
fr_ca: Physique

source: Limit Switches (`3103-0001-0001/3103-0001-0002 <https://www.gobilda.com/limit-switches/>`_)
fr_ca: Interrupteurs de fin de course (`3103-0001-0001/3103-0001-0002 <https://www.gobilda.com/limit-switches/>`_)

source: Endstops Generic (`Sparkfun <https://www.sparkfun.com/products/13014>`_)
fr_ca: Butées génériques (`Sparkfun <https://www.sparkfun.com/products/13014>`_)

source: Touch Sensor REV (`REV-31-1425 <https://www.revrobotics.com/rev-31-1425/>`_)
es_mx: Sensor táctil REV (`REV-31-1425 <https://www.revrobotics.com/rev-31-1425/>`_)
fr_ca: Capteur tactile REV (`REV-31-1425 <https://www.revrobotics.com/rev-31-1425/>`_)

source: Magnetic
es_mx: Magnético
fr_ca: Magnétique

source: Hall Effect Sensor REV (`REV-31-1462 <https://www.revrobotics.com/rev-31-1462/>`_)
es_mx: Sensor de efecto Hall REV (`REV-31-1462 <https://www.revrobotics.com/rev-31-1462/>`_)
fr_ca: Capteur à effet Hall REV (`REV-31-1462 <https://www.revrobotics.com/rev-31-1462/>`_)

source: Optical
es_mx: Óptico
fr_ca: Optique

source: Color
fr_ca: Couleur

source: REV Color
fr_ca: Couleur REV

source: MR Color
fr_ca: Couleur MR

source: Computer Vision
es_mx: Visión computarizada
fr_ca: Vision par ordinateur

source: Hardware
fr_ca: Matériel

source: Software
fr_ca: Logiciel

source: Ultrasonic
es_mx: Ultrasonicos
fr_ca: Ultrasons

source: Other
es_mx: Otros
fr_ca: Autres

source: Accelerometer
es_mx: Acelerómetro
fr_ca: Accéléromètre

source: Compass
es_mx: Compas
fr_ca: Boussole

source: Magnetometer
es_mx: Magnetómetro
fr_ca: Magnétomètre

source: Logic Level Converter
es_mx: Convertidor de nivel lógico
fr_ca: Convertisseur de niveau logique

source: The old Modern Robotics system run on 5v sensor logic. The new REV Robotics system uses 3.3v. For most off the shelf sensors, this doesn't cause any problems, but for some existing FTC sensors it does. To solve this REV sells boards, called `logic level converters <https://www.revrobotics.com/rev-31-1389/>`_, that convert the sensor data to be readable by the REV hubs. The `REV Expansion Hub <https://docs.revrobotics.com/duo-control/sensors/5v-sensors#logic-level-converter>`_ guide has a chart detailing what adapters are needed for what sensors.
es_mx: El antiguo sistema Modern Robotics funcionaba con una lógica de sensor de 5v. El nuevo sistema REV Robotics utiliza 3.3v. Para la mayoría de los sensores, esto no causa ningún problema, pero para algunos sensores FTC sí. Para solucionar esto REV vende placas, llamadas `convertidores de nivel lógico <https://www.revrobotics.com/rev-31-1389/>`_, que convierten los datos del sensor para que puedan ser leídos por los hubs REV. La guía `REV Expansion Hub <https://docs.revrobotics.com/duo-control/sensors/5v-sensors#logic-level-converter>`_ tiene una tabla que detalla qué adaptadores son necesarios para qué sensores.
fr_ca: L'ancien système Modern Robotics fonctionnait avec une logique de capteur de 5 V. Le nouveau système REV Robotics utilise 3,3 V. Le nouveau système REV Robotics utilise 3,3 V. Pour la plupart des capteurs disponibles sur le marché, cela ne pose aucun problème, mais pour certains capteurs FTC existants, c'est le cas. Pour résoudre ce problème, REV vend des cartes, appelées `convertisseurs de niveau logique <https://www.revrobotics.com/rev-31-1389/>`_, qui convertissent les données du capteur pour qu'elles puissent être lues par les hubs REV. Le guide `REV Expansion Hub <https://docs.revrobotics.com/duo-control/sensors/5v-sensors#logic-level-converter>`_ contient un tableau détaillant quels adaptateurs sont nécessaires pour quels capteurs.

source: According to REV testing, goBILDA, REV and TorqueNado motors don't need logic level converters, but only some NeveRest motors worked with no discernable reason why.
es_mx: Según las pruebas de REV, los motores goBILDA, REV y TorqueNado no necesitan convertidores de nivel lógico, pero sólo algunos motores NeveRest funcionaron sin razón discernible.
fr_ca: Selon les tests effectués par REV, les moteurs goBILDA, REV et TorqueNado n'ont pas besoin de convertisseurs de niveau logique, mais seuls certains moteurs NeveRest ont fonctionné sans que l'on puisse en déterminer la raison.

source: It is ideal to not use logic level converters to simplify your wiring. If you need to, there is a best practice. Electrical tape the connectors on either end, this helps with static, and it keeps it from being physically disconnected. This does produce a very noticeable effect with encoders on fields with lots of static.
es_mx: Lo ideal es no utilizar convertidores de nivel lógico para simplificar el cableado. Si lo necesitas, hay una mejor práctica. Ponga cinta aislante en los conectores de ambos extremos, esto ayuda con la estática, y evita que se desconecte físicamente. Esto produce un efecto muy notable con codificadores en los campos con mucha estática.
fr_ca: L'idéal est de ne pas utiliser de convertisseurs de niveau logique pour simplifier le câblage. Si vous devez le faire, il existe une meilleure pratique. Il faut mettre du ruban électrique sur les connecteurs à chaque extrémité, ce qui permet de réduire l'électricité statique et d'éviter que les connecteurs ne soient physiquement déconnectés. Cela produit un effet très visible avec les encodeurs dans les champs où il y a beaucoup d'électricité statique.

source: The second tip is to never tape over the middle or LED. The board generates a very small amount of heat, and it's very easy to overheat if it can't ventilate, also don't fully enclose it in any cases without holes.
es_mx: El segundo consejo es no poner nunca cinta adhesiva sobre el centro o el LED. La placa genera una cantidad muy pequeña de calor, y es muy fácil que se sobrecaliente si no puede ventilar, tampoco la encierres completamente en ningún caso sin agujeros.
fr_ca: Le deuxième conseil est de ne jamais coller de ruban adhésif sur le centre ou la LED. La carte génère une très petite quantité de chaleur, et il est très facile de surchauffer si elle ne peut pas être ventilée, aussi ne l'enfermez pas complètement dans des boîtiers sans trous.

source: Relative
es_mx: Relativo

source: Contact
es_mx: Contacto

source: Endstops Generic (`Sparkfun <https://www.sparkfun.com/products/13013>`_)
es_mx: Topes genéricos (`Sparkfun <https://www.sparkfun.com/products/13013>`_)

source: Distance
es_mx: Distancia

source: Gyroscope
es_mx: Giroscopio
