Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/wiring.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Be aware, :term:`XT30` connectors can wear out significantly faster than :term:`PowerPole <Anderson PowerPole>` connectors. Additionally, because :term:`XT30` connectors are soldered, they can break much easier than :term:`PowerPole <Anderson PowerPole>` connections.
es_mx: Ten en cuenta que los conectores :term:`XT30` pueden desgastarse significativamente más rápido que los conectores :term:`PowerPole <Anderson PowerPole>`. Además, debido a que los conectores :term:`XT30` están soldados, pueden romperse mucho más fácilmente que las conexiones :term:`PowerPole <Anderson PowerPole>`.
fr_ca: Attention, les connecteurs :term:`XT30` peuvent s'user beaucoup plus rapidement que les connecteurs :term:`PowerPole <Anderson PowerPole>`. De plus, comme les connecteurs :term:`XT30` sont soudés, ils peuvent se casser beaucoup plus facilement que les connexions :term:`PowerPole <Anderson PowerPole>`.
zh_cn: 请注意，:term:`XT30`连接器的磨损速度比:term:`PowerPole <Anderson PowerPole>`连接器快得多。此外，由于:term:`XT30`连接器是焊接的，所以它们比:term:`PowerPole <Anderson PowerPole>`连接更容易断裂。

source: Cabling for module power should be at least 14awg, if not 12awg. Keep in mind that it must be stranded, not solid, wire.
es_mx: El cableado para la alimentación del módulo debe ser al menos de calibre 14awg, si no es de calibre 12awg. Ten en cuenta que debe ser cable trenzado, no sólido.
fr_ca: Le câblage pour l'alimentation des modules doit être au moins de 14 AWG, si ce n'est de 12 AWG. N'oubliez pas qu'il doit s'agir d'un fil toronné et non d'un fil plein.
zh_cn: 模块电源的布线应至少为14awg，如果不是12awg。请记住，它必须是绞线，而不是实心线。

source: Motor Power
es_mx: Energía del motor
fr_ca: Puissance du moteur
zh_cn: 电机功率

source: Cabling for motor power should be between 16awg and 12awg. Again, stranded, not solid, wire.
es_mx: El cableado para la energía del motor debe ser entre 16awg y 12awg. Nuevamente, cable trenzado, no sólido.
fr_ca: Le câblage pour l'alimentation du moteur doit être compris entre 16 et 12 AWG. Là encore, il s'agit de fils torsadés et non de fils pleins.
zh_cn: 电机电源的布线应该在16awg和12awg之间。同样，使用绞线而不是实心线。

source: Some motors (like the :term:`REV HD Hex <HD Hex Motor>` and :term:`Core Hex <Core Hex Motor>`) will have removable power connectors on the back, while other motors (like the :term:`Andymark NeveRests <NeveRest Motor>`) will have a cable permanently soldered on the back. It is much more convenient to have a connector on the back, or failing that, have a very short plug on the back of the motor. Once your wires are run and secured, taking them out won't be fun.
es_mx: Algunos motores (como el :term:`REV HD Hex <HD Hex Motor>` y el :term:`Core Hex <Core Hex Motor>`) tendrán conectores de alimentación removibles en la parte posterior, mientras que otros motores (como el :term:`Andymark NeveRests <NeveRest Motor>`) tendrán un cable soldado permanentemente en la parte posterior. Es mucho más conveniente tener un conector en la parte posterior, o en su defecto, tener un enchufe muy corto en la parte posterior del motor. Una vez que los cables estén instalados y asegurados, sacarlos no será divertido.
fr_ca: Certains moteurs (comme le :term:`REV HD Hex <HD Hex Motor>` et le :term:`Core Hex <Core Hex Motor>`) ont des connecteurs d'alimentation amovibles à l'arrière, tandis que d'autres moteurs (comme le :term:`Andymark NeveRests <NeveRest Motor>`) ont un câble soudé en permanence à l'arrière. Il est beaucoup plus pratique d'avoir un connecteur à l'arrière, ou à défaut, d'avoir une prise très courte à l'arrière du moteur. Une fois que les fils sont passés et fixés, les retirer ne sera pas une partie de plaisir.
zh_cn: 一些电机（如：term:`REV HD Hex <HD Hex Motor>`和：term:`Core Hex <Core Hex Motor>`）在背面上有可拆卸的电源连接器，而其他电机（如：term:`Andymark NeveRests <NeveRest Motor>`）在背面上有一个电缆永久焊接。在电机背面上有一个连接器或者在电机背面上有一个非常短的插头会更加方便，如果没有这样的话，一旦你的电线安装好并固定好，取出它们将不会很有趣。

source: Servo Wires
es_mx: Cables del servo
fr_ca: Fils de servomoteurs
zh_cn: 舵机线

source: Using heavy-duty extension wires are recommended.
es_mx: Usar cables de extensión de alta resistencia es recomendado.
fr_ca: Il est recommandé d'utiliser des câbles de rallonge robustes.
zh_cn: 推荐使用重型延长线。

source: Tape the connections between extension wires and servo wires with electrical tape. This is as the connections can become loose over time and are easy to pull out.
es_mx: Encinta las conexiones entre los cables de extensión y los cables del servo con cinta eléctrica. Esto se debe a que las conexiones pueden aflojarse con el tiempo y son fáciles de sacar.
fr_ca: Collez du ruban adhésif sur les connexions entre les fils d'extension et les fils de servomoteurs. En effet, les connexions peuvent se desserrer avec le temps et être facilement arrachées.
zh_cn: 使用电子胶带将延长线和舵机线之间的连接点进行固定。这样做是因为连接点随着时间的推移可能会变松，并且很容易被拉出来。

source: The VEX Motor Controller 29 has the wrong gender connector on the 3-pin end. You are required to either use an adapter cable, or add the right connector to the wires (recommended). **Be sure to protect the MC29, as it is fragile and prone to failure if it takes impact from another object**.
es_mx: El Controlador de Motor VEX 29 tiene el conector de género incorrecto en el extremo de 3 pines. Se requiere que utilices un cable adaptador o agregues el conector correcto a los cables (recomendado). **Asegúrate de proteger el MC29, ya que es frágil y propenso a fallar si recibe impacto de otro objeto**.
fr_ca: Le Contrôleur de Moteur VEX 29 a le mauvais genre de connecteur sur l'extrémité à 3 broches. Vous devez soit utiliser un câble adaptateur, soit ajouter le bon connecteur aux fils (recommandé). **Veillez à protéger le MC29, car il est fragile et susceptible de tomber en panne s'il est heurté par un autre objet**.
zh_cn: VEX Motor Controller 29在3针端口上连接器的性别错误。您需要使用适配器电缆或者在线缆上添加正确的连接器（推荐）。**请务必保护MC29，因为它很脆弱，如果受到其他物体的冲击可能会导致故障**。

source: USB is generally a strong connector, but is prone to wearing out over time. Refrain from plugging/unplugging these cables more than necessary, especially on the RC/DS phones.
es_mx: Las USB son generalmente un conector resistente, pero tiende a desgastarse con el tiempo. Evita enchufar/desenchufar estos cables más de lo necesario, especialmente en los teléfonos RC/DS.
fr_ca: L'USB est généralement un connecteur solide, mais il a tendance à s'user avec le temps. Évitez de brancher/débrancher ces câbles plus que nécessaire, en particulier sur les téléphones RC/DS.
zh_cn: USB 通常是一种坚固的连接器，但随着时间的推移容易磨损。请避免在必要时插拔这些电缆，尤其是在遥控/DS 手机上。

source: USB loves strain relief. To keep disconnects low, tie down cables to leave as little loose cabling on the robot as possible.
es_mx: Las USB aman el alivio de tensión. Para mantener las desconexiones bajas, asegure los cables para dejar la menor cantidad de cables sueltos en el robot como sea posible.
fr_ca: L'USB aime la décharge de traction. Pour limiter les déconnexions, attachez les câbles de manière à ce qu'il y ait le moins de câbles libres possible sur le robot.
zh_cn: USB 与夹线套的适配度相当高。为减少断开连接，应绑紧电缆，尽可能减少机器人上松动的电缆。

source: Sensor Wires/Encoder Wires
es_mx: Cables del sensor / Cables del encoder
fr_ca: Fils du Capteur/Fils de l'Encodeur
zh_cn: 传感器导线/编码器导线

source: Sensor wires and their connectors can be incredibly fragile. Use caution when routing, and keep slack on the connector end when adding strain relief to the cable.
es_mx: Los cables del sensor y sus conectores pueden ser increíblemente frágiles. Tenga cuidado al enrutamiento y mantenga holgura en el extremo del conector al agregar alivio de tensión al cable.
fr_ca: Les câbles des capteurs et leurs connecteurs peuvent être incroyablement fragiles. Soyez prudent lors de l'acheminement et laissez du mou à l'extrémité du connecteur lorsque vous ajoutez une décharge de traction au câble.
zh_cn: 传感器电线及其连接器非常容易损坏。布线时要小心谨慎，在给电缆添加应力消除装置时，连接器端要保持松弛。

source: The JST data connectors on the REV Expansion Hub and Control Hub have +5v, GND, and two data pins. If you are using a digital or analog sensor that does not use I2C, you can use a Y cable that gives two sensors off of one port.
es_mx: Los conectores de datos JST en el REV Expansion Hub y Control Hub tienen +5v, GND y dos pines de datos. Si estás utilizando un sensor digital o analógico que no utiliza I2C, puedes usar un cable Y que permite conectar dos sensores a un solo puerto.
fr_ca: Les connecteurs de données JST sur l'Expansion Hub REV et le Control Hub ont +5v, GND, et deux broches de données. Si vous utilisez un capteur numérique ou analogique qui n'utilise pas I2C, vous pouvez utiliser un câble en Y qui permet à deux capteurs d'utiliser un seul port.
zh_cn: REV 扩展集线器和控制集线器上的 JST 数据连接器有 +5V、GND 和两个数据引脚。如果使用的是不使用 I2C 的数字或模拟传感器，则可以使用 Y 型电缆，通过一个端口连接两个传感器。

source: Miscellaneous
es_mx: Misceláneo
fr_ca: Divers
zh_cn: 杂项

source: REV Grounding Strap
es_mx: Correa de puesta a tierra REV
fr_ca: La sangle de mise à la terre REV
zh_cn: REV 接地带

source: The :term:`REV Grounding Strap <Grounding Strap>` is currently the only legal way to ground your robot. Attach the end to the metal part of your robot frame, and plug the :term:`XT30` connector end into a free :term:`XT30` port on your robot.
es_mx: La Correa de Puesta a Tierra REV <Grounding Strap> es actualmente la única forma legal de poner a tierra tu robot. Conecta el extremo al componente metálico del marco de tu robot y enchufa el extremo del conector XT30 en un puerto XT30 libre de tu robot.
fr_ca: term:`La sangle de mise à la terre REV <Grounding Strap>` est actuellement le seul moyen légal de mettre votre robot à la terre. Attachez l'extrémité à la partie métallique du châssis de votre robot et branchez l'extrémité du connecteur :term:`XT30` dans un port :term:`XT30` libre de votre robot.
zh_cn: :term:`REV 接地带 <Grounding Strap>` 是目前唯一合法的机器人接地方式。将 :term:`XT30` 接头的一端连接到机器人框架的金属部分，然后将 :term:`XT30` 接头的另一端插入机器人上空闲的 :term:`XT30` 端口。

source: Power distribution blocks/panels
es_mx: Bloques/paneles de distribución de energía
fr_ca: Blocs/panneaux de distribution d'énergie
zh_cn: 配电块/配电盘

source: The REV Power Distribution Block allows teams to have more than four :term:`XT30` connectors (2 on each Expansion Hub). The block can be connected to the Servo Power Module to boost voltage for servos.
es_mx: El Bloque de Distribución de Energía REV permite a los equipos tener más de cuatro conectores :term:`XT30` (2 en cada Expansion Hub). El bloque se puede conectar al Módulo de Energía del Servo para aumentar el voltaje de los servos.
fr_ca: Le Bloc de Distribution d'énergie REV permet aux équipes d'avoir plus de quatre connecteurs :term:`XT30` (2 sur chaque Expansion Hub). Le bloc peut être connecté au module d'alimentation des servomoteurs pour augmenter la tension des servomoteurs.
zh_cn: REV 电源分配模块允许团队拥有超过 4 个 :term:`XT30` 连接器（每个扩展集线器上有 2 个）。配电模块可与舵机电源模块连接，为舵机提升电压。

source: Dryer sheets
es_mx: Hojas para secadora
fr_ca: Feuilles de séchage
zh_cn: 干燥剂

source: Dryer sheets can be used to wipe down the robot after every match in order to reduce static buildup. This is not directly recommended by *FIRST* or any vendor, but our empirical evidence throughout the years suggests that it helps, or at the very least, can't hurt to do so. However, dryer sheets may or may not be on the boundary of legality, as grounding the robot to the ground is illegal.
es_mx: Las hojas para secadora se pueden usar para limpiar el robot después de cada partida con el fin de reducir la acumulación de estática. Esto no es recomendado directamente por *FIRST* o cualquier proveedor, pero nuestra evidencia empírica a lo largo de los años sugiere que ayuda, o al menos, no hace daño hacerlo. Sin embargo, las hojas para secadora pueden o no estar en el límite de la legalidad, ya que conectar el robot a tierra es ilegal.
fr_ca: Des feuilles de sèche-linge peuvent être utilisées pour essuyer le robot après chaque match afin de réduire l'accumulation d'électricité statique. Cela n'est pas directement recommandé par *FIRST* ou tout autre fournisseur, mais nos preuves empiriques au fil des ans suggèrent que cela aide, ou au moins, ne peut pas faire de mal de le faire. Cependant, les feuilles de séchage peuvent ou non être à la limite de la légalité, puisque la mise à la terre du robot est illégale.
zh_cn: 每次比赛结束后，可以用烘干纸擦拭机器人，以减少静电积累。这并不是*FIRST*或任何供应商的直接建议，但我们多年来的经验表明，这样做是有帮助的，至少不会有什么坏处。不过，干燥剂可能会也可能不会触犯规则，因为将机器人接地是违规的。

source: Staticide/static spray
es_mx: Staticide/spray estático
fr_ca: Staticide/vaporisation statique
zh_cn: 静电消除/静电喷雾

source: Staticide is a spray that helps to keep static off of the robot. Please be sure to spray your robot before an event and not during the event.
es_mx: Staticide es un spray que ayuda a mantener la estática fuera del robot. Por favor, asegúrese de rociar su robot antes de un evento y no durante el evento.
fr_ca: Staticide est un spray qui permet d'éviter l'électricité statique sur le robot. Veillez à vaporiser votre robot avant l'événement et non pendant.
zh_cn: Staticide 是一种喷雾剂，有助于防止机器人产生静电。请确保在比赛前而不是比赛中对机器人进行喷洒。

source: Common causes of static
es_mx: Causas comunes de estática
fr_ca: Causes courantes de l'électricité statique
zh_cn: 静电的常见原因

source: Every single contact point of your robot to the floor will increase the amount of static buildup.
es_mx: Cada punto de contacto de tu robot con el piso aumentará la acumulación de estática.
fr_ca: Chaque point de contact de votre robot avec le sol augmente l'accumulation d'électricité statique.
zh_cn: 机器人与地面的每一个接触点都会增加静电积聚量。

source: Too much turning scrub (or traction when wheels try to turn). This is possible if a 4WD or 6WD (no center drop) with all traction wheels is used.
es_mx: Demasiado desgaste al girar (o tracción cuando las ruedas intentan girar). Esto es posible si se utiliza un 4WD o un 6WD (sin caída central) con todas las ruedas de tracción.
fr_ca: Trop d'adhérence en virage (ou de traction lorsque les roues essaient de tourner). Cela est possible si l'on utilise un véhicule à 4 ou 6 roues motrices (sans déport central) avec toutes les roues motrices.
zh_cn: 转弯擦痕过大（或车轮试图转弯时牵引力过大）。如果使用的是四轮驱动或六轮驱动（无中心点下降），且所有车轮都有牵引力，就有可能出现这种情况。

source: A conductive part dragging along the ground. For example, try not to have an intake touch the ground when the robot is moving as much as possible. Foam wheels and foam rollers are a common culprit.
es_mx: Una parte conductora arrastrándose por el suelo. Por ejemplo, trata de evitar que el intake toque el suelo cuando el robot se esté moviendo tanto como sea posible. Las ruedas de espuma y los rodillos de espuma son un culpable común.
fr_ca: Une partie conductrice qui traîne sur le sol. Par exemple, il faut éviter autant que possible qu'une prise touche le sol lorsque le robot est en mouvement. Les roues en mousse et les rouleaux en mousse sont des coupables fréquents.
zh_cn: 沿地面拖动的导电部件。例如，当机器人移动时，尽量不要让进气口接触地面。泡沫轮和泡沫滚筒是常见的罪魁祸首。
