Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/wiring.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Wiring Guide
es_mx: Guía de cableado
fr_ca: Guide de Câblage
ro_ro: Ghid de Cablare
zh_cn: 布线指南

source: Why does wiring matter?
es_mx: ¿Por qué es importante el cableado?
fr_ca: Pourquoi le câblage est-il important ?
ro_ro: De ce contează cablarea?
zh_cn: 为什么布线很重要？

source: Have you ever looked inside your robot and thought "what a mess of wires"? Wiring is extremely important in FTC\ |reg|, but is often overlooked or hastily done the hour before competition starts. However, time spent in wiring the robot properly is crucial to the performance and maintenance of the robot.
es_mx: ¿Alguna vez has mirado dentro de tu robot y pensado "¡qué desorden de cables"? El cableado es extremadamente importante en FTC\ |reg|, pero a menudo se pasa por alto o se hace apresuradamente una hora antes de que comience la competencia. Sin embargo, el tiempo invertido en cablear correctamente el robot es crucial para el rendimiento y mantenimiento del robot.
fr_ca: Avez-vous déjà regardé à l'intérieur de votre robot en vous disant "quel fouillis de fils" ? Le câblage est extrêmement important en FTC\ |reg|, mais il est souvent négligé ou fait à la hâte dans l'heure qui précède le début de la compétition. Pourtant, le temps passé à câbler correctement le robot est crucial pour les performances et la maintenance du robot.
zh_cn: 您是否有过这样的经历：看着自己的机器人，心想 "电线真乱"？布线在 FTC\ |reg| 中极为重要，但往往被忽视或在比赛开始前一小时匆忙完成。然而，正确布线对机器人的性能和维护至关重要。

source: It is highly discouraged for teams to overlook wiring, but many new teams seem to disregard it or put little thought into wiring the robot properly.
es_mx: Es muy desalentador que los equipos pasen por alto el cableado, pero muchos equipos nuevos parecen ignorarlo o darle poco pensamiento a cablear correctamente el robot.
fr_ca: Il est fortement déconseillé aux équipes de négliger le câblage, mais de nombreuses nouvelles équipes semblent ne pas en tenir compte ou ne pas se préoccuper du câblage du robot.
ro_ro: Nu este recomandat ca echipele să treacă cu vederea cablarea, dar multe echipe noi par să nu țină cont de acest lucru sau să se gândească prea puțin la cablarea corectă a robotului.
zh_cn: 我们非常不建议参赛队忽视布线工作，但许多新参赛队似乎忽视了这一点，或者很少考虑如何为机器人正确布线。

source: While tedious and often no fun, wiring can mean the difference between a win and loss. The best robot in the world won't be able to work if a wire is loose or gets tangled up in the middle of a match. Thus it is imperative that wiring is purposefully thought out when designing and building a robot.
es_mx: Aunque tedioso y a menudo no divertido, el cableado puede significar la diferencia entre una victoria y una derrota. El mejor robot del mundo no podrá funcionar si un cable está suelto o se enreda en medio de una partida. Por lo tanto, es imperativo que el cableado se planifique cuidadosamente al diseñar y construir un robot.
fr_ca: Bien que fastidieux et souvent peu amusant, le câblage peut faire la différence entre une victoire et une défaite. Le meilleur robot du monde ne pourra pas fonctionner si un fil se détache ou s'emmêle au milieu d'un match. Il est donc impératif que le câblage soit bien pensé lors de la conception et de la construction d'un robot.
ro_ro: Deși obositoare și adesea deloc plăcute, cablurile pot face diferența dintre o victorie și o pierdere. Cel mai bun robot din lume nu va putea funcționa dacă un fir este slăbit sau se încurcă în mijlocul unui meci. Astfel, este obligatoriu ca cablarea să fie gândită în mod intenționat atunci când se proiectează și se construiește un robot.
zh_cn: 布线工作虽然繁琐，而且往往毫无乐趣可言，但却能决定胜负。如果在比赛中电线松动或被缠住，再好的机器人也无法工作。因此，在设计和制造机器人时，必须有目的地考虑布线问题。

source: *FIRST*\ |reg| FTC Wiring Guide
es_mx: *FIRST*\ |reg| Guía de cableado de FTC
fr_ca: Guide de Câblage *FIRST*\ |reg| FTC
ro_ro: *FIRST*\ |reg| Ghid de Cablare FTC
zh_cn: *FIRST*\ |reg| FTC 接线指南

source: *FIRST*\ |reg| has created a wiring guide to help teams with tasks like crimping cables, soldering connections, and ESD mitigation that won't be covered in this guide. Once you read up on electronics and wiring here, look at the `FTC Wiring Guide <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/robot-wiring-guide.pdf>`_ for the best practices and more tips & tricks. In addition, *FIRST* has written an `ESD Mitigation Whitepaper <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/analysis-esd-mitigation-echin.pdf>`_ that is worth taking a look at.
fr_ca: *FIRST* a créé un guide de câblage pour aider les équipes dans des tâches telles que le sertissage des câbles, la soudure des connexions et l'atténuation des décharges électrostatiques ou ESD, qui ne seront pas abordées dans ce guide. Une fois que vous vous serez familiarisé avec l'électronique et le câblage, consultez le `Guide de câblage de la FTC <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/robot-wiring-guide.pdf>`_ pour connaître les meilleures pratiques et obtenir davantage de conseils et d'astuces. En outre, *FIRST* a rédigé un "Livre blanc sur l'atténuation des ESD" <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/analysis-esd-mitigation-echin.pdf>`_ qui vaut la peine d'être consulté.
zh_cn: *FIRST*\ |reg| 已创建了一个布线指南，以帮助团队完成本指南未涉及的压接电缆、焊接连接和防静电等任务。当您在这里阅读了电子和布线方面的知识后，请查看 "FTC 布线指南 <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/robot-wiring-guide.pdf>`_"，了解最佳实践和更多技巧。此外，*FIRST*还撰写了 ` ESD缓解白皮书 <https://www.firstinspires.org/sites/default/files/uploads/resource_library/ftc/analysis-esd-mitigation-echin.pdf>`_ ，值得一看。

source: General Advice
es_mx: Consejos generales
fr_ca: Conseils généraux
ro_ro: Sfaturi Generale
zh_cn: 一般建议

source: **Always label wires! When bunched up, you may not know which wire goes into which port**.
es_mx: **¡Siempre etiqueta los cables! Cuando están agrupados, es posible que no sepas qué cable va en qué puerto**.
fr_ca: **Toujours étiqueter les fils ! Lorsqu'ils sont regroupés, vous risquez de ne pas savoir quel fil va dans quel port**.
ro_ro: **Întotdeauna etichetați firele! Când sunt adunate la un loc este posibil sa nu știti ce fir intră în ce port**.
zh_cn: **一定要给电线贴上标签！当电线捆绑在一起时，您可能不知道哪根电线通向哪个端口**。

source: Tie together loose wires, and better yet, tie that bunch of wires to a structural component. This will ensure that wires don't interfere with your mechanisms.
es_mx: Amarra los cables sueltos, y aún mejor, amarra ese montón de cables a un componente estructural. Esto asegurará que los cables no interfieran con tus mecanismos.
fr_ca: Attachez les fils détachés et, mieux encore, attachez ces fils à un élément structurel. Vous vous assurerez ainsi que les fils n'interfèrent pas avec vos mécanismes.
ro_ro: Legați firele libere și, mai bine, legați acele fire de o componentă structurală. Acest lucru va asigură că firele nu interferează cu mecanismele voastre.
zh_cn: 将松散的电线绑在一起，最好是将这些电线绑在结构部件上。这将确保电线不会干扰你的装置。

source: **Pay attention to port numbers!** The rev hub will often have multiple ports per connector on the REV hub. `REV has a pinout guide to avoid confusion <https://docs.revrobotics.com/duo-control/control-system-overview/port-pinouts>`_.
es_mx: **¡Presta atención a los números de puerto!** El REV hub a menudo tendrá múltiples puertos por conector en el REV hub. `REV tiene una guía del esquema de conexiones para evitar confusiones <https://docs.revrobotics.com/duo-control/control-system-overview/port-pinouts>`_.
fr_ca: **Faites attention aux numéros de port !**Le hub REV a souvent plusieurs ports par connecteur sur le hub REV. `REV a un guide de brochage pour éviter toute confusion <https://docs.revrobotics.com/duo-control/control-system-overview/port-pinouts>`_.
ro_ro: **Atenție la numărul de porturi!** Adesea, hub-ul REV va avea mai multe porturi pentru fiecare conector de pe hub-ul REV. `REV are un ghid de pinout pentru a evita confuzia <https://docs.revrobotics.com/duo-control/control-system-overview/port-pinouts>`_.
zh_cn: **注意端口号！** REV 集线器上的每个连接器通常会有多个端口。`REV 有一个引脚分配指南，以避免混淆 <https://docs.revrobotics.com/duo-control/control-system-overview/port-pinouts>`_。

source: **Treat every wire connection as a point of failure**. Therefore, use electrical tape to tape up and insulate connections and utilize strain relief as much as possible.
es_mx: **Trata cada conexión de cable como un punto de falla**. Por lo tanto, utiliza cinta eléctrica para envolver e aislar las conexiones y utiliza alivio de tensión tanto como sea posible.
fr_ca: **Traitez chaque connexion de fil comme un point de défaillance**. Par conséquent, utilisez du ruban isolant pour sécuriser et isoler les connexions, et utilisez des dispositifs de protection contre les tensions autant que possible.
ro_ro: **Tratați fiecare conexiune de cabluri ca pe un punct de defecțiune**. Prin urmare, folosiți bandă adezivă electrică pentru a lipi și izola conexiunile și reduceți cât mai mult posibil tensionarea cablurilor.
zh_cn: **将每个电线连接都视为可能故障的点**。因此，应使用电工胶带粘贴和绝缘连接，并尽可能使用应力消除装置。

source: **Strain relief** should be used everywhere possible. It is highly recommended for teams to use products like the :term:`REV USB Retention Mount <USB Retention Mount>`, as well as 3D printing strain relief methods for devices such as the Expansion Hub and robot controller phones.
es_mx: **El alivio de tensión** debe utilizarse en todas partes posible. Se recomienda encarecidamente que los equipos utilicen productos como el :term:`REV Montaje de retención USB <USB Retention Mount>`, así como métodos de alivio de tensión de impresión 3D para dispositivos como el Expansion Hub y los teléfonos controladores de robots.
fr_ca: **La décharge de traction** doit être utilisée partout où c'est possible. Il est fortement recommandé aux équipes d'utiliser des produits tels que le :term:`REV USB Retention Mount <USB Retention Mount>`, ainsi que des méthodes de décharge de traction par impression 3D pour des dispositifs tels que l'Expansion Hub et les téléphones des contrôleurs de robot.
zh_cn: **应尽可能在所有地方使用应力消除**。强烈建议参赛团队使用 :term:`REV USB 固定安装 <USB Retention Mount>` 等产品，以及 3D 打印应力消除方法，用于扩展集线器和机器人控制器电话等设备。

source: **DO NOT solder a wire before crimping it**. Solder can "creep" and losing connection is possible, possibly leading to fire.
es_mx: **NO suelde un cable antes de engarzarlo**. La soldadura puede "deslizarse" y es posible perder la conexión, lo que podría provocar un incendio.
fr_ca: **NE PAS souder un fil avant de le sertir**. La soudure peut "se faufiler" et la perte de connexion est possible, ce qui peut provoquer un incendie.
ro_ro: ** NU sudați un fir înainte de a-l prinde**. Sudura se poate "strecura" și este posibilă pierderea conexiunii, ceea ce poate duce la incendiu.
zh_cn: **在压接导线之前切勿焊接导线**。焊锡会 "蠕变"，可能会失去连接，并可能导致火灾。

source: **Keep all wire runs as short as possible** to prevent entanglement and improve wire management.
es_mx: **Mantenga todas las conexiones de cables lo más cortas posible** para evitar enredos y mejorar la gestión de cables.
fr_ca: **Gardez tous les fils aussi courts que possible** pour éviter les enchevêtrements et améliorer la gestion des fils.
ro_ro: **Păstrați toate firele cât mai scurte posibil** pentru a preveni încurcarea și pentru a îmbunătăți gestionarea firelor.
zh_cn: **尽可能缩短所有电线的长度**，以防止电线缠绕并改善电线管理。

source: **When using data/sensor cables, keep them away from motors.** This will reduce electromagnetic interference (EMI). Add a ferrite bead if possible.
es_mx: **Cuando se utilizan cables de datos/sensores, manténgalos alejados de los motores.** Esto reducirá la interferencia electromagnética (EMI). Agregue un núcleo de ferrita si es posible.
fr_ca: **Lorsque vous utilisez des câbles de données/capteurs, éloignez-les des moteurs** afin de réduire les interférences électromagnétiques (EMI). Ajoutez une perle de ferrite si possible.
ro_ro: **Când folosiți cabluri de date/senzor, țineți-le departe de motoare.** Acest lucru va reduce interferențele electromagnetice (EMI). Adăugați o perlă de ferită dacă este posibil.
zh_cn: **使用数据/传感器电缆时，应使其远离电机。** 这将减少电磁干扰 (EMI)。如有可能，请添加一个铁氧体磁珠。

source: **Crimped connectors are generally better than soldered connectors**, as solder joints can break easier than a crimped connection.
es_mx: **Los conectores engarzados son generalmente mejores que los conectores soldados**, ya que las uniones soldadas pueden romperse más fácilmente que una conexión engarzada.
fr_ca: **Les connecteurs sertis sont généralement préférables aux connecteurs soudés**, car les soudures se cassent plus facilement que les connexions serties.
ro_ro: **Conectorii sertizați sunt, în general, mai buni decât conectorii sudați**, deoarece îmbinările prin lipire se pot defecta mai ușor decât o conexiune strânsă.
zh_cn: **压接连接器通常比焊接连接器**好，因为焊点比压接连接更容易断裂。

source: **Keep wires tucked away from moving mechanisms,** and ensure that you will not be at risk of a mechanism snagging a wire. This is a proper application of materials such as acrylic, which allow drivers to see inside the robot while keeping wires out of the way of other robots/game pieces. It is advised for teams to purchase removable velcro ties or cable ties to aid with cable management.
es_mx: **Mantén los cables alejados de los mecanismos en movimiento,** y asegúrate de no correr el riesgo de que un mecanismo enganche un cable. Esta es una aplicación adecuada de materiales como el acrílico, que permite a los conductores del robot ver dentro del robot mientras mantiene los cables fuera del alcance de otros robots/piezas de juego. Se recomienda que los equipos adquieran sujetadores de velcro removibles o bridas/cinchos para ayudar con la gestión de cables.
fr_ca: **Gardez les fils à l'écart des mécanismes en mouvement,** et assurez-vous que vous ne risquez pas qu'un mécanisme accroche un fil. Il s'agit d'une application appropriée de matériaux tels que l'acrylique, qui permet aux pilotes de voir à l'intérieur du robot tout en gardant les fils à l'écart des autres robots/pièces de jeu. Il est conseillé aux équipes d'acheter des attaches velcro amovibles ou des serre-câbles pour faciliter la gestion des câbles.
ro_ro: ** Țineți firele la distanță de mecanismele în mișcare** și asigurați-vă că nu există riscul ca un mecanism să agațe un fir. Aceasta este o aplicare adecvată a unor materiale precum acrilicul, care permit driver-ilor să vadă în interiorul robotului, păstrând în același timp firele la distanță față de alți roboți/piese de joc. Se recomandă ca echipele să achiziționeze legături detașabile din velcro sau coliere de cablu pentru a ajuta la gestionarea cablurilor.
zh_cn: **确保电线远离移动的机械装置，**并确保不会出现机械装置卡住电线的危险。这是亚克力等材料的正确应用，既能让驾驶员看到机器人内部，又能使电线远离其他机器人/游戏部件。建议参赛队购买可拆卸的魔术贴绑带或电缆绑带来帮助管理电缆。

source: **For power wires, lower** :term:`gauge <Gauge>` **(larger size) wires are preferable.** This means a lower resistance across the wire and higher power throughput. This is negligible for data wires, however.
es_mx: **Para los cables de alimentación, es preferible utilizar cables de :term:`calibre <Gauge>` más bajo (mayor tamaño)**. Esto significa una resistencia más baja a través del cable y un mayor flujo de energía. Sin embargo, esto es insignificante para los cables de datos.
fr_ca: **Pour les fils de puissance, il est préférable d'utiliser des fils de faible** :terme:`gauge <Gauge>` **(de plus grande taille).** Cela signifie que la résistance à travers le fil est plus faible et que le débit de puissance est plus élevé. Cet aspect est toutefois négligeable pour les fils de données.
ro_ro: **Pentru firele de alimentare, sunt de preferat firele de :termen:`calibru<Gauge>` mai mic (dimensiuni mai mari).** Aceasta înseamnă o rezistență mai mică pe fir și o putere mai mare de trecere. Totuși, acest lucru este neglijabil pentru firele de date.
zh_cn: **对于电源线，最好使用较低** :term:`gauge <Gauge>`**（较大尺寸）的导线。**这意味着导线上的电阻较低，功率吞吐量较高。不过，这对数据线来说微不足道。

source: **Small wires and cables are fragile.** Treat them as such, and don't put them in an area where they will constantly be hit by another object. Larger power cables can take much more abuse.
es_mx: **Los cables y alambres pequeños son frágiles.** Trátalos como tal y no los coloques en un área donde constantemente sean golpeados por otro objeto. Los cables de alimentación más grandes pueden resistir mucho más abuso.
fr_ca: **Les petits fils et câbles sont fragiles.**Traitez-les comme tels et ne les placez pas dans un endroit où ils seront constamment heurtés par un autre objet. Les câbles d'alimentation de plus grande taille peuvent être beaucoup plus sollicités.
zh_cn: **小电线和电缆很容易损坏。**请将它们视为易损坏的物品，不要将它们放在经常会被其他物体撞击的地方。较大的电源线可以承受更多的磨损。

source: **Ensure that your wires are kept out of pinch points** where another mechanism could sandwich the wire. This is especially important in arms or mechanisms that are hinged.
es_mx: **Asegúrese de que sus cables se mantengan alejados de los puntos de pellizco** donde otro mecanismo pueda atrapar el cable. Esto es especialmente importante en brazos o mecanismos articulados.
fr_ca: **Veillez à ce que vos fils ne soient pas coincés dans des points de pincement** où un autre mécanisme pourrait les prendre en sandwich. Ceci est particulièrement important pour les bras ou les mécanismes articulés.
ro_ro: **Asigură-te că firele sunt ținute departe de punctele de ciupire**, unde un alt mecanism ar putea duce firul în contact. Acest lucru este deosebit de important în cazul brațelor sau al mecanismelor care sunt articulate.
zh_cn: **确保电线远离夹点**，因为其他机械装置可能会夹住电线。这一点对于铰链式机械臂或机械装置尤为重要。

source: An example of poor wiring
es_mx: Un ejemplo de mala instalación eléctrica
fr_ca: Un exemple de mauvais câblage
ro_ro: Un exemplu de cablare slabă
zh_cn: 差的布线示例

source: Bad example of wiring!
es_mx: ¡Mal ejemplo de cableado!
fr_ca: Mauvais exemple de câblage !
ro_ro: Exemplu prost de cablare!
zh_cn: 很差的布线示例！

source: An example of good wiring by 731
es_mx: Un ejemplo de buena conexión eléctrica por 731
fr_ca: Un exemple de bon câblage par 731
zh_cn: 队伍731 的良好布线范例

source: Good example of wiring by 731 Wannabee Strange, Rover Ruckus
es_mx: Buen ejemplo de cableado por 731 Wannabee Strange, Rover Ruckus
fr_ca: Bon exemple de câblage par 731 Wannabee Strange, Rover Ruckus
zh_cn: 731 Wannabee Strange、Rover Ruckus 的布线典范

source: An example of good wiring by 8417
es_mx: Un ejemplo de buena conexión eléctrica por 8417
fr_ca: Un exemple de bon câblage par 8417
zh_cn: 队伍·8417 的良好布线范例

source: Good example of wiring by 8417 'Lectric Legends
es_mx: Buen ejemplo de cableado por 8417 'Lectric Legends
fr_ca: Bon exemple de câblage par 8417 'Lectric Legends
zh_cn: 队伍·8417'Lectric传奇'的良好布线范例

source: An example of good wiring by 7244
es_mx: Un ejemplo de buena conexión eléctrica por 7244
fr_ca: Un exemple de bon câblage par 7244
zh_cn: 队伍·7244 的良好布线示例

source: Good example of wiring by 7244 Out of the Box Robotics
es_mx: Buen ejemplo de cableado por 7244 Out of the Box Robotics
fr_ca: Bon exemple de câblage par 7244 Out of the Box Robotics
zh_cn: 好的示例，由队伍7244 Out of the Box Robotics进行布线

source: When wiring, also take the time to plan out a specific layout for your wires and how they will run throughout the robot. Take the time to lay out something like an electronics panel if necessary! When building the robot, devote adequate space to wiring. This could mean mounting a PVC pipe and running wires from the back end of the robot through it, or simply using velcro or zipties.
es_mx: Cuando hagas la instalación eléctrica, también tómate el tiempo para planificar un diseño específico para tus cables y cómo se distribuirán por todo el robot. Dedica el tiempo necesario para organizar algo como un panel electrónico si es necesario. Al construir el robot, destina un espacio adecuado para la instalación eléctrica. Esto podría significar montar un tubo de PVC y hacer pasar los cables desde la parte trasera del robot a través de él, o simplemente usar velcro o sujetadores de plástico.
fr_ca: Lors du câblage, prenez également le temps de planifier une disposition spécifique pour vos câbles et la façon dont ils seront répartis dans le robot. Prenez le temps de dessiner un panneau électronique si nécessaire ! Lors de la construction du robot, prévoyez un espace suffisant pour le câblage. Il peut s'agir de monter un tuyau en PVC et de faire passer les fils de l'arrière du robot à travers ce tuyau, ou simplement d'utiliser du velcro ou des fermetures à glissière.
zh_cn: 布线时，也要花时间规划出电线的具体布局，以及它们将如何贯穿整个机器人。如果有必要，还可以花时间布置类似电子面板的东西！在制作机器人时，要为布线留出足够的空间。这可能意味着要安装一个 PVC 管，然后从机器人的后端穿线，或者干脆使用尼龙搭扣或拉链。

source: Make sure that wires are as short as possible to reduce the risk of entanglement.
es_mx: Asegúrese de que los cables sean lo más cortos posible para reducir el riesgo de enredos.
fr_ca: Veillez à ce que les fils soient aussi courts que possible afin de réduire le risque d'enchevêtrement.
zh_cn: 尽量确保电线尽可能短，以减少缠绕的风险。

source: However, as components move out of the robot, the wires move with it. Tying down every loose inch will result in wire disconnecting. Wiring is the art of finding the perfect balance between shortest length and allowing enough freedom as mechanisms need.
es_mx: Sin embargo, a medida que los componentes se mueven fuera del robot, los cables se mueven con él. Atar cada pulgada suelta resultará en la desconexión del cable. El cableado es el arte de encontrar el equilibrio perfecto entre la longitud más corta y permitir la suficiente libertad que los mecanismos necesitan.
fr_ca: Cependant, lorsque les composants sont retirés du robot, les fils se déplacent avec eux. Si vous attachez le moindre fil, vous risquez de le déconnecter. Le câblage est l'art de trouver l'équilibre parfait entre la longueur la plus courte et une liberté suffisante pour répondre aux besoins des mécanismes.
zh_cn: 然而，随着组件移出机器人，电线也会随之移动。将每一寸松散的电线束缚住将导致电线脱离连接。布线是在最短长度和允许机械部件需要足够自由的之间找到完美平衡的艺术。

source: **It is also recommended for electronics to be mounted on a nonconductive material such as wood to prevent ESD**.
es_mx: **También se recomienda que los dispositivos electrónicos se monten sobre un material no conductor, como la madera, para prevenir la ESD**.
fr_ca: **Il est également recommandé de monter les appareils électroniques sur un matériau non-conducteur tel que le bois pour éviter les décharges électrostatiques ou ESD**.
zh_cn: **我们建议将电子设备安装在非导电材料上，如木材，以防止静电放电。**

source: An example of good wiring on a non-conductive surface by 3736
es_mx: Un ejemplo de buena conexión eléctrica en una superficie no conductora por 3736
fr_ca: Un exemple de bon câblage sur une surface non conductrice par 3736
zh_cn: 一个在非导电表面上进行良好布线的例子，由3736提供。

source: Specific Recommendations
es_mx: Recomendaciones específicas
fr_ca: Recommandations spécifiques
zh_cn: 具体建议

source: Module Power
es_mx: Módulo de energía
fr_ca: Puissance du module
zh_cn: 模块电源
