Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/concepts/control-loops.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Control Loops
es_mx: Bucles de control
fr_ca: Boucles de contrôle
ro_ro: Buclele de Control
zh_cn: 控制回路

source: Control loops are software used to operate power transmission systems (such as a drivetrain or linear slide) in a fast and controlled fashion. Not only do control loops let you run mechanisms quickly without fear of losing control, in many cases, they help preserve the longevity of mechanisms by reducing rapid change of applied motor voltage.
es_mx: Los bucles de control son programas informáticos que se utilizan para accionar sistemas de transmisión de potencia (como un chasis o un deslizador lineal) de forma rápida y controlada. Los bucles de control no solo permiten accionar mecanismos con rapidez sin temor a perder el control, sino que, en muchos casos, ayudan a preservar la longevidad de los mecanismos al reducir los cambios rápidos de la tensión aplicada al motor.
fr_ca: Les boucles de contrôle sont des logiciels utilisés pour faire fonctionner des systèmes de transmission de puissance (tels qu'un châssis ou un chariot linéaire) de manière rapide et contrôlée. Non seulement les boucles de contrôle vous permettent de faire fonctionner des mécanismes rapidement sans craindre de perdre le contrôle, mais dans de nombreux cas, elles contribuent à préserver la longévité des mécanismes en réduisant les changements rapides de la tension appliquée au moteur.
ro_ro: Buclele de control sunt funcții folosite pentru a opera sisteme de transmisii (precum șasiuri sau glisiere liniare) într-o manieră rapidă și controlată. Nu numai buclele de control îți permit să rulezi mecanisme rapid fără frica de a pierde controlul, însă în multe cazuri, prezervă fiabilitatea mecanismelor prin reducerea schimbărilor rapide în tensiunea aplicată motorului.
zh_cn: 控制回路是用于快速、可控地运行动力传输系统（如传动系统或线性滑轨）的软件。控制回路不仅能让您快速运行机械装置而不必担心失控，而且在许多情况下，它们还能通过减少外加电机电压的快速变化来延长机械装置的使用寿命。

source: What is Error?
es_mx: ¿Qué es un Error?
fr_ca: Qu'est-ce qu'une erreur ?
ro_ro: Ce este Eroarea?
zh_cn: 什么是误差？

source: The first thing that must be defined when discussing control loops is the concept of error.
es_mx: Lo primero que hay que definir cuando se habla de bucles de control es el concepto de error.
fr_ca: La première chose à définir lorsque l'on parle de boucles de contrôle est le concept d'erreur.
ro_ro: Primul lucru care trebuie definit când lucrezi cu buclele de control este conceptul erorii.
zh_cn: 在讨论控制回路时，首先必须定义误差的概念。

source: Error is defined as the difference between where you are and where you want to be. For instance, say you tell your drivetrain to drive at 30 inches per second, but in actuality, at a time, the drivetrain is driving at 28 inches per second. Since :math:`30-28=2`, the error of the drivetrain's speed at this time :math:`T` is 2 inches per second. In other words, at a time :math:`t=T`, :math:`e(t)=2`.
es_mx: El error se define como la diferencia entre donde estás y donde quieres estar. Por ejemplo, digamos que le dices a tu chasis que conduzca a 30 pulgadas por segundo, pero en realidad, en un momento dado, el chasis está conduciendo a 28 pulgadas por segundo. Como :math:`30-28=2`, el error de la velocidad del chasis en ese momento :math:`T` es de 2 pulgadas por segundo. En otras palabras, en un tiempo :math:e`t=T`, :math:`e(t)=2`.
fr_ca: L'erreur est définie comme la différence entre l'endroit où vous êtes et l'endroit où vous voulez être. Par exemple, supposons que vous demandiez à votre châssis de rouler à une vitesse de 30 pouces par seconde, mais qu'en réalité, à un moment donné, le châssis roule à une vitesse de 28 pouces par seconde. Puisque :math:`30-28=2`, l'erreur de vitesse de la transmission à ce moment :math:`T` est de 2 pouces par seconde. En d'autres termes, à un moment :math:`t=T`, :math:`e(t)=2`.
zh_cn: 误差的定义是您所处的位置与您希望达到的位置之间的差值。例如，您告诉您的动力传动系统以每秒 30 英寸的速度行驶，但实际上，动力传动系统以每秒 28 英寸的速度行驶。由于 :math:`30-28=2`，:math:`T` 时刻传动系统的速度误差为每秒 2 英寸。换句话说，在 :math:`t=T` 时，:math:`e(t)=2`。

source: A PID controller (or Proportional Integral Derivative controller) is a control loop that solely uses error to control the system. PID is a form of a **feedback control loop**, or **closed loop control**. This means that data about the variable you are controlling is required in order for the loop to control that variable. In this case, information about the **error** of the system is required to control the system with a PID controller.
es_mx: Un controlador PID (o controlador Proporcional Integral Derivativo) es un lazo de control que utiliza únicamente el error para controlar el sistema. PID es una forma de **lazo de control de realimentación**, o **control de lazo cerrado**. Esto significa que se necesitan datos sobre la variable que se está controlando para que el lazo controle esa variable. En este caso, se requiere información sobre el **error** del sistema para controlar el sistema con un controlador PID.
fr_ca: Un contrôleur PID (ou contrôleur proportionnel intégral dérivé) est une boucle de contrôle qui utilise uniquement l'erreur pour contrôler le système. Le PID est une forme de **boucle de contrôle à rétroaction**, ou **commande en boucle fermée**. Cela signifie que des données sur la variable que vous contrôlez sont nécessaires pour que la boucle contrôle cette variable. Dans ce cas, des informations sur l'**erreur** du système sont nécessaires pour contrôler le système à l'aide d'un contrôleur PID.
ro_ro: Un controller PID (sau controller cu Derivată Integrală Proporțională) este o buclă de control care se folosește de eroare pentru a controla sistemul. PID este o formă de **buclă de control bazată pe feedback**, sau o **bucla de control închisă**. Aceasta înseamnă ca datele în legatură cu variabila pe care o controlezi sunt necesare pentru ca bucla de control să corecteze acea variabilă. În acest caz, informații despre **eroarea** sistemului sunt necesare pentru a controla sistemul cu un controller PID.
zh_cn: PID 控制器（或称比例积分微分控制器）是一种仅利用误差来控制系统的控制回路。PID 是**反馈控制回路**或**闭环控制**的一种形式。这意味着，为了让环路控制该变量，需要关于所控制变量的数据。在这种情况下，要使用 PID 控制器对系统进行控制，就需要有关系统**误差**的信息。

source: The Optional Calculus
es_mx: El cálculo opcional
fr_ca: Le calcul optionnel
ro_ro: Calculele Opționale
zh_cn: 可选微积分

source: The following equation represents the rigorous mathematical definition of the output of a PID controller :math:`f` at any given time :math:`t`:
es_mx: La siguiente ecuación representa la definición matemática rigurosa de la salida de un controlador PID :math:`f` en cualquier tiempo :math:`t`:
fr_ca: L'équation suivante représente la définition mathématique rigoureuse de la sortie d'un contrôleur PID :math:`f` à un moment donné :math:`t` :
ro_ro: Următoarea ecuație reprezintă definiția matematică riguroasă a ieșirii unui controller PID :math:`f` la orice timp dat :math:`t`:
zh_cn: 下式表示 PID 控制器 :math:`f` 在任何给定时间 :math:`t` 的输出的严格数学定义：

source: where :math:`K_p`, :math:`K_i`, and :math:`K_d` are constants and :math:`e(t)`, as previously mentioned, is the error in the system.
es_mx: donde :math:`K_p`, :math:`K_i` y :math:`K_d` son constantes y :math:`e(t)`, como ya se ha dicho, es el error del sistema.
fr_ca: où :math:`K_p`, :math:`K_i`, et :math:`K_d` sont des constantes et :math:`e(t)`, comme indiqué précédemment, est l'erreur dans le système.
ro_ro: unde :math:`K_p`, :math:`K_i`, and :math:`K_d` sunt constante iar :math:`e(t)`, menționat anterior, este eroarea sistemului.
zh_cn: 其中 :math:`K_p`、:math:`K_i` 和 :math:`K_d` 为常数，:math:`e(t)` 如前所述，为系统误差。

source: If you have no experience with calculus, don't worry; while PID is fundamentally rooted in calculus, you do not need any calculus experience to be able to understand it, only basic algebra. However, you are still urged to read the rest of the section regardless of calculus experience, as the formula alone doesn't tell you why it works.
es_mx: Si no tiene experiencia con el cálculo, no se preocupe; aunque el PID tiene sus raíces fundamentalmente en el cálculo, no necesita ninguna experiencia en cálculo para poder entenderlo, sólo álgebra básica. Sin embargo, te recomendamos que leas el resto de la sección independientemente de tu experiencia con el cálculo, ya que la fórmula por sí sola no te explica por qué funciona.
fr_ca: Si vous n'avez aucune expérience en calcul, ne vous inquiétez pas ; bien que le PID soit fondamentalement ancré dans le calcul, vous n'avez besoin d'aucune expérience en calcul pour pouvoir le comprendre, mais seulement d'une connaissance de base de l'algèbre. Cependant, nous vous conseillons vivement de lire le reste de la section, même si vous n'avez pas d'expérience en calcul, car la formule seule ne vous explique pas pourquoi elle fonctionne.
zh_cn: 如果你没有微积分的经验，不要担心；虽然PID从根本上植根于微积分，但你不需要任何微积分经验就能理解它，只需要基本的代数。然而，不管微积分经验如何，你仍然被敦促阅读本节的其余部分，因为仅靠公式并不能告诉你它为什么有效。

source: Simplification of the PID formula
es_mx: Simplificación de la fórmula PID
fr_ca: Simplification de la formule PID
ro_ro: Simplificarea Formulei PID
zh_cn: 简化 PID 公式

source: Here is a simplified version of the PID formula: :math:`f(t)=K_p P(t)+K_i I(t)+K_d D(t)`
es_mx: He aquí una versión simplificada de la fórmula PID: :math:`f(t)=K_p P(t)+K_i I(t)+K_d D(t)`
fr_ca: Voici une version simplifiée de la formule PID : :math:`f(t)=K_p P(t)+K_i I(t)+K_d D(t)`
ro_ro: Aici este o variantă simplificată a formulei PID: :math:`f(t)=K_p P(t)+K_i I(t)+K_d D(t)`
zh_cn: 以下是 PID 公式的简化版本：:math:`f(t)=K_p P(t)+K_i I(t)+K_d D(t)`

source: All we have done is simply take the full formula and replaced part of the terms with functions: :math:`P(t)`, :math:`I(t)`, and :math:`D(t)`.
es_mx: Todo lo que hemos hecho es simplemente tomar la fórmula completa y sustituir parte de los términos por funciones: :math:`P(t)`, :math:`I(t)`, y :math:`D(t)`.
fr_ca: Nous avons simplement pris la formule complète et remplacé une partie des termes par des fonctions : :math:`P(t)`, :math:`I(t)`, et :math:`D(t)`.
ro_ro: Tot ce am făcut este să luăm formula completă și să înlocuim partea de termeni cu funcții: :math:`P(t)`, :math:`I(t)`, and :math:`D(t)`.
zh_cn: 我们所做的只是简单地使用完整的公式，并将部分项替换为函数：:math:`P(t)`、:math:`I(t)` 和 :math:`D(t)`。

source: The Proportional Term
es_mx: El término proporcional
fr_ca: Le terme proportionnel
ro_ro: Termenul Proporțional
zh_cn: 比例项

source: The first component of the function, :math:`K_p P(t)`, is by far the most simple and easy to understand, as :math:`P(t) = e(t)`. For the sake of example, let's pretend that :math:`K_i=0` and :math:`K_d=0` (a PID controller with only a proportional constant is known as a **P controller**). How will the system behave? Well, if the error is large, the output will be large. Likewise, if the error is small, the output will be small. Also, ideally, given enough time, the system always approaches its destination, assuming :math:`K_p` is of the correct sign.
es_mx: El primer componente de la función, :math:`K_p P(t)`, es con diferencia el más sencillo y fácil de entender, ya que :math:`P(t) = e(t)`. Por poner un ejemplo, supongamos que :math:`K_i=0` y :math:`K_d=0` (un controlador PID con sólo una constante proporcional se conoce como controlador **P**). ¿Cómo se comportará el sistema? Pues bien, si el error es grande, la salida será grande. Del mismo modo, si el error es pequeño, la salida será pequeña. Además, idealmente, dado el tiempo suficiente, el sistema siempre se aproxima a su destino, suponiendo que :math:`K_p` sea del signo correcto.
fr_ca: La première composante de la fonction, :math:`K_p P(t)`, est de loin la plus simple et la plus facile à comprendre, car :math:`P(t) = e(t)`. Pour les besoins de l'exemple, supposons que :math:`K_i=0` et :math:`K_d=0` (un contrôleur PID avec seulement une constante proportionnelle est connu sous le nom de **contrôleur P**). Comment le système va-t-il se comporter ? Si l'erreur est importante, la sortie sera importante. De même, si l'erreur est faible, la sortie sera faible. Idéalement, avec suffisamment de temps, le système se rapproche toujours de sa destination, en supposant que :math:`K_p` soit du bon signe.
zh_cn: 函数的第一个分量 :math:`K_p P(t)` 是迄今为止最简单易懂的，因为 :math:`P(t) = e(t)`。举例来说，假设 :math:`K_i=0` 和 :math:`K_d=0` （只有比例常数的 PID 控制器称为 **P 控制器**）。系统将如何运行？如果误差大，输出就会大。同样，如果误差小，输出也会小。此外，在理想情况下，只要有足够的时间，假定 :math:`K_p` 的符号正确，系统总会接近目标。

source: Say we apply this to a drivetrain. You want to drive a distance :math:`D`, and you decide to set your motor powers using a P controller to accomplish this. In this case, your error is how far away the robot is from the desired location. As you start to drive forward, your error is large, so you drive forward quickly, which is desirable. After all, you aren't concerned with overshooting the target yet if you are far away from it.
es_mx: Digamos que aplicamos esto a un chasis. Quieres conducir una distancia :math:`D`, y decides ajustar las potencias de tus motores utilizando un controlador P para lograrlo. En este caso, tu error es la distancia a la que se encuentra el robot de la ubicación deseada. Cuando empiezas a avanzar, tu error es grande, por lo que avanzas rápidamente, lo cual es deseable. Después de todo, no estás preocupado por sobrepasar el objetivo si estás lejos de él.
fr_ca: Imaginons que nous appliquions cela à un châssis. Vous voulez parcourir une distance :math:`D`, et vous décidez de régler la puissance de vos moteurs à l'aide d'un contrôleur P. Dans ce cas, votre erreur est la distance qui sépare le robot de l'endroit désiré. Dans ce cas, votre erreur est la distance qui sépare le robot de l'endroit désiré. Lorsque vous commencez à avancer, votre erreur est importante et vous avancez rapidement, ce qui est souhaitable. Après tout, vous ne craignez pas de dépasser la cible si vous en êtes loin.
zh_cn: 假设我们将此应用于传动系统。您想行驶一段距离 :math:`D`，并决定使用 P 控制器设置电机功率来实现这一目标。在这种情况下，你的误差就是机器人距离目标位置的距离。当您开始向前行驶时，您的误差很大，因此您会快速向前行驶，这也是可取的。毕竟，如果距离目标较远，您还不用担心会超速。

source: But as the robot's distance to the target approaches 0, you will start to slow down, gaining more control over the robot. Once the error is zero, ideally, the robot will stop, and you have reached your destination. If you happen to overshoot, the error will become negative, and the robot will backtrack, repeating the process.
es_mx: Pero a medida que la distancia del robot al objetivo se acerque a 0, empezarás a reducir la velocidad, ganando más control sobre el robot. En el mejor de los casos, cuando el error sea cero, el robot se detendrá y habrás llegado a tu destino. Si te pasas, el error será negativo y el robot retrocederá, repitiendo el proceso.
fr_ca: Mais au fur et à mesure que la distance entre le robot et la cible se rapproche de 0, vous commencez à ralentir, ce qui vous permet de mieux contrôler le robot. Lorsque l'erreur est nulle, idéalement, le robot s'arrête et vous avez atteint votre destination. Si vous dépassez la cible, l'erreur devient négative et le robot revient sur ses pas, répétant le processus.
zh_cn: 但当机器人与目标的距离趋近于 0 时，您将开始减速，从而获得对机器人更多的控制权。理想情况下，一旦误差为零，机器人就会停下来，而你也就到达了目的地。如果碰巧超速，误差将变为负值，机器人将返回，重复上述过程。

source: The Derivative Term
es_mx: El término derivado
fr_ca: Le terme dérivé
ro_ro: Termenul Derivat
zh_cn: 微分项

source: This term, :math:`K_d D(t)`, is intended to dampen the rate of change of the error. In other words, it tries to keep the error constant. How is this done?
es_mx: Este término, :math:`K_d D(t)`, pretende amortiguar la tasa de cambio del error. En otras palabras, intenta mantener el error constante. ¿Cómo se consigue esto?
fr_ca: Ce terme, :math:`K_d D(t)`, est destiné à amortir le taux de variation de l'erreur. En d'autres termes, il tente de maintenir l'erreur constante. Comment cela se passe-t-il ?
ro_ro: Acest termen, :math:`K_d D(t)`, este intenționat să amelioreze rata de schimbare a erorii. În alte cuvinte, încearcă să țină eroarea constantă. Cum se face acest lucru?
zh_cn: 这个项 :math:`K_d D(t)` 的目的是抑制误差的变化率。换句话说，它试图保持误差不变。如何做到这一点呢？

source: Well, for those of you with calculus under your belt, :math:`D(t)=\frac{de(t)}{dt}`. For those without calculus experience, it represents how fast the error is changing. Graphically, :math:`D(t)` is simply the slope of the error at any given time :math:`t`.
es_mx: Bueno, para aquellos de ustedes con el cálculo en su haber, :math:`D(t)=\frac{de(t)}{dt}`. Para aquellos sin experiencia en cálculo, representa la rapidez con que el error está cambiando. Gráficamente, :math:`D(t)` es simplemente la pendiente del error en cualquier momento dado :math:`t`.
fr_ca: Eh bien, pour ceux d'entre vous qui savent calculer, :math:`D(t)=\frac{de(t)}{dt}`. Pour ceux qui n'ont pas d'expérience en calcul, cela représente la vitesse à laquelle l'erreur change. Graphiquement, :math:`D(t)` est simplement la pente de l'erreur à un moment donné :math:`t`.
ro_ro: Păi, pentru cei care au experiență în analiza matematică, :math:`D(t)=\frac{de(t)}{dt}`. Pentru cei fără experiență în analiza matematică, aceasta reprezintă cât de rapid se schimbă eroarea. Grafic, :math:`D(t)` este pur și simplu panta de eroare la orice timp dat :math:`t`.
zh_cn: 对于有微积分经验的人来说，:math:`D(t)=\frac{de(t)}{dt}`。对于没有微积分经验的人来说，它表示误差变化的速度。从图形上看，:math:`D(t)` 就是任意给定时间 :math:`t` 下误差的斜率。

source: This slope can be calculated by keeping track of the error over successive iterations of the control loop. One iteration occurs at time :math:`t_n` with an error of :math:`e(t_n)`. At the next iteration, the time is :math:`t_{n+1}` with an error of :math:`e(t_{n+1})`. Thus, to find :math:`D(t)`, simply find the slope of :math:`e(t)` given these two points.
es_mx: Está pendiente puede calcularse haciendo un seguimiento del error a lo largo de iteraciones sucesivas del bucle de control. Una iteración se produce en el tiempo :math:`t_n` con un error de :math:`e(t_n)`. En la siguiente iteración, el tiempo es :math:`t_{n+1}` con un error de :math:`e(t_{n+1})`. Por lo tanto, para encontrar :math:`D(t)`, basta con encontrar la pendiente de :math:`e(t)` dados estos dos puntos.
fr_ca: Cette pente peut être calculée en suivant l'erreur au cours des itérations successives de la boucle de contrôle. Une itération a lieu au temps :math:`t_n` avec une erreur de :math:`e(t_n)`. À l'itération suivante, le temps est :math:`t_{n+1}` avec une erreur de :math:`e(t_{n+1})`. Ainsi, pour trouver :math:`D(t)`, il suffit de trouver la pente de :math:`e(t)` à partir de ces deux points.
ro_ro: Panta poate fi calculată prin observarea erorii prin iteratii succesive ale buclei de control. O iterație are loc la un timp dat :math:`t_n` cu o eroare de :math:`e(t_n)`. La urmatoarea iterație, timpul este :math:`t_{n+1}`, cu o eroare de :math:`e(t_{n+1})`. Astfel, pentru a găsi :math:`D(t)`, pur și simplu găsește panta de :math:`e(t)` cu aceste două puncte.
zh_cn: 这个斜率可以通过跟踪控制环连续迭代的误差来计算。一次迭代的时间为 :math:`t_n`，误差为 :math:`e(t_n)`。下一次迭代的时间为 :math:`t_{n+1}`，误差为 :math:`e(t_{n+1})`。因此，若要求出 :math:`D(t)` ，只需根据这两点求出 :math:`e(t)` 的斜率即可。

source: The Integral Term
es_mx: El término integral
fr_ca: Le terme intégral
ro_ro: Termenul Integral
zh_cn: 积分项

source: Admittedly, the integral term is the least important term for FTC\ |reg| PID control loops. With a properly tuned :math:`K_p` and :math:`K_d`, you often can just set :math:`K_i` to 0 and call it a day.
es_mx: Hay que reconocer que el término integral es el menos importante para los bucles de control PID FTC\ |reg|. Con un ajuste adecuado de :math:`K_p` y :math:`K_d`, a menudo se puede poner :math:`K_i` a 0 y listo.
fr_ca: Il faut admettre que le terme intégral est le moins important pour les boucles de contrôle PID de FTC\ |reg|. Avec un :math:`K_p` et un :math:`K_d` correctement réglés, vous pouvez souvent mettre :math:`K_i` à 0 et en rester là.
zh_cn: 诚然，积分项是FTC \ |reg| 调节PID控制回路中最不重要的项。通过适当调整 :math:`K_p` 和 :math:`K_d` ，您通常可以将 :math:`K_i` 设置为0，然后就到此为止。

source: However, it can still be useful in some cases. Just like the derivative term, the integral term intends to correct for overshoot. if the system thinks it reached its destination, it will stop, even when, in fact, the error is not yet 0. Perhaps the motor is no longer being supplied enough power to move. Well, given enough time, the integral term will increase the output (in this case, motor power), causing movement towards the destination.
es_mx: Sin embargo, puede seguir siendo útil en algunos casos. Al igual que el término derivativo, el término integral pretende corregir el rebasamiento. Si el sistema cree que ha llegado a su destino, se detendrá, incluso cuando, de hecho, el error aún no sea 0. Tal vez el motor ya no reciba suficiente potencia para moverse. Pues bien, dado el tiempo suficiente, el término integral aumentará la salida (en este caso, la potencia del motor), provocando el movimiento hacia el destino.
fr_ca: Cependant, il peut encore être utile dans certains cas. Tout comme le terme dérivé, le terme intégral vise à corriger les dépassements. Si le système pense avoir atteint sa destination, il s'arrêtera, même si, en fait, l'erreur n'est pas encore 0. Peut-être le moteur ne reçoit-il plus assez de puissance pour se déplacer. Si l'on dispose de suffisamment de temps, le terme intégral augmentera la sortie (dans ce cas, la puissance du moteur), ce qui entraînera un mouvement vers la destination.
ro_ro: Totuși, poate fi folositoare în unele cazuri. Precum termenul derivat, termenul integral intenționează să corecteze depășirea. Dacă sistemul crede că și-a atins destinația, se va opri, și când, ca fapt divers, eroarea nu este înca 0. Poate că motorul nu are suficientă putere distribuită pentru a se mișca. Păi, cu suficient timp, termenul integral va mări output-ul (în acest caz, puterea motorului), pentru a se apropia de destinație.
zh_cn: 不过，它在某些情况下仍然有用。就像微分项一样，积分项的目的也是修正超调。如果系统认为已经到达目的地，它就会停止，即使事实上误差还没有为 0。那么，只要有足够的时间，积分项就会增加输出（这里指的是电机功率），从而使电机向目的地运动。

source: To explain without calculus, the integral term essentially sums the error over a specific interval of time. To do this, error in each loop iteration is added to a variable (in this case, :math:`I(t)`).
es_mx: Para explicarlo sin cálculos, el término integral básicamente suma el error en un intervalo de tiempo específico. Para ello, el error en cada iteración del bucle se suma a una variable (en este caso, :math:`I(t)`).
fr_ca: Pour l'expliquer sans calcul, le terme intégral additionne essentiellement l'erreur sur un intervalle de temps spécifique. Pour ce faire, l'erreur de chaque itération de la boucle est ajoutée à une variable (dans ce cas, :math:`I(t)`).
ro_ro: Pentru a explica acest lucru fără analiză matematică, termenul integral este în esență suma erorilor într-un interval de timp dat. Pentru a face acest lucru, eroarea din fiecare buclă iterată este adaugată la o variabila (în acest caz, :math:`I(t)`).
zh_cn: 如果不用微积分的知识来解释的话，积分项实质上是将特定时间间隔内的误差相加。为此，每次循环迭代中的误差都会加到一个变量中（本例中为 :math:`I(t)`）。
