Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/concepts/control-loops.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: However, summing error this way has an unfortunate side effect: the longer the loop takes to complete one iteration, the more slowly this sum increases, which is obviously not desirable, as we don't want lag to affect how the robot moves. To compensate for this, before the error is added to :math:`I(t)`, it is multiplied by how long the previous loop took to-complete, or :math:`t_{n+1}-t_n`, preventing lag from making the system sum more slowly.
es_mx: Sin embargo, sumar el error de esta forma tiene un desafortunado efecto secundario: cuanto más tarda el bucle en completar una iteración, más lentamente aumenta esta suma, lo que obviamente no es deseable, ya que no queremos que el retraso afecte a cómo se mueve el robot. Para compensar esto, antes de que el error se añada a :math:`I(t)`, se multiplica por el tiempo que tardó el bucle anterior en completarse, o :math:`t_{n+1}-t_n`, evitando que el retraso haga que la suma del sistema sea más lenta.
fr_ca: Cependant, l'addition de l'erreur de cette façon a un effet secondaire malheureux : plus la boucle prend de temps pour compléter une itération, plus cette somme augmente lentement, ce qui n'est évidemment pas souhaitable, car nous ne voulons pas que le décalage affecte la façon dont le robot se déplace. Pour compenser cela, avant que l'erreur ne soit ajoutée à :math:`I(t)`, elle est multipliée par le temps que la boucle précédente a pris pour se terminer, ou :math:`t_{n+1}-t_n`, empêchant ainsi le décalage de rendre la somme du système plus lente.
zh_cn: 然而，用这种方法计算误差总和有一个不幸的副作用：循环完成一次迭代所需的时间越长，误差总和增加的速度就越慢，这显然是不可取的，因为我们不希望滞后影响机器人的移动。为了弥补这一点，在将误差添加到 :math:`I(t)` 之前，先将其乘以上一个循环完成所需的时间，即 :math:`t_{n+1}-t_n`，以防止滞后使系统总和增加得更慢。

source: So say the robot stops short of the target. The P and D combination aren't strong enough to move it forward to the destination. You can either tune :math:`K_p` and :math:`K_d` to compensate (**this is recommended**), or you can add the integral term to increase output (**this works too, but requires more attention and tuning to achieve the same result**).
es_mx: Supongamos que el robot se detiene cerca del objetivo. La combinación P y D no son lo suficientemente fuertes como para moverlo hacia delante hasta el destino. Puedes ajustar :math:`K_p` y :math:`K_d` para compensar (**esto es lo recomendado**), o puedes añadir el término integral para aumentar el rendimiento (**esto también funciona, pero requiere más atención y ajuste para conseguir el mismo resultado**).
fr_ca: Supposons que le robot s'arrête avant la cible. La combinaison P et D n'est pas assez forte pour le faire avancer jusqu'à sa destination. Vous pouvez soit ajuster :math:`K_p` et :math:`K_d` pour compenser (**cela est recommandé**), soit ajouter le terme intégral pour augmenter le rendement (**cela fonctionne aussi, mais demande plus d'attention et d'ajustements pour obtenir le même résultat**).
zh_cn: 假设机器人在目标附近停下。P和D组合不足以将其向前移动到目的地。您可以调整 :math:`K_p` 和 :math:`K_d` 以进行补偿（**建议使用**），也可以添加积分项以增加输出（**这也有效，但需要更多的关注和调整才能获得相同的结果**）。

source: PID Pseudocode
es_mx: PID Pseudocódigo
fr_ca: Pseudocode PID
ro_ro: Pseudocod PID
zh_cn: PID 伪代码

source: Tuning a PID Loop
es_mx: Ajuste de un bucle PID
fr_ca: Réglage d'une Boucle PID
ro_ro: Reglarea unei Bucle PID
zh_cn: 调整 PID 回路

source: The most important thing to know while tuning a PID loop is how each of the terms affects the output. This can allow you to see which gains need to be adjusted.
es_mx: Lo más importante que hay que saber al sintonizar un bucle PID es cómo afecta cada uno de los términos a la salida. Esto puede permitirle ver qué ganancias necesitan ser ajustadas.
fr_ca: La chose la plus importante à savoir lors du réglage d'une boucle PID est la manière dont chacun des termes affecte la sortie. Cela vous permet de voir quels gains doivent être ajustés.
ro_ro: Cel mai important lucru de știut atunci când reglezi o buclă PID este cum fiecare termen afectează output-ul. Acest lucru îți permite să vezi care valori trebuie ajustate.
zh_cn: 在调整 PID 循环时，最重要的是了解每个项对输出的影响。这可以让您了解哪些增益需要调整。

source: For example, if the target is not reached but instead the setpoint begins to oscillate around the target, it means there is not enough D gain. If the target is eventually reached, albeit very slowly, that means there is not enough P gain or the D gain is too high.
es_mx: Por ejemplo, si no se alcanza el objetivo, sino que la consigna empieza a oscilar en torno al objetivo, significa que no hay suficiente ganancia D. Si finalmente se alcanza el objetivo, aunque muy lentamente, significa que no hay suficiente ganancia P o que la ganancia D es demasiado alta.
fr_ca: Par exemple, si la cible n'est pas atteinte mais que le point de consigne commence à osciller autour de la cible, cela signifie que le gain D est insuffisant. Si la cible est finalement atteinte, bien que très lentement, cela signifie que le gain P est insuffisant ou que le gain D est trop élevé.
ro_ro: De exemplu, dacă ținta nu este atinsă dar în schimb punctul de referință începe să oscileze în jurul țintei, înseamnă ca valoarea D nu afectează suficient algoritmul. Dacă ținta este atinsă, însă foarte încet, înseamnă că valoarea P nu afectează suficient algoritmul sau D este prea mare.
zh_cn: 例如，如果没有达到目标后停止，而是围绕目标摆动，则说明 D 增益不够。如果最终达到目标，但是速度非常缓慢，则说明 P 增益不足或 D 增益过高。

source: In brief, the P variable drives the error towards zero, the I variable corrects for steady state error, and the D variable dampens the effects of the P variable, more so as error approaches zero, which prevents overshoot.
es_mx: En resumen, la variable P conduce el error hacia cero, la variable I corrige el error de estado estacionario y la variable D amortigua los efectos de la variable P, más a medida que el error se aproxima a cero, lo que evita el rebasamiento.
fr_ca: En résumé, la variable P fait tendre l'erreur vers zéro, la variable I corrige l'erreur en régime permanent et la variable D amortit les effets de la variable P, d'autant plus que l'erreur se rapproche de zéro, ce qui empêche le dépassement.
ro_ro: Pe scurt, variabila P aduce eroarea spre zero, variabila I menține starea de echilibru al erorii, iar varibila D ameliorează efectele variabilei P, cu cât se apropie eroarea de zero, cu cât P devine mai mare, ceea ce previne depașirea țintei.
zh_cn: 简而言之，P 变量推动误差趋于零，I 变量修正稳态误差，D 变量抑制 P 变量的影响，当误差趋于零时，D 变量的影响更大，从而防止超调。

source: The most common method for tuning a PID controller is as follows:
es_mx: El método más común para sintonizar un controlador PID es el siguiente:
fr_ca: La méthode la plus courante pour régler un contrôleur PID est la suivante :
ro_ro: Cea mai comună metođă de a regla un controller PID este următoarea:
zh_cn: 调整 PID 控制器最常用的方法如下：

source: Set the I and D gains to zero
es_mx: Poner a cero las ganancias I y D
fr_ca: Régler les gains I et D à zéro
ro_ro: Setează I și D la zero
zh_cn: 将 I 增益和 D 增益设为零

source: Increase the P gain until there are oscillations around the target
es_mx: Aumenta la ganancia P hasta que haya oscilaciones alrededor del objetivo
fr_ca: Augmenter le gain P jusqu'à ce qu'il y ait des oscillations autour de la cible.
ro_ro: Crește valoarea P până când apar oscilații în jurul țintei
zh_cn: 增大 P 增益，直到目标附近出现振荡

source: Increase the D gain until no overshoot occurs
es_mx: Aumentar la ganancia D hasta que no se produzca sobreimpulso
fr_ca: Augmenter le gain D jusqu'à ce qu'il n'y ait plus de dépassement.
ro_ro: Crește valoarea D până când robotul nu mai depășește ținta
zh_cn: 增大 D 增益，直到不出现过冲为止

source: If there is steady state error, increase the I gain until it is corrected
es_mx: Si hay error de estado estacionario, aumente la ganancia I hasta que se corrija
fr_ca: En cas d'erreur en régime permanent, augmenter le gain I jusqu'à ce que l'erreur soit corrigée.
ro_ro: Dacă nu există o stare de echilibru, crește valoarea I până când se corectează
zh_cn: 如果存在稳态误差，则增大 I 增益，直至误差得到纠正

source: An important thing to note is that most systems do not need both I and D control. Generally, systems without a lot of friction do not need an I term, but will need more D control. Systems with a lot of friction, on the other hand, generally do not need D control because the friction facilitates deceleration but need I control because the friction prevents the system from reaching the target otherwise.
es_mx: Algo importante a tener en cuenta es que la mayoría de los sistemas no necesitan tanto control I como D. Generalmente, los sistemas sin mucha fricción no necesitan un término I, pero necesitarán más control D. Los sistemas con mucha fricción, por otro lado, generalmente no necesitan control D porque la fricción facilita la deceleración, pero necesitan control I porque la fricción impide que el sistema alcance el objetivo de otro modo.
fr_ca: Il est important de noter que la plupart des systèmes n'ont pas besoin d'un contrôle I et d'un contrôle D. En général, les systèmes sans beaucoup de friction n'ont pas besoin d'un terme I, mais auront besoin d'un contrôle D plus important. Les systèmes avec beaucoup de friction, en revanche, n'ont généralement pas besoin d'un contrôle D parce que la friction facilite la décélération, mais ont besoin d'un contrôle I parce que la friction empêche le système d'atteindre la cible autrement.
ro_ro: Un lucru important de reținut este că multe sisteme nu au nevoie de I și D. În general, sistemele fără prea multă frecare nu au nevoie de un termen I, însă vor avea nevoie de mai mult control D. Sistemele cu multă frecare, pe de altă parte, în general nu au nevoie de control D deoarece frecarea facilitează decelerarea însă au nevoie de control I deoarece frecarea previne sistemul din a-și atinge ținta.
zh_cn: 需要注意的是，大多数系统并不需要 I 和 D 控制。一般来说，没有大量摩擦的系统不需要 I 项控制，但需要更多的 D 项控制。另一方面，摩擦力较大的系统一般不需要 D 控制，因为摩擦力有助于减速，但需要 I 控制，因为摩擦力会阻止系统达到目标。

source: For a more in-depth explanation, `click here <https://blog.wesleyac.com/posts/intro-to-control-part-two-pid-tuning>`_
es_mx: Para una explicación más detallada, `haga clic aquí <https://blog.wesleyac.com/posts/intro-to-control-part-two-pid-tuning>`_
fr_ca: Pour une explication plus approfondie, `cliquez ici <https://blog.wesleyac.com/posts/intro-to-control-part-two-pid-tuning>`_
ro_ro: Pentru mai multe detalii, `apasă aici <https://blog.wesleyac.com/posts/intro-to-control-part-two-pid-tuning>`_
zh_cn: 如需更深入的解释，请`点击这里<https://blog.wesleyac.com/posts/intro-to-control-part-two-pid-tuning>`_

source: Built-In PID Controller
es_mx: Controlador PID integrado
fr_ca: Contrôleur PID intégré
ro_ro: Controllerul PID Integrat
zh_cn: 内置 PID 控制器

source: For situations where one needs to control the velocity or position of a single motor, the built in PID controller can be used. PID can be enabled by changing the run mode to ``RUN_USING_ENCODER``
es_mx: Para situaciones en las que se necesita controlar la velocidad o la posición de un solo motor, se puede utilizar el controlador PID incorporado. El PID puede activarse cambiando el modo de ejecución a ``RUN_USING_ENCODER``.
fr_ca: Pour les situations où il est nécessaire de contrôler la vitesse ou la position d'un seul moteur, le contrôleur PID intégré peut être utilisé. Le PID peut être activé en changeant le mode d'exécution en ``RUN_USING_ENCODER``.
ro_ro: Pentru situațiile în care o persoană are nevoie să controleze viteza sau poziția unui singur motor, controllerul PID integrat poate fi folosit. PID poate fi activat prin schimbarea modului de rulare în ``RUN_USING_ENCODER``.
zh_cn: 如果需要控制单个电机的速度或位置，可以使用内置的 PID 控制器。将运行模式更改为 "RUN_USING_ENCODER"，即可启用 PID。

source: Many misunderstand the use of ``RUN_USING_ENCODER``, many may mistake that it is necessary to use this mode for the encoders to work at all, but this is not true. Instead, ``RUN_USING_ENCODER`` enables velocity feedback using the encoder. If you are using an external PID controller such as one that you implement, generally, it is recommended that you use ``RUN_WITHOUT_ENCODER``.
es_mx: Muchos malinterpretan el uso de ``RUN_USING_ENCODER``, muchos pueden confundir que es necesario utilizar este modo para que los encoders funcionen en absoluto, pero esto no es cierto. En su lugar, ``RUN_USING_ENCODER`` habilita la realimentación de velocidad utilizando el encoder. Si estás utilizando un controlador PID externo como el que implementas, generalmente, se recomienda que utilices ``RUN_WITHOUT_ENCODER``.
fr_ca: Beaucoup se méprennent sur l'utilisation de ``RUN_USING_ENCODER``, beaucoup pensent qu'il est nécessaire d'utiliser ce mode pour que les encodeurs fonctionnent, mais ce n'est pas vrai. Au lieu de cela, ``RUN_USING_ENCODER`` active le retour de vitesse en utilisant l'encodeur. Si vous utilisez un contrôleur PID externe tel que celui que vous implantez, il est généralement recommandé d'utiliser ``RUN_WITHOUT_ENCODER``.
ro_ro: Mulți nu înțeleg rolul ``RUN_USING_ENCODER``, mulți pot înțelege că această funcție este necesară pentru ca encoderele să funcționeze, însă acest lucru nu este adevărat. În schimb, ``RUN_USING_ENCODER`` activează feedback-ul vitezei folosind encoderul. Dacă folosești un controller PID extern precum cel pe care îl implementezi, în general, este recomandat să folosești ``RUN_WITHOUT_ENCODER``.
zh_cn: 许多人误解了 ``RUN_USING_ENCODER`` 的使用，误以为必须使用该模式编码器才能工作，但事实并非如此。相反，`RUN_USING_ENCODER`` 可以使用编码器实现速度反馈。如果使用的是外部 PID 控制器，例如自己实现的控制器，一般建议使用 ``RUN_WITHOUT_ENCODER``。

source: For official documentation on the built in PID controller, `see here <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_
es_mx: Para la documentación oficial sobre el controlador PID integrado, `vea aquí <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_
fr_ca: Pour la documentation officielle sur le contrôleur PID intégré, `voyez ici <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_
ro_ro: Pentru mai multe informații în legătură cu controllerul PID integrat, `apasă aici <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_
zh_cn: 有关内置 PID 控制器的官方文档，` 请参见<https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_

source: Debugging Built-In PID Controller
es_mx: Depuración del controlador PID integrado
fr_ca: Débogage du Contrôleur PID Intégré
ro_ro: Depanarea Controllerului PID Integrat
zh_cn: 调试内置 PID 控制器

source: Problem
es_mx: Problema
fr_ca: Problème
ro_ro: Problema
zh_cn: 问题

source: Solution
es_mx: Solución
ro_ro: Soluția
zh_cn: 解决方案

source: Motor goes at Full Speed regardless of velocity setpoint
es_mx: El motor va a máxima velocidad independientemente de la consigna de velocidad
fr_ca: Le moteur passe à la vitesse maximale indépendamment du point de consigne de la vitesse.
ro_ro: Motorul merge la viteză maximă indiferent de viteza de referință
zh_cn: 电机全速运转，与速度设定值无关

source: Most of the time this occurs when one of two things occurs:
es_mx: La mayoría de las veces esto ocurre cuando ocurre una de estas dos cosas:
fr_ca: La plupart du temps, cela se produit lorsque l'une des deux choses suivantes se produit :
ro_ro: De cele mai multe ori acest lucru se întâmplă când au loc două probleme:
zh_cn: 大多数情况下，出现这种情况的原因有两种：

source: #1: Your encoder is not connected properly.
es_mx: #1: Su codificador no está conectado correctamente.
fr_ca: #1 : Votre encodeur n'est pas correctement connecté.
ro_ro: #1: Encoderul nu este conectat corespunzător.
zh_cn: #1：编码器连接不正确。

source: Diagnosis: Log your encoder position to telemetry, if the position oscillates between 0 - 1 make sure you have the correct cable and it is seated correctly.
es_mx: Diagnóstico: Registre la posición de su codificador en telemetría, si la posición oscila entre 0 - 1 asegúrese de que tiene el cable correcto y que está asentado correctamente.
fr_ca: Diagnostic : Enregistrez la position de votre codeur sur la télémétrie. Si la position oscille entre 0 - 1, assurez-vous que vous avez le bon câble et qu'il est correctement installé.
ro_ro: Diagnoză: Înregistrează poziția encoderului în telemetrie, dacă poziția oscilează între 0-1 înseamnă că ai cablul corect și este conectat corespunzător.
zh_cn: 诊断：将编码器的位置记录到遥测系统中，如果位置在 0 - 1 之间摆动，请确保电缆正确且安装正确。

source: #2: Your motor is going in the wrong direction.
es_mx: #2: Su motor va en la dirección equivocada.
fr_ca: #2 : Votre moteur va dans la mauvaise direction.
ro_ro: #2: Motorul tău merge în direcția gresită.
zh_cn: #2: 你的电机运转方向错误。

source: Diagnosis: Log your velocity to telemetry, if you have a positive reference velocity and the output is negative or vice versa then your motor is plugged in backwards.
es_mx: Diagnóstico: Registra tu velocidad en telemetría, si tienes una velocidad de referencia positiva y la salida es negativa o viceversa entonces tu motor está enchufado al revés.
fr_ca: Diagnostic : Enregistrez votre vitesse sur la télémétrie, si vous avez une vitesse de référence positive et que la sortie est négative ou vice versa, alors votre moteur est branché à l'envers.
ro_ro: Diagnoză: Înregistrează viteza ta în telemetrie, dacă ai o referință pozitivă a vitezei iar output-ul este negativ sau vice versa înseamnă că motorul tău este conectat invers.
zh_cn: 诊断：将速度记录到遥测系统中，如果参考速度为正，而输出为负，或者反之亦然，则说明电机插反了。

source: Motor does not reach full speed with ``.setPower``
es_mx: El motor no alcanza la velocidad máxima con ``.setPower``
fr_ca: Le moteur n'atteint pas sa vitesse maximale avec ``.setPower``.
ro_ro: Motorul nu atinge viteza maximă cu ``.setPower``
zh_cn: 使用 ``.setPower`` 时电机未达到全速

source: Use the ``.setVelocity`` method as part of DcMotorEx or use ``RUN_WITHOUT_ENCODER`` with an external PID controller.
es_mx: Usa el método ``.setVelocity`` como parte de DcMotorEx o usa ``RUN_WITHOUT_ENCODER`` con un controlador PID externo.
fr_ca: Utilisez la méthode ``.setVelocity`` dans le cadre de DcMotorEx ou utilisez ``RUN_WITHOUT_ENCODER`` avec un contrôleur PID externe.
ro_ro: Folosește metoda ``.setVelocity`` din clasa DcMotorEx sau ``RUN_WITHOUT_ENCODER`` cu un controller PID extern.
zh_cn: 使用作为 DcMotorEx 一部分的 ``.setVelocity`` 方法，或使用外部 PID 控制器的 ``RUN_WITHOUT_ENCODER`` 方法。

source: PID Controller Sample Rate
es_mx: Controlador PID Frecuencia de muestreo
fr_ca: Taux d'échantillonnage du contrôleur PID
ro_ro: Rata de Numerizare a unui Controller PID
zh_cn: PID 控制器采样率

source: For teams who desire the most performance out of their PID controller, it is essential to consider the Sample rate of the controller. The Sample rate is when the controller updates its output given new sensor data. Higher Sample rates allow for more stable control and allow for the usage of more significant PID coefficients to reduce settling time. See this `video <https://www.youtube.com/watch?v=fusr9eTceEo&t=133s>`_ to see how sample rate effects stability in a practical motor control example. The inbuilt PID controller is locked at a 20hz refresh rate (50ms sample rate). Many top FTC teams optimize their robot loops to run at up to 80hz, achieving *much* more stable control with an external PID.
es_mx: Para los equipos que desean obtener el máximo rendimiento de su controlador PID, es esencial tener en cuenta la Frecuencia de muestreo del controlador. La frecuencia de muestreo es cuando el controlador actualiza su salida dados los nuevos datos del sensor. Tasas de muestreo más altas permiten un control más estable y permiten el uso de coeficientes PID más significativos para reducir el tiempo de asentamiento. Vea este `video <https://www.youtube.com/watch?v=fusr9eTceEo&t=133s>`_ para ver cómo la frecuencia de muestreo afecta a la estabilidad en un ejemplo práctico de control de motores. El controlador PID incorporado está bloqueado a una frecuencia de refresco de 20hz (frecuencia de muestreo de 50ms). Muchos de los mejores equipos de FTC optimizan sus bucles de robot para que funcionen hasta a 80hz, consiguiendo un control *mucho* más estable con un PID externo.
fr_ca: Pour les équipes qui souhaitent obtenir les meilleures performances de leur contrôleur PID, il est essentiel de prendre en compte le taux d'échantillonnage du contrôleur. Le taux d'échantillonnage est le moment où le contrôleur met à jour sa sortie en fonction des nouvelles données du capteur. Des taux d'échantillonnage plus élevés permettent un contrôle plus stable et l'utilisation de coefficients PID plus importants pour réduire le temps de stabilisation. Voir cette `vidéo <https://www.youtube.com/watch?v=fusr9eTceEo&t=133s>`_ pour voir comment le taux d'échantillonnage affecte la stabilité dans un exemple pratique de contrôle de moteur. Le contrôleur PID intégré est verrouillé à un taux de rafraîchissement de 20 Hz (taux d'échantillonnage de 50 ms). De nombreuses équipes FTC optimisent les boucles de leurs robots pour qu'elles fonctionnent jusqu'à 80 Hz, ce qui permet d'obtenir un contrôle beaucoup plus stable avec un PID externe.
ro_ro: Pentru echipele care vor cea mai bună performanță din controllerul lor PID, este esențial să iei în considerare rata de numerizare a controllerului. Rata de numerizare este atunci când controllerul îți actualizează output-ul având date noi despre senzori. Cu cât frecvența de numerizare este mai mare, cu cât controlul este mai stabil și permite folosirea unor coeficienți PID mai semnificativi pentru a reduce timpul de corectare. Vezi acest `video <https://www.youtube.com/watch?v=fusr9eTceEo&t=133s>`_ pentru a vedea cum rata de numerizare afectează stabilitatea într-un exemplu practic cu un motor. Controllerul PID integrat este blocat la frecventa de actualizare de 20Hz (rata de numerizare de 50ms). Multe echipe FTC de top își optimizează buclele roboților lor pentru a rula la timpi de la până la 80Hz, obținând un control *mult* mai stabil cu un PID extern.
zh_cn: 对于希望 PID 控制器发挥最大性能的团队来说，必须考虑控制器的采样率。采样率是指控制器根据新的传感器数据更新其输出的时间。较高的采样率可实现更稳定的控制，并允许使用更重要的 PID 系数来减少沉淀时间。请参阅本视频<https://www.youtube.com/watch?v=fusr9eTceEo&t=133s> ，了解采样率在实际电机控制示例中如何影响稳定性。内置 PID 控制器的刷新率锁定在 20 赫兹（50 毫秒采样率）。许多顶尖的 FTC 团队会优化他们的机器人回路，使其运行频率高达 80hz，从而通过外部 PID 实现**更稳定的控制。

source: Feedforward Control
es_mx: Control Feedforward
fr_ca: Contrôle par Anticipation
ro_ro: Controlul Feedforward
zh_cn: 前馈控制

source: Feedforward control is a method of what is known as "open-loop" control. This is the opposite of closed-loop control and the primary difference is that feedforward does not actively use sensors to control the system. Instead it "predicts" the desired input based on a model.
es_mx: El control feedforward es un método de lo que se conoce como control "en bucle abierto". Es lo contrario del control en bucle cerrado y la principal diferencia es que el control directo no utiliza sensores para controlar el sistema. En su lugar, "predice" la entrada deseada basándose en un modelo.
fr_ca: Le contrôle par anticipation est une méthode de contrôle dite "en boucle ouverte". C'est l'opposé du contrôle en boucle fermée et la principale différence est que le contrôle par anticipation n'utilise pas activement les capteurs pour contrôler le système. Au lieu de cela, il "prédit" l'entrée souhaitée sur la base d'un modèle.
zh_cn: 前馈控制是一种被称为 "开环 "控制的方法。它与闭环控制相反，主要区别在于前馈控制并不主动使用传感器来控制系统。 相反，它根据模型 "预测 "所需的输入。

source: Typically feedforward is used to control either rates of change or combat known disturbances from your system.
es_mx: Normalmente, el feedforward se utiliza para controlar las tasas de cambio o para combatir las perturbaciones conocidas del sistema.
fr_ca: En règle générale, l'anticipation est utilisée pour contrôler les taux de changement ou pour lutter contre les perturbations connues de votre système.
zh_cn: 前馈通常用于控制变化率或消除系统中的已知干扰。
