Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/concepts/control-loops.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Feedforward is very powerful because it is immune to noise or other sensor errors. This is because it is not actively measuring the system, but instead predicting the desired input. However, this also means that it is not very good at correcting for errors. This is why it is often used in conjunction with a closed-loop controller such as PID.
es_mx: El feedforward es muy potente porque es inmune al ruido o a otros errores de los sensores. Esto se debe a que no mide activamente el sistema, sino que predice la entrada deseada. Sin embargo, esto también significa que no es muy bueno para corregir errores. Por eso se suele utilizar junto con un controlador de bucle cerrado, como el PID.
fr_ca: L'anticipation est très puissante parce qu'elle est immunisée contre le bruit ou d'autres erreurs de capteur. En effet, elle ne mesure pas activement le système, mais prédit l'entrée souhaitée. Toutefois, cela signifie également qu'elle n'est pas très efficace pour corriger les erreurs. C'est pourquoi il est souvent utilisé en conjonction avec un contrôleur en boucle fermée tel que le PID.
zh_cn: 前馈功能非常强大，因为它不受噪声或其他传感器误差的影响。 这是因为它不是主动测量系统，而是预测所需的输入。不过，这也意味着它不善于纠正错误。这就是为什么它经常与 PID 等闭环控制器结合使用。

source: Kv Ka Feedforward Model
es_mx: Modelo Feedforward Kv Ka
fr_ca: Modèle d'anticipation Kv Ka
zh_cn: Kv Ka 前馈模型

source: The most common feedforward and the one used by libraries such as road-runner is the Kv-Ka feedforward model:
es_mx: El feedforward más común y el utilizado por librerías como road-runner es el modelo feedforward Kv-Ka:
fr_ca: Le modèle d'anticipation le plus courant et celui utilisé par des bibliothèques telles que road-runner est le modèle d'anticipation Kv-Ka :
zh_cn: Kv-Ka 前馈模型是最常见的前馈模型，也是 road-runner 等程序库所使用的前馈模型：

source: Where :math:`K_v` is the velocity gain, :math:`K_a` is the acceleration gain, and :math:`f(t)` is the feedforward output sent to your motors.
es_mx: Donde :math:`K_v` es la ganancia de velocidad, :math:`K_a` es la ganancia de aceleración, y :math:`f(t)` es la salida feedforward enviada a tus motores.
fr_ca: Où :math:`K_v` est le gain de vitesse, :math:`K_a` est le gain d'accélération, et :math:`f(t)` est la sortie feedforward envoyée à vos moteurs.
zh_cn: 其中 :math:`K_v` 是速度增益，:math:`K_a` 是加速度增益，:math:`f(t)` 是发送给电机的前馈输出。

source: These gains can be estimated by giving the controller a series of ramp inputs (such as those computed with a motion profile), measuring the output, and then changing these gains till the robot matches the desired motion.
es_mx: Estas ganancias pueden estimarse proporcionando al controlador una serie de rampas de entrada (como las calculadas con un perfil de movimiento), midiendo la salida y cambiando las ganancias hasta que el robot alcance el movimiento deseado.
fr_ca: Ces gains peuvent être estimés en donnant au contrôleur une série de rampes d'entrée (telles que celles calculées avec un profil de mouvement), en mesurant la sortie, puis en modifiant ces gains jusqu'à ce que le robot atteigne le mouvement souhaité.
zh_cn: 这些增益可以通过给控制器一系列斜坡输入（如用运动曲线计算的输入）来估算，测量输出，然后改变这些增益，直到机器人达到所需的运动状态。

source: The gains will change based on the robot's mass, friction, and other factors. It is recommended to re-estimate these gains every time you make a significant change to your robot.
es_mx: Las ganancias cambiarán en función de la masa del robot, la fricción y otros factores. Se recomienda volver a calcular estas ganancias cada vez que se realice un cambio significativo en el robot.
fr_ca: Les gains varieront en fonction de la masse du robot, de la friction et d'autres facteurs. Il est recommandé de réestimer ces gains chaque fois que vous apportez une modification importante à votre robot.
zh_cn: 增益会根据机器人的质量、摩擦力和其他因素发生变化。建议每次对机器人进行重大改动时，都重新估算这些增益。

source: Kv Ka Feedforward Pseudocode
es_mx: Kv Ka Feedforward Pseudocódigo
fr_ca: Pseudocode anticipation Kv Ka
zh_cn: Kv Ka 前馈伪代码

source: Static Friction Feedforward
es_mx: Alimentación por fricción estática
fr_ca: Friction statique d'anticipation
zh_cn: 静态摩擦前馈

source: In every system there is bound to be some amount of static Friction. This means that the robot mechanism will not move until a certain amount of power is applied. This can be modeled by adding a constant feedforward term in the direction you want to move.
es_mx: En todos los sistemas existe cierta fricción estática. Esto significa que el mecanismo del robot no se moverá hasta que se aplique una cierta cantidad de energía. Esto se puede modelar añadiendo un término feedforward constante en la dirección en la que quieres moverte.
fr_ca: Dans tout système, il y a forcément une certaine quantité de friction statique. Cela signifie que le mécanisme du robot ne bougera pas tant qu'une certaine puissance n'est pas appliquée. Ce phénomène peut être modélisé par l'ajout d'un terme d'anticipation constant dans la direction où vous souhaitez vous déplacer.
zh_cn: 每个系统都必然存在一定的静摩擦力。这意味着，在施加一定量的动力之前，机器人机构不会移动。这可以通过在想要移动的方向上添加一个恒定的前馈项来模拟。

source: Motion Profiles
es_mx: Perfiles de movimiento
fr_ca: Profils de mouvement
ro_ro: Profilarea Mișcării
zh_cn: 运动曲线

source: Motion profiles are *not* a specific type of control loop, but rather a technique that works well in combination with other control loops such as PID and feedforward.
es_mx: Los perfiles de movimiento *no* son un tipo específico de control loop, sino más bien una técnica que funciona bien en combinación con otros lazos de control, como el PID y el feedforward.
fr_ca: Les profils de mouvement *ne sont pas* un type spécifique de boucle de contrôle, mais plutôt une technique qui fonctionne bien en combinaison avec d'autres boucles de contrôle telles que PID et feedforward.
zh_cn: 运动曲线*不是*一种特定类型的控制回路，而是一种与其他控制回路（如 PID 和前馈）结合使用的技术。

source: Motion profiling is a technique popularized in FRC\ |reg| that is starting to find its way to FTC. A motion profile is a function used to change the speed of a power transmission system in a controlled and consistent way by changing desired speed gradually rather than instantaneously.
es_mx: La creación de perfiles de movimiento es una técnica popularizada en FRC\ |reg| que está empezando a abrirse camino en FTC. Un perfil de movimiento es una función utilizada para modificar la velocidad de un sistema de transmisión de potencia de forma controlada y coherente, cambiando la velocidad deseada gradualmente en lugar de instantáneamente.
fr_ca: Le profilage de mouvement est une technique popularisée par FRC\ |reg| et qui commence à faire son chemin vers FTC. Un profil de mouvement est une fonction utilisée pour modifier la vitesse d'un système de transmission de puissance de manière contrôlée et cohérente en modifiant la vitesse souhaitée progressivement plutôt qu'instantanément.
ro_ro: Profilarea mișcării este o tehnică popularizată în FRC\ |reg| care începe să își găsească folosul în FTC. Un profil al mișcării este o funcție folosită pentru a schimba viteza unei transmisii într-o manieră controlată și consistentă prin schimbarea vitezei treptat decât instantaneu.
zh_cn: 运动曲线是一种在 FRC\ |reg| 中得到推广的技术，目前正开始应用于 FTC。运动曲线是一种函数，用于通过逐渐而非瞬时改变所需的速度，以受控和一致的方式改变动力传输系统的速度。

source: Let's illustrate this with an example: say you want your drivetrain, which is initially unmoving, to drive forward at full speed. Ordinarily, you would set all drivetrain motors to full power in the code. However, this can be problematic because even though you tell the motors to move at full speed instantaneously, the drivetrain takes time to get to full speed. This can lead to uncontrolled movements which have the potential to make autonomous less consistent and, perhaps more importantly, damage mechanisms.
es_mx: Vamos a ilustrar esto con un ejemplo: digamos que usted quiere que su chasis, que inicialmente está inmóvil, avance a toda velocidad. Normalmente, en el código se pondrían todos los motores de la transmisión a máxima potencia. Sin embargo, esto puede ser problemático porque, aunque le digas a los motores que se muevan a toda velocidad instantáneamente, la transmisión tarda un tiempo en alcanzar la velocidad máxima. Esto puede conducir a movimientos incontrolados que tienen el potencial de hacer que la autonomía sea menos consistente y, quizás más importante, dañar los mecanismos.
fr_ca: Illustrons cela par un exemple : supposons que vous souhaitiez que votre châssis, qui est initialement immobile, avance à pleine vitesse. D'ordinaire, vous devriez mettre tous les moteurs du châssis à pleine puissance dans le code. Cependant, cela peut poser des problèmes, car même si vous demandez aux moteurs d'avancer à pleine vitesse instantanément, le châssis met du temps à atteindre sa vitesse maximale. Cela peut entraîner des mouvements incontrôlés qui risquent de rendre l'autonomie moins cohérente et, peut-être plus important encore, d'endommager les mécanismes.
zh_cn: 让我们举个例子来说明这一点：假设您希望初始不动的传动系统全速前进。通常情况下，您会在代码中将传动系统的所有电机设置为全速。但是，这样做可能会有问题，因为即使您让电机瞬间全速前进，传动系统也需要时间才能达到全速。这可能会导致不受控制的运动，从而降低自主稳定性，更重要的是可能会损坏机械装置。

source: Motion profiling attempts to solve this issue.
es_mx: Los perfiles de movimiento intentan resolver este problema.
fr_ca: Le profilage des mouvements tente de résoudre ce problème.
ro_ro: Profilarea mișcării încearcă să rezolve această problemă.
zh_cn: 运动曲线试图解决这个问题。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
ro_ro: Avantaje
zh_cn: 优势

source: More controlled and predictable movements
es_mx: Movimientos más controlados y predecibles
fr_ca: Des mouvements plus contrôlés et plus prévisibles
ro_ro: Mișcări mai controlate și previzibile
zh_cn: 动作更可控、更可预测

source: Reduces rapid change of applied motor voltage
es_mx: Reduce el cambio rápido de la tensión aplicada al motor
fr_ca: Réduit les variations rapides de la tension appliquée au moteur
ro_ro: Reduce schimbarea rapidă a tensiunii aplicate motorului
zh_cn: 降低外加电机电压的快速变化

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
ro_ro: Dezavantaje
zh_cn: 缺点

source: Can be slower
es_mx: Puede ser más lento
fr_ca: Peut être plus lent
ro_ro: Poate fi mai lent
zh_cn: 可能慢一些

source: There are two main types of motion profiles: **Trapezoidal** profiles and **S-Curve** profiles. Trapezoidal profiles accelerate the system at a constant rate, and S-Curve profiles assume jerk (the speed acceleration changes) is constant. Given that S-Curve profiles are not optimal for controlling 2d trajectories (such as driving) and exist to reduce slippage (which usually only occurs when driving in FTC), trapezoidal profiles are recommended for most FTC applications.
es_mx: Existen dos tipos principales de perfiles de movimiento: **Los perfiles trapezoidales y los perfiles de curva S. Los perfiles trapezoidales aceleran el sistema a un ritmo constante, mientras que los perfiles de curva S suponen que la sacudida (la velocidad a la que cambia la aceleración) es constante. Dado que los perfiles S-Curve no son óptimos para controlar trayectorias en 2d (como la conducción) y existen para reducir el deslizamiento (que normalmente sólo se produce al conducir en FTC), se recomiendan los perfiles trapezoidales para la mayoría de las aplicaciones FTC.
fr_ca: Il existe deux principaux types de profils de mouvement : les profils **trapézoïdaux** et les profils **courbes en S**. Les profils trapézoïdaux accélèrent le système à un rythme constant, tandis que les profils en courbe S supposent que le jerk (la vitesse à laquelle l'accélération change) est constant. Étant donné que les profils en courbe S ne sont pas optimaux pour le contrôle des trajectoires 2D (comme la conduite) et qu'ils existent pour réduire le glissement (qui ne se produit généralement que lors de la conduite en FTC), les profils trapézoïdaux sont recommandés pour la plupart des applications de FTC.
ro_ro: Există două tipuri de profilare a mișcării: profilare **Trapezoidală** și profilare **S-Curve**. Profilarea trapezoidală accerelează sistemul la o frecvență constantă, iar profilarea S-Curve presupune smucituri (jerk, sau schimbările în accerelația vitezei) care sunt constante. Astfel, profilarea S-Curve nu este optimă pentru a controla traiectorii 2D (precum condusul) și există pentru a reduce alunecarea (care de obicei apare doar când conduci în FTC), profilarea trapezoidală este recomandată pentru majoritatea aplicațiilor FTC.
zh_cn: 运动曲线主要有两种类型：**梯形曲线**和 **S 曲线**。梯形曲线以恒定的速度加速系统，而 S 曲线则假定加速度变化的速度是恒定的。鉴于 S 曲线并不是控制二维轨迹（如驾驶）的最佳选择，而且其存在是为了减少打滑（通常只在 FTC 驾驶时才会发生），因此建议在大多数 FTC 应用中使用梯形剖面。

source: Trapezoidal profiles get their name from the shape of the graph of velocity over time:
es_mx: Los perfiles trapezoidales deben su nombre a la forma del gráfico de la velocidad en función del tiempo:
fr_ca: Les profils trapézoïdaux tirent leur nom de la forme du graphique de la vitesse en fonction du temps :
ro_ro: Profilarea trapezoidală îți are numele din forma graficului velocității în timp:
zh_cn: 梯形曲线的名称来源于速度随时间变化的图形形状：

source: The position over time, velocity over time, and acceleration over time graphs for a trapezoidal motion profile
es_mx: Los gráficos de posición en el tiempo, velocidad en el tiempo y aceleración con el tiempo se grafican para un perfil de movimiento trapezoidal.
fr_ca: Les graphiques de la position en fonction du temps, de la vitesse en fonction du temps et de l'accélération en fonction du temps pour un profil de mouvement trapézoïdal.
ro_ro: Poziția în timp, velocitatea în timp, și accerelația în timp vizualizat pentru profilarea trapezoidală
zh_cn: 梯形运动曲线的位置随时间变化图、速度随时间变化图和加速度随时间变化图

source: These are the "magic functions" for velocity and acceleration over time alluded to in the feedforward section.
es_mx: Estas son las "funciones mágicas" para la velocidad y la aceleración en el tiempo a las que se aludió en la sección feedforward.
fr_ca: Il s'agit des "fonctions magiques" pour la vitesse et l'accélération dans le temps auxquelles il a été fait allusion dans la section sur l'anticipation.
zh_cn: 这些是前文提到的速度和加速度随时间变化的“神奇函数”。

source: Here is some pseudocode for a trapezoidal profile:
es_mx: He aquí un pseudocódigo para un perfil trapezoidal:
fr_ca: Voici un pseudo-code pour un profil trapézoïdal :
ro_ro: Aici este niște pseudocod pentru un profil trapezoidal:
zh_cn: 下面是梯形剖面的一些伪代码：

source: The results of the above pseudocode are then used in a feedforward and / or PID loop to control the position of the system in a smooth and predictable way.
es_mx: Los resultados del pseudocódigo anterior se utilizan a continuación en un bucle feedforward y/o PID para controlar la posición del sistema de forma suave y predecible.
fr_ca: Les résultats du pseudocode ci-dessus sont ensuite utilisés dans une boucle d'anticipation et/ou une boucle PID pour contrôler la position du système de manière régulière et prévisible.
zh_cn: 然后将上述伪代码的结果用于前馈和/或 PID 环路，以平滑和可预测的方式控制系统的位置。

source: A more advanced example of the math for motion profile generation as used in the `Road Runner library <https://github.com/acmerobotics/road-runner>`_ can be found in this `Jupyter Notebook <https://mybinder.org/v2/gh/acmerobotics/road-runner/HEAD?filepath=doc%2Fnotebook%2Froad-runner-lite.ipynb>`_.
es_mx: En este `Jupyter Notebook <https://mybinder.org/v2/gh/acmerobotics/road-runner/HEAD?filepath=doc%2Fnotebook%2Froad-runner-lite.ipynb>`_ se puede encontrar un ejemplo más avanzado de las matemáticas para la generación de perfiles de movimiento tal y como se utilizan en la `Librería Road Runner <https://github.com/acmerobotics/road-runner>`_.
fr_ca: Un exemple plus avancé des mathématiques pour la génération du profil de mouvement tel qu'il est utilisé dans la bibliothèque `Road Runner <https://github.com/acmerobotics/road-runner>`_ peut être trouvé dans ce `Jupyter Notebook <https://mybinder.org/v2/gh/acmerobotics/road-runner/HEAD?filepath=doc%2Fnotebook%2Froad-runner-lite.ipynb>`_.
ro_ro: Un exemplu mai avansat al matematicii din generarea profilării mișcării folosite în `librăria Road Runner <https://github.com/acmerobotics/road-runner>`_ poate fi găsit în `documentul Jupyter <https://mybinder.org/v2/gh/acmerobotics/road-runner/HEAD?filepath=doc%2Fnotebook%2Froad-runner-lite.ipynb>`_.
zh_cn: 在 "Road Runner 库<https://github.com/acmerobotics/road-runner>`_"中使用的运动曲线生成数学的更高级示例可在本 "Jupyter Notebook<https://mybinder.org/v2/gh/acmerobotics/road-runner/HEAD?filepath=doc%2Fnotebook%2Froad-runner-lite.ipynb>`_"中找到。
