Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/concepts/finite-state-machines.po
Languages: es_mx, fr_ca, zh_cn

source: Finite State Machines
es_mx: Máquinas de Estados Finitos
fr_ca: Machines à états finis
zh_cn: 有限状态机

source: Finite State Machines (FSM) are often used while programming in order to allow for more complex series of actions. This is especially useful when one needs multiple tasks to run at the same time, because it allows for tasks to depend on each other's execution in a non-linear fashion.
es_mx: Las máquinas de estados finitos (FSM) se utilizan a menudo en programación para permitir series de acciones más complejas. Esto es especialmente útil cuando se necesita que varias tareas se ejecuten al mismo tiempo, ya que permite que las tareas dependan de la ejecución de las demás de forma no lineal.
fr_ca: Les machines à états finis (FSM) sont souvent utilisées en programmation pour permettre des séries d'actions plus complexes. Cela est particulièrement utile lorsque plusieurs tâches doivent être exécutées en même temps, car cela permet aux tâches de dépendre de l'exécution de chacune d'entre elles de manière non linéaire.
zh_cn: 有限状态机（FSM）通常用于编程，以实现更复杂的一系列操作。当需要多个任务同时运行时，这一点尤其有用，因为它允许任务以非线性方式相互依赖执行。

source: What is a Finite State Machine?
es_mx: ¿Qué es una máquina de estados finitos?
fr_ca: Qu'est-ce qu'une machine à états finis ?
zh_cn: 什么是有限状态机？

source: The name of a finite state machine is very descriptive; it's a state machine, with a finite number of states. It can be in one state at a time, and can transition to a different state once something happens. The `Wikipedia <https://en.wikipedia.org/wiki/Finite-state_machine#Example:_coin-operated_turnstile>`__ example of a turnstile explains the concept very well.
fr_ca: Le nom d'un automate à états finis est très descriptif : il s'agit d'un automate à états, avec un nombre fini d'états. Elle peut se trouver dans un état à la fois, et peut passer à un autre état lorsque quelque chose se produit. L'exemple `Wikipedia <https://en.wikipedia.org/wiki/Finite-state_machine#Example:_coin-operated_turnstile>`__ d'un tourniquet explique très bien le concept.

source: Implementation
es_mx: Aplicación
fr_ca: Mise en œuvre
zh_cn: 具体实现

source: Naive Implementation
es_mx: Aplicación ingenua
fr_ca: Mise en œuvre naïve
zh_cn: 简单实现

source: When first learning about FSMs, it is quite common for programmers to try and use them. Often times, they try to apply an FSM to their autonomous programs by segmenting their autonomous into a giant ``switch`` statement, and it often looks something like this:
es_mx: Cuando se aprende por primera vez sobre los FSM, es bastante común que los programadores intenten utilizarlos. A menudo, intentan aplicar un FSM a sus programas autónomos segmentando sus autónomos en una declaración ``switch`` gigante, y a menudo se parece a esto:
fr_ca: Lorsque les programmeurs découvrent les FSM, il est fréquent qu'ils essaient de les utiliser. Souvent, ils essaient d'appliquer une FSM à leurs programmes autonomes en segmentant leur programme autonome en une déclaration "switch" géante, et cela ressemble souvent à quelque chose comme ça :
zh_cn: 初学 FSM 时，程序员尝试使用 FSM 的情况很常见。很多时候，他们试图将 FSM 应用到自主程序中，将自主程序分割成一个巨大的 ``switch`` 语句，通常看起来是这样的：

source: This however does not really have any benefits compared to if the programmer had simply put each of the code's segments into functions, and executed them in order. In fact, often times, programmers will structure their code like this instead of splitting their code up into functions. The result is an autonomous that's more difficult to debug, and ultimately harder to fix on the fly during a competition or other time crunch.
es_mx: Esto, sin embargo, no tiene realmente ningún beneficio en comparación con si el programador simplemente hubiera puesto cada uno de los segmentos del código en funciones, y los hubiera ejecutado en orden. De hecho, muchas veces, los programadores estructuran su código así en lugar de dividirlo en funciones. El resultado es un código autónomo que es más difícil de depurar y, en última instancia, más difícil de arreglar sobre la marcha durante una competencia o en otro momento de apuro.
fr_ca: Cependant, cela ne présente pas vraiment d'avantages par rapport au fait que le programmeur aurait simplement placé chacun des segments du code dans des fonctions et les aurait exécutés dans l'ordre. En fait, les programmeurs structurent souvent leur code de cette manière au lieu de le diviser en fonctions. Il en résulte un code autonome plus difficile à déboguer et, en fin de compte, plus difficile à corriger à la volée lors d'une compétition ou d'un autre problème de temps.
zh_cn: 然而，与程序员简单地将每段代码放入函数并按顺序执行相比，这样做并没有任何好处。事实上，很多时候，程序员都会这样编排代码，而不是将代码分割成函数。这样做的结果是，自动阶段代码更难调试，最终也更难在比赛或其他时间紧迫的情况下临时修复。

source: If one drew out the state transition diagram for each of the states, for the autonomus above it'd be very linear, and the state transitions always occur because the section of the code finished:
es_mx: Si uno dibujara el diagrama de transición de estado para cada uno de los estados, para el autónomo de arriba sería muy lineal, y las transiciones de estado siempre ocurren porque la sección del código terminó:
fr_ca: Si l'on dessinait le diagramme de transition d'état pour chacun des états, pour l'autonomus ci-dessus, il serait très linéaire, et les transitions d'état se produisent toujours parce que la section du code s'est terminée :
zh_cn: 如果画出每种状态的状态转换图，对于上面的自动程序来说，它将是非常线性的，而且状态转换总是因为该段代码完成而发生：

source: In fact, in many implementations, making state transitions for any other reason is often difficult because the code executes linearly and is only in a loop to rerun the switch statements. (Often times, this means the code has a hard time reacting to a stop request in the middle of autonomous.)
es_mx: De hecho, en muchas implementaciones, hacer transiciones de estado por cualquier otra razón es a menudo difícil porque el código se ejecuta linealmente y sólo está en un bucle para volver a ejecutar las sentencias switch. (A menudo, esto significa que el código tiene dificultades para reaccionar ante una petición de parada en medio de la ejecución autónoma).
fr_ca: En fait, dans de nombreuses implémentations, il est souvent difficile d'effectuer des transitions d'état pour toute autre raison parce que le code s'exécute de manière linéaire et n'est dans une boucle que pour réexécuter les instructions de commutation. (Souvent, cela signifie que le code a du mal à réagir à une demande d'arrêt au milieu de l'autonomie).
zh_cn: 事实上，在许多实现中，由于代码是线性执行的，只需在循环中重新运行 switch 语句，因此出于任何其他原因进行状态转换通常都很困难。(很多时候，这意味着代码很难对自动运行中的停止请求做出反应）。

source: It is unadvisable to write code like this. If your autonomous is synchronous, it is preferable to split your code up into functions and run them in order, as this will be easier to understand and edit on the fly.
es_mx: No es aconsejable escribir código así. Si tu autónomo es síncrono, es preferible dividir tu código en funciones y ejecutarlas en orden, ya que así será más fácil de entender y editar sobre la marcha.
fr_ca: Il est déconseillé d'écrire du code de cette manière. Si votre autonomie est synchrone, il est préférable de diviser votre code en fonctions et de les exécuter dans l'ordre, car cela sera plus facile à comprendre et à modifier à la volée.
zh_cn: 这样写代码是不可取的。如果您的自动运行程序是同步的，最好将代码分割成多个函数并按顺序运行，因为这样更易于理解和即时编辑。

source: Useful Implementation
es_mx: Aplicación útil
fr_ca: Une mise en œuvre utile
zh_cn: 有用的实现

source: FSMs are the right tool to use when a robot needs to complete multiple tasks at once; a common example of this is when a robot should have automation in teleop, but still have control over the drivetrain.
es_mx: Los FSM son la herramienta adecuada cuando un robot debe realizar varias tareas a la vez; un ejemplo habitual es cuando un robot debe automatizarse en teleoperación, pero sigue teniendo control sobre el chasis.
fr_ca: Les FSM sont le bon outil à utiliser lorsqu'un robot doit accomplir plusieurs tâches à la fois ; un exemple courant est celui d'un robot qui doit être automatisé en téléopération, tout en gardant le contrôle de la chaîne cinématique.
zh_cn: 当机器人需要同时完成多项任务时，FSM 就是最合适的工具；一个常见的例子是，机器人需要在远程操作中实现自动化，但仍能控制传动系统。

source: Often times, teams have issues because their teleop executes in a loop and their servo logic has sleeps in it. But, we can avoid this if we write code in an **asynchronous** fashion - where instead of waiting for a task to complete before doing the next one, tasks are performed at the same time, and each task's state is checked without stopping the other tasks from executing.
es_mx: A menudo, los equipos tienen problemas porque su teleoperación se ejecuta en bucle y su lógica de servos tiene tiempos de espera. Pero podemos evitarlo si escribimos el código de forma **asíncrona**, es decir, en lugar de esperar a que se complete una tarea para realizar la siguiente, las tareas se ejecutan al mismo tiempo y se comprueba el estado de cada tarea sin detener la ejecución de las demás.
fr_ca: Souvent, les équipes rencontrent des problèmes parce que leur téléopération s'exécute en boucle et que leur logique d'asservissement comporte des périodes de sommeil. Mais nous pouvons éviter cela si nous écrivons le code de manière **asynchrone** - où, au lieu d'attendre la fin d'une tâche avant d'exécuter la suivante, les tâches sont exécutées en même temps, et l'état de chaque tâche est vérifié sans interrompre l'exécution des autres tâches.
zh_cn: 很多时候，团队会遇到一些问题，因为他们的远程操作是在循环中执行的，而且他们的伺服电机逻辑中存在 sleep 函数。但是，如果我们以**异步** 的方式编写代码，就可以避免这种情况的发生--在这种方式下，任务不是等一个任务完成后再执行下一个任务，而是同时执行，并且在不停止其他任务执行的情况下检查每个任务的状态。

source: An example of this would be that if one had a robot similar to `Gluten Free's Rover Ruckus Robot <https://www.youtube.com/watch?v=NQvhvYJXVMA>`__, and one wanted to automate the scoring lift so that the drivers don't have to think while the bot deposits the minerals. There are two parts of the bot that are relevant to us in this exercise: the angled scoring lift, and the servo that tips the dumper so the minerals fall out. The goal is to be able to push a button, and then the bot will:
es_mx: Un ejemplo de esto sería que si uno tuviera un robot similar al `Gluten Free's Rover Ruckus Robot <https://www.youtube.com/watch?v=NQvhvYJXVMA>`__, y uno quisiera automatizar el elevador de puntuación para que los conductores no tengan que pensar mientras el bot deposita los minerales. Hay dos partes del robot que son relevantes para nosotros en este ejercicio: el elevador de puntuación en ángulo, y el servo que inclina el volquete para que los minerales caigan. El objetivo es poder pulsar un botón y que el bot lo haga:
fr_ca: Par exemple, si l'on dispose d'un robot semblable au robot Rover Ruckus de Gluten Free <https://www.youtube.com/watch?v=NQvhvYJXVMA>`__, et que l'on souhaite automatiser l'élévateur de pointage afin que les chauffeurs n'aient pas à réfléchir pendant que le robot dépose les minéraux. Deux parties du robot nous intéressent dans le cadre de cet exercice : l'élévateur de pointage incliné et le servomoteur qui fait basculer le tombereau pour que les minéraux tombent. L'objectif est de pouvoir appuyer sur un bouton pour que le robot s'exécute :
zh_cn: 举个例子，如果我们有一个类似于 `Gluten Free's Rover Ruckus Robot<https://www.youtube.com/watch?v=NQvhvYJXVMA>`__ 的机器人，而我们想自动完成升降机的工作，这样驾驶员就不必在机器人堆放矿石时思考。在本练习中，机器人有两个与我们相关的部分：倾斜的得分升降机和倒出矿物的伺服电机。我们的目标是按下按钮，机器人就会开始工作：

source: extend the lift,
es_mx: extender el ascensor,
fr_ca: étendre l'ascenseur,
zh_cn: 延长升降机，

source: at full lift extension, angle the mineral bucket servo to deposit the minerals,
es_mx: en la extensión de elevación completa, incline el servo del cucharón de minerales para depositar los minerales,
fr_ca: à l'extension complète de l'élévateur, inclinez le servo du godet à minéraux pour déposer les minéraux,
zh_cn: 在升降机完全伸出的时候，调整矿斗伺服电机的角度，倒出矿物，

source: wait for the minerals to fall out,
es_mx: esperar a que se caigan los minerales,
fr_ca: attendre que les minéraux tombent,
zh_cn: 等着矿石掉出来、

source: reset the servo to the original position
es_mx: restablecer el servo a la posición original
fr_ca: remettre le servo dans sa position initiale
zh_cn: 将伺服电机复位到初始位置

source: retract the lift
es_mx: retraer el ascensor
fr_ca: rétracter l'ascenseur
zh_cn: 缩回升降机

source: If the drivers press a specific other button, we will stop executing the actions above as a failsafe - in case the robot is breaking somehow and the drivers need to take manual control. All the while, the drivers should still be able to control our drivetrain so we can make adjustments. Now, of course, this is a bit simplified (and probably not entirely what GF did), but it will do for now.
es_mx: Si los conductores pulsan otro botón específico, dejaremos de ejecutar las acciones anteriores como medida de seguridad, por si el robot se rompe de algún modo y los conductores tienen que tomar el control manual. Mientras tanto, los conductores deberían poder seguir controlando nuestro chasis para que podamos hacer ajustes. Ahora, por supuesto, esto es un poco simplificado (y probablemente no del todo lo que hizo GF), pero servirá por ahora.
fr_ca: Si les pilote appuient sur un autre bouton spécifique, nous cesserons d'exécuter les actions ci-dessus en guise de sécurité - au cas où le robot se briserait d'une manière ou d'une autre et où les pilotes devraient prendre le contrôle manuellement. Pendant ce temps, les pilotes devraient toujours être en mesure de contrôler notre châssis afin que nous puissions effectuer des ajustements. Bien entendu, ce schéma est un peu simplifié (et ne correspond probablement pas tout à fait à ce que GF a fait), mais il suffit pour l'instant.
zh_cn: 如果驾驶员按下其他特定按钮，我们将停止执行上述操作，以防万一--万一机器人发生故障，驾驶员需要手动控制。与此同时，驾驶员仍能控制我们的传动系统，以便我们进行调整。当然，这有点简化了（可能也不完全是 GF 所做的那样），但目前还是可以做到的。

source: Before anything is programmed, it may be useful draw out the state diagram for this to get a better understanding of what we the robot should actually be doing. This can also add to a Control Award submission.
es_mx: Antes de programar nada, puede ser útil dibujar el diagrama de estados para obtener una mejor comprensión de lo que el robot debería estar haciendo. Esto también puede contribuir a la presentación de un Premio de Control.
fr_ca: Avant de programmer quoi que ce soit, il peut être utile de dessiner le diagramme d'état pour obtenir une meilleure compréhension de ce que le robot devrait réellement faire. Cela peut également contribuer à la présentation d'un prix de contrôle.
zh_cn: 在编写任何程序之前，不妨绘制出相关的状态图，以便更好地了解机器人实际应该做些什么。这也可以为提交的控制奖增色不少。

source: Notice how resetting the dump servo and retracting the lift share a state. That's because the robot doesn't need to wait for the servo to reset before moving the lift down; they can both happen at once.
es_mx: Observa cómo el restablecimiento del servo de descarga y la retracción del elevador comparten un estado. Esto se debe a que el robot no necesita esperar a que el servo se restablezca antes de mover el ascensor hacia abajo; ambos pueden ocurrir a la vez.
fr_ca: Remarquez que la réinitialisation du servo de déversement et la rétraction de l'ascenseur partagent un même état. C'est parce que le robot n'a pas besoin d'attendre la réinitialisation du servo pour faire descendre l'ascenseur ; les deux peuvent se produire en même temps.
zh_cn: 请注意，重置倾卸伺服电机和缩回移位机是共用一个状态的。这是因为机器人在向下移动移位机之前不需要等待伺服器复位，它们可以同时进行。

source: Now, let's get into actually implementing the code for this. In a traditional ``OpMode``, which is commonly used for teleop, code runs repeatedly in a ``loop()`` function, so instead of waiting for a state transition to happen directly, the code will repeatedly check on each ``loop()`` call if it should perform a state transition. This kind of "update our state" pattern keeps code from blocking the rest of the ``loop()`` code from running, such as the drivetrain.
es_mx: Ahora, pasemos a implementar el código para esto. En un ``OpMode`` tradicional, que se utiliza comúnmente para teleoperación, el código se ejecuta repetidamente en una función ``loop()``, por lo que en lugar de esperar a que una transición de estado suceda directamente, el código comprobará repetidamente en cada llamada ``loop()`` si debe realizar una transición de estado. Este tipo de patrón "actualiza nuestro estado" evita que el código bloquee la ejecución del resto del código del ``loop()``, como el chasis.
fr_ca: Passons maintenant à l'implémentation du code. Dans un ``OpMode`` traditionnel, qui est communément utilisé pour la téléopération, le code s'exécute de façon répétée dans une fonction ``loop()``, donc au lieu d'attendre qu'une transition d'état se produise directement, le code vérifiera de façon répétée à chaque appel ``loop()` s'il doit effectuer une transition d'état. Ce type de modèle de "mise à jour de notre état" empêche le code de bloquer l'exécution du reste du code ``loop()``, tel que le groupe motopropulseur.
zh_cn: 现在，让我们来实际执行相关代码。在传统的 ``OpMode`` （通常用于远程操作）中，代码会在一个 ``loop()`` 函数中重复运行，因此代码不会直接等待状态转换的发生，而是会在每次 ``loop()``调用时重复检查是否应该执行状态转换。这种 "更新状态 "模式可以防止代码阻塞其他 ``loop()`` 代码的运行，例如传动系统。

source: The name of a finite state machine is very descriptive; it's a state machine, with a finite number of states. It can be in one state at a time, and can transition to a different state once something happens. For example, see the example of a finite state machine that's on `Wikipedia <https://en.wikipedia.org/wiki/Finite-state_machine#Example:_coin-operated_turnstile>`__ because a turnstile is a great example, and it is explained very well.
zh_cn: 有限状态机的名称非常具有描述性；它是一种状态机，具有有限个状态。它可以同时处于一种状态，一旦有事情发生，就可以过渡到另一种状态。例如，请参阅 `维基百科 <https://en.wikipedia.org/wiki/Finite-state_machine#Example:_coin-operated_turnstile>`__ 上的有限状态机旋转门的示例。因为旋转门就是一个很好的例子，而且解释得非常清楚。
