Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/concepts/kinematics.po
Languages: es_mx, fr_ca, zh_cn

source: Kinematics
es_mx: Cinemáticas
fr_ca: Cinématique
zh_cn: 运动学

source: Kinematics is the application of geometry to the control of various robot mechanisms. Kinematics equations are used to control mechanisms by providing specific inputs to achieve a desired output.
es_mx: La cinemática es la aplicación de la geometría al control de diversos mecanismos robóticos. Las ecuaciones cinemáticas se utilizan para controlar mecanismos proporcionando entradas específicas para lograr una salida deseada.
fr_ca: La cinématique est l'application de la géométrie au contrôle de divers mécanismes robotiques. Les équations cinématiques sont utilisées pour contrôler les mécanismes en fournissant des entrées spécifiques pour obtenir une sortie souhaitée.
zh_cn: 运动学是几何学在各种机器人机构控制中的应用。运动学方程通过提供特定的输入来控制机械装置，以实现所需的输出。

source: Many of the kinematics equations here were taken from `Controls Engineering in the FIRST Robotics Competition (book) <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ and `Mobile Robot Kinematics for FTC (paper) <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_, which contain the relevant derivations. While only tank (differential drive) and mecanum kinematics equations are shown here, these sources also contain derivations for other mechanisms such as swerve and dead wheel odometry.
es_mx: Muchas de las ecuaciones cinemáticas aquí fueron tomadas de `Controls Engineering in the FIRST Robotics Competition (libr) <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ y `Mobile Robot Kinematics for FTC (paper) <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_, que contienen las derivaciones pertinentes. Aunque aquí sólo se muestran las ecuaciones de la cinemática del tanque (accionamiento diferencial) y del mecanum, estas fuentes también contienen derivaciones para otros mecanismos como el swerve y la odometría de la rueda muerta.
fr_ca: La plupart des équations cinématiques présentées ici sont tirées de `Controls Engineering in the FIRST Robotics Competition (book) <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ et de `Mobile Robot Kinematics for FTC (paper) <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_, qui contiennent les dérivations correspondantes. Bien que seules les équations de la cinématique du réservoir (entraînement différentiel) et de la mécanique soient présentées ici, ces sources contiennent également des dérivations pour d'autres mécanismes tels que le pivotement et l'odométrie de la roue morte.
zh_cn: 这里的许多运动学方程式取自 `FIRST 机器人竞赛中的控制工程（书籍） <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_和 `FTC 移动机器人运动学（论文） <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_，其中包含相关推导。虽然这里只显示了坦克（差速驱动）和机械臂运动学方程，但这些资料还包含其他机构的推导，如转向和惰轮里程计。

source: Forward vs Inverse Kinematics
es_mx: Cinemática directa e inversa
fr_ca: Cinématique Directe et Inverse
zh_cn: 正向运动学与逆向运动学

source: Mechanisms may have different sets of equations for their forward and inverse kinematics. Forward kinematics are the equations used to determine the state of a system given the state of its outputs, whereas inverse kinematics determines the output of a system given the desired state. For example, in a drivetrain, forward kinematics would determine body velocity of the robot based on the individual velocities of the wheels, whereas inverse kinematics would determine the required wheel velocities for a desired body velocity.
es_mx: Los mecanismos pueden tener diferentes conjuntos de ecuaciones para su cinemática directa e inversa. La cinemática directa son las ecuaciones utilizadas para determinar el estado de un sistema dado el estado de sus salidas, mientras que la cinemática inversa determina la salida de un sistema dado el estado deseado. Por ejemplo, en una cadena cinemática, la cinemática directa determinaría la velocidad del cuerpo del robot en función de las velocidades individuales de las ruedas, mientras que la cinemática inversa determinaría las velocidades necesarias de las ruedas para una velocidad del cuerpo deseada.
fr_ca: Les mécanismes peuvent avoir différents ensembles d'équations pour leur cinématique avant et leur cinématique inverse. La cinématique directe est l'équation utilisée pour déterminer l'état d'un système en fonction de l'état de ses sorties, tandis que la cinématique inverse détermine la sortie d'un système en fonction de l'état souhaité. Par exemple, dans une chaîne cinématique, la cinématique avant détermine la vitesse du corps du robot sur la base des vitesses individuelles des roues, tandis que la cinématique inverse détermine les vitesses requises des roues pour une vitesse souhaitée du corps.
zh_cn: 机械装置的正向和逆向运动学可能有不同的方程组。正向运动学是根据系统的输出状态来确定系统状态的方程，而逆向运动学则是根据所需的状态来确定系统的输出。例如，在动力传动系统中，正向运动学将根据车轮的单个速度确定机器人的车身速度，而逆向运动学将根据所需的车身速度确定所需的车轮速度。

source: Tank (Differential Drive)
es_mx: Tanque (accionamiento diferencial)
fr_ca: Char/Tank (entraînement différentiel)
zh_cn: 坦克底盘（差动驱动）

source: A tank, or differential drive, is a drivetrain consisting of two sets of wheels on either side of the robot that are independently driven. These are described under further detail in the :doc:`/docs/common-mechanisms/drivetrains/tank` section.
es_mx: Un tanque, o diferencial, es un sistema de transmisión que consta de dos juegos de ruedas a cada lado del robot que se accionan de forma independiente. Se describen con más detalle en la sección :doc:`/docs/common-mechanisms/drivetrains/tank`.
fr_ca: Un tank, ou entraînement différentiel, est une chaîne cinématique composée de deux ensembles de roues situées de chaque côté du robot et entraînées de manière indépendante. Ils sont décrits plus en détail dans la section :doc:`/docs/common-mechanisms/drivetrains/tank`.
zh_cn: 坦克或差速驱动是一种传动系统，由机器人两侧独立驱动的两组车轮组成。更多详情请参见 :doc:`/docs/common-mechanisms/drivetrains/tank` 部分。

source: Variables
zh_cn: 变量

source: The following variables are used in this section.
es_mx: En esta sección se utilizan las siguientes variables.
fr_ca: Les variables suivantes sont utilisées dans cette section.
zh_cn: 本节使用以下变量。

source: :math:`v_r` denotes the linear velocity of the right wheel(s)
es_mx: :math:`v_r` indica la velocidad lineal de la(s) rueda(s) derecha(s)
fr_ca: :math:`v_r` désigne la vitesse linéaire de la (des) roue(s) droite(s)
zh_cn: :math:`v_r` 表示右轮的线速度

source: :math:`v_l` denotes the linear velocity of the left wheel(s)
es_mx: :math:`v_l` indica la velocidad lineal de la(s) rueda(s) izquierda(s)
fr_ca: :math:`v_l` désigne la vitesse linéaire de la (des) roue(s) gauche(s)
zh_cn: :math:`v_l` 表示左轮的线速度

source: :math:`v_f` denotes the forward velocity of the robot, relative to itself
es_mx: :math:`v_f` denota la velocidad de avance del robot, relativa a sí mismo
fr_ca: :math:`v_f` désigne la vitesse d'avancement du robot par rapport à lui-même
zh_cn: :math:`v_f` 表示机器人相对于自身的前进速度

source: :math:`\omega` denotes the rotational velocity of the robot in radians/second
es_mx: :math:`\omega` indica la velocidad de rotación del robot en radianes/segundo
fr_ca: :math:`\omega` indique la vitesse de rotation du robot en radians/seconde
zh_cn: :math:`\omega` 表示机器人的旋转速度，单位为弧度/秒

source: :math:`r_b` denotes the base track radius, or the distance between the wheel and center of the robot (half of the distance between wheels)
es_mx: :math:`r_b` indica el radio de la pista base, o la distancia entre la rueda y el centro del robot (la mitad de la distancia entre ruedas)
fr_ca: :math:`r_b` indique le rayon de la piste de base, ou la distance entre la roue et le centre du robot (la moitié de la distance entre les roues).
zh_cn: :math:`r_b` 表示基本轨道半径，或车轮与机器人中心之间的距离（车轮间距的一半）。

source: These variables, with the exception of :math:`\omega`, represent **linear** velocities NOT **rotational** velocities. Wheel rotational velocity in radians/second can be converted to linear velocity by multiplying by the wheel's radius.
es_mx: Estas variables, con la excepción de :math:`\omega`, representan **velocidades lineales** NO **velocidades de rotación**. La velocidad de rotación de la rueda en radianes/segundo puede convertirse en velocidad lineal multiplicándola por el radio de la rueda.
fr_ca: Ces variables, à l'exception de :math:`\noméga`, représentent des vitesses **linéaires** et NON des vitesses **rotationnelles**. La vitesse de rotation de la roue en radians/seconde peut être convertie en vitesse linéaire en la multipliant par le rayon de la roue.
zh_cn: 除了 :math:`\omega` 之外，这些变量代表的是 **线性** 速度，而不是 **旋转** 速度。以弧度/秒为单位的车轮旋转速度可以通过乘以车轮半径转换为线速度。

source: Positive rotational velocity (:math:`\omega`) will spin the robot COUNTERCLOCKWISE when viewed from above.
es_mx: La velocidad de rotación positiva (:math:`\omega`) hará girar al robot en SENTIDO CONTRAHORARIO visto desde arriba.
fr_ca: Une vitesse de rotation positive (:math:`\noméga`) fait tourner le robot dans le sens inverse des aiguilles d'une montre lorsqu'on le regarde d'en haut.
zh_cn: 正的旋转速度（:math:`\omega`）将使机器人从上方看时顺时针旋转。

source: Forward Kinematics
es_mx: Cinemática de avance
fr_ca: Cinématique avant
zh_cn: 正向运动学

source: The forward kinematics of a tank drive relate the velocity of the wheels to the forward and rotational velocities of the robot, relative to itself. The forward velocity :math:`v_f` and the rotational velocity :math:`v_{\theta}` is:
es_mx: La cinemática de avance de la propulsión de un tanque relaciona la velocidad de las ruedas con las velocidades de avance y rotación del robot, respecto a sí mismo. La velocidad de avance :math:`v_f` y la velocidad de rotación :math:`v_{\theta}` son:
fr_ca: La cinématique d'avancement d'un tank drive relie la vitesse des roues aux vitesses d'avancement et de rotation du robot par rapport à lui-même. La vitesse d'avancement :math:`v_f` et la vitesse de rotation :math:`v_{\theta}` sont :
zh_cn: 坦克驱动装置的前进运动学将车轮的速度与机器人相对于自身的前进速度和旋转速度联系起来。前进速度 :math:`v_f` 和旋转速度 :math:`v_{\theta}` 为：

source: Inverse Kinematics
es_mx: Cinemática inversa
fr_ca: Cinématique inverse
zh_cn: 反向运动学

source: The inverse kinematics of a tank drive relate the desired velocity of the robot to the velocity required of the wheels. These velocities are as follows:
es_mx: La cinemática inversa del accionamiento de un tanque relaciona la velocidad deseada del robot con la velocidad requerida de las ruedas. Estas velocidades son las siguientes
fr_ca: La cinématique inverse d'un entraînement de char relie la vitesse souhaitée du robot à la vitesse requise des roues. Ces vitesses sont les suivantes :
zh_cn: 坦克驱动装置的逆运动学将机器人的期望速度与车轮所需的速度联系起来。这些速度如下：

source: Mecanum Drive
fr_ca: Châssis Mecanum
zh_cn: 麦克纳姆轮底盘

source: Mecanum kinematics uses the same variables as differential drive, except with four wheel velocity variables and an additional robot velocity vector for the left to right velocity.
es_mx: La cinemática Mecanum utiliza las mismas variables que el accionamiento diferencial, excepto con cuatro variables de velocidad de las ruedas y un vector de velocidad adicional del robot para la velocidad de izquierda a derecha.
fr_ca: La cinématique Mecanum utilise les mêmes variables que l'entraînement différentiel, à l'exception des quatre variables de vitesse des roues et d'un vecteur de vitesse supplémentaire du robot pour la vitesse de gauche à droite.
zh_cn: 麦克纳姆底盘的运动学使用的变量与差分驱动相同，但有四个车轮速度变量和一个额外的机器人速度矢量（从左到右的速度）。

source: :math:`v_\mathrm{fr}` denotes the linear velocity of the front (leading) right wheel
es_mx: :math:`v_\mathrm{fr}` indica la velocidad lineal de la rueda delantera (delantera) derecha
fr_ca: :math:`v_\mathrm{fr}` désigne la vitesse linéaire de la roue avant droite (en tête)
zh_cn: :math:`v_\mathrm{fr}` 表示右前轮的线速度

source: :math:`v_\mathrm{br}` denotes the linear velocity of the back (trailing) right wheel
es_mx: :math:`v_\mathrm{br}` indica la velocidad lineal de la rueda trasera (trasera) derecha
fr_ca: :math:`v_\mathrm{br}` désigne la vitesse linéaire de la roue droite arrière (arrière)
zh_cn: :math:`v_\mathrm{br}` 表示右后轮的线速度

source: :math:`v_\mathrm{fl}` denotes the linear velocity of the front (leading) left wheel(s)
es_mx: :math:`v_\mathrm{fl}` indica la velocidad lineal de la(s) rueda(s) delantera(s) izquierda(s).
fr_ca: :math:`v_\mathrm{fl}` désigne la vitesse linéaire de la (des) roue(s) avant gauche.
zh_cn: :math:`v_\mathrm{fl}` 表示左前轮的线速度

source: :math:`v_\mathrm{bl}` denotes the linear velocity of the back (trailing) left wheel(s)
es_mx: :math:`v_\mathrm{bl}` indica la velocidad lineal de la(s) rueda(s) trasera(s) izquierda(s).
fr_ca: :math:`v_\mathrm{bl}` désigne la vitesse linéaire de la (des) roue(s) arrière(s) gauche(s)
zh_cn: :math:`v_\mathrm{bl}` 表示左后轮的线速度

source: :math:`v_f` denotes the forward velocity of the robot, relative to itself.
es_mx: :math:`v_f` denota la velocidad de avance del robot, relativa a sí mismo.
fr_ca: :math:`v_f` indique la vitesse d'avancement du robot par rapport à lui-même.
zh_cn: :math:`v_f` 表示机器人相对于自身的前进速度。

source: :math:`v_s` denotes the strafe (sideways) velocity of the robot, relative to itself.
es_mx: :math:`v_s` indica la velocidad de desplazamiento (lateral) del robot respecto a sí mismo.
fr_ca: :math:`v_s` indique la vitesse de déplacement du robot, par rapport à lui-même.
zh_cn: :math:`v_s` 表示机器人相对于自身的横移（侧移）速度。

source: :math:`r_b` represents the base track radius, or the distance between the wheel and center of the robot (half of the distance between wheels)
es_mx: :math:`r_b` representa el radio de la pista base, o la distancia entre la rueda y el centro del robot (la mitad de la distancia entre ruedas)
fr_ca: :math:`r_b` représente le rayon de la piste de base, ou la distance entre la roue et le centre du robot (la moitié de la distance entre les roues).
zh_cn: :math:`r_b` 表示基本轨道半径，或车轮与机器人中心之间的距离（车轮间距离的一半）。

source: The forward kinematics of a mecanum drive relate the velocity of the wheels to the forward, strafe, and rotational velocities of the robot, relative to itself. These are as follows:
es_mx: La cinemática de avance de un accionamiento mecanum relaciona la velocidad de las ruedas con las velocidades de avance, derrape y rotación del robot respecto a sí mismo. Son las siguientes:
fr_ca: La cinématique de marche avant d'un entraînement mécanique relie la vitesse des roues aux vitesses de marche avant, de marche arrière et de rotation du robot par rapport à lui-même. Ces vitesses sont les suivantes :
zh_cn: 麦克纳姆轮底盘的正向运动学将车轮的速度与机器人相对于自身的前向、侧移和旋转速度联系起来。这些是：

source: The inverse kinematics of a mecanum drive relate the desired velocity of the robot to the velocity required on the wheels. These are as follows:
es_mx: La cinemática inversa de un accionamiento mecanum relaciona la velocidad deseada del robot con la velocidad requerida en las ruedas. Éstas son las siguientes:
fr_ca: La cinématique inverse d'un entraînement mécanique relie la vitesse souhaitée du robot à la vitesse requise sur les roues. Il s'agit des éléments suivants :
zh_cn: 麦克纳姆轮底盘的逆运动学将机器人的期望速度与车轮所需的速度联系起来。具体如下
