Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/concepts/odometry.po
Languages: es_mx, fr_ca, zh_cn

source: Odometry
es_mx: Odometría
fr_ca: Odométrie
zh_cn: 里程计

source: Odometry is a form of localization that uses data from sensors like encoders to derive an estimated position relative to a starting point. Localization is a means for being able to locate the position of the bot at some point in time. Odometry is especially useful in autonomous programs because it allows for easier implementation of different tasks on the field due to understanding one's position.
es_mx: La odometría es una forma de localización que utiliza datos de sensores como codificadores para obtener una posición estimada en relación con un punto de partida. La localización es un medio para poder situar la posición del robot en un momento dado. La odometría es especialmente útil en programas autónomos porque permite realizar más fácilmente distintas tareas sobre el terreno gracias a la comprensión de la propia posición.
fr_ca: L'odométrie est une forme de localisation qui utilise des données provenant de capteurs tels que des encodeurs pour obtenir une position estimée par rapport à un point de départ. La localisation est un moyen de localiser la position du robot à un moment donné. L'odométrie est particulièrement utile dans les programmes autonomes car elle permet de faciliter l'exécution de différentes tâches sur le terrain grâce à la compréhension de sa propre position.
zh_cn: 里程计是一种定位形式，它使用来自编码器等传感器的数据来推导相对于起点的估计位置。定位是一种能够在某个时间点定位机器人位置的手段。里程计在自主程序中特别有用，因为它允许了解自己的位置而更容易地在场地上执行不同的任务。

source: We refer to pose, which is the position of some body (like a bot), normally in the context two-dimensional space, as the movement of the robot is generally constrained to a single plane. We notate the robot's pose as :math:`\vec{x}`. A pose contains two entries: the robot's position and heading; position is generally in Cartesian coordinates, so the pose can be represented with :math:`x`, :math:`y`, and :math:`\theta`. A "heading" is a term for the direction towards which the front of the robot is facing. Because of this, the robot's coordinate frame is set up such that the global x-axis is lined up with the 0 heading.
es_mx: Nos referimos a la pose, que es la posición de algún cuerpo (como un robot), normalmente en el contexto del espacio bidimensional, ya que el movimiento del robot está generalmente restringido a un solo plano. Anotamos la pose del robot como :math:`\vec{x}`. Una pose contiene dos entradas: la posición y el rumbo del robot; la posición suele estar en coordenadas cartesianas, por lo que la pose puede representarse con :math:`x`, :math:`y` y :math:`\theta`. Un "rumbo" es un término para la dirección hacia la que está orientada la parte frontal del robot. Debido a esto, el marco de coordenadas del robot está configurado de tal forma que el eje x global está alineado con el rumbo 0.
fr_ca: Nous nous référons à la pose, qui est la position d'un corps (comme un robot), normalement dans le contexte d'un espace bidimensionnel, puisque le mouvement du robot est généralement contraint à un seul plan. Nous notons la pose du robot comme :math:`\vec{x}`. Une pose contient deux entrées : la position et le cap du robot ; la position est généralement en coordonnées cartésiennes, de sorte que la pose peut être représentée par :math:`x`, :math:`y`, et :math:`\theta`. Un "cap" est un terme qui désigne la direction vers laquelle l'avant du robot est orienté. Pour cette raison, le cadre de coordonnées du robot est configuré de manière à ce que l'axe x global soit aligné sur le cap 0.
zh_cn: 我们所说的姿态是指某个物体（如机器人）的位置，通常是在二维空间中，因为机器人的运动通常受限于单一平面。我们将机器人的姿势记为 :math:`\vec{x}`。一个姿势包含两个条目：机器人的位置和方向；位置一般采用直角坐标，因此姿势可以用 :math:`x`, :math:`y` 和 :math:`\theta` 表示。方向 "是指机器人前方所朝的方向。因此，机器人坐标系的全局 x 轴与 0 方向一致。

source: The directional axes of the robot with respect to its body
es_mx: Los ejes direccionales del robot con respecto a su cuerpo
fr_ca: Les axes directionnels du robot par rapport à son corps
zh_cn: 机器人相对于本体的方向轴

source: `Road Runner Coordinate Frame Documentation <https://acme-robotics.gitbook.io/road-runner/tour/coordinate-frame>`_
es_mx: `Road Runner Documentación del Marco de Coordenadas <https://acme-robotics.gitbook.io/road-runner/tour/coordinate-frame>`_
zh_cn: `Road Runner 坐标框架文档<https://acme-robotics.gitbook.io/road-runner/tour/coordinate-frame>`_

source: We can refer to the current pose (:math:`\vec{x}_0`) of the robot as :math:`\begin{pmatrix} x_0 \\ y_0 \\ \theta_0 \end{pmatrix}`. This is just fancy notation for a point on the field :math:`(x_0, y_0)` with a specified orientation of the robot--the heading :math:`\theta_0`. A pose generally has some beginning origin in the coordinate frame.
es_mx: Podemos referirnos a la pose actual (:math:`\vec{x}_0`) del robot como :math:`\begin{pmatrix} x_0 \ y_0 \\theta_0 \end{pmatrix}`. Esto es sólo una notación de fantasía para un punto en el campo :math:`(x_0, y_0)` con una orientación especificada del robot--el rumbo :math:`\theta_0`. Una pose generalmente tiene un origen inicial en el marco de coordenadas.
fr_ca: Nous pouvons nous référer à la position actuelle (:math:\vec{x}_0`) du robot comme :math:\begin{pmatrix} x_0 \\ y_0 \ \theta_0 \end{pmatrix}`. C'est juste une notation fantaisiste pour un point sur le champ :math:`(x_0, y_0)` avec une orientation spécifiée du robot - le titre :math:\theta_0`. Une pose a généralement un point d'origine dans le cadre de coordonnées.
zh_cn: 我们可以把机器人当前的姿态（:math:`\vec{x}_0`）称为 :math:`begin{pmatrix} x_0 \y_0 \\theta_0 \end{pmatrix}`。这只是一个花哨的符号，表示在:math:`(x_0, y_0)`场上的一个点，机器人有一个指定的方向--标题:math:`theta_0`。一个姿态通常在坐标系中有一个起始原点。

source: Updating the Pose
es_mx: Actualizar la pose
fr_ca: Mise à jour de la pose
zh_cn: 更新姿态

source: The change in pose over some very small amount of time is :math:`\Delta \vec{x}`. The difference in time between the current pose and the last pose should be as small as possible to improve the approximations for the math. Teams should update their robot pose every cycle of their control loop.
es_mx: El cambio de pose a lo largo de un periodo de tiempo muy pequeño es :math:`\Delta \vec{x}`. La diferencia de tiempo entre la pose actual y la última pose debe ser lo más pequeña posible para mejorar las aproximaciones matemáticas. Los equipos deben actualizar la pose de su robot en cada ciclo de su bucle de control.
fr_ca: Le changement de pose sur une très petite période de temps est :math:\Delta \vec{x}`. La différence de temps entre la pose actuelle et la dernière pose doit être aussi petite que possible pour améliorer les approximations mathématiques. Les équipes doivent mettre à jour la position de leur robot à chaque cycle de leur boucle de contrôle.
zh_cn: 在极短的时间内姿态的变化是 :math:`\Delta \vec{x}`。当前姿态与上次姿态之间的时间差应尽可能小，以改善数学近似值。参赛队应在控制循环的每个周期更新机器人姿态。

source: Updating the pose is as simple as adding the transformed change to the previous pose where :math:`\varphi = \Delta\theta`
es_mx: Actualizar la pose es tan sencillo como añadir el cambio transformado a la pose anterior donde :math:`\varphi = \Delta\theta`
fr_ca: La mise à jour de la pose est aussi simple que l'ajout du changement transformé à la pose précédente où :math:``varphi = \Delta\theta``
zh_cn: 更新姿态非常简单，只需将变换后的变化添加到之前的姿态中即可，其中 :math:`\varphi = \Delta\theta`

source: \begin{pmatrix} x \\ y \\ \theta \end{pmatrix} = \begin{pmatrix} x_0 \\ y_0\\ \theta_0 \end{pmatrix} + \begin{pmatrix} \Delta x \\ \Delta y \\ \varphi \end{pmatrix}
es_mx: \empezar{pmatrix} x \\ y \\ \theta \fin{pmatrix} = \Inicio{pmatrix} x_0 \\ y_0\\ \theta_0 \end{pmatrix} + \Inicio{pmatrix} \Delta x \Delta y \varphi \fin{pmatrix}

source: The idea of odometry is to use sensor data and math to form an approximation for the robot's pose over time.
es_mx: La idea de la odometría es utilizar los datos de los sensores y las matemáticas para formar una aproximación de la pose del robot a lo largo del tiempo.
fr_ca: L'idée de l'odométrie est d'utiliser les données des capteurs et les mathématiques pour former une approximation de la position du robot au fil du temps.
zh_cn: 里程测量法的原理是利用传感器数据和数学运算，对机器人在一段时间内的姿态算出近似值。

source: Finding the Change in Position
es_mx: Determinación del cambio de posición
fr_ca: Détermination du changement de position
zh_cn: 查找位置变化

source: In order to determine the current location of the robot and update its pose, the change must be calculated using data read from the sensors. For a robot, there will be three possible sensors that you can use: two that are parallel with the robot's body in the :math:`x`-direction and one that is aligned with the :math:`y`-direction of movement (perpendicular to the drive wheels).
es_mx: Para determinar la posición actual del robot y actualizar su pose, el cambio debe calcularse utilizando los datos leídos de los sensores. Para un robot, habrá tres sensores posibles que se pueden utilizar: dos que son paralelos al cuerpo del robot en la dirección :math:`x` y uno que está alineado con la dirección de movimiento :math:`y` (perpendicular a las ruedas motrices).
fr_ca: Afin de déterminer la position actuelle du robot et de mettre à jour sa pose, le changement doit être calculé à l'aide des données lues par les capteurs. Pour un robot, vous pouvez utiliser trois capteurs : deux qui sont parallèles au corps du robot dans la direction :math:`x` et un qui est aligné avec la direction :math:`y` du mouvement (perpendiculaire aux roues motrices).
zh_cn: 为了确定机器人的当前位置并更新其姿态，必须使用从传感器读取的数据来计算变化。对于机器人来说，有三个传感器可供使用：两个在 :math:`x` 方向上与机器人身体平行，一个与 :math:`y` 运动方向对齐（垂直于驱动轮）。

source: Angle and Displacement
es_mx: Ángulo y desplazamiento
fr_ca: Angle et déplacement
zh_cn: 角度和位移

source: The displacement (or change in position) of the left sensor is :math:`\Delta x_l` and the displacement of the right sensor is :math:`\Delta x_r`. The lateral distance between these two sensors is called the trackwidth, notated as :math:`L`. This is very important for determining angle for turning approximations. This value will need to be tuned, which means tested repeatedly and then brought to some converging value that is close to the actual measurement.
es_mx: El desplazamiento (o cambio de posición) del sensor izquierdo es :math:`\Delta x_l` y el desplazamiento del sensor derecho es :math:`\Delta x_r`. La distancia lateral entre estos dos sensores se denomina ancho de vía, anotada como :math:`L`. Esto es muy importante para determinar el ángulo para aproximaciones de giro. Este valor tendrá que ser sintonizado, lo que significa probado repetidamente y luego llevado a algún valor convergente que esté cerca de la medición real.
fr_ca: Le déplacement (ou changement de position) du capteur gauche est :math:`Delta x_l` et le déplacement du capteur droit est :math:\Delta x_r`. La distance latérale entre ces deux capteurs est appelée largeur de la voie, notée :math:`L`. Cette valeur est très importante pour déterminer l'angle des approximations de virage. Cette valeur devra être ajustée, c'est-à-dire testée à plusieurs reprises, puis amenée à une valeur convergente proche de la mesure réelle.
zh_cn: 左边传感器的位移（或位置变化）为 :math:`\Delta x_l`，右边传感器的位移为 :math:`\Delta x_r`。这两个传感器之间的横向距离称为轨迹宽度，记为 :math:`L`。这对于确定转弯近似角度非常重要。这个值需要调整，也就是反复测试，然后达到某个接近实际测量值的趋近值。

source: The lateral distance, forward offset, and location of the sensors
es_mx: La distancia lateral, el desplazamiento hacia delante y la ubicación de los sensores
fr_ca: La distance latérale, le décalage vers l'avant et l'emplacement des capteurs
zh_cn: 传感器的横向距离、前偏和位置

source: Deriving the value of :math:`\varphi` then becomes simple:
es_mx: Derivar el valor de :math:`\varphi` se convierte entonces en algo sencillo:
fr_ca: Le calcul de la valeur de :math:``varphi`` devient alors simple :
zh_cn: 因此，推导 :math:`\varphi` 的值就变得简单了：

source: To perform later calculations, we need to know the displacement of the robot in the x-direction relative to its center rather than the two parallel sensors. To do this, we take the average to derive :math:`\Delta x_c`, or the center displacement:
es_mx: Para realizar los cálculos posteriores, necesitamos conocer el desplazamiento del robot en la dirección x respecto a su centro y no respecto a los dos sensores paralelos. Para ello, tomamos la media para obtener :math:`\Delta x_c`, o el desplazamiento central:
fr_ca: Pour effectuer les calculs ultérieurs, nous avons besoin de connaître le déplacement du robot dans la direction x par rapport à son centre plutôt que par rapport aux deux capteurs parallèles. Pour ce faire, nous prenons la moyenne pour obtenir :math:`\Delta x_c`, ou le déplacement du centre :
zh_cn: 为了进行后面的计算，我们需要知道机器人在 x 方向上相对于其中心的位移，而不是两个平行传感器的位移。为此，我们取平均值得出 :math:`\Delta x_c`，即中心位移：

source: The final displacement we need before we can determine the change in pose is the horizontal displacement :math:`\Delta x_\perp`. This is the displacement of the perpendicular sensor :math:`\Delta x_h` with a correction for forward offset :math:`F`. In order to get accurate approximations, the forward offset needs to be considered. When the sensor is closer to the back, the offset is negative, but when it is closer to the front, it is positive. This is to account for the change in its position based on point-turns.
es_mx: El desplazamiento final que necesitamos antes de poder determinar el cambio de pose es el desplazamiento horizontal :math:`\Delta x_\perp`. Este es el desplazamiento del sensor perpendicular :math:`\Delta x_h` con una corrección por desplazamiento hacia delante :math:`F`. Para obtener aproximaciones precisas, es necesario tener en cuenta el desplazamiento hacia delante. Cuando el sensor está más cerca de la parte trasera, el desplazamiento es negativo, pero cuando está más cerca de la parte delantera, es positivo. Esto es para tener en cuenta el cambio en su posición basado en puntos de giro.
fr_ca: Le dernier déplacement dont nous avons besoin avant de pouvoir déterminer le changement de pose est le déplacement horizontal :math:\Delta x_\perp`. Il s'agit du déplacement du capteur perpendiculaire :math:\Delta x_h` avec une correction pour le décalage vers l'avant :math:`F`. Pour obtenir des approximations précises, il faut tenir compte du décalage vers l'avant. Lorsque le capteur est plus proche de l'arrière, le décalage est négatif, mais lorsqu'il est plus proche de l'avant, il est positif. Cela permet de prendre en compte le changement de position du capteur en fonction de la rotation des points.
zh_cn: 在确定姿态变化之前，我们需要的最后一个位移是水平位移 :math:`\Delta x_\perp`。这是垂直传感器的位移 :math:`\Delta x_h` 加上前向偏移的修正 :math:`F`。为了得到精确的近似值，需要考虑前向偏移。当传感器更靠近后方时，偏移量为负，但当传感器更靠近前方时，偏移量为正。这是为了考虑其位置在点转动时的变化。

source: As a result of this, we can define our horizontal displacement as:
es_mx: Como resultado de esto, podemos definir nuestro desplazamiento horizontal como:
fr_ca: Par conséquent, nous pouvons définir notre déplacement horizontal comme suit :
zh_cn: 因此，我们可以将水平位移定义为

source: If you do not have perpendicular sensors, which are not required if the robot cannot move in the lateral direction, :math:`\Delta x_\perp` is not necessary.
es_mx: Si no tiene sensores perpendiculares, que no son necesarios si el robot no puede moverse en la dirección lateral, :math:`\Delta x_\perp` no es necesario.
fr_ca: Si vous n'avez pas de capteurs perpendiculaires, qui ne sont pas nécessaires si le robot ne peut pas se déplacer dans la direction latérale, :math:``Delta x_\perp` n'est pas nécessaire.
zh_cn: 如果没有垂直传感器（如果机器人不能横向移动，则不需要垂直传感器），则不需要 :math:`\Delta x_\perp`。

source: For this value, use 0 if you do not have a horizontal sensor.
es_mx: Para este valor, utilice 0 si no dispone de sensor horizontal.
fr_ca: Pour cette valeur, utilisez 0 si vous n'avez pas de capteur horizontal.
zh_cn: 如果没有水平传感器，该值应为 0。

source: Robot-Relative Deltas
es_mx: Deltas relativos a robots
fr_ca: Deltas relatifs aux robots
zh_cn: 机器人相关变化量

source: Let's come up with a simplified, nonoptimal way to calculate our robot-relative pose deltas which we can then transform into field-relative coordinate changes. To perform this we need to transform the robot-relative deltas via a rotation matrix where we rotate the relative pose difference by the original heading. We can derive the values of :math:`\Delta x` and :math:`\Delta y`.
es_mx: Vamos a idear una forma simplificada y no óptima de calcular los deltas de la pose relativa de nuestro robot, que luego podremos transformar en cambios de coordenadas relativos al campo. Para ello, tenemos que transformar los deltas relativos al robot a través de una matriz de rotación donde giramos la diferencia de pose relativa por el rumbo original. Podemos obtener los valores de :math:`\Delta x` y :math:`\Delta y`.
fr_ca: Proposons une méthode simplifiée et non optimale pour calculer les deltas de pose relatifs du robot, que nous pourrons ensuite transformer en changements de coordonnées relatifs au champ. Pour ce faire, nous devons transformer les deltas relatifs du robot via une matrice de rotation où nous faisons pivoter la différence de pose relative par le cap d'origine. Nous pouvons dériver les valeurs de :math:\Delta x` et :math:\Delta y`.
zh_cn: 让我们用一种简化的、非最佳的方法来计算机器人相对姿态差，然后将其转换为相对场地坐标变化。为此，我们需要通过一个旋转矩阵来转换机器人的相对位置差，在这个矩阵中，我们用原始方向来旋转相对位置差。我们可以得出 :math:`\Delta x` 和 :math:`\Delta y` 的值。

source: \begin{pmatrix} \Delta x \\ \Delta y \\ \varphi \end{pmatrix} = \begin{pmatrix} \cos(\theta_0)&-\sin(\theta_0)&0\\ \sin(\theta_0)&\cos(\theta_0)&0\\ 0&0&1\end{pmatrix} \begin{pmatrix} \Delta x_c\\ \Delta x_\perp\\ \varphi \end{pmatrix}
es_mx: \Inicio{pmatrix} \Delta x \Delta y \varphi \fin{pmatrix} = \Inicio{pmatrix} \cos(\theta_0)&amp;-\sin(\theta_0)&amp;0\\ \sin(\theta_0)&amp;\cos(\theta_0)&amp;0\\ 0&amp;0&amp;1 fin{pmatrix} \Inicio{pmatrix} \Delta x_c \delta x-perp \varphi \fin{pmatrix}

source: From this, we can calculate our field-relative change in pose:
es_mx: A partir de ahí, podemos calcular nuestro cambio de pose relativo al campo:
fr_ca: À partir de là, nous pouvons calculer notre changement de position relatif au champ :
zh_cn: 由此，我们可以计算出我们的姿态的相对场地变化：

source: \begin{pmatrix} \Delta x \\ \Delta y \\ \varphi \end{pmatrix} = \begin{pmatrix} \Delta x_c \cos(\theta_0) - \Delta x_\perp \sin(\theta_0) \\ \Delta x_c \sin(\theta_0) + \Delta x_\perp \cos(\theta_0)\\ \varphi \end{pmatrix}
es_mx: \Inicio{pmatrix} \Delta x \Delta y \varphi \fin{pmatrix} = \Inicio{pmatrix} \delta x_c \cos(\theta_0) - delta x_\perp \sin(\theta_0) \ \delta x_c sin (zeta_0) + delta x_perp sin (zeta_0) \VARPHI \Fin{pmatrix}

source: This method of approximating position is known as Euler integration, but we are using it for strict pose deltas instead of integrating the velocity (essentially, this is a very simplified version of the original theory).
es_mx: Este método de aproximación de la posición se conoce como integración de Euler, pero lo estamos utilizando para deltas de pose estrictos en lugar de integrar la velocidad (en esencia, se trata de una versión muy simplificada de la teoría original).
fr_ca: Cette méthode d'approximation de la position est connue sous le nom d'intégration d'Euler, mais nous l'utilisons pour les deltas de pose stricts au lieu d'intégrer la vitesse (il s'agit essentiellement d'une version très simplifiée de la théorie originale).
zh_cn: 这种近似位置的方法被称为欧拉积分法，但我们用它来计算精确的姿态变化量，而不是对速度进行积分（本质上，这是原始理论的一个非常简化的版本）。

source: This is for advanced programmers; while implementing this from scratch is a great learning exercise, it is likely not the optimal way to get the best auto. There are several `resources <#resources-for-odometry>`_ out there for producing great, well-tested, and easy-to-implement odometry.
es_mx: Esto es para programadores avanzados; mientras que implementar esto desde cero es un gran ejercicio de aprendizaje, probablemente no sea la forma óptima de obtener el mejor auto. Hay varios `recursos <#resources-for-odometry>`_ por ahí para producir una gran odometría, bien probada y fácil de implementar.
fr_ca: Ceci s'adresse aux programmeurs avancés ; bien que la mise en œuvre de cette méthode à partir de zéro soit un excellent exercice d'apprentissage, ce n'est probablement pas la meilleure façon d'obtenir la meilleure auto. Il existe plusieurs `ressources <#resources-for-odometry>`_ pour produire une odométrie de qualité, bien testée et facile à mettre en œuvre.
zh_cn: 这是为高级程序员准备的；虽然从头开始实施是一个很好的练习，但这可能不是获得最佳自动驾驶的最佳方法。现在有很多 "资源 <#resources-for-odometry>`_"可以制作出优秀的、经过良好测试的、易于实施的里程计。

source: Odometry Pseudocode
es_mx: Pseudocódigo de odometría
fr_ca: Pseudocode d'Odométrie
zh_cn: 里程计伪代码

source: Using Pose Exponentials
es_mx: Uso de exponenciales de pose
fr_ca: Utilisation des exponentielles de pose
zh_cn: 使用姿态指数

source: This method uses differential equations to solve the nonlinear position of the robot given constant curvature. Euler integration assumes that the robot follows a straight path between updates, which can lead to inaccurate approximations when traveling around curves. If you are interested in the math itself, we recommend you check out `this book <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ for FRC\ |reg| controls.
es_mx: Este método utiliza ecuaciones diferenciales para resolver la posición no lineal del robot dada una curvatura constante. La integración de Euler asume que el robot sigue una trayectoria recta entre actualizaciones, lo que puede conducir a aproximaciones inexactas cuando se viaja alrededor de curvas. Si usted está interesado en las matemáticas en sí, le recomendamos que consulte `este libro <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ para FRC\ |reg| controles.
fr_ca: Cette méthode utilise des équations différentielles pour résoudre la position non linéaire du robot à courbure constante. L'intégration d'Euler suppose que le robot suit une trajectoire rectiligne entre les mises à jour, ce qui peut conduire à des approximations inexactes lorsqu'il se déplace dans des courbes. Si vous êtes intéressé par les mathématiques elles-mêmes, nous vous recommandons de consulter `ce livre <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ pour les commandes FRC\ |reg|.
zh_cn: 在曲率不变的情况下，这种方法使用微分方程来求解机器人的非线性位置。欧拉积分法假定机器人在两次更新之间遵循直线路径，这可能会导致机器人在曲线上行驶时的近似值不准确。如果您对数学本身感兴趣，我们建议您查看 "这本书 <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_有关 FRC\ |reg| 控制的内容。

source: We'll treat the way it is solved in this page as a black box, and derive the formula by implementing a correction for this nonlinear curvature into our Euler integration robot-relative deltas equation:
es_mx: Trataremos la forma en que se resuelve en esta página como una caja negra, y derivaremos la fórmula implementando una corrección para esta curvatura no lineal en nuestra ecuación de deltas relativos al robot de integración de Euler:
fr_ca: Nous traiterons la façon dont elle est résolue dans cette page comme une boîte noire, et nous déduirons la formule en appliquant une correction pour cette courbure non linéaire dans notre équation d'intégration d'Euler relative aux deltas des robots :
zh_cn: 我们将把本页中的求解方式视为一个黑盒子，并通过在欧拉积分机器人相关三角方程中对非线性曲率进行修正来推导出公式：

source: Resources for Odometry
es_mx: Recursos para la odometría
fr_ca: Ressources pour l'odométrie
zh_cn: 里程计资源
