Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/concepts/odometry.po
Languages: es_mx, fr_ca, zh_cn

source: There are several great resources out there for odometry. We highly recommend `Road Runner <https://acme-robotics.gitbook.io/road-runner/>`_. For the math behind Road Runner (which utilizes pose exponentials), you can also read `Ryan's paper <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_. An additional resource for Road Runner is `Learn Road Runner <https://learnroadrunner.com/>`_ which is a step-by-step procedural guide that explains how to work with the `Road Runner quickstart <https://github.com/acmerobotics/road-runner-quickstart>`_.
es_mx: Existen varios recursos excelentes para la odometría. Recomendamos encarecidamente `Road Runner <https://acme-robotics.gitbook.io/road-runner/>`_. Para las matemáticas que hay detrás de Road Runner (que utiliza exponenciales de pose), también puedes leer el artículo de `Ryan <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_. Un recurso adicional para Road Runner es `Learn Road Runner <https://learnroadrunner.com/>`_ que es una guía de procedimiento paso a paso que explica cómo trabajar con el `Road Runner quickstart <https://github.com/acmerobotics/road-runner-quickstart>`_.
fr_ca: Il existe plusieurs ressources excellentes pour l'odométrie. Nous recommandons vivement `Road Runner <https://acme-robotics.gitbook.io/road-runner/>`_. Pour les mathématiques de Road Runner (qui utilisent des exponentielles de pose), vous pouvez également lire l'article de Ryan <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_. Une ressource supplémentaire pour Road Runner est `Learn Road Runner <https://learnroadrunner.com/>`_ qui est un guide de procédure étape par étape qui explique comment travailler avec le `Road Runner quickstart <https://github.com/acmerobotics/road-runner-quickstart>`_.
zh_cn: 在里程计方面，有几种很好的资源。我们强烈推荐 `Road Runner <https://acme-robotics.gitbook.io/road-runner/>`_。如需了解 Road Runner 背后的数学原理（它利用了姿态指数），您还可以阅读`Ryan 的论文 <https://github.com/acmerobotics/road-runner/blob/master/doc/pdf/Mobile_Robot_Kinematics_for_FTC.pdf>`_。有关 Road Runner 的另一个资源是 `Learn Road Runner <https://learnroadrunner.com/>`_，这是一个分步骤的程序指南，解释了如何使用 `Road Runner quickstart <https://github.com/acmerobotics/road-runner-quickstart>`_。

source: We also recommend `Tyler's book <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ as it goes into great detail about various controls in *FIRST*\ |reg| robotics.
es_mx: También recomendamos el libro de `Tyler <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_ ya que entra en gran detalle sobre varios controles en *FIRST* |reg| robótica.
fr_ca: Nous recommandons également le livre de Tyler <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>_, car il explique en détail divers systèmes de contrôle en robotique FIRST*\ |reg|.
zh_cn: 我们还推荐泰勒的著作 <https://file.tavsys.net/control/controls-engineering-in-frc.pdf>`_，因为书中详细介绍了 *FIRST*\ |reg| 机器人技术中的各种控制。

source: If you're using other resources, it is important that you do not use ones that utilize Euler integration as it is less optimal for real life approximations of robot pose.
es_mx: Si utiliza otros recursos, es importante que no utilice los que utilizan la integración de Euler, ya que es menos óptima para las aproximaciones reales de la pose del robot.
fr_ca: Si vous utilisez d'autres ressources, il est important de ne pas utiliser celles qui utilisent l'intégration d'Euler, car elle est moins optimale pour les approximations réelles de la pose du robot.
zh_cn: 如果您使用其他资源，请务必不要使用使用欧拉积分的资源，因为它对于现实生活中的机器人姿态近似不太理想。

source: Pose
zh_cn: 姿态
