Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/3d-printing.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: 3D Printing
es_mx: Impresión 3D
fr_ca: Impression 3D
ja_jp: 3Dプリンティング
ro_ro: Printare 3D
ru_ru: 3D-печать
zh_cn: 3D打印

source: Kinds of 3D Printing
es_mx: Tipos de Impresión 3D
fr_ca: Les sortes d'impressions 3D
ja_jp: 3Dプリンティングの種類
ro_ro: Tipuri de Printare 3D
ru_ru: Виды 3D печати
zh_cn: 3D打印种类

source: There are a few different kinds of 3D printing. FDM (Fused Deposition Modeling) (also known as Fused Filament Fabrication) extrudes a melted filament to create a part and is the most common type and the one we'll focus on in this guide. SLA (stereolithography) and SLS (Selective Laser Sintering) are both options for 3D printing plastics, but they are generally more complex, expensive, or hold other disadvantages in FTC\ |reg| applications. For those reasons, they are not recommended.
fr_ca: Il existe plusieurs types d'impression 3D. La FDM (modélisation par fil fondu) (également appelée fabrication de filaments fondus) consiste à extruder un filament fondu pour créer une pièce. c'est le type le plus courant et celui que nous aborderons dans ce guide. La SLA (stréréolithographie) et le SLS (frittage sélectif par laser) sont deux options pour l'impression 3D de plastique, mais elles sont généralement plus complexes, plus coûteuses FTC/ lregl. Pour ces raisons, elles ne sont pas recommandées.
ja_jp: 3Dプリントにはいくつかの種類があります。FDM（Fused Deposition Modeling / Fused Filament Fabrication) ( 熱溶解積層方式）は、フィラメントを溶かし、押出成形でパーツを造形する方法です。FDMはよく使われるプリント方法であるため、gm0ではFDM方式を取り上げ説明します。他にも、SLA（ステレオリソグラフィー)、SLS（粉末焼結積層造形）という3Dプリントの手法が存在します。しかし、一般的にこれらの手法は複雑・高価であったり、FTC\ |reg|の用途には適さない場合があります。そのため、SLA,SLSはFTCの仕様には推奨されません。
ru_ru: Существует несколько различных видов 3D-печати. FDM (Моделирование Наплавленного Осаждения), также известная как FFF (Изготовление Плавленой Нити Накала) предполагает выдавливание расплавленного филамента для создания детали. Это наиболее распространённый тип печати, на котором мы сосредоточимся в этом руководстве. SLA (стереолитография) и SLS (селективное лазерное спекание) — это варианты 3D-печати пластиком, но они, как правило, более сложные, дорогие или имеют другие недостатки применения в FTC\ |reg|. По этим причинам они не рекомендуются.
zh_cn: 3D打印有几种不同的类型。FDM（熔融沉积建模）（也称熔融长丝制造）通过挤出熔融长丝来制造零件，这是最常见的类型，也是本指南的重点。SLA（立体光刻）和SLS（选择性激光烧结）都是3D打印塑料的选择，但它们通常更为复杂、昂贵，或者在FTC\|reg|应用中存在其他缺点。出于这些原因，我们不推荐使用它们。

source: Metal 3D printing (SLS and others) is also becoming more and more available, but is not in the scope of this guide.
es_mx: La impresión 3D en metal (SLS y otras) también está cada vez más accesible, pero no entra en el ámbito de esta guía.
fr_ca: L’impression 3D métal (SLS et autres) devient également de plus en plus disponible, mais n’entre pas dans le cadre de ce guide.
ja_jp: 金属3Dプリンティング（SLSなど）も近年利用可能になってきていますが、現在gm0では触れていません。
ro_ro: Printarea 3D cu metal (SLS sau altele), este de asemenea din ce în ce mai accesibilă, însă nu este documentată în acest ghid.
ru_ru: 3D-печать металлом (SLS и другие) также становится все более доступной, однако не входит в рамки данного руководства.
zh_cn: 金属3D打印（SLS和其他）也越来越多，但不在本指南的范围内。

source: Consider checking out `the FTC docs 3D printing section <https://ftc-docs.firstinspires.org/en/latest/manufacturing/3d_printing/index.html>`_, a guide for FDM 3D printing within the scope of FTC. It covers topics such as: bed adhesion, tolerances, designing for 3D printing, tuning, and hardware choices.
es_mx: Considera la posibilidad de consultar `la sección de impresión 3D en FTC docs <https://ftc-docs.firstinspires.org/en/latest/manufacturing/3d_printing/index.html>`_, una guía de impresión 3D FDM en el ámbito de FTC. Cubre temas como: adherencia en la cama de impresión, tolerancias, diseño para impresión 3D, puesta a punto y opciones de hardware.
fr_ca: N'hésitez pas à consulter la section « Impression 3D » de la documentation FTC <https://ftc-docs.firstinspires.org/en/latest/manufacturing/3d_printing/index.html>, un guide sur l'impression 3D FDM dans le cadre de la FTC. Il aborde des sujets tels que l'adhérence du plateau, les tolérances, la conception pour l'impression 3D, le réglage et le choix du matériel.
ja_jp: 必要に応じて `FTC docs 3D printing section<https://ftc-docs.firstinspires.org/en/latest/manufacturing/3d_printing/index.html>`_を参照してください。 このページはFTC用途のFDM 3Dプリントを行うためのガイドになっています。ベッドの接着、トレランス、3Dプリントするパーツのデザイン、チューニング、環境に応じた3Dプリンターの選択などのトピックをカバーしています。
ru_ru: Рекомендуем ознакомиться с разделом о 3D-печати в документации FTC <https://ftc-docs.firstinspires.org/en/latest/manufacturing/3d_printing/index.html>_ — руководством по FDM 3D-печати в рамках FTC. В нём рассматриваются такие темы, как: адгезия к столу, допуски, моделирование под 3D-печать, калибровка и выбор оборудования.
zh_cn: 考虑查看 FTC `文档中3D打印的部份 <https://ftc-docs.firstinspires.org/en/latest/manufacturing/3d_printing/index.html>`_，这是FTC范围内FDM 3D打印的完整指南，提供了有关3D打印的许多基本问题的答案，这些问题涉及：床层附着力、公差、3D打印设计、调整和硬件选择。

source: Advantages of 3D Printing
es_mx: Ventajas de la Impresión 3D
fr_ca: Avantages de l'impression 3D
ja_jp: 3Dプリントのメリット
ro_ro: Avantajele Printării 3D
ru_ru: Преимущества 3D-печати
zh_cn: 3D打印的优势

source: 3D printing allows for customizable sizing and perfect optimization; for example, teams can print a spool of the exact diameter needed for optimal speed, or a belt pulley with a certain number of teeth.
es_mx: La impresión 3D se presta a la posibilidad de ajustar los tamaños para conseguir una optimización perfecta; por ejemplo, los equipos pueden imprimir un carrete del diámetro exacto necesario para alcanzar una velocidad óptima, o una polea de correa con un número determinado de dientes.
fr_ca: L'impression 3D permet un dimensionnement personnalisable et une optimisation parfaite ; par exemple, les équipes peuvent imprimer une bobine du diamètre exact nécessaire pour une vitesse optimale, ou une poulie à courroie avec un certain nombre de dents.
ja_jp: 3Dプリントにより、任意のサイズのパーツの作成や、ロボットごとに最適なパーツの作成が可能になる。例えば、最適な速度に必要な正確な直径のスプールや、特定の歯数のベルトプーリーを印刷することができる。
ro_ro: Printarea 3D permite personalizarea dimensiunilor și optimizarea perfectă, de exemplu, pentru echipele care au nevoie de o transmisie cu curea cu un anumit număr de dinți.
ru_ru: 3D-печать позволяет создавать детали нестандартных размеров и добиваться идеальной оптимизации. Например, команды могут напечатать бобину строго определённого диаметра для максимальной скорости или шкив для ременной передачи с заданным количеством зубьев.
zh_cn: 3D打印允许定制尺寸和完美优化；例如，团队可以打印最佳速度所需的精确直径的线轴，或者具有一定齿数的皮带轮。

source: 3D printing allows teams to adapt between kits and individual parts easily, as not all kits have adaptable mounts or brackets. A good example of this are the Nexus :term:`mecanum <Mecanum Wheel>` bore adapters that teams 3D print.
es_mx: La impresión en 3D permite a los equipos adaptarse fácilmente a diferentes kits y piezas individuales, ya que no todos los kits disponen de soportes o monturas adaptables. Un buen ejemplo de ello son los adaptadores de :term:`mecanum <Mecanum Wheel>` Nexus que los equipos imprimen en 3D.
fr_ca: L'impression 3D permet aux équipes de s'adapter facilement aux différents kits et pièces individuelles, car tous les kits ne disposent pas de supports ou de supports adaptables. Le Nexus :term:`mecanum en est un bon exemple.<Mecanum Wheel>` adaptateurs d'alésage que les équipes impriment en 3D.
ja_jp: すべてのキットに適応可能なマウントやブラケットがあるわけではない。3Dプリントによってチームはキットや個々のパーツを簡単に適応させることができる。その良い例として、チームが3DプリントするNexus :term:`メカナム<Mecanum Wheel>`ボアアダプターがある。
ro_ro: Printarea 3D permite echipelor să se adapteze între kit-urile și piesele individuale cu ușurință, din moment ce nu toate kit-urile au monturi adaptabile. Un exemplu bun în acest sens sunt adaptoarele de ax ale roților :term:`mecanum<Mecanum Wheel>` Nexus, pe care echipele le pot printa 3D.
ru_ru: 3D-печать позволяет командам легко комбинировать готовые наборы и отдельные детали, поскольку не все комплекты имеют регулируемые крепления или кронштейны. Хорошим примером служат переходные втулки для механических колес Nexus :term:`mecanum <Mecanum Wheel>` , которые команды печатают на 3D-принтерах.
zh_cn: 3D打印允许团队轻松适应套件和单个零件，因为并非所有套件都具有可适应的支架或支架。团队3D打印的 :term:`麦克纳姆轮 <Mecanum Wheel>` 孔适配器就是一个很好的例子。

source: 3D printing allows teams to fabricate parts that would otherwise be impossible with materials such as aluminum due to machining restrictions.
es_mx: La impresión 3D permite a los equipos fabricar piezas que, de otro modo, serían imposibles con materiales como el aluminio, debido a las restricciones del maquinado.
fr_ca: L’impression 3D permet aux équipes de fabriquer des pièces qui seraient autrement impossibles avec des matériaux tels que l’aluminium en raison de restrictions d’usinage.
ja_jp: 3Dプリントにより、アルミニウムなどの素材では加工上の制約から制作不可能なパーツを製作することができる。
ro_ro: Printarea 3D permite echipelor să fabrice piese care altfel ar fi imposibil de obținut din materiale precum aluminiu din cauza limitărilor de fabricare.
ru_ru: 3D-печать позволяет изготавливать детали, которые в противном случае было бы невозможно сделать из таких материалов, как алюминий, из-за ограничений в механической обработке.
zh_cn: 3D打印允许团队制造由于加工限制而无法使用铝等材料制造的零件。

source: 3D printing allows teams to have customizable strain relief on wires and connections. This is a great project and well worth your time.
es_mx: La impresión 3D permite a los equipos tener carcasas de protección personalizadas en cables y conexiones. Es un buen proyecto en el que vale la pena invertir tiempo.
fr_ca: L'impression 3D permet aux équipes de personnaliser les serre-câbles sur les fils et les connexions. C'est un excellent projet qui vaut vraiment le coup.
ja_jp: 3Dプリントにより、チームはワイヤーや接続部のカスタムストレインリリーフを制作することができる。カスタムストレインリリーフは3Dプリントの練習に素晴らしいプロジェクトであり、時間を費やす価値がある。
ro_ro: Printarea 3D permite echipelor să reducă stresul asupra cablurilor și conexiunilor, fiind un proiect în care merită investit timp.
ru_ru: 3D-печать позволяет командам создавать кастомную защиту проводов и соединений от механических нагрузок. Это отличный проект, который определённо стоит вашего времени.
zh_cn: 3D打印允许团队在电线和连接上有可定制的应变消除。这是一个伟大的项目，非常值得你花时间。

source: Disadvantages of 3D Printing
es_mx: Desventajas de la impresión 3D
fr_ca: Inconvénients de l'impression 3D
ja_jp: 3Dプリントのデメリット
ro_ro: Dezavantajele Printării 3D
ru_ru: Недостатки 3D-печати
zh_cn: 3D打印的缺点

source: **If you are out of 3D printed spares at a competition, you're probably out of luck. Teams are advised to print at least one set of every single 3D printed part as spares for competition**.
es_mx: **Si se te acaban los repuestos impresos en 3D en una competencia, probablemente te encontrarás en graves problemas. Es recomendado que los equipos impriman al menos un juego de cada pieza como repuesto para las competencias**.
fr_ca: **Si vous n'avez plus de pièces supplémentaires imprimées en 3D lors d'une compétition, vous n'avez probablement pas de chance. Il est conseillé aux équipes d'imprimer au moins un exemplaire de chaque pièce imprimée en 3D comme pièces de rechange pour la compétition**.
ja_jp: **大会で3Dプリントのスペアが切れたら運の尽きです。チームは、3Dプリントされたすべてのパーツに対して少なくとも1セットを、競技用のスペアとしてプリントすることをお勧めします**。
ro_ro: **Dacă rămâi fără piese printate 3D la o competiție, ți s-a terminat norocul. Este recomandat ca echipele să printeze cel putin un set suplimentar de piese printate 3D de rezervă pentru competiții.**
ru_ru: ** Если на соревнованиях у вас закончились запасные части, напечатанные на 3D-принтере, скорее всего, вам не повезло. Командам рекомендуется распечатать как минимум по одному комплекту каждой детали, напечатанной на 3D-принтере, в качестве запасных частей для соревнований **.
zh_cn: 如果你在比赛中没有3D打印的备件，那么你可能运气不好。建议团队至少打印一套3D打印的零件作为比赛的备件。

source: 3D printed components are generally weaker than other materials such as aluminum. However, printing in the proper orientation can be very strong - teams have 3D printed hooks and other parts to support their FRC\ |reg| robot (120 pounds) and FTC robots (40 pounds).
es_mx: Las piezas impresas en 3D suelen ser más débiles que otros materiales como el aluminio. Sin embargo, hacer una impresión en la orientación adecuada puede ser muy resistente: los equipos han impreso ganchos en 3D y otras piezas para sostener su robots de FRC\ |reg| (120 libras) y de FTC (40 libras).
fr_ca: Les composants imprimés en 3D sont généralement plus fragiles que d'autres matériaux comme l'aluminium. Cependant, une impression correctement orientée peut s'avérer très solide. Des équipes ont imprimé en 3D des crochets et d'autres pièces pour soutenir leurs robots FRC\ |reg| (120 lb) et FTC (40 lb).
ja_jp: 3Dプリントされた部品は、一般的にアルミニウムなどの他の材料よりも強度が低い。しかし、プリン方向を適切に調整することによって、十分な強度の部品をつくることができる。現に3DプリントされたフックでFRC｜reg｜ロボット（120ポンド）やFTCロボット（40ポンド）を支えているチームも存在する。
ro_ro: Piesele printate 3D sunt, în general, mai ușor de rupt decât alte materiale, precum aluminiul. Însă, printarea 3D În orientarea potrivită poate fi foarte rezistentă. Unele echipe au printat 3D cârlige și alte piese să iși susțină roboții lor FRC\ |reg| (55 kilograme) si roboții FTC (18 kilograme)
ru_ru: 3D-печатные компоненты обычно слабее других материалов, таких как алюминий. Однако печать в правильной ориентации может быть очень прочной - команды напечатали 3D-крюки и другие детали для поддержки робота FRC\ |reg| (120 фунтов) и роботов FTC (40 фунтов).
zh_cn: 3D打印部件硬度通常比铝等其他材料弱。然而，正确方向的打印可能非常坚固——团队3D打印挂钩和其他部件来支撑他们的FRC®机器人（120磅）和FTC机器人（40磅）。

source: 3D printed parts should only be loaded in one orientation. That is, if the robot is hanging from a hook, the only load should be on the bottom face of the curved part of the hook. Try to eliminate side loads as much as possible to avoid part failure.
es_mx: Las piezas impresas en 3D sólo deben de recibir fuerza en una orientación. Es decir, si el robot cuelga de un gancho, la única carga debe estar en la cara inferior de la parte curva del gancho. Intenta eliminar las fuerzas laterales en la medida de lo posible para evitar la ruptura de la pieza.
fr_ca: Les pièces imprimées en 3D ne doivent être chargées que dans une seule orientation. Par exemple, si le robot est suspendu à un crochet, la seule charge doit s'exercer sur la face inférieure de la partie incurvée du crochet. Essayez d'éliminer autant que possible les charges latérales afin d'éviter toute défaillance de la pièce.
ja_jp: 3Dプリントされた部品は、1つの方向にのみ負荷をかけれる。ロボットが3Dプリントされたフックにぶら下がっている場合、フックの湾曲した部分の底面にのみ荷重がかかるようにし、パーツの故障を避けるため、側面からの荷重はできるだけ排除しなくてはならない。
ro_ro: Piesele printate 3D ar trebui să fie încărcate într-o singură orientare. Dacă robotul este susținut de un cârlig, singura încărcătură ar trebui să fie pe partea de jos a cârligului. Încearcă să elimini orice încărcătură din părțile laterale pe cât este posibil.
ru_ru: Детали, напечатанные на 3D-принтере, должны быть нагружены только в одной ориентации. То есть, если робот подвешен на крюке, нагрузка должна приходиться только на нижнюю часть изогнутого крюка. Старайтесь по возможности исключить боковые нагрузки, чтобы избежать поломки детали.
zh_cn: 3D打印的零件只能以一个方向装载。也就是说，如果机器人悬挂在钩子上，唯一的载荷应该在钩子弯曲部分的底面上。尽量消除侧面载荷，以避免零件失效。

source: The size of 3D printed parts is limited by the size of your print bed.
es_mx: El tamaño de las piezas impresas en 3D está limitado por el tamaño de la cama de impresión.
fr_ca: La taille des pièces imprimées en 3D est limitée par la taille de votre lit d'impression.
ja_jp: 3Dプリントで作れるパーツのサイズは、プリントベッドのサイズによって制限される。
ro_ro: Dimensiunile pieselor printate 3D sunt limitate de dimensiunile patului de printare al imprimantei tale.
ru_ru: Размер деталей, напечатанных на 3D-принтере, ограничен размером вашего стола для печати.
zh_cn: 打印零件3D尺寸受打印床尺寸的限制。

source: Large and thick prints can take a long time (overnight) to print and can run the risk of failure.
es_mx: Las impresiones grandes y anchas pueden tardar mucho tiempo (toda la noche) en imprimirse y se corre el riesgo de que fallen.
fr_ca: Les impressions de grande taille et épaisses peuvent prendre beaucoup de temps (une nuit) et risquent d'échouer.
ja_jp: 大きい・厚みがあるパーツのプリントは、プリントに長時間（一晩中）かかり、その上で失敗する危険性がある。
ro_ro: Piesele de dimensiuni mari și late pot dura foarte mult să se printeze (>10 ore) și sunt predispuse la eșec.
ru_ru: Печать крупных и массивных деталей может занять много времени (например, всю ночь) и сопряжена с высоким риском неудачи.
zh_cn: 大而厚的打印可能需要很长时间（一夜之间）才能打印出来，并且可能会有失败的风险。

source: 3D printing can end up quite expensive, though filament can be found for a reasonable price on online vendors such as Amazon.
es_mx: La impresión 3D puede resultar bastante cara, aunque se puede encontrar filamento a un precio razonable en vendedores en línea como Amazon.
fr_ca: L'impression 3D peut s'avérer assez coûteuse, même si le filament peut être trouvé à un prix raisonnable sur des sites de vente en ligne tels qu'Amazon.
ja_jp: プリント用のフィラメントはAmazonなどのオンライン販売でリーズナブルな価格で手に入る。しかし、それでも3Dプリンティングはかなり高価になる可能性がある。
ro_ro: Printarea 3D poate fi destul de scumpă, deși filamentele se pot achiziționa la prețuri rezonabile, precum eMAG, filamente3d.ro, hobbymarket.ro, etc.
ru_ru: 3D-печать может оказаться довольно дорогостоящей, хотя филамент можно найти по разумной цене у онлайн-продавцов, таких как Amazon.
zh_cn: 3D打印最终可能会非常昂贵，尽管在亚马逊等在线供应商那里可以找到价格合理的灯丝。

source: Common Filaments
es_mx: Filamentos Comunes
fr_ca: Filaments communs
ja_jp: 3Dプリントに用いられる一般的なフィラメント
ro_ro: Filamente Comune
ru_ru: Обычные Филаменты
zh_cn: 普通长丝

source: For almost every part that needs to be 3D printed for FTC, **PLA (or PLA+, Pro, etc) and/or PETG will meet all the needs for strength, durability, and aesthetics.** These two filament types are by far the easiest to print, and are sold by many manufacturers for reasonable prices. Most of the other filaments here offer very specific advantages (like TPU) that come at the cost of effort, time, and money.
es_mx: Para casi todas las piezas que necesitan ser impresas en 3D para FTC, **PLA (o PLA+, Pro, etc) y/o PETG cumplirán todas las necesidades de resistencia, durabilidad y estética.** Estos dos tipos de filamento son, por mucho, los más fáciles de imprimir, y son vendidos por muchos fabricantes a precios bastante razonables. La mayoría de los otros filamentos ofrecen ventajas muy específicas (como el TPU) que vienen a costa de tiempo, esfuerzo y dinero.
fr_ca: Pour presque toutes les pièces qui doivent être imprimées en 3D pour FTC, **PLA (ou PLA+, Pro, etc.) et/ou PETG répondront à tous les besoins en termes de résistance, de durabilité et d'esthétique.** Ces deux types de filaments sont de loin les plus faciles à imprimer et sont vendus par de nombreux fabricants à des prix raisonnables. La plupart des autres filaments présentés ici offrent des avantages très spécifiques (comme le TPU) qui ont un coût en termes d'efforts, de temps et d'argent.
ja_jp: FTCのために3Dプリントする必要があるほとんどのパーツは、**PLA（またはPLA+、Pro、その他)・ PETGは、強度、耐久性、外観のすべてのニーズを満たすでしょう。**この2種類のフィラメントは、プリントするのが圧倒的に簡単で、多くのメーカーからリーズナブルな価格で販売されています。ここで紹介する他のフィラメントのほとんどは、（TPUのような）非常に特殊な利点を提供するが、その代償として労力と時間とお金がかかる。
ro_ro: Pentru aproape orice piese care trebuie printate 3D pentru FTC, **PLA (sau PLA+, Pro, etc.) sau PETG vor îndeplini orice nevoie pentru durabilitate, rezistență și aspect.** Aceste două tipuri de filament sunt pe departe cele mai ușor de printat și sunt vândute de producători la prețuri rezonabile. Alte filamente au avantaje specifice, precum TPU, care vin la un preț ridicat, necesită mai mult efort și timp.
ru_ru: Практически для любой детали, которую необходимо напечатать для FTC, **PLA (или PLA+, Pro и т.д.) и/или PETG удовлетворят все требования по прочности, долговечности и внешнего вида.** Эти два типа филамента являются безусловно самыми простыми в печати и продаются многими производителями по разумным ценам. Большинство других материалов предлагают весьма специфические преимущества (как, например, TPU), которые достигаются ценой дополнительных усилий, времени и денег.
zh_cn: 对于几乎所有需要3D打印FTC的零件，PLA（或PLA+、Pro等）和/或PETG将满足强度、耐用性和美观性的所有需求。这两种灯丝类型是迄今为止最容易打印的，并且被许多制造商以合理的价格出售。这里的大多数其他灯丝都提供了非常具体的优势（如TPU），这些优势是以付出努力、时间和金钱为代价的。

source: If your printer's hotend (the part that melts the filament) has a PTFE (Teflon) lining where the PTFE tube goes all the way down to the heat block (common in lower price printers like the Ender 3 and its variants), then you **should not be printing at or above 250 degrees Celsius**. Doing so will cause the PTFE tube to degrade and melt, releasing toxic fumes. If you need to print at these temperatures and you have a PTFE lined hotend, you can look at upgrading to an all-metal hotend.
fr_ca: Si la buse de votre imprimante (la partie qui fait fondre le filament) a un revêtement en PTFE (téflon) à l'endroit où le tube PTFE descend jusqu'au bloc thermique (commun dans les imprimantes à bas prix comme l'Ender 3 et ses variantes), alors vous **ne devez pas imprimer à une température égale ou supérieure à 250 degrés Celsius**. Le tube en PTFE se dégraderait et fondrait, libérant des fumées toxiques. Si vous devez imprimer à ces températures et que vous disposez d'une buse en PTFE, vous pouvez envisager de passer à une buse entièrement métallique.
ja_jp: 使っているプリンターのホットエンド（フィラメントを溶かす部分）にPTFE（テフロン）ライニングが施され、PTFEチューブがヒートブロックまで続いている場合（エンダー3やその亜種のような低価格プリンターに多い）、**摂氏250度**以上でプリントしてはいけません。高温でプリントすると、PTFEチューブが劣化して溶け、有毒ガスが発生します。高温で印刷する必要があり、PTFEライニングのホットエンドを使用している場合は、オールメタルホットエンドへのアップグレードを検討してください。
ru_ru: Если нагревательный элемент вашего принтера (часть, в которой расплавляется филамент) имеет подкладку из ПТФЭ (Тефлон), где трубка из ПТФЭ проходит до самого термоблока (часто используется в недорогих принтерах, таких как Ender 3 и его модификациях), то вам **не следует печатать при или выше температуры 250 градусов Цельсия**. Это приведет к разрушению и расплавлению трубки из ПТФЭ, что приведет к выделению токсичных паров. Если вам нужно печатать при таких температурах и у вас есть нагревательный элемент с покрытием из ПТФЭ, вы можете перейти на цельнометаллический нагревательный элемент.
zh_cn: 如果您的打印机热端（熔化灯丝的部分）有PTFE（特氟龙）衬里，其中PTFE管一直延伸到热块（常见于价格较低的打印机，如Ender 3及其变体），那么您不应该在250°C或更高温度下打印。这样做会导致PTFE管降解和熔化，释放有毒气体。如果您需要在这些温度下打印，并且您有PTFE衬里的热端，您可以考虑升级到全金属热端。

source: PLA (Polylactic Acid)
es_mx: PLA (ácido poliláctico)
fr_ca: PLA (Acide Polylactique)
ja_jp: PLA（ポリ乳酸）
ro_ro: PLA (Acid Polilactic)
ru_ru: PLA (Полимолочная Кислота)
zh_cn: PLA(聚乳酸)
