Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/3d-printing.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: Due to its flexible nature, printers that use a Bowden tube extrusion system, where the extruder motor is not placed on the hotend, will find it extremely difficult to print TPU/TPE.
es_mx: Debido a su naturaleza flexible, las impresoras que utilizan un sistema de extrusión de tubo Bowden, en el que el motor del extrusor no se coloca en el hotend, tendrán grandes dificultades para imprimir TPU/TPE.
fr_ca: En raison de sa nature flexible, les imprimeurs qui utilisent un système d'extrusion à tube Bowden, où le moteur de l'extrudeuse n'est pas placé sur l'élément chauffant, auront beaucoup de mal à imprimer du TPU/TPE.
ro_ro: Din cauza flexibilității tubului PTFE, folosit de anumite imprimante 3D, unde motorul care alimentează imprinta cu filament nu este poziționat direct deasupra hotend-ului, TPU/TPE sunt dificil de printat pe aceste tipuri de imprintante.
ru_ru: Из-за гибкой природы этих материалов принтерам с экструдером типа Bowden, где привод вынесен отдельно от хотенда, печатать TPU/TPE крайне сложно.
zh_cn: 由于其灵活性，使用Bowden管挤出系统的打印机，其中挤出机电机不放置在端部，将发现打印TPU/TPE极其困难。

source: TPU/TPE hotend temperatures range from 210\ |deg|-250\ |deg| C
fr_ca: Les températures des extrémités chaudes des TPU/TPE sont comprises entre 210\ |deg|-250\ |deg| C.
ru_ru: Температура хотенда TPU/TPE варьируется от 210\ |deg|-250\ |deg| C
zh_cn: TPU/TPE 热端温度范围为 210 摄氏度-250 摄氏度

source: TPU/TPE does not usually need a heated bed, but if one is used it should not go over 60 |deg|\ C as this will fuse TPU with print bed.
fr_ca: Le TPU/TPE n'a généralement pas besoin d'un lit chauffé, mais s'il est utilisé, il ne doit pas dépasser 60 |deg|\ C, car le TPU fusionnerait avec le lit d'impression.
zh_cn: 热塑性聚氨酯/热塑性弹性体通常不需要加热床，但如果使用加热床，则温度不应超过 60 摄氏度，因为这会使热塑性聚氨酯与打印床熔化。

source: TPU/TPE has the tendency to absorb a lot of moisture from the air, and thus will likely need to be dried before and perhaps during a print.
es_mx: El TPU/TPE tiende a absorber mucha humedad del aire, por lo que es probable que sea necesario secarlo antes de la impresión, e inclusive quizás durante la misma.
fr_ca: Le TPU/TPE a tendance à absorber beaucoup d'humidité de l'air et devra donc être séché avant et peut-être pendant l'impression.
ro_ro: TPU/TPE are tendința să absoarbă multă umiditate din aer, iar cel mai probabil va trebui să fie uscat filamentul înainte/în timpul printării 3D.
zh_cn: TPU/TPE有从空气中吸收大量水分的趋势，因此可能需要在打印前或打印期间干燥。

source: Direct drive extruder is highly recommended
es_mx: Se recomienda encarecidamente un extrusor de accionamiento directo
fr_ca: L'utilisation d'une extrudeuse à entraînement direct est fortement recommandée
ro_ro: Un extrudor de tip "Direct Drive", cu motorul care alimentează hotend-ul cu filament amplasat direct deasupra acestuia, este recomandat.
ru_ru: Настоятельно рекомендуется использовать экструдер с прямой подачей
zh_cn: 强烈推荐直接驱动挤出机

source: Exotic Filaments
es_mx: Filamentos Exóticos
fr_ca: Filaments exotiques
ro_ro: Filamente "Exotice"
ru_ru: Специализированные Виды Филаментов
zh_cn: 进口打印材料

source: There is rarely ever any need for these filaments in FTC. They offer extremely good material properties for parts that need to be subjected to high forces and adverse environments. They are all much more expensive than any of the filaments listed above, and offer a multitude of challenges for printing.
es_mx: Rara vez se necesitan estos filamentos en FTC. Ofrecen propiedades de material extremadamente buenas para piezas que deben someterse a fuerzas elevadas y entornos adversos. Todos ellos son mucho más caros que cualquiera de los filamentos enumerados anteriormente, y ofrecen una multitud de retos para su impresión.
fr_ca: Ces filaments sont rarement nécessaires en FTC. Ils offrent d'excellentes propriétés matérielles pour les pièces qui doivent être soumises à des forces élevées et à des environnements défavorables. Ils sont tous beaucoup plus chers que les filaments mentionnés ci-dessus et présentent une multitude de défis pour l'impression.
ro_ro: Aceste filamente sunt întâlnite rar în FTC. Aceastea oferă propriețăti extrem de bune ale materialului pentru piesele care sunt expuse la condiții extreme. Aceste filamente sunt mult mai scumpe decât cele descrise mai sus, și sunt destul de dificil de printat.
ru_ru: В FTC эти материалы практически не находят применения. Несмотря на превосходные механические свойства, позволяющие деталям выдерживать экстремальные нагрузки и воздействие неблагоприятных условий окружающей среды, их использование сопряжено с существенными трудностями. Все эти филаменты значительно дороже упомянутых выше аналогов, при этом создают множество проблем при печати.
zh_cn: FTC很少需要这些长丝。它们为需要承受高强度和恶劣环境的零件提供了非常好的材料性能。它们都比上面列出的任何一种长丝贵得多，并为打印带来了许多挑战。

source: Nylon
ro_ro: Nailonul (Nylon)
ru_ru: Нейлон
zh_cn: 尼龙

source: Nylon filaments can be glass-filled, carbon fiber-filled, or pure. Nylon is the king of impact resistance in many situations where the part can flex out of the way, instead of completely breaking. Occasionally nylon is used for parts like wheel covers on drivetrains and in places where it will be repeatedly hit and battered. Nylon requires very high temperatures, generally requires an enclosure, and absolutely must be dried before (and while) printing.
es_mx: Los filamentos de nylon pueden estar rellenos de vidrio, fibra de carbono o ser puros. El nylon es el rey en cuanto se trata a la resistencia al impacto, en muchas situaciones en las que la pieza va a flexionarse en lugar de romperse por completo. Ocasionalmente, el nylon se utiliza para piezas como cubiertas de ruedas en un chasis, y en lugares donde se golpeará y maltratará repetidamente. El nylon requiere temperaturas muy elevadas, por lo general requiere un encerramiento y es absolutamente necesario secarlo antes (y durante) la impresión.
fr_ca: Les filaments de nylon peuvent être chargés de verre, de fibres de carbone ou purs. Le nylon est le roi de la résistance aux chocs dans de nombreuses situations où la pièce peut fléchir au lieu de se briser complètement. Le nylon est parfois utilisé pour des pièces telles que les enjoliveurs de roues sur les chaînes cinématiques et dans des endroits où il est soumis à des chocs et à des coups répétés. Le nylon requiert des températures très élevées, nécessite généralement une enceinte et doit absolument être séché avant (et pendant) l'impression.
ro_ro: Filamentele din nailon pot fi compuse din sticlă, carbon, sau din material pur. Nailonul este "regele" rezistenței la impacturi în cazul în care piesa printată 3D poate să se deformeze și să revină la forma originală, în loc să se spargă. Ocazional, nailonul este folosit pentru protecții ale roților/șasiurilor, unde sunt predispuse la loviri puternice repetitive. Nailonul are nevoie de o temperatură mare de printare și, în general, o carcasă pentru a izola atmorsfera imprimantei. Nailonul trebuie uscat bine înainte și în timpul printării pentru rezultate excelente.
ru_ru: Нейлоновые филаменты могут быть стеклонаполненными, углеволоконными или чистыми. Нейлон считается лидером по ударопрочности во многих ситуациях, где деталь может упруго деформироваться, а не ломаться полностью. Его часто используют для таких деталей, как крышки колес в колесной базе и в местах, где он может подвергаться многократным ударам и повреждениям. Для печати нейлоном требуются очень высокие температуры, обычно необходима термокамера, а материал обязательно нужно просушивать перед печатью (и во время нее).
zh_cn: 尼龙丝可以是玻璃填充的，碳纤维填充的，也可以是纯的。在许多情况下，尼龙是抗冲击性之王，在这些情况下，零件可以弯曲而不是完全断裂。偶尔，尼龙用于传动系统上的轮罩等零件，以及会反复撞击和撞击的地方。尼龙需要非常高的温度，通常需要外壳，并且在打印前（和打印时）必须绝对干燥。

source: Nylon hotend temperatures range from 240\ |deg|-260\ |deg| C
fr_ca: Les températures de l'extrémité chaude du nylon sont comprises entre 240\ |deg|-260\ |deg| C.
ru_ru: Температура нагрева нейлона варьируется от 240\ |deg|-260\ |deg| C
zh_cn: 尼龙热端温度范围为 240-260摄氏度

source: Nylon bed temperatures range from 55\ |deg|-80\ |deg| C
fr_ca: Les températures du lit de nylon sont comprises entre 55\ |deg|-80\ |deg| C.
zh_cn: 尼龙床温度范围为 55-80摄氏度

source: Nylon is infamous for absorbing moisture from the air and should be thoroughly dried before and during printing. Failure to do this will probably result in a nearly unusable part.
es_mx: El nylon es conocido por absorber la humedad del aire y debe secarse a fondo antes y durante la impresión. Si no se hace, probablemente se obtendrá una pieza casi inutilizable.
fr_ca: Le nylon est réputé pour absorber l'humidité de l'air et doit être soigneusement séché avant et pendant l'impression. Si vous ne le faites pas, vous obtiendrez probablement une pièce pratiquement inutilisable.
ro_ro: Nailonul este cunoscut pentru absorbția sa a umidității din aer și ar trebui uscat integral înainte și în timpul printării. Nefăcând acest lucru, piesa este predispusă la eșec în timpul printării.
ru_ru: Нейлон печально известен тем, что впитывает влагу из воздуха, и его следует тщательно высушивать до и во время печати. Несоблюдение этого требования, вероятно, приведет к тому, что деталь будет практически непригодна для использования.
zh_cn: 尼龙因吸收空气中的水分而臭名昭著，在打印前和打印过程中应该彻底干燥。不这样做可能会导致几乎无法使用的部分。

source: Enclosure recommended
es_mx: Se recomienda un encerramiento.
fr_ca: Boîtier recommandé
ro_ro: Carcasa cu atmorsferă închisă este recomandată.
ru_ru: Рекомендуется использование термокамеры
zh_cn: 建议的附件

source: Carbon Fiber-filled
es_mx: Filamentos Rellenos con Fibra de Carbono
fr_ca: Rempli de fibre de carbone
ro_ro: Filament Compus din Carbon
ru_ru: Наполненный углеродным волокном
zh_cn: 碳纤维填充

source: Many filaments are also sold with the addition of small chunks of carbon fiber mixed into the filament itself. While often though of as an extreme strength improvement, these filaments are instead meant to be stiffer and help to improve the printability of filaments like nylon. Carbon fiber-filled filaments generally require higher temperatures, and a hardened steel nozzle, but if you can print the pure variants of those filaments, you should be able to print their carbon fiber-filled counterparts.
es_mx: Muchos filamentos también se venden con pequeños trozos de fibra de carbono mezclados con el propio filamento. Aunque a menudo se consideran una mejora considerable de la resistencia, estos filamentos están pensados para ser más rígidos y ayudar a mejorar la capacidad de impresión de filamentos como el nylon. Los filamentos rellenos de fibra de carbono suelen requerir temperaturas más altas y una boquilla de acero endurecido, sin embargo, si puedes imprimir las variantes puras de esos filamentos, deberías poder imprimir sus equivalentes rellenas de fibra de carbono.
fr_ca: De nombreux filaments sont également vendus avec l'ajout de petits morceaux de fibre de carbone mélangés au filament lui-même. Bien qu'ils soient souvent considérés comme une amélioration extrême de la résistance, ces filaments sont plutôt destinés à être plus rigides et à améliorer l'imprimabilité de filaments tels que le nylon. Les filaments remplis de fibres de carbone nécessitent généralement des températures plus élevées et une buse en acier trempé, mais si vous pouvez imprimer les variantes pures de ces filaments, vous devriez être en mesure d'imprimer leurs équivalents remplis de fibres de carbone.
ro_ro: Multe filamente sunt produse cu aditivi compuși din bucăți mici de fibră de carbon pentru a mări rezistența, dar și rigiditatea și printabilitatea nailonului. Filamentele din fibră de carbon au nevoie de temperaturi mari de printare și o duză din oțel dur. Totuși dacă imprimanta ta poate din fabrică să printeze nailonul pur, poate printa și variantele sale compuse din fibră de carbon.
ru_ru: Многие филаменты также выпускаются с добавлением частиц углеродного волокна, которые вводятся в состав самого материала. Хотя их часто считают средством радикального повышения прочности, на самом деле такие филаменты предназначены в первую очередь для увеличения жёсткости и улучшения технологичности печати материалов наподобие нейлона. Углеволоконные филаменты, как правило, требуют более высоких температур и сопла из закалённой стали, но если ваш принтер справляется с чистыми версиями этих материалов, то и с их углеволоконными аналогами проблем возникнуть не должно.
zh_cn: 许多长丝也在销售时添加了小块碳纤维混合到长丝本身中。虽然这些长丝通常被认为是一种极端的强度改进，但它们实际上更坚硬，有助于提高尼龙等长丝的打印性。碳纤维填充长丝通常需要更高的温度和硬化的钢喷嘴，但是如果你能打印这些长丝的纯变体，你应该能够打印它们的碳纤维填充长丝。

source: Polycarbonate (PC)
es_mx: Policarbonato (PC)
ro_ro: Policarbonat (PC)
ru_ru: Поликарбонат (PC)
zh_cn: 聚碳酸酯（PC）

source: Polycarbonate and its variants are very very strong, technical materials. PC shines in its ability to be very rigid, and handle shock loads exceedingly well. PC also requires being dry, having a printer capable of **very** high temperatures, and an enclosure. It is a very challenging material to print, and is often very expensive. There is little reason to ever need printed polycarbonate parts in FTC, with no use cases requiring its strength.
es_mx: El policarbonato y sus variantes son materiales técnicos muy resistentes. El PC destaca por su capacidad de ser muy rígido y soportar muy bien las fuerzas de choque. El PC también requiere estar seco, tener una impresora capaz de soportar **muy** altas temperaturas y un encerramiento. Es un material muy difícil de imprimir, y suele ser muy caro. Hay pocas razones para necesitar piezas de policarbonato impresas en FTC, ya que no hay casos de uso que requieran su resistencia.
fr_ca: Le polycarbonate et ses variantes sont des matériaux techniques très résistants. Le PC se distingue par sa capacité à être très rigide et à supporter très bien les chocs. Le PC nécessite également d'être sec, d'avoir une imprimante capable de supporter des températures **très** élevées et une enceinte. C'est un matériau très difficile à imprimer et souvent très cher. Il y a peu de raisons d'avoir besoin de pièces imprimées en polycarbonate en FTC, aucun cas d'utilisation ne nécessitant sa résistance.
ro_ro: Policarbonatul și alte variante ale sale sunt materiale tehnice foarte, foarte rezistente. PC este un material foarte rigid, și poate face față la șocuri foarte puternice. PC are nevoie totuși, de o imprimantă capabilă de printare cu temperaturi *foarte* mari, și o carcasă închisă. Este un material foarte dificil de printat și foarte scump. În general, nu există motive concrete să folosești piese printate din PC în FTC, din moment ce nu vor exista șocuri extrem de puternice în timpul jocului care să facă PC un material neapărat util.
ru_ru: Поликарбонат и его разновидности — это исключительно прочные технические материалы. Главное преимущество PC заключается в его высокой прочности и возможности превосходно выдерживать ударные нагрузки. Однако для работы с ним требуются тщательная сушка, принтер, способный работать при **очень** высоких температурах, и термокамера. Это чрезвычайно сложный в печати материал, к тому же обычно весьма дорогой. В FTC практически нет причин использовать детали из поликарбоната, поскольку ни одна из задач соревнований не требует его прочностных характеристик.
zh_cn: 聚碳酸酯及其变体是非常非常坚固的技术材料。PC在它非常刚性的能力上大放异彩，并且能够非常好地处理冲击载荷。PC还需要干燥，拥有能够承受非常高温度的打印机和外壳。这是一种非常具有挑战性的打印材料，而且通常非常昂贵。FTC几乎没有理由需要打印聚碳酸酯部件，因为没有需要其强度的用例。

source: There are several PC blends that can be much easier to print, a standout example is PolyMaker PolyMax PC. It is an easier-to-print, lower temp PC that retains many of the advantages of pure PC. PolyLite is not quite as impact-resistant, but a lot cheaper. Both are much easier to print than pure PC.
es_mx: Hay varias mezclas de PC que pueden ser mucho más fáciles de imprimir, un ejemplo destacado es PolyMaker PolyMax PC. Se trata de un PC más fácil de imprimir y de menor temperatura que conserva muchas de las ventajas del PC puro. PolyLite no es tan resistente a los impactos, pero es mucho más barato. Ambos son mucho más fáciles de imprimir que el PC puro.
fr_ca: Il existe plusieurs mélanges de PC qui peuvent être beaucoup plus faciles à imprimer, comme le PolyMaker PolyMax PC. Il s'agit d'un PC plus simple à imprimer, à température plus basse, qui conserve de nombreux avantages du PC pur. Le PolyLite n'est pas aussi résistant aux chocs, mais il est beaucoup moins cher. Les deux sont beaucoup plus simples à imprimer que le PC pur.
ro_ro: Există câteva variante ale PC care sunt mai ușor de printat, precum PolyMaker PolyMax PC. Este un filament ușor de printat, care reține avantajele PC-ului. PolyLite nu este la fel de rezistent, însă cu mult mai ieftin. Ambele sunt mai ușor de printat decât PC-ul pur.
ru_ru: Существует несколько смесей на основе поликарбоната, которые печатать значительно проще. Яркий пример — материал PolyMax PC от PolyMaker. Это более простой в печати PC-материал с пониженной температурой обработки, сохраняющий большинство преимуществ чистого поликарбоната. Модель PolyLite обладает не столь высокой ударной вязкостью, но существенно дешевле. Оба варианта печатать намного проще, чем чистый поликарбонат.
zh_cn: 有几种PC混合物更容易打印，一个突出的例子是PolyMaker PolyMaxPC。这是一种更容易打印、温度更低的PC，保留了纯PC的许多优点。PolyLite不太耐冲击，但便宜得多。两者都比纯PC更容易打印。

source: PC hotend temperatures range from 250\ |deg|-320\ |deg| C
fr_ca: Les températures de la buse du PC sont comprises entre 250\ |deg|-320\ |deg| C.
ru_ru: Температура хотенда PC варьируется от 250\ |deg|-320\ |deg| C
zh_cn: PC 热端温度范围为 250-320 摄氏度

source: PC bed temperatures range from 80\ |deg|-140\ |deg| C
fr_ca: Les températures du lit de PC sont comprises entre 80\ |deg|-140\ |deg| C.
zh_cn: PC 床温度范围为 80-140摄氏度

source: Enclosure required
es_mx: Se requiere un encerramiento
fr_ca: Boîtier requis
ro_ro: O carcasă închisă este obligatorie
ru_ru: Обязательно использование термокамеры
zh_cn: 所需附件

source: Filament must be kept dry
es_mx: El filamento debe mantenerse seco
fr_ca: Le filament doit être conservé au sec
ro_ro: Filamentul trebuie ținut uscat
ru_ru: Обязательная сушка филамента
zh_cn: 灯丝必须保持干燥

source: High-end exotic filaments
es_mx: Filamentos exóticos de alta gama
fr_ca: Filaments exotiques haut de gamme
ro_ro: Filamente "Exotice" de Top
ru_ru: Высококлассные специализированные филаменты
zh_cn: 高端进口打印材料

source: There are a few other materials that can have very high-end benefits, and push the envelope on what 3D printing can accomplish, but should not be printed if you are not *very* confident in your printing skills, and have basically no use in FTC. These materials include, but are not limited to, Delrin (Polyoxymethylene Homopolymer Acetal), PEI (Polyether Imide, brand name ULTEM), PEEK (Polyether Ether Ketone), and PEKK (Polyetherketoneketone). These materials are extremely hard to print, require ludicrous temperatures (some to the point where a hardened steel nozzle begins to melt), and are extremely expensive.
es_mx: Hay algunos otros materiales que pueden tener beneficios de gama muy alta, y empujar el limite en lo que la impresión 3D puede lograr, pero no debes imprimirlo si no tienes * mucha * confianza en tus habilidades de impresión, sin embargo, realmente no tienen ningún uso en FTC. Estos materiales incluyen, pero no se limitan a, Delrin (polioximetileno homopolímero acetal), PEI (poliéter imida, marca ULTEM), PEEK (poliéter éter cetona), y PEKK (poliéter cetona). Estos materiales son extremadamente difíciles de imprimir, requieren temperaturas excesivas (algunas hasta el punto de que una boquilla de acero endurecido empieza a fundirse) y son extremadamente caros.
fr_ca: Il y a quelques autres matériaux qui peuvent avoir des avantages très haut de gamme, et repousser les limites de ce que l'impression 3D peut accomplir, mais qui ne devraient pas être imprimés si vous n'êtes pas *très* confiant dans vos compétences d'impression, et qui n'ont fondamentalement aucune utilité en FTC. Ces matériaux comprennent, entre autres, le Delrin (acétal homopolymère de polyoxyméthylène), le PEI (polyéther-imide, marque ULTEM), le PEEK (polyéther-éther-cétone) et le PEKK (polyéther-cétone-cétone). Ces matériaux sont extrêmement difficiles à imprimer, nécessitent des températures très élevées (certaines au point qu'une buse en acier trempé commence à fondre) et sont extrêmement coûteux.
ro_ro: Există câteva materiale care pot avea proprietăți de top, și care pot duce mai departe capabilitățile printării 3D, însă nu ar trebui folosite dacă nu ești *foarte* experimentat în printarea 3D, iar piesele nu au un folos în FTC. Aceste materiale includ: Delrin (Polioximetilen Homopolimer Acetal), PEI (Polieter Imidă, marca ULTEM), PEEK (Polieter eter cetona), și PEKK (Polietercetonecetonă). Aceste materiale sunt extrem de greu de printat, au nevoie de temperaturi extrem de mari (la care duzele din oțel încep să se topească), și sunt extrem de scumpe.
ru_ru: Существуют и другие материалы, которые могут обеспечивать высококлассные преимущества и расширять границы возможностей 3D-печати, но их не стоит использовать, если вы не *очень* уверены в своих навыках печати. В FTC они практически не находят применения. К таким материалам относятся, но не ограничиваются: Delrin (полиоксиметилен, гомополимер ацеталя), PEI (полиэфиримид, коммерческое название ULTEM), PEEK (полиэфирэфиркетон) и PEKK (полиэфиркетонкетон). Эти материалы чрезвычайно сложны в печати, требуют невероятно высоких температур (некоторые - до такой степени, что начинает плавиться даже закалённое стальное сопло) и стоят очень дорого.
zh_cn: 还有一些材料可以带来非常高端的优势，并推动 3D 打印技术的发展，但如果您对自己的打印技术没有 *足够* 信心，就不应该打印这些材料，而且它们在 FTC 中基本上没有用处。这些材料包括但不限于Delrin（聚甲醛均聚物缩醛）、PEI（聚醚酰亚胺，品牌名ULTEM）、PEEK（聚醚醚酮）和PEKK（聚醚酮酮）。这些材料极难打印，所需的温度高得离谱（有些甚至达到硬化钢喷嘴开始熔化的程度），而且价格极其昂贵。

source: 3D Printing Design Guide
es_mx: Guía de Diseño para Imprimir en 3D
fr_ca: Guide de conception de l'impression 3D
ro_ro: Ghidul Modelării pentru Printarea 3D
ru_ru: Руководство По Проектированию Для 3D-печати
zh_cn: 3D打印设计指南

source: Here is a quick guide on designing 3D printed parts that we hope is helpful for teams who may be unfamiliar with 3D parts.
es_mx: Presentamos una guía rápida sobre el diseño de piezas impresas en 3D que esperamos sea útil para los equipos que no estén familiarizados con las piezas en 3D.
fr_ca: Voici un guide rapide sur la conception de pièces imprimées en 3D qui, nous l'espérons, sera utile aux équipes qui ne sont pas familiarisées avec les pièces en 3D.
ro_ro: Aici este un scurt ghid care explică proiectarea pieselor printate 3D, care sperăm să fie util pentru echipele care nu sunt familiarizate cu piesele printate 3D.
ru_ru: Вот краткое руководство по проектированию деталей для 3D-печати, которое, как мы надеемся, поможет командам, только начинающим работать с 3D-моделированием.
zh_cn: 这里有一个关于设计3D打印零件的快速指南，我们希望对可能不熟悉3D零件的团队有所帮助。
