Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/3d-printing.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: The most common 3D Printing filament is polylactic acid, or PLA. It is a plastic made from biological sources like corn starch and sugar cane. PLA is stiff but more brittle than other filament options and tends to have little to no warp when printing. PLA is well suited to the majority of robot parts, but it may not hold up well to shock loads (impacts to parts), and as such parts should be designed accordingly.
es_mx: El filamento de impresión 3D más común es el ácido poliláctico, o PLA. Es un plástico fabricado a partir de fuentes biológicas como el almidón de maíz y la caña de azúcar. El PLA es rígido, aunque más quebradizo que otras opciones de filamento, y tiende a tener muy pocas o nulas deformaciones al imprimir. El PLA es adecuado para la mayoría de las piezas que puedas necesitar en tu robot, pero puede que no resista bien las cargas de choque (impactos en las piezas), por lo que éstas deben diseñarse tomando esto en consideración.
fr_ca: Le filament d'impression 3D le plus courant est l'acide polylactique ou PLA. Il s'agit d'un plastique fabriqué à partir de sources biologiques telles que l'amidon de maïs et la canne à sucre. Le PLA est rigide, mais plus fragile que d'autres filaments et a tendance à ne pas se déformer lors de l'impression. Le PLA est bien adapté à la majorité des pièces de robots, mais il peut ne pas bien résister aux chocs (impacts sur les pièces), et les pièces doivent donc être conçues en conséquence.
ja_jp: 最も一般的な3Dプリント用フィラメントは、PLA（ポリ乳酸）である。PLAは、トウモロコシの澱粉やサトウキビなどの生物由来の原料から作られたプラスチックです。PLAは硬いが、他のフィラメントよりも脆く、プリント時の反りがほとんどない傾向にある。PLAは大半のロボット部品の作成に適しているが、衝撃荷重には耐えられない可能性があるため、プリントされる部品は用途に合わせて設計する必要があります。
ro_ro: Cel mai comun filament pentru printarea 3D este acidul polilactic, sau PLA. Este un plastic fabricat din surse naturale precum amidonul de porumb sau trestia de zahăr. PLA este rigid, dar mai fragil decât alte filamente și tinde să aibă aproape zero deviere în timpul printării. PLA este protrivit pentru majoritatea componentelor pentru roboți, însă nu va rezista mult timp la impacte, drept pentru care aceste piese trebuie modelate potrivit.
ru_ru: Наиболее распространенным филаментом для 3D-печати является полимолочная кислота, или PLA. Это пластик, изготовленный из биологических материалов, таких как кукурузный крахмал и сахарный тростник. PLA является жестким, но более хрупким, чем другие виды филаментов, и при печати практически не деформируется. PLA хорошо подходит для большинства деталей робота, но может плохо выдерживать ударные нагрузки (удары по деталям), и поэтому такие детали должны быть смоделированы соответствующим образом.
zh_cn: 最常见的3D打印灯丝是聚乳酸或聚乳酸。它是一种由玉米淀粉和甘蔗等生物来源制成的塑料。聚乳酸比其他灯丝更硬，但更脆，打印时往往几乎没有翘曲。聚乳酸非常适合大多数机器人部件，但它可能不能很好地承受冲击载荷（对部件的冲击），因此这些部件应该相应地设计。

source: PLA hotend temperatures range from 190\ |deg|-230\ |deg| C
fr_ca: Les températures des têtes de chauffe PLA sont comprises entre 190\ |deg|-230\ |deg| C.
ja_jp: PLAホットエンドの温度範囲は190〜230℃。
ru_ru: Температура в хотенде для PLA варьируется от 190\ |deg|-230\ |deg| C
zh_cn: 聚乳酸热端温度范围为 190 摄氏度-230 摄氏度

source: PLA bed temperatures range from 20\ |deg|-60\ |deg| C, but a heated bed isn't strictly required for PLA
fr_ca: Les températures du lit de PLA varient entre 20\ |deg|-60\ |deg| C, mais un lit chauffé n'est pas strictement nécessaire pour le PLA.
ja_jp: PLAのベッド温度は20～60℃だが、PLAを用いたプリントでは加熱ベッドは厳密には必要ない
ru_ru: Температура стола для PLA варьируется в пределах 20\ |deg|-60\ |deg| C, но подогрев стола не является обязательным условием для PLA.
zh_cn: 聚乳酸床的温度范围为 20 -60摄氏度，但聚乳酸并不严格需要加热床。

source: Due to the relatively low melting point of PLA, it is not advisable to leave PLA parts in locations such as a hot car, as this can produce severe warping in those parts.
es_mx: Debido a la temperatura de derretimiento relativamente bajo del PLA, no es aconsejable dejar las piezas de PLA en lugares como un coche caliente, ya que esto puede producir graves deformaciones en dichas piezas.
fr_ca: En raison du point de fusion relativement bas du PLA, il n'est pas conseillé de laisser les pièces en PLA dans des endroits tels qu'une voiture chaude, car cela peut entraîner une déformation importante de ces pièces.
ja_jp: PLAの融点は比較的低いため、高温の車内などにPLAパーツを放置しないようにしましょう。高温での放置はフィラメントが反ることにつながります。
ro_ro: Din cauza punctului scăzut de topire al PLA, nu este indicat să lăsați piesele printate din PLA într-o mașină în soare, deoarece se pot produce deteriorări ale materialului.
ru_ru: Из-за относительно низкой температуры плавления PLA не рекомендуется оставлять детали из этого материала в таких местах, как закрытый автомобиль на жаре, так как это может вызвать сильную деформацию деталей.
zh_cn: 由于PLA的熔点相对较低，不建议将PLA零件留在热车等位置，因为这会在这些零件中产生严重的翘曲。

source: There are many variations of PLA sold by different manufacturers, like PLA+ or PLA Pro. These filaments have various additives in them to improve strength, printability, and other properties. While more expensive, these products can greatly improve the performance of PLA and cover its weaknesses.
es_mx: Hay muchas variaciones de PLA vendidas por diferentes fabricantes, como PLA+ o PLA Pro. Estos filamentos contienen varios aditivos para mejorar su resistencia, capacidad de impresión y otras propiedades. Aunque son más caros, estos productos pueden mejorar mucho el rendimiento del PLA y cubrir sus puntos débiles.
fr_ca: Il existe de nombreuses variantes de PLA vendues par différents fabricants, comme PLA+ ou PLA Pro. Ces filaments contiennent divers additifs destinés à améliorer la résistance, l'imprimabilité et d'autres propriétés. Bien que plus chers, ces produits peuvent améliorer considérablement les performances du PLA et couvrir ses faiblesses.
ja_jp: PLAには、PLA+やPLA Proのように、さまざまなメーカーから多くのフィラメントのバリエーションが販売されています。これらのフィラメントには、強度や印刷適性、その他の特性を向上させるためのさまざまな添加剤が含まれています。高価ではあるものの、これらの製品はPLAの性能を大幅に向上させ、その弱点をカバーすることができます。
ro_ro: Există multe variante ale PLA-ului vândute de diverși producători, precum PLA+ sau PLA Pro. Aceste filamente au diverși aditivi în compoziție pentru a îmbunătăți rezistența, durabilitatea, pritabilitatea și alte proprietăți. Deși sunt mai scumpe, aceste produse pot aduce multe beneficii PLA-ului și reduc slăbiciunile acestui filament.
ru_ru: Существует множество разновидностей PLA, продаваемых разными производителями, например, PLA+ или PLA Pro. В состав этих филаментов входят различные добавки, улучшающие прочность, пригодность для печати и другие свойства. Хотя эти продукты стоят дороже, они могут значительно улучшить характеристики PLA и скрыть его недостатки.
zh_cn: 不同制造商销售的聚乳酸有许多变体，如聚乳酸+或聚乳酸专业。这些长丝中含有各种添加剂，以提高强度、打印性和其他性能。虽然更昂贵，但这些产品可以大大提高聚乳酸的性能并弥补其弱点。

source: PETG (Polyethylene Terephthalate Glycol)
es_mx: PETG (Polietileno Tereftalato Glicol)
fr_ca: PETG (polyéthylène téréphtalate glycol)
ja_jp: PETG（グリコール変性ポリエチレンテレフタレート）
ro_ro: PETG (Polietilen Tereftalat Glicol)
ru_ru: PETG (полиэтилентерефталатгликоль)
zh_cn: PETG (聚对苯二甲酸乙二醇酯)

source: PETG can be described as a strength upgrade to PLA. It is not difficult to print, but often has noticeably more stringing and other minor artifacts. While it technically has a lower tensile strength than PLA, it is far less brittle and withstands impacts better, through slight flexing. It is a great option for FTC parts which need to be impact resistant where PLA will not suffice. Its higher temperature resistance also means it won't warp in a high ambient temperature such as a hot car.
es_mx: El PETG puede describirse como una mejora en resistencia comparado al PLA. No es difícil de imprimir, pero a menudo presenta una mayor cantidad de derramamiento y otros defectos menores. Aunque técnicamente tiene una menor resistencia a la tensión que el PLA, es mucho menos quebradizo y resiste mejor los impactos, con un ligero nivel de flexibilidad. Es una gran opción para las piezas FTC que necesitan ser resistentes al impacto donde el PLA no será suficiente. Su mayor resistencia a la temperatura también significa que no se deformará a una temperatura ambiente elevada, como la de un coche caliente.
fr_ca: Le PETG peut être décrit comme une amélioration résistante du PLA. Il n'est pas difficile à imprimer, mais il présente souvent un filage nettement plus important et d'autres artefacts mineurs. Bien que sa résistance à la traction soit techniquement inférieure à celle du PLA, il est beaucoup moins fragile et résiste mieux aux chocs, grâce à une légère flexion. C'est une excellente option pour les pièces FTC qui doivent être résistantes aux chocs et pour lesquelles le PLA ne suffit pas. Sa plus grande résistance à la température signifie également qu'il ne se déformera pas à une température ambiante élevée, comme dans une voiture chaude.
ja_jp: PETGはPLAの強度アップグレードと言えます。印刷は難しくありませんが、ささくれやその他の小さな遺物が目立ちます。技術的にはPLAより抗張力（引張強さ）は低いものの、はるかに堅く、たわむことで衝撃に耐える特徴を持ちます。PLAでは不十分な耐衝撃性が必要なFTC部品には最適な選択肢です。また、耐熱性が高いため、高温の車内などの高い周囲温度でもフィラメントが反ることはありません。
ro_ro: PETG poate fi descris ca o îmbunătățire a durabilității PLA-ului. Nu este dificil de printat, deși produce des "fire" și defecte minore. Deși, teoretic, are o rezistență mai slabă decât PLA, este cu mult mai puțin fragil și face față mai bine impacturilor, fiind un material ușor flexibil. Este o opțiune bună pentru componentele roboților care trebuie să reziste la impacturi, unde PLA nu face față. Rezistența mai bună la temperaturi ridicate reduce riscul de deteriorare al materialului într-un mediu cald.
ru_ru: PETG можно охарактеризовать как усиленную версию PLA. Печатать им не сложно, но он часто дает заметно большее образование нитей и другие мелкие дефекты. Хотя предел прочности при растяжении у PETG технически ниже, чем у PLA, он гораздо менее хрупкий и лучше выдерживает удары за счет небольшого изгиба. Это отличный вариант для деталей FTC, которые должны быть ударопрочными, в тех случаях, когда PLA не справляется. Более высокая термостойкость PETG также означает, что он не деформируется при высоких температурах окружающей среды, например, в раскаленной машине.
zh_cn: PETG可以被描述为PLA的强度升级。它并不难打印，但通常有明显更多的穿线和其他次要工件。虽然从技术上讲，它的拉伸强度低于PLA，但通过轻微的弯曲，它的脆性要小得多，承受冲击的能力也更好。对于需要抗冲击的FTC部件来说，它是一个很好的选择，而PLA是不够的。它更高的耐温性也意味着它不会在高温环境中变形，比如在热车中。

source: PETG is known for bonding very well to print beds, **especially glass and PEI**, and is known to rip chunks out of the bed. It is a good idea to add some glue stick or hairspray before printing it.
es_mx: El PETG es conocido por adherirse muy bien a las camas de impresión, **especialmente aquellas hechas de vidrio y PEI**, y es conocido por arrancar trozos de esta a la hora de intentar retirar las piezas. Es una buena idea añadir un poco de pegamento en barra o spray de cabello antes de imprimirlo.
fr_ca: Le PETG est connu pour adhérer très bien aux lits d'impression, **surtout le verre et le PEI**, et est connu pour arracher des morceaux du lit. C'est une bonne idée d'ajouter un peu de colle ou de laque pour cheveux avant de l'utiliser pour imprimer.
ja_jp: PETGはプリントベッド、**特にガラスとPEI**に非常によく接着することで知られており、ベッドの表面を引きはがすことで知られています。印刷する前にスティックのりやヘアスプレーをベッドに吹きかけるとよいでしょう。
ro_ro: PETG este cunoscut pentru aderența sa foarte bună pe patul de printare, **în special pe sticlă sau PEI**, și este comun să se rupă bucăți de pe suprafață. Este o idee bună să adăugati adeziv (precum lipici la tub pentru școală) sau fixativ înainte de printare.
ru_ru: PETG известен очень сильной адгезией к поверхности стола для печати, особенно к стеклу и PEI, и может вырывать куски материала из рабочей поверхности. Перед печатью рекомендуется нанести слой клея-карандаша или лака для волос.
zh_cn: PETG以粘合非常好而闻名于打印床，尤其是玻璃和PEI，并且以从床上撕下大块而闻名。在打印之前添加一些胶棒或发胶是个好主意。

source: PETG hotend temperatures range from 230\ |deg|-260\ |deg| C
fr_ca: Les températures des buses pour le PETG sont comprises entre 230\ |deg|-260\ |deg| C.
ja_jp: PETGプリントのホットエンドの温度範囲は230-260℃。
ru_ru: Температурный диапазон хотенда PETG составляет 230\ |deg|-260\ |deg| C.
zh_cn: PETG 热端温度范围为 230\ |deg|-260\ |deg| C

source: PETG bed temperatures range from 60\ |deg|-80\ |deg| C
fr_ca: Les températures du lit de PETG sont comprises entre 60\ |deg|-80\ |deg| C.
ja_jp: PETGプリントのベッド温度は60-80℃。
ru_ru: Температура стола для PETG варьируется от 60\ |deg|-80\ |deg| C
zh_cn: PETG 料床温度范围为60摄氏度到80摄氏度

source: Less Common Filaments
es_mx: Filamentos Menos Comunes
fr_ca: Filaments moins courants
ja_jp: その他のフィラメント
ro_ro: Filamente mai Puțin Comune
ru_ru: Менее Распространенные Филаменты
zh_cn: 较少常见的长丝

source: These filaments are less used than those listed above, but can still find plenty of use cases on an FTC robot. These usually are used due to specific material properties such as flexibility or durability. These often come however, with substantial obstacles for printing that prevent some printers from printing them out of the box, along with sometimes being significantly more expensive.
es_mx: Estos filamentos son menos utilizados que los mencionados anteriormente, sin embargo, aún pueden encontrar muchos casos de uso en un robot FTC. Suelen utilizarse por las propiedades específicas del material, como la flexibilidad o la durabilidad. Sin embargo, a menudo vienen con obstáculos importantes que impiden que algunas impresoras los impriman de inmediato, además de ser a veces significativamente más caros.
fr_ca: Ces filaments sont moins utilisés que ceux énumérés ci-dessus, mais peuvent encore trouver de nombreux cas d'utilisation sur un robot FTC. Ils sont généralement utilisés en raison des propriétés spécifiques du matériau, telles que la flexibilité ou la durabilité. Cependant, ils sont souvent accompagnés d'obstacles importants à l'impression qui empêchent certaines imprimantes de les imprimer dès le départ, et ils sont parfois beaucoup plus chers.
ja_jp: ここで紹介するフィラメントは、上記のフィラメントに比べ使用頻度は低いが、FTCロボットで使用されるケースはたくさんある。これらのフィラメントは通常、柔軟性や耐久性といった特定の材料特性があるため使用される。しかし、これらのフィラメントは、印刷の際に大きな障害が伴うことが多く、プリンターによってはすぐに印刷できないことがある。
ro_ro: Aceste filamente sunt mai puțin comune decât cele descrise mai sus, însă pot avea suficiente aplicații în cazul unui robot FTC. Acestea sunt folosite în general pentru proprietățile lor specifice precum flexibilitatea sau durabilitatea. Aceste calități vin, în schimb, cu obstacole în procesul de printare întrucât pot preveni anumite imprimante să printeze cu aceste materiale din fabrică, și de obicei, aceste filamente sunt mai scumpe.
ru_ru: Данные типы филаментов используются реже, чем упомянутые выше, но также могут найти множество применений в FTC роботах. Обычно их выбирают из-за специфических свойств, таких как гибкость или повышенная прочность. Однако их печать часто сопряжена со значительными трудностями: некоторые принтеры не могут работать с ними без дополнительной настройки, а стоимость таких материалов может быть существенно выше.
zh_cn: 这些细丝比上面列出的少用，但是仍然可以在FTC机器人上找到很多用例。这些通常是由于特定的材料特性而使用的，如柔韧性或耐用性。然而，这些通常会出现很大的打印障碍，阻止一些打印机开箱打印，有时还会贵得多。

source: ABS (Acrylonitrile Butadiene Styrene)
es_mx: ABS (Acrilonitrilo Butadieno Estireno)
fr_ca: ABS (Acrylonitrile Butadiène Styrène)
ja_jp: ABS（アクリロニトリル・ブタジエン・スチレン）
ro_ro: ABS (Acrilonitril Butadien Stiren)
ru_ru: ABS (Акрилонитрилбутадиенстирол)
zh_cn: ABS（丙烯腈丁二烯苯乙烯）

source: ABS used to be the standard filament for printing before PLA became commercially available. You've probably used ABS before in LEGO\ |reg| pieces. It can withstand high loads and is quite ductile. This comes at the cost of printing difficulty, where an enclosure is often necessary to raise the ambient temperature and prevent severe part warping. The strength improvements over PLA can be more easily found in PETG, so ABS parts are not as common in FTC. ABS is quite affordable though, sold at the same prices as PLA.
fr_ca: L'ABS était le filament standard pour l'impression avant que le PLA ne soit disponible dans le commerce. Vous avez probablement déjà utilisé l'ABS pour des pièces LEGO. Il peut supporter des charges élevées et est assez ductile. Cela se fait au prix de difficultés d'impression, où une enceinte est souvent nécessaire pour augmenter la température ambiante et éviter une déformation excessive de la pièce. Les améliorations de la résistance par rapport au PLA peuvent être plus facilement trouvées dans le PETG, de sorte que les pièces en ABS ne sont pas aussi courantes en FTC. L'ABS est cependant assez abordable, vendu au même prix que le PLA.
ja_jp: PLAが市販される前は、ABSがプリント用の標準フィラメントだった。LEGO｜reg｜の部品でABSを使ったことがあるだろう。ABSは高荷重に耐えることができ、非常に延性が大きい。この性質は印刷が難しいという代償を伴う。時に、プリントパーツの激しい反りを防ぐために囲いを用いて周囲温度を高く保つ必要がある。PLAよりも強度の高いフィラメントを求める際、ABSよりもPETGの方が扱いやすいため、FTCでABSの部品はそれほど使われていない。しかし、ABSはPLAと同じ価格で販売されており、かなり手頃だ。
ru_ru: ABS раньше был стандартным материалом для печати до появления PLA в коммерческом доступе. Вы наверняка сталкивались с ABS в деталях LEGO\ |reg|. Этот материал выдерживает высокие нагрузки и обладает хорошей пластичностью. Однако за это приходится расплачиваться сложностью печати: часто требуется термокамера для поддержания температуры окружающей среды и предотвращения сильной деформации деталей. Поскольку аналогичное улучшение прочности по сравнению с PLA проще достичь с помощью PETG, ABS не так распространён в FTC. Тем не менее, ABS вполне доступен по цене и продаётся по тем же ценам, что и PLA..
zh_cn: 在聚乳酸商业化之前，ABS曾是打印的标准长丝。您可能曾经在LEGO\|reg|零件中使用过ABS。它可以承受高负荷，而且韧性很好。但这是以打印困难为代价的，通常需要一个外壳来提高环境温度，防止部件严重变形。与PLA相比，PETG更容易提高强度，因此ABS零件在FTC中并不常见。但ABS的价格相当实惠，与PLA的售价相同。

source: ABS hotend temperatures range from 230\ |deg|-250\ |deg| C
fr_ca: Les températures de la buse de l'ABS sont comprises entre 230\ |deg|-250\ |deg| C.
ja_jp: ABSプリントのホットエンドの温度範囲は230-250℃。
ru_ru: Температурный диапазон хотенда ABS составляет 230\ |deg|-250\ |deg| C
zh_cn: ABS 热端温度范围为 230到250摄氏度

source: ABS bed temperatures range from 100\ |deg|-120\ |deg| C
fr_ca: Les températures du lit d'ABS sont comprises entre 100\ |deg|-120\ |deg| C.
ja_jp: ABSプリントのベッド温度は100-120℃。
ru_ru: Температура стола ABS варьируется в пределах 100\ |deg|-120\ |deg| C
zh_cn: ABS 床温范围为 100-120摄氏度

source: Enclosure highly recommended to prevent warping
es_mx: Se recomienda un encerramiento para evitar deformaciones
fr_ca: Boîtier fortement recommandé pour éviter les déformations
ja_jp: 反りを防ぐため、エンクロージャーを強く推奨
ro_ro: O carcasă pentru imprimanta 3D este recomandată pentru a preveni deterioarea ABS-ului.
ru_ru: Для предотвращения деформации настоятельно рекомендуется использовать термокамеру.
zh_cn: 强烈推荐外壳以防止翘曲

source: Due to the difficulty of printing ABS and its limitations, one might look at alternatives such as ASA which offer similar properties with much better printability.
es_mx: Debido a la gran dificultad para imprimir ABS, y a sus limitaciones, se recomiendan buscar alternativas como el ASA, que ofrece propiedades similares con una mayor facilidad de impresión.
fr_ca: En raison de la difficulté d'imprimer l'ABS et de ses limitations, on peut envisager des alternatives telles que l'ASA qui offre des propriétés similaires avec une bien meilleure imprimabilité.
ro_ro: Din cauza dificultății printării cu ABS și limitările sale, o alternativă mai bună este ASA, care are propriețăti similare, însă o printabilitate mai bună.
ru_ru: Из-за сложностей печати ABS и его ограничений стоит рассмотреть альтернативы, такие как ASA, которые обладают схожими свойствами, но значительно лучшей технологичностью.
zh_cn: 由于打印ABS的困难和局限性，人们可能会考虑ASA等替代品，它们具有更好的打印性能。

source: TPU/TPE (Themoplastic polyurethane/Thermoplastic elastomer)
es_mx: TPU/TPE (poliuretano termoplástico/elastómero termoplástico)
fr_ca: TPU/TPE (polyuréthane thermoplastique/élastomère thermoplastique)
ro_ro: TPU/TPE (Poliuretan termoplastic)
zh_cn: TPU/TPE（polyurethane/Thermoplastic弹性体）

source: TPU and TPE are both common printing filaments that are widely used for their flexible material properties. This allows one to create printed parts that can easily flex and bend. Sold under many different durometers (a measure on the Shore Hardness Scale of the hardness/flexibility of a material), TPU/TPE's high impact resistance and layer adhesion make it not only a versatile filament, but an extremely durable one. In FTC, teams use TPU/TPE in roles such as printed intake flaps in place of a tube, as well as custom belts for low-load applications.
es_mx: Tanto el TPU como el TPE son filamentos de impresión comunes que se utilizan ampliamente por sus propiedades de material flexible. Esto permite crear piezas impresas que pueden flexionarse y doblarse fácilmente. El TPU/TPE se vende con muchos durómetros diferentes (una medida de la dureza/flexibilidad de un material en la escala de dureza Shore), y es un filamento versátil y muy duradero gracias a su gran resistencia a los impactos y a la adherencia de las capas. En FTC, los equipos utilizan el TPU/TPE en funciones como alas de absorción para un in-take en lugar de un tubo, así como correas personalizados para aplicaciones de baja carga.
fr_ca: Le TPU et le TPE sont deux filaments d'impression courants qui sont largement utilisés pour leurs propriétés de matériaux flexibles. Cela permet de créer des pièces imprimées qui peuvent facilement se plier et se courber. Vendus sous différents duromètres (mesure de la dureté/flexibilité d'un matériau sur l'échelle de dureté de Shore), la résistance élevée aux chocs et l'adhérence des couches font du TPU/TPE un filament non seulement polyvalent, mais aussi extrêmement durable. En FTC, les équipes utilisent le TPU/TPE dans des rôles tels que les volets d'admission imprimés à la place d'un tube, ainsi que les courroies personnalisées pour les applications à faible charge.
ro_ro: TPU și TPE sunt ambele filamente des întâlnite care sunt utilizate în general datorită flexibilității acestora. Aceste proprietăți permit pieselor printate să se deformeze și să revină la forma inițială. Vândute sub diferite durometre (măsura flexibilitatii unui material), TPU/TPE dețin o rezistență puternică asupra impacturilor, drept pentru care sunt folosite în role pentru intake-uri în loc de tubulatură, dar și personalizate sub formă de curele pentru transmisii la aplicații ușoare.
ru_ru: TPU и TPE — это распространенные типы филаментов, широко используемые благодаря своей гибкости. Они позволяют создавать детали, которые могут легко сгибаться и деформироваться. Эти материалы продаются с разными показателями дюрометра (мера твёрдости/гибкости материала по шкале Шора). Высокая ударная вязкость и отличная адгезия слоев делают TPU/TPE не только универсальным, но и исключительно прочным материалом. В FTC команды используют TPU/TPE для таких элементов, как напечатанные элементы для активного захвата вместо трубок, а также для изготовления несиловых приводных ремней.
zh_cn: TPU和TPE都是常见的打印长丝，因其柔性材料特性而被广泛使用。这使得人们可以制造出易于弯曲和弯曲的打印零件。在许多不同的硬度下销售（一种材料hardness/flexibility的肖氏硬度等级的衡量标准），TPU/TPE的高抗冲击性和层粘附性使其不仅是一种多功能长丝，而且是一种极其耐用的长丝。在FTC，团队使用TPU/TPE来代替管子，以及用于低负载应用的定制皮带。
