Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/3d-printing.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: The first consideration when designing 3D printed parts is print orientation. This refers to the side that contacts the print bed. Preferably, the part should have a flat bottom to maximize contact with the print bed.
es_mx: La primera consideración a la hora de diseñar piezas impresas en 3D es la orientación de la impresión. Se refiere al lado que entra en contacto con la cama de impresión. Preferiblemente, la pieza debe tener un fondo plano para maximizar el contacto con la cama.
fr_ca: La première chose à prendre en compte lors de la conception de pièces imprimées en 3D est l'orientation de l'impression. Il s'agit du côté qui entre en contact avec le lit d'impression. De préférence, la pièce doit avoir un fond plat pour maximiser le contact avec le lit d'impression.
ro_ro: Primul lucru pe care al trebui să îl consideri când schițezi o piesă printată 3D este orientarea în care va fi printat. Acest lucru se referă la partea care va face contact cu suprafața de printare a imprimantei. Preferabil, acea parte ar trebui să aibă o suprafață plată pentru un contact eficient cu patul imprimantei.
ru_ru: Первое, что следует учитывать при проектировании деталей для 3D-печати — это ориентация модели на столе. Она определяется той стороной, которая контактирует с поверхностью стола для печати. В идеале деталь должна иметь плоское основание для максимальной площади контакта со столом, что обеспечивает лучшее сцепление.
zh_cn: 设计3D打印部件时首先考虑的是打印方向，这是指与打印床接触的一侧，优选地，该部件应具有平底，以最大限度地与打印床接触。

source: Maximizing contact with the print bed will make sure the part doesn't delaminate or warp from the bed and increase print quality.
es_mx: Maximizar el contacto con la cama de impresión garantizará que la pieza no se despegue o deforme a mitad de impresión, y aumentará la calidad de la misma.
fr_ca: En maximisant le contact avec le lit d'impression, on s'assure que la pièce ne se délamine pas ou ne se déforme pas du lit et on améliore la qualité de l'impression.
ro_ro: Eficientizarea contactului cu patul de printare va asigura faptul că piesa nu se va deforma în timpul printării 3D.
ru_ru: Максимальная площадь контакта с столом для печати обеспечивает лучшее сцепление, предотвращая отслаивание и деформацию детали во время печати, что в итоге повышает общее качество результата.
zh_cn: 最大限度地与打印床接触将确保零件不会从打印床脱层或翘曲，并提高打印质量。

source: If it is impossible for the part to have a flat side to print on, a simple solution is to split the part into multiple parts along a plane. For instance, the gearbox plate below didn't have a flat side to print on, so it was split in half. The part was later sandwiched with numerous screws and plastic glue. If this plate was printed as one part instead of split in half, support would have to be used to create all of the necessary holes. Parts that use no support material make sure that the least amount of plastic is wasted.
es_mx: Si es imposible que la pieza tenga una cara plana sobre la que imprimir, una solución sencilla es dividir la pieza en varias partes a lo largo de un plano. Por ejemplo, la placa de la caja de engranes que se muestra a continuación no tenía una cara plana sobre la que imprimir, así que se dividió por la mitad. Posteriormente, la pieza se unió con varios tornillos y pegamento plástico. Si esta placa se hubiera impreso como una sola pieza en lugar de dividirla por la mitad, habría que utilizar material de soporte para crear todos los orificios necesarios. Las piezas que no utilizan material de soporte garantizan que se desperdicie la menor cantidad de plástico posible.
fr_ca: S'il est impossible d'imprimer une face plane sur la pièce, une solution simple consiste à diviser la pièce en plusieurs parties le long d'un plan. Par exemple, la plaque de la boîte de vitesses ci-dessous n'avait pas de face plane sur laquelle imprimer, elle a donc été divisée en deux. La pièce a ensuite été prise en sandwich avec de nombreuses vis et de la colle plastique. Si cette plaque avait été imprimée en une seule pièce au lieu d'être coupée en deux, il aurait fallu utiliser un support pour créer tous les trous nécessaires. Les pièces qui n'utilisent pas de support permettent de réduire au maximum la quantité de plastique gaspillée.
ro_ro: Dacă este imposibil ca o piesă să aibă o parte plată pentru contact cu patul de printare, o soluție simplă ar fi să împarți piesa în mai multe bucăți de-a lungul unui plan. De exemplu, o placă de angrenaj nu are o suprafață plată de printare, așa că a fost împărțită în două bucăți și lipită ulterior cu adeziv și șuruburi. Dacă piesa ar fi fost printată într-o singură bucată, ar fi fost nevoie de material auxiliar de suport pentru a printa găurile necesare. Piesele care nu au nevoie de material de suport asigură faptul ca filamentul nu este irosit aiurea.
ru_ru: Если деталь не имеет плоской поверхности для печати, простое решение — разделить её на несколько частей по столу. Например, приведенная ниже пластина редуктора не имела плоской стороны для печати, поэтому была разрезана пополам. В дальнейшем части были соединены с помощью винтов и клея для пластика. Если бы эта пластина была напечатана как единое целое, потребовалось бы использование поддержек для создания всех необходимых отверстий. Избегание поддержек позволяет минимизировать расход материала.
zh_cn: 如果零件不可能有平坦的一面可以打印，一个简单的解决方案是沿着平面将零件分成多个部分。例如，下面的变速箱板没有平坦的一面可以打印，所以它被分成两半。这个零件后来被夹在许多螺丝和塑料胶水中。如果这个板是作为一个零件打印的，而不是分成两半，就必须使用支架来制造所有必要的孔。不使用支撑材料的零件可以确保浪费最少的塑料。

source: A 3D printed gearbox, printed in 2 parts, cut along a plane
es_mx: Una caja de engranes impresa en 3D, dividida en 2 partes, cortada a lo largo de un plano
fr_ca: Une boîte de vitesses imprimée en 3D, imprimée en 2 parties, coupée le long d'un plan
ro_ro: Un angrenaj printat 3D, printat în 2 părți, tăiate de-a lungul unui plan
ru_ru: 3D-печатный редуктор, напечатанный 2-мя частями с разрезом по плоскости
zh_cn: 一个 3D 打印的齿轮箱，分为2部分打印，沿平面切割

source: Don't chamfer or round anything on the perimeter of the first layer on the bottom face of the part. Chamfering or rounding will increase the chances of the part warping, especially on unheated print plates.
es_mx: No hagas biseles ni redondeos en el perímetro de la primera capa de la cara inferior de la pieza. Biselar o redondear aumentará las posibilidades de que la pieza se deforme, especialmente en placas de impresión sin calentar.
fr_ca: Ne chanfreinez pas et n'arrondissez rien sur le périmètre de la première couche sur la face inférieure de la pièce. Les chanfreins ou les arrondis augmentent les risques de déformation de la pièce, en particulier sur les plaques d'impression non chauffées.
ro_ro: Nu teși sau rotunji nimic în perimetrul primului strat printat pe partea de jos a piesei. Teșirea sau rotunjirea piesei va mări șansele de deformare a piesei, în special pe paturile de printare neîncălzite.
ru_ru: Не снимайте фаски и не закругляйте ничего по периметру первого слоя на нижней поверхности детали. Снятие фаски или закругления увеличит вероятность деформации детали, особенно на столах для печати без нагрева.
zh_cn: 不要在零件底面第一层的周边倒角或倒圆任何东西。倒角或倒圆会增加零件翘曲的机会，尤其是在未加热的印版上。

source: Draft Angle
es_mx: Ángulo de Colgado
fr_ca: Angle de dépouille
ro_ro: Unghiul de Proiectare
ru_ru: Угол Наклона
zh_cn: 牵伸角

source: Draft angle refers to the overhang angle between the part side and normal vector from the print plate. The maximum draft angle refers to the maximum angle the printer can print without support material and is based on the printer, print settings (notably speed, temperature and cooling) and filament type. When trying to decrease support material, consider every overhang angle and make sure it is within the maximum draft angle. Staying within the maximum draft angle will also decrease the chances of part warping.
es_mx: El ángulo de colgado se refiere al ángulo de voladizo entre el lado de la pieza y el vector normal de la placa de impresión. El ángulo de inclinación máximo se refiere al ángulo máximo que la impresora puede imprimir sin material de soporte, lo cual depende de la impresora, los ajustes de impresión (en particular, la velocidad, la temperatura y la refrigeración) y el tipo de filamento. Cuando intentes reducir el material de soporte, ten en cuenta todos los ángulos salientes y asegúrate de que se encuentran dentro del ángulo de inclinación máximo. Mantenerse dentro del ángulo de inclinación máximo también reducirá las posibilidades de que la pieza se deforme.
fr_ca: L'angle de dépouille correspond à l'angle de dépassement entre le côté de la pièce et le vecteur normal de la plaque d'impression. L'angle de dépouille maximal correspond à l'angle maximal que l'imprimante peut imprimer sans matériau de support et dépend de l'imprimante, des paramètres d'impression (notamment la vitesse, la température et le refroidissement) et du type de filament. Lorsque vous essayez de réduire le matériau de soutien, prenez en compte chaque angle de dépassement et assurez-vous qu'il est compris dans l'angle de dépouille maximal. Le fait de rester dans l'angle de dépouille maximum réduira également les risques de déformation de la pièce.
ro_ro: Unghiul de proiectare se referă la unghiul suspendat între piesă și vectorul patului de printare. Unghiul maxim de suspendare se referă la unghiul maxim pe care imprimanta îl poate printa fără material de suport și este bazat pe calitatea imprimantei, setările imprimantei (viteza de printare, temperatura și răcire) și tipul de filament. Când încerci să reduci din utilizarea materialului de suport, ia în calcul toate unghiurile de suspendare și asigură-te că sunt mai mici decât unghiul maxim de proiectare, reducând asftel riscul de deformare.
ru_ru: Угол наклона— это угол между боковой поверхностью детали и нормалью к столу печати. Максимальный угол наклона - это максимальный угол, под которым принтер может печатать без использования поддержек, и зависит от конкретного принтера, настроек печати (особенно скорости, температуры и охлаждения) и типа филамента. Для минимизации поддержек проверяйте все углы наклона в модели и убедитесь, что их угол не превышает максимально допустимого. Соблюдение этого предела также снижает риск деформации детали.
zh_cn: 拔模角是指部件侧面与打印板法向量之间的悬垂角度。最大拔模角是指打印机在不使用支撑材料的情况下可以打印的最大角度，取决于打印机、打印设置（主要是速度、温度和冷却）以及长丝类型。在尝试减少支撑材料时，要考虑每个悬伸角度，并确保其在最大牵伸角度范围内。保持在最大拔模角范围内也会降低部件翘曲的几率。

source: Stress Vectors
es_mx: Vectores de Estrés
fr_ca: Vecteurs de contraintes
ro_ro: Vectori de Stres
ru_ru: Векторы Напряжения
zh_cn: 应力矢量

source: Perhaps the most important consideration is stress vectors. 3D printed parts are inherently stronger on two axes and weaker on one axis. The weaker axis comes from the layering action that defines FDM 3D printing. A common fix to this is to simply increase the print temperature up to a certain limit until it starts decreasing print quality, but the weaker axis can be resolved by again splitting up into multiple parts. The point to get across is to try to increase strength by optimizing sections of the part on the plane they are being printed on. For instance, this assembly below was responsible for hanging the entire robot, so it had to be the maximum strength possible for a 3D printed part.
es_mx: Quizá la parte más importante a considerar son los vectores de estrés. Las piezas impresas en 3D son intrínsecamente más fuertes en dos ejes y más débiles en un eje. El eje más débil proviene de la acción de estratificación (capas) que define la impresión 3D FDM. Una solución común para esto es simplemente aumentar la temperatura de impresión hasta un cierto límite hasta que comienza a disminuir la calidad de impresión, pero el eje más débil se puede resolver dividiendo de nuevo en múltiples partes. El punto a transmitir es tratar de aumentar la fuerza mediante la optimización de las secciones de la pieza en el plano en el que se están imprimiendo. Por ejemplo, el siguiente ensamblaje era responsable de colgar todo el robot, por lo que tenía que tener la máxima resistencia posible para una pieza impresa en 3D.
fr_ca: La considération la plus importante est peut-être celle des vecteurs de contrainte. Les pièces imprimées en 3D sont intrinsèquement plus résistantes sur deux axes et plus faibles sur un axe. L'axe le plus faible provient de l'action de superposition qui définit l'impression 3D FDM. Une solution courante consiste à augmenter la température d'impression jusqu'à une certaine limite, jusqu'à ce que la qualité d'impression commence à diminuer, mais l'axe le plus faible peut être résolu en divisant à nouveau les pièces en plusieurs parties. L'idée à retenir est d'essayer d'augmenter la résistance en optimisant les sections de la pièce sur le plan sur lequel elles sont imprimées. Par exemple, l'assemblage ci-dessous était chargé de suspendre l'ensemble du robot, il devait donc être le plus résistant possible pour une pièce imprimée en 3D.
ro_ro: Probabil cel mai important factor ce trebuie luat in considerare este vectorul de stres / rezistență. Piesele printate 3D sunt mai rezistente implicit pe două axe teoretice și mai slabe pe o singură axă. Axa mai slabă este cea pe care sunt printate straturile de filament prin printarea FDM. O soluție comună este să mărești temperatura de printare până la limită, până începe să se strice calitatea piesei, însă axa mai slaba poate fi de asemenea consolidată prin printarea pe mai multe bucăți. În esență, încearcă să mărești rezistența prin optimizirea secțiunilor piesei pe planul pe care sunt printate. De exemplu, piesa de mai jos a fost responsibilă pentru susținerea întregului robot, deci implicit trebuia să aibă rezistența maximă a unei piese printate 3D.
ru_ru: Пожалуй, ключевым аспектом при проектировании являются векторы напряжений. 3D-печатные детали по своей природе обладают повышенной прочностью в двух осях и пониженной — в третьей. Эта "слабая ось" обусловлена самой слоистой структурой FDM-печати. Частично проблему можно решить повышением температуры печати до определенного предела, пока не начнет страдать качество, но более эффективный метод — повторное разделение детали на части. Основная идея заключается в увеличении прочности за счет оптимизации геометрии детали в плоскости её печати. Например, представленная ниже сборка отвечала за подвес всего робота и требовала максимально возможной прочности для 3D-печатной детали.
zh_cn: 也许最重要的考虑因素是应力矢量。3D打印零件在两个轴上天生更强，在一个轴上更弱。较弱的轴来自定义FDM3D打印的分层动作。一个常见的解决方法是简单地将打印温度提高到一定的限度，直到它开始降低打印质量，但是较弱的轴可以通过再次分成多个部分来解决。要理解的一点是尝试通过优化零件在打印平面上的部分来提高强度。例如，下面的组件负责悬挂整个机器人，因此它必须是3D打印零件的最大强度。

source: It might seem counterintuitive to split up a part into multiple parts to increase strength, but there is a logic behind it.
es_mx: Puede parecer contraintuitivo dividir una pieza en varias partes para aumentar la fuerza, pero hay una lógica detrás de ello.
fr_ca: Il peut sembler contre-intuitif de diviser une pièce en plusieurs parties pour augmenter la force, mais il y a une logique derrière cela.
ro_ro: Ar putea părea ilogic să împarți o piesă în mai multe părți pentru a mări rezistența, însă există o logică în spatele acestui concept.
ru_ru: Может показаться нелогичным разбивать деталь на несколько частей для увеличения прочности, но в этом есть логика.
zh_cn: 将一个零件分成多个零件来增加强度似乎违反直觉，但这背后有一个逻辑。

source: The part could have been easily printed as a single part, but it would be fairly weak when stresses are exerted in the upward direction. Splitting the part and creating new flat surfaces to print on will strengthen each axis. *If one small part failed, the robot might still be able to somewhat function.* This would be preferable to the entire piece failing at once. In this example, the side pieces were printed as separate parts on a complementary axis to strengthen the assembly.
es_mx: La pieza podría haberse impreso fácilmente como una sola pieza, pero sería bastante débil cuando las fuerzas de estrés se ejercen en dirección ascendente. Dividir la pieza y crear nuevas superficies planas sobre las que imprimir reforzará cada eje. *Si fallara una pequeña pieza, el robot podría seguir funcionando en cierta medida*. Esto sería preferible a que fallara toda la pieza a la vez. En este ejemplo, las piezas laterales se imprimieron como piezas separadas en un eje complementario para reforzar el conjunto.
fr_ca: La pièce aurait pu être facilement imprimée en une seule fois, mais elle serait assez faible lorsque les contraintes sont exercées dans la direction ascendante. Le fait de diviser la pièce et de créer de nouvelles surfaces planes sur lesquelles imprimer renforcera chaque axe. *Si une petite pièce venait à se briser, le robot pourrait encore fonctionner quelque peu, ce qui serait préférable à une défaillance simultanée de l'ensemble de la pièce. Dans cet exemple, les pièces latérales ont été imprimées séparément sur un axe complémentaire afin de renforcer l'assemblage.
ro_ro: Piesa ar fi putut fi printată cu ușurință într-o singură bucată, însă ar fi fost destul de slabă din punct de vedere mecanic cănd stresul ar fi fost exercitat în sus. Împărțirea axei și crearea unei suprafețe noi, plate, pentru printare va mări rezistența fiecărei axe. *Dacă o bucată ar fi dat greș, robotul tot ar mai putea funcționa într-un fel sau altul.* De exemplu, piesele laterale au fost printate separat pe o axă complementară pentru a mări rezistența piesei întregi.
ru_ru: Данную деталь можно было бы легко напечатать цельной, но её прочность оказалась бы недостаточной при нагрузках, направленных вверх. Разделение детали и создание новых плоских поверхностей для печати позволяет усилить каждую из осей. При выходе из строя небольшого компонента робот сохранит частичную работоспособность, что предпочтительнее полного разрушения всей конструкции. В данном примере боковые элементы были напечатаны отдельно с ориентацией на перпендикулярных осях для повышения общей прочности сборки.
zh_cn: 该零件可以很容易地作为单个零件打印，但当向上施加应力时，它会相当弱。拆分零件并创建新的平坦表面来打印将加强每个轴。如果一个小零件发生故障，机器人可能仍然能够发挥一定的作用。这比整个零件一次发生故障要好。在这个例子中，侧件作为单独的零件打印在互补轴上，以加强组件。

source: A multipart assembly 3D printing
es_mx: Ensamblajes Multipieza Impresos en 3D
fr_ca: Un assemblage en plusieurs parties Impression 3D
ro_ro: O piesă printată 3D din mai multe bucăți
ru_ru: 3D-печать сборки из нескольких частей
zh_cn: 多部件组装3D打印

source: An assembled version of what was printing in the previous image
es_mx: Una versión ensamblada de lo que se imprimía en la imagen anterior
fr_ca: Une version assemblée de ce qui a été imprimé dans l'image précédente
ro_ro: O variantă asamblată a bucăților printate în poza anterioară
ru_ru: Собранная версия того, что было напечатано на предыдущем изображении
zh_cn: 上一张图片中打印内容的组装版本

source: This assembly is a good example of considering part orientation, draft angles, and stress vectors in each part of the design. Complex parts can be made strong and without any support by simply splitting it up in the right way.
es_mx: Este ensamblaje es un buen ejemplo de cómo tener en cuenta la orientación de las piezas, los ángulos de cuelgue y los vectores de estrés en cada parte del diseño. Las piezas complejas pueden hacerse fuertes y sin ningún apoyo, simplemente dividiéndolas de la forma correcta.
fr_ca: Cet assemblage est un bon exemple de la prise en compte de l'orientation des pièces, des angles de dépouille et des vecteurs de contrainte dans chaque partie de la conception. Il est possible de rendre des pièces complexes solides et sans support en les divisant simplement de la bonne manière.
ro_ro: Această piesă este un exemplu bun de considerare al orientării bucăților, unghiurilor de proiectare, și vectorilor de stres în fiecare parte al modelului. Piesele complexe pot fi rezistente și fără material de suport pur și simplu prin împărțirea corectă a piesei.
ru_ru: Эта сборка является хорошим примером учета ориентации деталей, углов наклона и векторов напряжений в каждой детали конструкции. Сложные детали можно сделать прочными и без какой-либо поддержки, просто правильно разделив их.
zh_cn: 这个装配是一个很好的例子，说明在设计的每个部分都要考虑零件的方向、拔模角和应力矢量。只需以正确的方式进行拆分，就能使复杂的零件在没有任何支撑的情况下变得坚固。

source: TPU/TPE (Thermoplastic polyurethane/Thermoplastic elastomer)
ru_ru: TPU/TPE (Термопластичный полиуретан/Термопластичный эластомер)
