Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/laser-cutting.po
Languages: es_mx, fr_ca, zh_cn

source: Laser Cutting
es_mx: Corte láser
fr_ca: Découpe au laser
zh_cn: 激光切割

source: Laser cutting can be a useful tool that allows FTC\ |reg| teams to quickly produce complex custom parts. This guide will cover the uses of laser cutting in FTC, common types of laser cutters, and how to optimize your design for laser cutting.
es_mx: La corte láser puede ser una herramienta útil que permite a los equipos de FTC\ |reg| producir rápidamente piezas personalizadas complejas. Esta guía cubrirá los usos de la corte láser en FTC, los tipos comunes de cortadoras láser y cómo optimizar su diseño para el corte láser.
fr_ca: La découpe laser peut être un outil utile qui permet aux équipes FTC\ |reg| de produire rapidement des pièces complexes sur mesure. Ce guide aborde les utilisations de la découpe laser en FTC, les types de découpeurs laser les plus courants et la manière d'optimiser votre conception pour la découpe laser.
zh_cn: 激光切割可以成为一种有用的工具，使FTC团队能够快速生产复杂的定制零件。本指南将涵盖激光切割在FTC中的用途、激光切割机的常见类型以及如何优化您的激光切割设计。

source: If your team does not have access to a laser cutter, consider checking with sponsors or local makerspaces, or using a service like `Fabworks <https://www.fabworks.com/>`_ or `SendCutSend <https://sendcutsend.com/>`_. These may have access to laser cutters that can cut more exotic materials. For example, Fabworks and SendCutSend both cut metals such as aluminum and steel, and SendCutSend specifically offers a wide variety of woods, plastics, metals, and composites. These services may also offer post-processing such as bending, tapping, and powder coating.
es_mx: Si tu equipo no tiene acceso a una cortadora láser, considera consultar con patrocinadores o makerspaces locales, o utilizar un servicio como `Fabworks <https://www.fabworks.com/>`_ o `SendCutSend <https://sendcutsend.com/>`_. Estos pueden tener acceso a cortadoras láser que pueden cortar materiales más exóticos. Por ejemplo, Fabworks y SendCutSend cortan metales como aluminio y acero, y SendCutSend específicamente ofrece una amplia variedad de maderas, plásticos, metales y compuestos. Estos servicios también pueden ofrecer post-procesamiento como doblado, roscado y recubrimiento en polvo.
fr_ca: Si votre équipe n'a pas accès à une découpeuse laser, renseignez-vous auprès de sponsors ou de makerspaces locaux, ou utilisez un service comme `Fabworks <https://www.fabworks.com/>`_ ou `SendCutSend <https://sendcutsend.com/>`_. Ces services peuvent avoir accès à des découpeurs laser capables de découper des matériaux plus exotiques. Par exemple, Fabworks et SendCutSend découpent tous deux des métaux tels que l'aluminium et l'acier, et SendCutSend propose spécifiquement une grande variété de bois, de plastiques, de métaux et de composites. Ces services peuvent également proposer des opérations de post-traitement telles que le pliage, le taraudage et le revêtement par poudre.
zh_cn: 如果你的团队无法使用激光切割机，请考虑与赞助商或当地的创客空间核实，或者使用 `Fabworks <https://www.fabworks.com/>`_ 或 `SendCutSend <https://sendcutsend.com/>`_ 等服务。这些可能可以使用激光切割机切割更奇特的材料。例如，Fabworks和 SendCutSend都能切割铝和钢等金属，SendCutSend 专门提供各种木材、塑料、金属和复合材料。这些服务还可以提供弯曲、攻丝和粉末涂层等后处理。

source: Common Types of Laser Cutters
es_mx: Tipos comunes de cortadoras láser
fr_ca: Types courants de découpeurs laser
zh_cn: 激光切割机的常见类型

source: In general, there are three types of laser cutters FTC teams may have access to: **diode lasers**, **CO2 lasers**, and **fiber lasers**.
es_mx: En general, hay tres tipos de cortadoras láser a las que los equipos de FTC pueden tener acceso: **láseres de diodo**, **láseres de CO2** y **láseres de fibra**.
fr_ca: En général, il existe trois types de découpeurs laser auxquels les équipes de FTC peuvent avoir accès : **les lasers à diode**, **les lasers à CO2** et **les lasers à fibre**.
zh_cn: 一般来说，FTC 团队可以使用三种类型的激光切割机：**二极管激光器**、**二氧化碳激光器** 和 **光纤激光器**。

source: Diode
es_mx: Diodo
zh_cn: 二极管

source: These tend to be the smallest, cheapest, and lightest duty. They move around a small (<20 watts) laser diode on an exposed gantry. Usually they can only cut paper, cardboard or thin wood. In FTC, these can be useful for quick cardboard prototypes and for engraving decorative items such as team numbers and sponsor logos.
es_mx: Estos tienden a ser los más pequeños, baratos y ligeros. Se mueven alrededor de un diodo láser pequeño (<20 watts) en un marco expuesto. Por lo general, solo pueden cortar papel, cartón o madera delgada. En FTC, estos pueden ser útiles para prototipos rápidos de cartón y para engrabar elementos decorativos como números de equipo y logotipos de patrocinadores.
fr_ca: Ce sont généralement les plus petits, les moins chers et les plus légers. Ils déplacent une petite diode laser (<20 watts) sur un portique exposé. En général, ils ne peuvent découper que du papier, du carton ou du bois fin. En FTC, elles peuvent être utiles pour réaliser rapidement des prototypes en carton et pour graver des éléments décoratifs tels que des numéros d'équipe et des logos de sponsors.
zh_cn: 这些往往是最小、最便宜、最轻的任务。它们在暴露的龙门架上绕着一个小（<20瓦特）激光二极管。通常它们只能切割纸、纸板或薄木头。FTC，这些对于快速纸板原型和雕刻装饰性物品如团队编号和赞助商标志很有用。

source: CO2
zh_cn: 二氧化碳

source: These are typically enclosed machines, using a moving mirror to aim the light from a 30+ watt laser tube. These can cut wood and plastics, but can only mark metal. They can be very useful in FTC for custom parts.
es_mx: Estas son máquinas típicamente cerradas, que utilizan un espejo móvil para dirigir la luz de un tubo láser de 30+ watts. Estas pueden cortar madera y plásticos, pero solo pueden marcar metal. Pueden ser muy útiles en FTC para piezas personalizadas.
fr_ca: Il s'agit généralement de machines fermées, utilisant un miroir mobile pour diriger la lumière d'un tube laser de plus de 30 watts. Elles peuvent découper le bois et le plastique, mais ne peuvent marquer que le métal. Ils peuvent être très utiles en FTC pour les pièces personnalisées.
zh_cn: 这些通常是封闭的机器，使用移动的镜子瞄准30多瓦激光管的光。这些可以切割木材和塑料，但只能标记金属。它们在定制零件的FTC比赛中中非常有用。

source: Fiber
es_mx: Fibra
fr_ca: Fibre
zh_cn: 纤维

source: These combine beams from multiple laser diodes into a fiber optic cable and can cut metal. Desktop versions usually have a very limited working area, often just a couple inches. These are very expensive and few FTC teams have access to them.
es_mx: Estos combinan haces de múltiples diodos láser en un cable de fibra óptica y pueden cortar metal. Las versiones de escritorio suelen tener un área de trabajo muy limitada, a menudo solo unas pocas pulgadas. Estos son muy caros y pocos equipos de FTC tienen acceso a ellos.
fr_ca: Ils combinent les faisceaux de plusieurs diodes laser dans un câble à fibre optique et peuvent découper le métal. Les versions de bureau ont généralement une zone de travail très limitée, souvent de quelques centimètres. Ces appareils sont très coûteux et peu d'équipes FTC y ont accès.
zh_cn: 这些将来自多个激光二极管的光束组合成光缆，可以切割金属。台式机版本的工作区域通常非常有限，通常只有几英寸。这些非常昂贵，很少有FTC团队能够使用它们。

source: These are generalizations, and are not always true. For example, some diode cutters can cut thin metals. For more information, always research your specific laser cutter.
es_mx: Estas son generalizaciones y no siempre son ciertas. Por ejemplo, algunos cortadores de diodos pueden cortar metales delgados. Para obtener más información, siempre investiga tu cortador láser específico.
fr_ca: Il s'agit de généralisations qui ne sont pas toujours vraies. Par exemple, certains découpeurs à diodes peuvent découper des métaux fins. Pour plus d'informations, renseignez-vous toujours sur votre découpeur laser spécifique.
zh_cn: 这些都是概括，并不总是正确的。例如，一些二极管切割机可以切割薄金属。要了解更多信息，请始终研究您的特定激光切割机。

source: What Can You Cut?
es_mx: ¿Qué puedes cortar?
fr_ca: Que pouvez-vous couper ?
zh_cn: 你能切什么？

source: As mentioned above, CO2 lasers---like those commonly available to FTC teams---can cut wood and some plastics. Some of the most useful materials you can cut with a CO2 laser in the 40 watt range are:
es_mx: Como se mencionó anteriormente, los láseres de CO2, como los comúnmente disponibles para los equipos de FTC, pueden cortar madera y algunos plásticos. Algunos de los materiales más útiles que se pueden cortar con un láser de CO2 en el rango de 40 watts son:
fr_ca: Comme indiqué plus haut, les lasers CO2, comme ceux dont disposent généralement les équipes FTC, peuvent découper le bois et certains plastiques. Les matériaux les plus utiles que vous pouvez découper avec un laser CO2 dans la gamme des 40 watts sont les suivants :
zh_cn: 如上所述，二氧化碳激光器——就像FTC团队通常使用的那些——可以切割木材和一些塑料。用40瓦范围内的二氧化碳激光器切割的一些最有用的材料是：

source: Wood
es_mx: Madera
fr_ca: Bois
zh_cn: 木材

source: Most thin wood can be easily lasercut and is great for prototypes as well as light-duty parts. For more info see :ref:`the material guide <materials-guide-plywood-and-mdf>`. Please note that some woods - such as MDF - contain glues that release fumes when cut. Oily or resinous woods may also have a heightened risk of catching on fire.
es_mx: La mayoría de las maderas delgadas se pueden cortar fácilmente con láser y son ideales para prototipos y piezas de trabajo livianas. Para obtener más información, consulta la :ref:`guía de materiales <materials-guide-plywood-and-mdf>`. Ten en cuenta que algunas maderas, como el MDF, contienen pegamentos que liberan humos al cortar. Las maderas aceitosas o resinosas también pueden tener un mayor riesgo de incendiarse.
fr_ca: La plupart des bois minces peuvent être facilement découpés au laser et sont parfaits pour les prototypes et les pièces légères. Pour plus d'informations, voir :ref:`le guide des matériaux <materials-guide-plywood-and-mdf>`. Veuillez noter que certains bois, comme le MDF, contiennent des colles qui dégagent des fumées lors de la découpe. Les bois gras ou résineux peuvent également présenter un risque accru d'incendie.
zh_cn: 大多数薄木板都可以很容易地进行激光切割，非常适合制作原型和轻型零件。更多信息请参阅 :ref:`材料指南 <materials-guide-plywood-and-mdf>` 。请注意，某些木材（如中密度纤维板）含有胶水，切割时会释放烟雾。油性或树脂木材可能会增加着火的风险。

source: Acrylic
es_mx: Acrílico
fr_ca: Acrylique
zh_cn: 丙烯酸纤维

source: Acrylic is a very commonly used material for laser cutting. Due to its tendency to fracture under load, it mainly finds use on FTC bots as decorative plates or as guides to funnel game elements. For more information on using acrylic in FTC, see :ref:`the material guide <materials-guide-acrylic>`.
es_mx: El acrílico es un material muy utilizado para el corte láser. Debido a su tendencia a fracturarse bajo carga, se utiliza principalmente en los robots FTC como placas decorativas o como guías para dirigir los elementos del juego. Para obtener más información sobre el uso del acrílico en FTC, consulta la :ref:`guía de materiales <materials-guide-acrylic>`.
fr_ca: L'acrylique est un matériau très couramment utilisé pour la découpe laser. En raison de sa tendance à se fracturer sous l'effet de la charge, il est principalement utilisé sur les robots FTC comme plaques décoratives ou comme guides pour les éléments de jeu en entonnoir. Pour plus d'informations sur l'utilisation de l'acrylique en FTC, voir :ref:`le guide des matériaux <materials-guide-acrylic>`.
zh_cn: 丙烯酸纤维是一种非常常用的激光切割材料。由于它在负载下容易断裂，因此在 FTC 机器人上主要用作装饰板或输送比赛元素的导轨。有关在 FTC 中使用亚克力的更多信息，请参阅 :ref:`材料指南 <materials-guide-acrylic>` 。

source: Delrin, also known as acetal, can be safely cut on most CO2 lasers with proper ventilation. Laser cut Delrin can be used to make everything from motor mounts to linear slide inserts to whole drivetrain plates. More information on delrin can be found in :ref:`the material guide <materials-guide-delrin>`.
es_mx: Delrin, también conocido como acetal, se puede cortar de forma segura en la mayoría de los láseres de CO2 con una ventilación adecuada. El Delrin cortado con láser se puede utilizar para fabricar desde soportes de motor hasta insertos de rieles lineales y placas del chasis completas. Se puede encontrar más información sobre el Delrin en :ref:`la guía de materiales <materials-guide-delrin>`.
fr_ca: Le Delrin, également connu sous le nom d'acétal, peut être découpé en toute sécurité sur la plupart des lasers CO2 avec une ventilation adéquate. Le Delrin découpé au laser peut être utilisé pour fabriquer des supports de moteur, des inserts de glissières linéaires ou des plaques de transmission complètes. Pour plus d'informations sur le delrin, consultez :ref:`le guide des matériaux <materials-guide-delrin>`.
zh_cn: Delrin 又称缩醛，在适当通风的情况下，可以在大多数 CO2 激光器上安全切割。激光切割的 Delrin 可用于制造从电机支架、线性滑轨插入件到整个传动系统板的所有部件。有关 Delrin 的更多信息，请参阅 :ref:`材料指南 <materials-guide-delrin>` 。

source: What Can't You Cut?
es_mx: ¿Qué no puedes cortar?
fr_ca: Qu'est-ce que vous ne pouvez pas couper ?
zh_cn: 你不能切割什么？

source: There are some materials, mostly plastics, you should **NEVER** try cutting on a desktop laser.
es_mx: Hay algunos materiales, principalmente plásticos, que **NUNCA** debes intentar cortar en un láser de escritorio.
fr_ca: Il existe des matériaux, principalement des plastiques, qu'il ne faut **JAMAIS** essayer de découper avec un laser de bureau.
zh_cn: 有些材料，主要是塑料，你永远不要尝试在桌面激光上切割。

source: PVC
zh_cn: 聚氯乙烯

source: This emits toxic fumes which can damage your laser cutter and your lungs.
es_mx: Este emite humos tóxicos que pueden dañar tu cortadora láser y tus pulmones.
fr_ca: Cela émet des fumées toxiques qui peuvent endommager votre découpeur laser et vos poumons.
zh_cn: 这会释放有毒气体，损害你的激光切割机和你的肺部。

source: Polycarbonate
es_mx: Policarbonato
zh_cn: 聚碳酸酯

source: If you try to cut polycarbonate it will discolor and burn instead of cutting, releasing toxic fumes and potentially starting a fire.
es_mx: Si intentas cortar policarbonato, en lugar de cortarse, se decolorará y quemará, liberando humos tóxicos y potencialmente iniciando un incendio.
fr_ca: Si vous essayez de couper le polycarbonate, il se décolorera et brûlera au lieu de se couper, libérant des fumées toxiques et risquant de déclencher un incendie.
zh_cn: 如果你试图切割聚碳酸酯，它会变色并燃烧而不是切割，释放有毒气体并可能引发火灾。

source: ABS and HDPE
es_mx: ABS y HDPE
fr_ca: ABS et HDPE
zh_cn: ABS和HDPE

source: These will both melt instead of cutting cleanly.
es_mx: Estos se derretirán en lugar de cortarse limpiamente.
fr_ca: Ils fondront tous deux au lieu de couper proprement.
zh_cn: 这些都会融化而不是切割干净。

source: Any unknown plastic
es_mx: Cualquier plástico desconocido
fr_ca: Tout plastique inconnu
zh_cn: 任何不明塑料

source: If you don't know what a plastic is, don't take the risk of cutting it. It could potentially burn or release toxic gasses. Be careful, as some different plastics, such as acrylic and polycarbonate, can resemble each other.
es_mx: Si no sabes qué es un plástico, no corras el riesgo de cortarlo. Podría potencialmente quemarse o liberar gases tóxicos. Ten cuidado, ya que algunos plásticos diferentes, como el acrílico y el policarbonato, pueden parecerse entre sí.
fr_ca: Si vous ne savez pas ce qu'est un plastique, ne prenez pas le risque de le couper. Il pourrait brûler ou dégager des gaz toxiques. Faites attention, car certains plastiques, comme l'acrylique et le polycarbonate, peuvent se ressembler.
zh_cn: 如果你不知道塑料是什么，不要冒险切割它。它可能会燃烧或释放有毒气体。小心，因为一些不同的塑料，如丙烯酸和聚碳酸酯，可能彼此相似。

source: This is not an exhaustive list and you should always research materials to ensure they will be safe before cutting them.
es_mx: Esta no es una lista exhaustiva y siempre debes investigar los materiales para asegurarte de que sean seguros antes de cortarlos.
fr_ca: Cette liste n'est pas exhaustive et vous devez toujours vous renseigner sur les matériaux pour vous assurer qu'ils sont sûrs avant de les découper.
zh_cn: 这不是一个详尽的清单，你应该总是研究材料，以确保它们在切割之前是安全的。

source: Design Guide
es_mx: Guía de diseño
fr_ca: Guide de conception
zh_cn: 设计指南

source: When using a sponsor, machine shop, or service like Fabworks or SendCutSend, parts may be adjusted by the vendor for you. Check with the service you are using before you make these adjustments!
es_mx: Cuando utilices un patrocinador, taller de máquinas o un servicio como Fabworks o SendCutSend, es posible que el proveedor ajuste las piezas por ti. ¡Verifica con el servicio que estás utilizando antes de realizar estos ajustes!
fr_ca: Lorsque vous faites appel à un sponsor, à un atelier d'usinage ou à un service tel que Fabworks ou SendCutSend, les pièces peuvent être ajustées par le vendeur pour vous. Vérifiez auprès du service que vous utilisez avant de procéder à ces ajustements !
zh_cn: 使用赞助商、机械车间或Fabworks或SendCutsend等服务时，供应商可能会为您调整零件。在进行这些调整之前，请咨询您正在使用的服务！

source: There are a few quirks of laser cut parts that you should keep in mind when designing them
es_mx: Hay algunas peculiaridades de las piezas cortadas con láser que debes tener en cuenta al diseñarlas.
fr_ca: Les pièces découpées au laser présentent quelques particularités qu'il convient de garder à l'esprit lors de leur conception.
zh_cn: 有几个少见的激光切割零件您应该牢记当设计他们

source: Kerf
es_mx: Corte
zh_cn: 锯口

source: Most laser cutting software does not account for the width of the laser beam when cutting. This means if you require precise outer dimensions or hole diameters, you need to manually offset your paths in CAD.
es_mx: La mayoría del software de corte láser no tiene en cuenta el ancho del haz láser al cortar. Esto significa que si necesitas dimensiones externas precisas o diámetros de agujeros, debes desplazar manualmente tus trayectorias en CAD.
fr_ca: La plupart des logiciels de découpe laser ne tiennent pas compte de la largeur du faisceau laser lors de la découpe. Cela signifie que si vous avez besoin de dimensions extérieures ou de diamètres de trous précis, vous devez décaler manuellement vos trajectoires dans la CAO.
zh_cn: 大多数激光切割软件在切割时不会考虑激光束的宽度。这意味着如果您需要精确的外形尺寸或孔直径，您需要在CAD中手动偏移路径。

source: Taper
es_mx: Afilar
fr_ca: Conique
zh_cn: 锥度

source: As the lens in a laser cutter focuses light, it naturally creates a cone shaped beam. This leads to a beveled edge on parts. While this is usually not a problem for plates, it means pressfit non-flanged bearings may work their way out over time as they are squeezed harder at one side than another. One way to get around this is to lase holes undersized and then drill or ream them out to their final dimension to achieve vertical walls.
es_mx: A medida que el lente en una cortadora láser enfoca la luz, naturalmente crea un haz en forma de cono. Esto resulta en un borde biselado en las piezas. Si bien esto generalmente no es un problema para las placas, significa que los rodamientos sin brida ajustados a presión pueden salirse con el tiempo, ya que se comprimen más fuertemente en un lado que en otro. Una forma de solucionar esto es cortar los agujeros con un tamaño menor y luego perforar o escariar hasta alcanzar su dimensión final para lograr paredes verticales.
fr_ca: Lorsque la lentille d'une découpeuse laser concentre la lumière, elle crée naturellement un faisceau en forme de cône. Il en résulte un bord biseauté sur les pièces. Bien que cela ne pose généralement pas de problème pour les plaques, cela signifie que les roulements à pression non bridés peuvent s'user au fil du temps car ils sont pressés plus fortement d'un côté que de l'autre. Une façon de contourner ce problème consiste à percer des trous sous-dimensionnés, puis à les percer ou à les aléser à leur dimension finale afin d'obtenir des parois verticales.
zh_cn: 当激光切割机中的透镜聚焦光线时，它自然会产生锥形光束。这导致零件上有斜边。虽然这通常对板来说不是问题，但这意味着随着时间的推移，压配合非法兰轴承可能会出现问题，因为它们的一侧比另一侧挤压得更厉害。解决这个问题的一种方法是激光孔尺寸较小，然后钻或扩孔到最终尺寸，以实现垂直壁。

source: Side view of a laser-cut acrylic part, showing the taper
es_mx: Vista lateral de una pieza de acrílico cortada con láser, mostrando la afilación
fr_ca: Vue latérale d'une pièce en acrylique découpée au laser, montrant la conicité
zh_cn: 激光切割丙烯酸部件的侧视图，显示锥度

source: Other Uses of Laser Cutting
es_mx: Otros usos del corte láser
fr_ca: Autres utilisations de la découpe laser
zh_cn: 激光切割的其他用途

source: A laser cutter can be used to precisely mark the positions of holes in a metal sheet, which can then be drilled out with a drill press to make metal plates.
es_mx: Una cortadora láser se puede utilizar para marcar con precisión las posiciones de los agujeros en una lámina de metal, los cuales luego pueden ser perforados con una prensa de taladro para hacer placas de metal.
fr_ca: Une découpeuse laser peut être utilisée pour marquer avec précision les positions des trous dans une feuille de métal, qui peuvent ensuite être percés à l'aide d'une perceuse à colonne pour fabriquer des plaques de métal.
zh_cn: 激光切割机可以用来精确标记金属工作表中孔的位置，然后用钻床钻出孔来制作金属板。

source: Delrin
es_mx: Acetal
