Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/machining.po
Languages: es_mx, fr_ca, zh_cn

source: Machining
es_mx: Maquinado
fr_ca: Usinage
zh_cn: 机械加工

source: Advantages of Machining
es_mx: Ventajas de maquinar
fr_ca: Avantages de l'usinage
zh_cn: 机械加工的优势

source: Machining allows teams to create practically any part without limitations.
es_mx: El maquinado permite a los equipos crear prácticamente cualquier pieza sin limitaciones.
fr_ca: L'usinage permet aux équipes de créer pratiquement n'importe quelle pièce sans limites.
zh_cn: 机械加工可以让团队不受任何限制地制造出几乎任何部件。

source: Machining allows teams to create custom drivetrain plates, arms, linear slides, etc to fit their design needs more effectively than kits.
es_mx: El maquinado permite a los equipos crear placas del chasis personalizadas, brazos, guías lineales, etc. para adaptarse a sus necesidades de diseño de manera más efectiva que los kits.
fr_ca: L'usinage permet aux équipes de créer des plaques de transmission, des bras, des glissières linéaires, etc. personnalisés pour répondre à leurs besoins de conception plus efficacement que les kits.
zh_cn: 与成套设备相比，机械加工使团队能够更有效地创建定制的传动系统板、臂、线性滑轨等，以满足他们的设计需求。

source: Machining is cool. Yes, really.
es_mx: El maquinado es genial. Sí, de verdad.
fr_ca: L'usinage, c'est cool. Oui, vraiment.
zh_cn: 机械加工很酷。是的，真的。

source: Disadvantages of Machining
es_mx: Desventajas del maquinado
fr_ca: Inconvénients de l'usinage
zh_cn: 机械加工的缺点

source: Perhaps the biggest barrier when making a fully custom robot is that it requires very expensive manufacturing equipment. While 3D printers have become more and more common in FTC\ |reg| and allow teams to create or customize small parts, many teams do not have access to equipment such as lathes, routers, waterjet cutters, or CNC machines.
es_mx: Quizás la barrera más grande al hacer un robot completamente personalizado es que requiere equipo de fabricación muy costoso. Aunque las impresoras 3D se han vuelto cada vez más comunes en FTC\ |reg| y permiten a los equipos crear o personalizar piezas pequeñas, muchos equipos no tienen acceso a equipos como tornos, enrutadores, cortadores de chorro de agua o máquinas CNC.
fr_ca: Peut-être que le plus grand obstacle à la création d’un robot entièrement personnalisé est qu’il nécessite un équipement de fabrication très coûteux. Bien que les imprimantes 3D soient de plus en plus courantes en FTC\ |reg| et permettent aux équipes de créer ou de personnaliser de petites pièces, de nombreuses équipes n’ont pas accès à des équipements tels que des tours, des fraiseuses, des découpeuses au jet d’eau ou des machines CNC.
zh_cn: 制作全定制机器人的最大障碍可能是需要非常昂贵的制造设备。虽然 3D 打印机在 FTC\ |reg| 中越来越常见，并允许团队创建或定制小部件，但许多团队无法使用车床、刳刨机、水刀切割机或数控机床等设备。

source: Fully custom robots need to be fully designed in CAD. Sketching will not cut it when building custom robots.
es_mx: Los robots personalizados deben ser completamente diseñados en CAD. El dibujo a mano no es suficiente cuando se construyen robots personalizados.
fr_ca: Les robots entièrement personnalisés doivent être entièrement conçus en CAO. Les croquis ne suffisent pas pour construire des robots personnalisés.
zh_cn: 完全定制的机器人需要在 CAD 中进行完全设计。绘制草图并不能满足定制机器人的要求。

source: Another barrier is that prototyping with fully custom systems is almost always much slower than using kit parts. The full CAD process takes time, and fabrication/getting parts fabricated by a shop or sponsor is another lengthy process. Notwithstanding those two factors, if something goes drastically wrong then it will require a repeat process of CAD and fabrication.
es_mx: Otra barrera es que la creación de prototipos con sistemas completamente personalizados casi siempre es mucho más lenta que el uso de piezas de kit. El proceso completo de CAD lleva tiempo, y la fabricación/obtención de piezas fabricadas por una tienda o patrocinador es otro proceso largo. No obstante, si algo sale drásticamente mal, requerirá un proceso repetido de CAD y fabricación.
fr_ca: Un autre obstacle est que le prototypage de systèmes entièrement personnalisés est presque toujours beaucoup plus lent que l'utilisation de pièces en kit. Le processus complet de CAO prend du temps, et la fabrication des pièces par un atelier ou un sponsor est un autre processus long. Indépendamment de ces deux facteurs, si quelque chose ne va pas du tout, il faudra recommencer le processus de CAO et de fabrication.
zh_cn: 另一个障碍是，完全定制系统的原型制作几乎总是比使用配套零件要慢得多。完整的 CAD 流程需要时间，而制造/让商店或赞助商制造部件又是一个漫长的过程。尽管有这两个因素，但如果出了大问题，就需要重复 CAD 和制造过程。

source: It must be noted that teams do not need to pick between a fully kit-based robot or a fully custom robot. In fact, many successful teams are actually a hybrid of both kit and custom parts, as can be seen in many of example robots in this section.
es_mx: Debe tenerse en cuenta que los equipos no necesitan elegir entre un robot completamente basado en kits o un robot completamente personalizado. De hecho, muchos equipos exitosos son en realidad una combinación de piezas de kit y personalizadas, como se puede ver en muchos ejemplos de robots en esta sección.
fr_ca: Il convient de noter que les équipes n'ont pas besoin de choisir entre un robot entièrement en kit et un robot entièrement personnalisé. En fait, de nombreuses équipes qui réussissent sont en fait un hybride de pièces en kit et de pièces personnalisées, comme on peut le voir dans de nombreux exemples de robots dans cette section.
zh_cn: 必须指出的是，参赛队不必在完全基于套件的机器人和完全定制的机器人之间做出选择。事实上，许多成功的团队实际上是套件和定制部件的混合体，本节中的许多机器人示例就体现了这一点。

source: However, our suggestion is that inexperienced teams should prioritize 3D printing over machining for fabricating custom parts, at least for the near term.
es_mx: Sin embargo, nuestra sugerencia es que los equipos inexpertos deberían priorizar la impresión en 3D sobre el maquinado para fabricar piezas personalizadas, al menos a corto plazo.
fr_ca: Cependant, nous suggérons aux équipes inexpérimentées de donner la priorité à l'impression 3D plutôt qu'à l'usinage pour la fabrication de pièces personnalisées, du moins à court terme.
zh_cn: 不过，我们的建议是，在制造定制零件时，缺乏经验的团队应优先考虑 3D 打印，而不是机械加工，至少在短期内是这样。

source: 8680 Kraken Pinion's Rover Ruckus robot
fr_ca: 8680 Robot Rover Ruckus de Kraken Pinion
zh_cn: 8680 Kraken Pinion 的 Rover Ruckus 机器人

source: 8680 Kraken Pinion, Division Semifinalist (Detroit Worlds), Rover Ruckus
es_mx: 8680 Kraken Pinion, Semifinalista de División (Detroit Worlds), Rover Ruckus
fr_ca: 8680 Kraken Pinion, demi-finaliste de la division (Detroit Worlds), Rover Ruckus
zh_cn: 8680 Kraken Pinion，分区半决赛选手（底特律世锦赛），Rover Ruckus

source: Utilizes a kit-based drivetrain (Actobotics) and horizontal linear slides (REV) with a custom intake, housing, and mineral container. Kit linear actuator (Actobotics) with custom hook.
es_mx: Utiliza un chasis basado en kit (Actobotics) y rieles lineales horizontales (REV) con una intake, carcasa y contenedor de minerales personalizados. Actuador lineal de kit (Actobotics) con gancho personalizado.
fr_ca: Utilise une chaîne cinématique en kit (Actobotics) et des glissières linéaires horizontales (REV) avec un ramsseur, un boîtier et un réservoir de minéraux sur mesure. Actionneur linéaire en kit (Actobotics) avec crochet personnalisé.
zh_cn: 采用套件式传动系统（Actobotics）和水平线性滑轨（REV），配有定制的进气口、外壳和矿物容器。带有定制挂钩的成套线性传动装置（Actobotics）。

source: 8393 Giant Diencephalic BrainSTEM Robotics Team's Relic Recovery robot
fr_ca: 8393 Cerveau diencéphale géantRobot de récupération de reliques de l'équipe de robotiqueSTEM
zh_cn: 8393 Giant Diencephalic BrainSTEM 的 Relic Recovery 机器人

source: 8393 Giant Diencephalic BrainSTEM Robotics Team, Winning Alliance First Pick (Detroit), Relic Recovery, fully custom
es_mx: 8393 Giant Diencephalic BrainSTEM Robotics Team, Primera Selección Alianza Ganadora (Detroit), Relic Recovery, completamente personalizado
fr_ca: 8393 Giant Diencephalic BrainSTEM Robotics Team, Winning Alliance First Pick (Detroit), Relic Recovery, entièrement personnalisé
zh_cn: 8393 Giant Diencephalic BrainSTEM，获胜联盟第一选拔赛（底特律），Relic Recovery，完全定制

source: 731 Wannabee Strange's Rover Ruckus robot
fr_ca: 731 Robot Rover Ruckus de Wannabee Strange
zh_cn: 731 Wannabee Strange 的 Rover Ruckus 机器人

source: 731 Wannabee Strange, Rover Ruckus, Design Award Finalist (Houston)
es_mx: 731 Wannabee Strange, Rover Ruckus, Finalista del Premio de Diseño (Houston)
fr_ca: 731 Wannabee Strange, Rover Ruckus, finaliste du prix du design (Houston)
zh_cn: 731 Wannabee Strange，Rover Ruckus，设计奖入围奖（休斯顿）

source: Utilizes a 3D printed (PETG and TPU) and machined (milled) arm/intake with a custom HDPE drive train (CNC routed)
es_mx: Utiliza un brazo/intake impreso en 3D (PETG y TPU) y maquinado (fresado) con un chasis personalizado de HDPE (enrutado por CNC)
fr_ca: Utilise un bras/ramasseur imprimé en 3D (PETG et TPU) et usiné (fraisé) avec un système d'entraînement personnalisé en HDPE (fraisage CNC).
zh_cn: 采用 3D 打印（PETG 和 TPU）和机械加工（铣削）的机械臂/进气口，以及定制的高密度聚乙烯传动系统（数控加工）。
