Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/manufacturing-glossary.po
Languages: es_mx, fr_ca

source: Manufacturing Glossary
es_mx: Glosario de Manufactura
fr_ca: Glossaire de la fabrication

source: Laser Cutter
es_mx: Cortadora láser
fr_ca: Découpeur laser

source: A laser cutter is a tool that uses a high-power laser to cut through sheet metal or similar material. The laser is guided by CNC to cut preprogrammed patterns into the sheet.
es_mx: Una cortadora láser es una herramienta que utiliza un láser de alta potencia para cortar láminas de metal o material similar. El láser es guiado por CNC para cortar patrones preprogramados en la lámina.
fr_ca: Un découpeur laser est un outil qui utilise un laser de forte puissance pour découper une feuille de métal ou un matériau similaire. Le laser est guidé par la commande numérique pour découper des motifs préprogrammés dans la tôle.

source: Waterjet Cutter
es_mx: Cortadora de chorro de agua
fr_ca: Découpeur à jet d'eau

source: A waterjet cutter is a tool which cuts sheet metal and other materials via extremely high pressure water focused into a small stream. Waterjet cutters are commonly used in industrial fabrication and can follow preprogrammed instructions to cut patterns, similar to a CNC system.
es_mx: Un cortador de chorro de agua es una herramienta que corta láminas de metal y otros materiales mediante agua a presión extremadamente alta enfocada en un pequeño chorro. Los cortadores de chorro de agua se utilizan comúnmente en la fabricación industrial y pueden seguir instrucciones preprogramadas para cortar patrones, similares a un sistema CNC.
fr_ca: Une découpeuse à jet d'eau est un outil qui découpe des tôles et d'autres matériaux à l'aide d'eau à très haute pression concentrée dans un petit courant. Les découpeurs à jet d'eau sont couramment utilisés dans la fabrication industrielle et peuvent suivre des instructions préprogrammées pour découper des modèles, à l'instar d'un système CNC.

source: Standoff
es_mx: Standoff/Separador
fr_ca: Entretoise

source: A standoff is a fastener with two threaded ends and usually has a hex profile to be used with a wrench. These ends are usually female threaded, meaning that they can have a screw threaded into them.
es_mx: Un standoff es un sujetador con dos extremos roscados y generalmente tiene un perfil hexagonal para ser utilizado con una llave. Estos extremos generalmente están roscados en forma de hembra, lo que significa que se puede enroscar un tornillo en ellos.
fr_ca: Une entretoise est une fixation à deux extrémités filetées, généralement dotée d'un profil hexagonal permettant de l'utiliser avec une clé. Ces extrémités sont généralement filetées femelles, ce qui signifie qu'une vis peut y être vissée.

source: This is usually a more compact alternative to a long screw and spacers, and can be used to space things out as well as fasten them. Custom standoffs can be made out of hex stock, such as :term:`AndyMark Churro <Churro>`.
es_mx: Esta es generalmente una alternativa más compacta a un tornillo largo y espaciadores, y se puede utilizar para espaciar las cosas, así como para sujetarlas. Los standoffs personalizados se pueden hacer a partir de una barra hexagonal, como :term:`AndyMark Churro <Churro>`.
fr_ca: Il s'agit généralement d'une alternative plus compacte qu'une longue vis et des entretoises, et elle peut être utilisée pour espacer les objets ainsi que pour les fixer. Des supports personnalisés peuvent être fabriqués à partir d'hexagones, comme :term:`AndyMark Churro <Churro>`.

source: Standoffs are usually used in drivetrain purposes, such as in parallel plate drivetrains, where the plates must be separated and supported by standoffs at equal distances.
es_mx: Los standoffs se utilizan generalmente en propósitos del chasis, como en chasises de placas paralelas, donde las placas deben estar separadas y soportadas por separadores a distancias iguales.
fr_ca: Les entretoises sont généralement utilisées dans les transmissions, par exemple dans les transmissions à plaques parallèles, où les plaques doivent être séparées et soutenues par des entretoises à des distances égales.

source: A couple of standoffr
es_mx: Un par de standoff
fr_ca: Un couple d'entretoises
