Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/materials-guide.po
Languages: es_mx, fr_ca, zh_cn

source: Acetal, also known under brand name Delrin, is a low-friction strong plastic. It is a common plastic used for wheels, plastic gears, and sprockets (especially in the REV system).
es_mx: El acetal, también conocido bajo la marca Delrin, es un plástico resistente de baja fricción. Es un plástico muy utilizado para ruedas, engranajes de plástico y piñones (especialmente en el sistema REV).
fr_ca: L'acétal, également connu sous le nom de marque Delrin, est un plastique résistant à faible frottement. C'est un plastique couramment utilisé pour les roues, les engrenages en plastique et les pignons (en particulier dans le système REV).
zh_cn: 缩醛，也称为Delrin，是一种低摩擦强力塑料。它是一种常用于车轮、塑料齿轮和链轮（尤其是在REV系统中）的塑料。

source: It is a durable and strong plastic that is not easily cracked. Delrin can be used in drivetrain plates (use 1/4" or 3/16" thickness), but Delrin sheet is also quite expensive.
es_mx: Es un plástico resistente y duradero que no se agrieta con facilidad. El Delrin se puede utilizar en placas del chasis (utilice un grosor de 1/4" o 3/16"), pero la lámina de Delrin también es bastante cara.
fr_ca: Il s'agit d'un plastique durable et solide qui ne se fissure pas facilement. Le Delrin peut être utilisé pour les plaques de transmission (épaisseur de 1/4" ou 3/16"), mais les plaques de Delrin sont également assez chères.
zh_cn: 它是一种耐用且坚固的塑料，不易开裂。Delrin可用于传动系统板（使用1/4"或3/16"厚度），但Delrin工作表也相当昂贵

source: Delrin can be machined in a variety of ways including laser cutting, CNC routing and hand sculpting. However, bending Delrin is much harder than bending Lexan or ABS.
es_mx: El Delrin puede maquinarse de diversas formas, como corte por láser, enrutamiento con CNC y esculpido a mano. Sin embargo, doblar Delrin es mucho más difícil que doblar Lexan o ABS.
fr_ca: Le Delrin peut être usiné de diverses manières, notamment par découpe laser, routage CNC et sculpture manuelle. Cependant, le cintrage du Delrin est beaucoup plus difficile que celui du Lexan ou de l'ABS.
zh_cn: Delrin可以通过多种方式进行加工，包括激光切割、CNC布线和手工雕刻。然而，弯曲Delrin比弯曲Lexan或ABS困难得多。

source: Various HDPE plates
es_mx: Varias placas de HDPE
fr_ca: Diverses plaques HDPE
zh_cn: 各种高密度聚乙烯板

source: HDPE stands for High Density Polyethylene and usually comes in opaque white or black sheets and plates
es_mx: HDPE son las siglas de "High Density Polyethylene" o polietileno de alta densidad y suele presentarse en placas y láminas opacas de color blanco o negro.
fr_ca: Le PEHD polyéthylène haute densité se présente généralement sous la forme de feuilles et de plaques opaques blanches ou noires.
zh_cn: HDPE 是高密度聚乙烯的缩写，通常为不透明的白色或黑色片材和板材。

source: HDPE is a cheaper alternative with low-friction characteristics similar to Delrin and flexibility/structure near polycarbonate.
es_mx: El HDPE es una alternativa más barata con características de baja fricción similares al Delrin y una flexibilidad/estructura cercana al policarbonato.
fr_ca: Le PEHD est une alternative moins coûteuse qui présente des caractéristiques de faible friction similaires à celles du Delrin et une flexibilité/structure proche de celle du polycarbonate.
zh_cn: HDPE是一种更便宜的替代品，具有与Delrin相似的低摩擦特性，flexibility/structure接近聚碳酸酯。

source: HDPE is easily machined by both hand tools and machine tools. However, it will burn in a laser cutter, so **do not laser cut HDPE.**
es_mx: El HDPE se maquina fácilmente tanto con herramientas manuales como mecánicas. Sin embargo, se quemará en una cortadora láser, por lo que **No corte HDPE con láser. **.
fr_ca: Le HDPE se travaille facilement à la main comme à la machine-outil. Cependant, il brûle dans une découpeuse laser, donc **ne pas découper le HDPE au laser.**
zh_cn: HDPE很容易用手动工具和机床加工。然而，它会在激光切割机中燃烧，所以不要激光切割HDPE

source: PVC is a common lightweight plastic ubiquitous at any hardware store.
es_mx: El PVC es un plástico ligero común omnipresente en cualquier ferretería.
fr_ca: Le PVC est un plastique léger courant que l'on trouve dans toutes les quincailleries.
zh_cn: PVC 是一种常见的轻质塑料，在五金店里随处可见。

source: PVC is most commonly sold as pipe, though PVC sheet does exist.
es_mx: El PVC se vende sobre todo en forma de tuberías, aunque también existen láminas de PVC.
fr_ca: Le PVC est le plus souvent vendu sous forme de tuyaux, bien qu'il existe des feuilles de PVC.
zh_cn: PVC 最常见的销售形式是管材，但也有 PVC 板材。

source: FTC teams generally use PVC in order to customize intake rollers, especially for surgical tubing intakes. Due to the soft plastic, it is very easy to drill through, so teams often attach the surgical tubing to a PVC pipe. The PVC roller will then be attached to the intake motor.
es_mx: Los equipos de FTC suelen utilizar PVC para personalizar los rodillos del intake, especialmente para las tomas de tubo quirúrgico. Debido a su plástico blando, es muy fácil de perforar, por lo que los equipos suelen fijar el tubo quirúrgico a una tubería de PVC. A continuación, el rodillo de PVC se fija al motor del intake.
fr_ca: Les équipes de FTC utilisent généralement du PVC pour personnaliser les rouleaux d'admission, en particulier pour les tubulures chirurgicales. En raison de la souplesse du plastique, il est très facile de le percer, de sorte que les équipes fixent souvent le tube chirurgical à un tuyau en PVC. Le rouleau en PVC est ensuite fixé au moteur d'admission.
zh_cn: FTC 团队通常使用 PVC 来定制进气辊，尤其是手术管道进气辊。由于塑料较软，很容易钻透，因此参赛队通常会将手术管连接到 PVC 管上。然后将 PVC 滚筒连接到进气马达上。

source: Since PVC is cheap, teams can easily experiment with different mechanism configurations.
es_mx: Como el PVC es barato, los equipos pueden experimentar fácilmente con distintas configuraciones de mecanismos.
fr_ca: Le PVC étant bon marché, les équipes peuvent facilement expérimenter différentes configurations de mécanismes.
zh_cn: 由于PVC很便宜，团队可以很容易地尝试不同的机制配置。

source: PVC pipe is sometimes used in cable management to run wires through, as it comes in different diameters and can easily be mounted.
es_mx: Los tubos de PVC se utilizan a veces en la gestión de cables para pasar cables, ya que vienen en diferentes diámetros y se pueden montar fácilmente.
fr_ca: Les tuyaux en PVC sont parfois utilisés pour le passage des câbles, car ils sont disponibles en différents diamètres et peuvent être facilement montés.
zh_cn: PVC管有时用于电缆管理，使电线通过，因为它有不同的直径，可以很容易地安装

source: PVC sheet can be bought or made by cutting vertically along the pipe so that the profile looks like a C. Bake in oven. PVC sheet is pliable yet sturdy, making it a good option for backstops or customizing connectors that require some sort of flex.
es_mx: La lámina de PVC puede comprarse o fabricarse cortando verticalmente a lo largo del tubo de modo que el perfil parezca una C. Cocer en horno. La lámina de PVC es flexible pero resistente, lo que la convierte en una buena opción para los topes traseros o para personalizar conectores que requieran algún tipo de flexión.
fr_ca: La feuille de PVC peut être achetée ou fabriquée en coupant verticalement le long du tuyau de manière à ce que le profil ressemble à un C. Cuire au four. La feuille de PVC est souple mais solide, ce qui en fait une bonne option pour les butées arrière ou la personnalisation des connecteurs qui nécessitent une certaine flexibilité.
zh_cn: PVC板可以通过沿着管道垂直切割来购买或制作，这样轮廓看起来就像烤箱里的烤面包。PVC板柔韧而坚固，是需要某种弯曲的背挡或定制连接器的好选择。

source: Acrylic is not a load-bearing material. It will crack and possibly shatter under impact.
es_mx: El acrílico no es un material de carga. Se agrietará y posiblemente se romperá en caso de impacto.
fr_ca: L'acrylique n'est pas un matériau porteur. Il se fissure et peut même se briser en cas d'impact.
zh_cn: 丙烯酸树脂不是承重材料。它在受到冲击时会开裂，甚至可能碎裂。

source: Do not use it on drivetrains by any means!
es_mx: No lo utilice en chasises bajo ningún concepto.
fr_ca: Ne l'utilisez en aucun cas sur les transmissions !
zh_cn: 无论如何都不要在传动系统上使用！

source: Acrylic is a transparent thermoplastic commonly known as Plexiglass.
es_mx: El acrílico es un termoplástico transparente conocido comúnmente como Plexiglás.
fr_ca: L'acrylique est un thermoplastique transparent communément appelé plexiglas.
zh_cn: 亚克力是一种透明的热塑性塑料，俗称有机玻璃。

source: As acrylic is not a structural material, it should only be used in mechanisms where there is no chance of shock impact.
es_mx: Como el acrílico no es un material estructural, sólo debe utilizarse en mecanismos en los que no haya posibilidad de impacto.
fr_ca: L'acrylique n'étant pas un matériau structurel, il ne doit être utilisé que dans des mécanismes où il n'y a pas de risque de choc.
zh_cn: 由于亚克力不是结构性材料，因此只能用于不会受到冲击的装置中。

source: It may be used for aesthetic purposes or as shielding (to protect game elements from falling into the robot or from other robots tangling with wires, etc.)
es_mx: Puede utilizarse con fines estéticos o como blindaje (para proteger los elementos del juego de que caigan dentro del robot o de que otros robots se enreden con los cables, etc.).
fr_ca: Il peut être utilisé à des fins esthétiques ou comme bouclier (pour protéger les éléments du jeu de la chute dans le robot ou de l'enchevêtrement des fils par d'autres robots, etc.)
zh_cn: 它可用于美观或屏蔽（防止游戏元素落入机器人或其他机器人与电线缠绕等）。

source: Treat acrylic as fancy clear cardboard - it cannot be loaded and should only be used in very specific circumstances.
es_mx: Trate el acrílico como si fuera cartón transparente de fantasía: no se puede cargar con mucho peso y sólo debe utilizarse en circunstancias muy concretas.
fr_ca: L'acrylique est considéré comme du carton transparent : il ne peut pas être chargé et ne doit être utilisé que dans des circonstances très spécifiques.
zh_cn: 丙烯酸树脂就像花哨的透明硬纸板一样，无法装载，只能在非常特殊的情况下使用。

source: Other
es_mx: Otros
fr_ca: Autres
zh_cn: 其他

source: Plywood and MDF
es_mx: Contrachapado y MDF
fr_ca: Contreplaqué et MDF
zh_cn: 胶合板和MDF

source: A medium to high strength material suitable for use in a wide variety of applications. Keep in mind that wood cannot be exposed to water or excessive humidity, as lumber for use in FTC isn't treated and may warp or expand. Do not try to use laser cut wood for a drivetrain. This is especially important if you live in a humid region such as Florida - wood expanding can completely ruin a custom drivetrain.
es_mx: Un material de resistencia media a alta adecuado para su uso en una amplia variedad de aplicaciones. Tenga en cuenta que la madera no puede exponerse al agua ni a una humedad excesiva, ya que la madera para uso en FTC no está tratada y puede contraerse o dilatarse. No intente utilizar madera cortada con láser para un chasis. Esto es especialmente importante si usted vive en una región húmeda como Florida - la madera que se expande puede arruinar por completo un chasis personalizado.
zh_cn: 这是一种中高强度的材料，适用于各种用途。请记住，木材不能接触水或过高的湿度，因为用于 FTC 的木材未经处理，可能会变形或膨胀。不要尝试使用激光切割的木材制作传动系统。如果你居住在佛罗里达等潮湿地区，这一点尤为重要--木材膨胀会完全毁坏定制的传动系统。

source: Baltic Birch is the highest grade plywood, used in commercial applications and furniture. It contains 8+ layers (usually), is extremely dense, and is recommended for high-load applications or structure. It is quite an expensive material, so prototype and plan carefully before cutting.
es_mx: El abedul báltico es el contrachapado de mayor calidad, utilizado en aplicaciones comerciales y mobiliario. Contiene más de 8 capas (normalmente), es extremadamente denso y se recomienda para aplicaciones o estructuras de gran carga. Se trata de un material bastante caro, por lo que hay que hacer prototipos y planificar con cuidado antes de cortar.
fr_ca: Le bouleau baltique est le contreplaqué de la plus haute qualité, utilisé dans les applications commerciales et l'ameublement. Il contient plus de 8 couches (en général), est extrêmement dense et est recommandé pour les applications ou les structures à forte charge. Il s'agit d'un matériau assez coûteux, c'est pourquoi il convient d'établir un prototype et de planifier soigneusement la découpe.
zh_cn: 波罗的海桦木是最高等级的胶合板，用于商业应用和家具。它包含8+层（通常），非常致密，推荐用于高负载应用或结构。它是一种相当昂贵的材料，因此在切割前仔细制作原型和计划。

source: Plywood is not recommended for final iterations, but can be a cheap prototyping material. It doesn't bear load especially well and can flex quite a bit.
es_mx: La madera contrachapada no se recomienda para iteraciones finales, pero puede ser un material barato para prototipos. No soporta especialmente bien la carga y puede flexionarse bastante.
fr_ca: Le contreplaqué n'est pas recommandé pour les itérations finales, mais il peut constituer un matériau de prototypage bon marché. Il ne supporte pas particulièrement bien les charges et peut se déformer assez rapidement.
zh_cn: 胶合板不推荐用于最终迭代，但可以是一种廉价的原型材料。它不能很好地承受负载，并且可以弯曲相当大。

source: MDF is generally discouraged as there are better options and absorbs water easily.
es_mx: Generalmente, el MDF se desaconseja ya que hay mejores opciones y absorbe el agua con facilidad.
fr_ca: Le MDF est généralement déconseillé car il existe de meilleures options et il absorbe facilement l'eau.
zh_cn: MDF通常不被鼓励，因为有更好的选择，而且容易吸收水分。

source: Carbon Fiber
es_mx: Fibra de Carbono
fr_ca: Fibre de carbone
zh_cn: 碳纤维

source: **Machining carbon fiber, like any fibrous substance, is a significant SAFETY HAZARD! Carbon fiber dust especially can cause cancer and is incredibly dangerous. DO NOT MACHINE/CUT carbon fiber unless you know what you are doing. When you do, make sure to either use machinery that is designed to cut carbon fiber, or cut in a well ventilated area with sufficient respiratory protection and running water over the carbon fiber.**
es_mx: **El maquinado de fibra de carbono, como el de cualquier sustancia fibrosa, supone un importante PELIGRO PARA LA SEGURIDAD. Especialmente el polvo de fibra de carbono puede causar cáncer y es increíblemente peligroso. NO MAQUINE/CORTE fibra de carbono a menos que sepa lo que está haciendo. Cuando lo haga, asegúrese de utilizar maquinaria diseñada para cortar fibra de carbono, o corte en una zona bien ventilada con suficiente protección respiratoria y agua corriendo sobre la fibra de carbono. **
fr_ca: **L'usinage de la fibre de carbone, comme toute substance fibreuse, présente un risque important pour la sécurité ! La poussière de fibre de carbone, en particulier, peut provoquer un cancer et est incroyablement dangereuse. NE PAS USINER/COUPER la fibre de carbone à moins de savoir ce que l'on fait. Si vous le faites, veillez à utiliser des machines conçues pour couper la fibre de carbone ou à couper dans un endroit bien ventilé, avec une protection respiratoire suffisante et de l'eau courante sur la fibre de carbone.**
zh_cn: **加工碳纤维与加工任何纤维物质一样，都存在重大安全隐患！尤其是碳纤维粉尘会致癌，危险性极高。除非你知道自己在做什么，否则切勿加工/切割碳纤维。如果要切割碳纤维，请务必使用专门用于切割碳纤维的机器，或者在通风良好的地方切割，并配备足够的呼吸防护设备和流水冲刷碳纤维**。

source: Carbon fiber is one of the strongest materials for FTC use. For most teams, it is totally overkill, but it can be used in some specific applications.
es_mx: La fibra de carbono es uno de los materiales más resistentes para uso en FTC. Para la mayoría de los equipos, es totalmente exagerado, pero se puede utilizar en algunas aplicaciones específicas.
fr_ca: La fibre de carbone est l'un des matériaux les plus résistants pour le FTC. Pour la plupart des équipes, elle est totalement surdimensionnée, mais elle peut être utilisée dans certaines applications spécifiques.
zh_cn: 碳纤维是FTC使用的最强材料之一，对于大多数团队来说，它完全是大材小用，但它可以用于一些特定的应用。

source: Carbon fiber rods are used in custom linear slide extensions or multi-axis arms.
es_mx: Las varillas de fibra de carbono se utilizan en extensiones de guías lineales personalizadas o brazos multieje.
fr_ca: Les tiges en fibre de carbone sont utilisées dans les extensions de glissières linéaires ou les bras multi-axes personnalisés.
zh_cn: 碳纤维棒用于定制线性滑轨延伸件或多轴臂。

source: It is probably the most expensive material to purchase.
es_mx: Es probablemente el material más caro de adquirir.
fr_ca: C'est probablement le matériau le plus cher à l'achat.
zh_cn: 它可能是最昂贵的材料。

source: Cardboard
es_mx: Cartón
fr_ca: Carton
zh_cn: 纸板

source: **Please do not use cardboard as a load-bearing material.** We have seen too many teams use cardboard in ways that it shouldn't be used. Treat cardboard as a sheet of paper: it has no structural rigidity and only should be used as guides to channel pieces from A to B.
es_mx: **Por favor, no utilices el cartón como material de carga. ** Hemos visto a demasiados equipos utilizar el cartón de formas en las que no debería utilizarse. Trata el cartón como una hoja de papel: no tiene rigidez estructural y solo debe utilizarse como guía para canalizar piezas de A a la B.
fr_ca: **Veuillez ne pas utiliser le carton comme matériau porteur.** Nous avons vu trop d’équipes utiliser le carton de manière inappropriée. Traitez le carton comme une feuille de papier : il n’a aucune rigidité structurelle et ne doit être utilisé que comme guide pour diriger les pièces de A à B.
zh_cn: **请勿将硬纸板用作承重材料。** 我们看到有太多的团队将硬纸板用在了不该用的地方。请将硬纸板当作一张纸：它没有结构刚度，只能用作将作品从 A 地传送到 B 地的导轨。

source: HDPE
zh_cn: 高密度聚乙烯（HDPE）
