Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/custom-manufacturing/materials-guide.po
Languages: es_mx, fr_ca, zh_cn

source: Materials Guide
es_mx: Guía de Materiales
fr_ca: Guide des matériaux
zh_cn: 材料指南

source: In FTC\ |reg|, teams have design freedom in terms of what raw materials to use. However, there are definitely some important recommendations regarding material usage.
es_mx: En FTC, los equipos tienen libertad de diseño en cuanto a qué materiales primarios utilizar. Sin embargo, definitivamente hay algunas recomendaciones importantes con respecto al uso de materiales.
fr_ca: Dans FTC |reg|, les équipes sont libres de choisir les matières premières qu'elles souhaitent utiliser. Toutefois, il existe des recommandations importantes concernant l'utilisation des matériaux.
zh_cn: FTC，团队在使用什么原材料方面有设计自由。然而，关于材料的使用，肯定有一些重要的建议。

source: Common raw materials may be found at your local hardware store. McMaster-Carr and OnlineMetals are two frequently used online vendors. For more vendors, check the Appendix.
es_mx: Las materias primas más comunes pueden encontrarse en su ferretería local McMaster-Carr y OnlineMetals son dos proveedores en línea que se utilizan con frecuencia. Para más proveedores, consulte el Apéndice.
fr_ca: Les matières premières courantes peuvent être trouvées dans votre quincaillerie locale. McMaster-Carr et OnlineMetals sont deux vendeurs en ligne fréquemment utilisés. Vous trouverez d'autres fournisseurs dans l'annexe.
zh_cn: 常见的原材料可以在你当地的五金店找到。McMaster-Carr和OnlineMetals是两个常用的在线供应商。有关更多供应商，请查看附录。

source: Here are recommended materials listed in order of importance.
es_mx: A continuación, está enlistado los materiales recomendados por orden de importancia.
fr_ca: Voici les matériaux recommandés, classés par ordre d'importance.
zh_cn: 以下是按重要性顺序列出的推荐材料。

source: Recommended Materials
es_mx: Materiales Recomendados
fr_ca: Matériaux recommandés
zh_cn: 推荐材料

source: Aluminum channel & angle
es_mx: Canal y Ángulo de aluminio
fr_ca: Profilés et cornières en aluminium
zh_cn: 铝C形梁和角度

source: Aluminum extrusion (15 and 20 mm)
es_mx: Extrusión de aluminio (15 y 20 mm)
fr_ca: Extrusion d'aluminium (15 et 20 mm)
zh_cn: 铝型材（15和20毫米）

source: Polycarbonate (Lexan\ |trade|)
es_mx: Policarbonato (Lexan\ |trade|)
fr_ca: Polycarbonate (Lexan)
zh_cn: 聚碳酸酯（Lexan™）

source: ABS
es_mx: Plástico ABS

source: Delrin
es_mx: Acetal
zh_cn: Delrin 金属

source: Conditionally Recommended
es_mx: Recomendado Condicionalmente
fr_ca: Recommandé sous conditions
zh_cn: 有条件推荐

source: Aluminum sheet
es_mx: Hoja de aluminio
fr_ca: Tôle d'aluminium
zh_cn: 铝工作表

source: Aluminum :term:`extrusion <Extrusion>` (1 inch)
es_mx: Aluminio: término: 'extrusión <Extrusion>` (1 pulgada)
fr_ca: Aluminium :terme:`extrusion <Extrusion>` (1 pouce)
zh_cn: 铝型材 :term:`铝型材 <Extrusion>` （1英寸）

source: Plywood
es_mx: Contrachapado
fr_ca: Contreplaqué
zh_cn: 胶合板

source: Polyvinyl chloride (PVC)
es_mx: Cloruro de polivinilo (PVC)
fr_ca: Chlorure de polyvinyle (PVC)
zh_cn: 聚氯乙烯（PVC）

source: Not Recommended
es_mx: No Recomendado
fr_ca: Non recommandé
zh_cn: 不推荐

source: Medium-density fiberboard (MDF)
es_mx: Tablero de fibra de densidad media (MDF)
fr_ca: Panneau de fibres de densité moyenne (MDF)
zh_cn: 中密度纤维板（MDF）

source: Steel
es_mx: Acero
fr_ca: Acier
zh_cn: 钢

source: Acrylic
es_mx: Acrílico
fr_ca: Acrylique
zh_cn: 丙烯酸

source: Metals
es_mx: Metales
fr_ca: Métaux
zh_cn: 金属

source: Aluminum
es_mx: Aluminio
fr_ca: Aluminium
zh_cn: 铝

source: Various aluminum items including extrusion, box tube, flat sheet, channel, and drawer slides
es_mx: Diversos artículos de aluminio, como extrusiones, tubos de caja, hojas planas, canales y rieles de cajón
fr_ca: Divers articles en aluminium, notamment des extrusions, des tubes, des tôles plates, des profilés et des glissières de tiroir.
zh_cn: 各种铝制品，包括型材、箱管、平板、槽钢和抽屉滑轨

source: A high strength, medium-high density material. Suitable for use in nearly every application; recommended in load-bearing applications.
es_mx: Material de alta resistencia y densidad media-alta. Adecuado para su uso en casi todas las aplicaciones; recomendado en aplicaciones de soporte de carga.
fr_ca: Matériau de haute résistance et de densité moyenne à élevée. Convient à presque toutes les applications ; recommandé pour les applications porteuses.
zh_cn: 一种高强度、中高密度的材料。几乎适用于所有应用；建议用于承重应用。

source: Aluminum comes in :term:`channel <Channel>`, :term:`extrusion <Extrusion>`, flat, angle, sheet/plate, and is used in some drawer slides.
es_mx: El aluminio se presenta en: término: 'canal <Channel>`, termino: 'extrusión <Extrusion>`, plano, ángulo, chapa/placa, y se utiliza en algunos rieles para cajones.
zh_cn: 铝有 :term:`C形梁 <Channel>` 、 :term:`铝型材 <Extrusion>` 、扁平材、角材、板材，还用于某些抽屉滑轨。

source: Aluminum :term:`channel <Channel>` is used in many build system kits and is very popular among teams of various skill levels. :term:`channel <Channel>` is strong yet relatively lightweight, and offers many mounting options for teams.
es_mx: El: término: `canal <Channel>` de aluminio se utiliza en muchos kits de sistemas de construcción y es muy popular entre los equipos de varios niveles de habilidad.: término: 'canal <Channel>` es fuerte pero relativamente ligero, y ofrece muchas opciones de montaje para los equipos.
zh_cn: :term:`C形梁 <Channel>` 在许多构建系统套件中都有使用，在不同技术水平的团队中都很受欢迎。 :term:`C形梁 <Channel>` 强度高，但重量相对较轻，可为团队提供多种安装选项。

source: 15 mm :term:`extrusion <Extrusion>` is compatible with M3 hardware, allowing teams to slide in bolts to their desired location. REV and MiSUMI offer 15 mm :term:`extrusion <Extrusion>`. REV :term:`extrusion <Extrusion>` is not as great structurally, but is lighter than MiSUMI :term:`extrusion <Extrusion>`. MiSUMI is more resistant to :term:`flexing and/or twisting under load <Torsional Rigidity>`. Both REV and MiSUMI :term:`extrusion <Extrusion>` are sold in bulk, and MiSUMI has the option to cut to the half millimeter. Keep in mind that a lot of :term:`extrusion <Extrusion>` can add up quickly in terms of weight.
es_mx: 15 mm: término: `extrusión <Extrusion>` es compatible con el hardware M3, lo que permite a los equipos deslizar los pernos hasta la ubicación deseada. REV y MiSUMI ofrecen: término: `extrusión <Extrusion>` de 15 mm. REV: término: `extrusión <Extrusion>` no es tan buena estructuralmente, pero es más ligera que MiSUMI :término: 'extrusión <Extrusion>`. MiSUMI es más resistente al: término: 'flexión y/o torsión bajo carga <Torsional Rigidity>`. Tanto REV como MiSUMI :término: 'extrusión <Extrusion>` se venden a granel, y MiSUMI tiene la opción de corte al medio milímetro. Tenga en cuenta que una gran cantidad de: término:' extrusión <Extrusion>` puede aumentar rápidamente en términos de peso.
fr_ca: 15 mm :term:`extrusion <Extrusion>` est compatible avec le matériel M3, ce qui permet aux équipes de glisser les boulons à l'endroit souhaité. REV et MiSUMI proposent des :term:`extrusion <Extrusion>` de 15 mm. REV :term:`extrusion <Extrusion>` n'est pas aussi performant sur le plan structurel, mais il est plus léger que MiSUMI :term:`extrusion <Extrusion>`. MiSUMI est plus résistant :term:`à la flexion et/ou à la torsion sous charge <Torsional Rigidity>`. Le REV et le MiSUMI :term:`extrusion <Extrusion>` sont tous deux vendus en vrac, et le MiSUMI peut être coupé au demi-millimètre près. N'oubliez pas qu'une grande quantité de :term:`extrusion <Extrusion>` peut rapidement peser lourd.
zh_cn: 15 毫米 :term:`铝型材 <Extrusion>` 与 M3 硬件兼容，允许团队将螺丝滑入所需位置。REV 和 MiSUMI 提供 15 毫米 :term:`铝型材 <Extrusion>` 。REV :term:`铝型材 <Extrusion>` 在结构上不如 MiSUMI :term:`铝型材 <Extrusion>` 轻。MiSUMI 更能抵抗 :term:`负载下的弯曲和/或扭曲 <Torsional Rigidity>` 。REV 和 MiSUMI :term:`铝型材 <Extrusion>` 都是批量销售，MiSUMI 还可以切割到半毫米。请记住，大量 :term:`铝型材 <Extrusion>` 会使重量很快得增加。

source: Term
es_mx: Término
fr_ca: Définition
zh_cn: 术语

source: Torsional Rigidity
es_mx: Rigidez Torsional
fr_ca: Rigidité torsionnelle
zh_cn: 扭转刚度

source: Torsional rigidity refers to how difficult it is to twist an object due to an applied torque. This mainly refers to :term:`extrusion <Extrusion>`, as it is easier to twist extrusion than :term:`channel <Channel>` or an angle piece, for example.
es_mx: La rigidez torsional se refiere a la dificultad de torcer un objeto debido a un toque aplicado. Esto se refiere principalmente a la: término: 'extrusión <Extrusion>`, ya que es más fácil retorcer la extrusión que un: término: 'canal <Channel>` o una pieza angular, por ejemplo.
zh_cn: 扭转刚度是指施加扭矩后物体扭转的困难程度。这主要是指 :term:`铝型材 <Extrusion>` ，因为与 :term:`C型梁 <Channel>` 或角件相比，铝型材更容易扭转。

source: Torsional rigidity has consequences particularly in building drivetrains, as the drivetrain is the last mechanism on your robot that should flex or bend when weight or force is applied to it.
es_mx: La rigidez torsional tiene consecuencias especialmente en la construcción de chasises, ya que el chasis es el último mecanismo del robot que debe flexionarse o doblarse cuando se le aplica peso o fuerza.
zh_cn: 扭转刚度会产生后果，尤其是在构建动力传动系统时，因为动力传动系统是机器人上最后一个在施加重量或力时应该弯曲或弯曲的机构。

source: MiSUMI and 8020 also offer aluminum :term:`extrusions <Extrusion>` in other sizes, such as 20mm and 1". 20 mm :term:`extrusion <Extrusion>` can be a good choice if you need a sturdier frame than provided by 15mm :term:`extrusion <Extrusion>`. Note that then you would need to buy special nuts, as 20mm :term:`extrusion <Extrusion>` is not compatible with M3 nuts. 1" extrusion is regularly used as the primary building system in FRC\ |reg|, but is definitely overkill for FTC.
es_mx: MiSUMI y 8020 también ofrecen: término: 'extrusiones <Extrusion>` de aluminio en otros tamaños, como 20 mm y 1". La: término: 'extrusión <Extrusion>` de 20 mm puede ser una buena opción si necesita un marco más robusto que el que proporciona la: término: 'extrusión <Extrusion>` de 15 mm. Tenga en cuenta que entonces tendría que comprar tuercas especiales, ya que la: término: 'extrusión <Extrusion>` de 20 mm no es compatible con las tuercas M3. La extrusión de 1" se utiliza habitualmente como sistema de construcción principal en FRC, pero es definitivamente excesivo para FTC.
fr_ca: MiSUMI et 8020 proposent également des :term:`extrusions <Extrusion>` en aluminium dans d'autres dimensions, telles que 20 mm et 1". Les :term:`extrusions <Extrusion>` de 20 mm peuvent être un bon choix si vous avez besoin d'un cadre plus solide que celui fourni par les :term:`extrusions <Extrusion>` de 15 mm. Notez que vous devrez alors acheter des écrous spéciaux, car l'extrusion :term:`extrusion <Extrusion>` de 20 mm n'est pas compatible avec les écrous M3. L'extrusion de 1" est régulièrement utilisée comme système de construction principal en FRC, mais elle est certainement excessive pour le FTC.
zh_cn: MiSUMI和8020还提供其他尺寸的 :term:`铝型材 <Extrusion>` ，如20毫米和1英寸。如果你需要比15毫米 :term:`铝型材 <Extrusion>` 更坚固的框架，20毫米 :term:`铝型材 <Extrusion>` 是一个不错的选择。请注意，你需要购买特殊螺母，因为20毫米 :term:`铝型材 <Extrusion>` 与M3螺母不兼容。1英寸铝型材材通常用作 FRC\ |reg| 中的主要搭建系统，但对于FTC而言绝对是过剩的。

source: Aluminum flat and aluminum angle is widely available at hardware stores. In certain applications, such as adapting from different build systems, it is possible to drill custom adapter plates to mount mechanisms to the drivetrain. Aluminum angle is also a very sturdy structural support piece that takes up relatively little space, and can adapt to any build system. We suggest using 1/8" alumimum with drivetrain or mounting applications, and 1/16" aluminum for low-load situations.
es_mx: El aluminio plano y el ángulo de aluminio están ampliamente disponibles en ferreterías. En ciertas aplicaciones, como la adaptación de diferentes sistemas de construcción, es posible perforar placas adaptadoras personalizadas para montar mecanismos en la chasis. El ángulo de aluminio es también una pieza de soporte estructural muy resistente que ocupa relativamente poco espacio, y puede adaptarse a cualquier sistema de construcción. Sugerimos utilizar el aluminio de 1/8" con el chasis o aplicaciones de montaje, y el aluminio de 1/16" para situaciones de baja carga.
fr_ca: L'aluminium plat et l'aluminium angulaire sont largement disponibles dans les quincailleries. Dans certaines applications, telles que l'adaptation de différents systèmes de construction, il est possible de percer des plaques d'adaptation personnalisées pour monter des mécanismes sur le groupe motopropulseur. La cornière en aluminium est également une pièce de support structurel très solide qui prend relativement peu de place et qui peut s'adapter à n'importe quel système de construction. Nous suggérons d'utiliser de l'aluminium de 1/8" au maximum pour les applications de transmission ou de montage, et de l'aluminium de 1/16" pour les situations de faible charge.
zh_cn: 铝扁平和铝角在五金店随处可见。在某些应用中，例如适应不同的构建系统，可以钻定制的适配器板将机构安装到传动系统。铝角也是一种非常坚固的结构支撑件，占用相对较小的空间，可以适应任何构建系统。我们建议在传动系统或安装应用中使用1/8"铝，在低负载情况下使用1/16"铝。

source: Aluminum drawer slides, often with :term:`ball bearings <Ball Bearing>`, are recommended over steel drawer slides due to weight savings. Refer to the :doc:`Linear Motion section </docs/common-mechanisms/linear-motion-guide/index>` for more information.
es_mx: Los rieles de aluminio para cajones, a menudo con: término: 'rodamientos de bolas <Ball Bearing>`, se recomiendan sobre los rieles de acero para cajones debido al ahorro de peso. Consulte la sección: doc.: `Movimiento lineal </docs/common-mechanisms/linear-motion-guide/index>` para obtener más información.
fr_ca: Les glissières de tiroir en aluminium, souvent équipées de :term:`roulements à billes <Ball Bearing>`, sont recommandées par rapport aux glissières de tiroir en acier en raison du gain de poids. Pour plus d'informations, consultez la section :doc:`Mouvement linéaire </docs/common-mechanisms/linear-motion-guide/index>`.
zh_cn: 与钢制抽屉滑轨相比，建议使用铝制抽屉滑轨，通常配有 :term:`滚珠轴承 <Ball Bearing>` ，以减轻重量。更多信息，请参阅 :doc:`线性运动部分 </docs/common-mechanisms/linear-motion-guide/index>` 。

source: Sheet aluminum is generally used for drivetrain plates on custom drivetrains. The recommended thickness is 1/8" or 3/16". Because it is a plate, sheet aluminum will bend if not supported correctly with :term:`standoffs <Standoff>` or :term:`channel <Channel>`. Only load the sheet in the plane that it is in (if the sheet is vertical, then only put vertical load on it; do not load it horizontally). However, there may be some applications that would benefit from a slight bit of flex for adjustability - in those cases, use your judgment and test it out for yourself!
es_mx: La hoja de aluminio se utiliza generalmente para placas del chasis en chasises personalizados. El grosor recomendado es de 1/8" o 3/16". Al tratarse de una placa, la hoja de aluminio se doblará si no se apoya correctamente con: término: `standoffs <Standoff>` o: término: `canal<Channel>`. Cargue la hoja sólo en el plano en el que se encuentra (si la chapa es vertical, aplíquele sólo carga vertical; no la cargue horizontalmente). Sin embargo, puede que algunas aplicaciones se beneficien de una ligera flexión para facilitar el ajuste; en esos casos, use su criterio y pruébelo usted mismo.
zh_cn: 铝板通常用于定制传动系统的传动板。建议厚度为 1/8" 或 3/16"。由于是板材，如果不使用 :term:`支座 <Standoff>` 或 :term:`C形梁 <Channel>` 正确支撑，铝板会弯曲。只能在铝板所在的平面内对其进行加载（如果铝板是垂直的，则只能对其进行垂直加载；不要进行水平加载）。不过，在某些应用中，可能会因为可调节性而略有弯曲--在这种情况下，请自行判断并进行测试！

source: Steel is unnecessarily heavy for FTC structure. Aluminum provides plenty of strength at a fraction of the weight, and doesn't require welding.
es_mx: El acero es innecesariamente pesado para una estructura FTC. El aluminio proporciona mucha resistencia con una fracción del peso y no requiere soldadura.
fr_ca: L'acier est inutilement lourd pour une structure FTC. L'aluminium offre une grande résistance pour une fraction du poids et ne nécessite pas de soudure.
zh_cn: 钢对于FTC结构来说是不必要的重。铝在重量的一小部分上提供了足够的强度，并且不需要焊接。

source: The proper uses of steel in FTC are in shafts (most are made out of precision-ground stainless steel) and gearboxes.
es_mx: Los únicos usos del acero en FTC son los ejes (la mayoría son de acero inoxidable rectificado con precisión) y las cajas de engranajes.
fr_ca: Les utilisations appropriées de l'acier dans les FTC sont les arbres (la plupart sont fabriqués en acier inoxydable rectifié avec précision) et les boîtes de vitesses.
zh_cn: 钢在 FTC 中的适当用途是轴（大部分由精密研磨的不锈钢制成）和齿轮箱。

source: Steel drawer slides can be used, but aluminum slides are highly recommended.
es_mx: Pueden utilizarse rieles de acero, pero se recomiendan los de aluminio.
fr_ca: Les glissières de tiroir en acier peuvent être utilisées, mais les glissières en aluminium sont fortement recommandées.
zh_cn: 可以使用钢制抽屉滑轨，但强烈建议使用铝制滑轨。

source: Plastics
es_mx: Plásticos
fr_ca: Plastiques
zh_cn: 塑料

source: Various polycarbonate plates, inlcuing one with a 90-degree bend
es_mx: Varias placas de policarbonato, incluida una con una curvatura de 90 grados
fr_ca: Diverses plaques en polycarbonate, dont une avec un coude à 90 degrés
zh_cn: 各种聚碳酸酯板，包括一块 90 度弯曲的聚碳酸酯板

source: Polycarbonate, commonly known by its brand name Lexan, is a material that is great for applications such as drivetrain plates or intake collector boxes.
es_mx: El policarbonato, comúnmente conocido por su nombre comercial Lexan, es un material ideal para aplicaciones como placas de chasis o cajas colectoras del intake.
fr_ca: Le polycarbonate, plus connu sous le nom de marque Lexan, est un matériau qui convient parfaitement à des applications telles que les plaques de transmission ou les collecteurs d'admission.
zh_cn: 聚碳酸酯，通常以其品牌名称Lexan而闻名，是一种非常适合动力传动系统板或进气收集箱等应用的材料。

source: Lexan can bear load and is very impact-resistant.
es_mx: El Lexan soporta cargas y es muy resistente a los impactos.
fr_ca: Lexan peut supporter des charges et est très résistant aux chocs.
zh_cn: Lexan可以承受负载，并且非常耐冲击。

source: Lexan is commonly used in intake and deposit mechanisms as it is clear, allowing the drive team to see into the intake itself, an advantage over wood.
es_mx: El Lexan se utiliza habitualmente en los mecanismos de intake y depósito, como es transparente, le permite al equipo de conducción ver el interior de la propio intake, una ventaja frente a la madera.
fr_ca: Le Lexan est couramment utilisé dans les mécanismes d'admission et de dépôt, car il est transparent et permet à l'équipe de conduite de voir à l'intérieur de l'admission elle-même, ce qui est un avantage par rapport au bois.
zh_cn: Lexan通常用于进气和沉积机制，因为它很清楚，允许驱动团队看到进气本身，这是木材的优势。

source: Thick Lexan can be used for drivetrain plates, though this is not recommended for inexperienced teams.
es_mx: Se puede utilizar Lexan grueso para las placas del chasis, aunque no es recomendable para equipos sin experiencia.
fr_ca: Du Lexan épais peut être utilisé pour les plaques de transmission, bien que cela ne soit pas recommandé pour les équipes inexpérimentées.
zh_cn: 厚Lexan可用于传动系统板，但不推荐用于没有经验的团队。

source: Lexan is one of the most expensive materials per square foot, so make sure you have carefully planned out what you are cutting before doing so.
es_mx: El Lexan es uno de los materiales más caros por metro cuadrado, así que asegúrate de haber planificado bien lo que vas a cortar antes de hacerlo.
fr_ca: Le Lexan est l'un des matériaux les plus chers au mètre carré. Assurez-vous donc d'avoir bien planifié ce que vous allez découper avant de le faire.
zh_cn: Lexan是每平方英尺最昂贵的材料之一，所以在这样做之前，确保你已经仔细计划好你要切割的东西。

source: Thin Lexan can be bent with a metal brake or sheet bender. It is recommended for teams to use bends instead of connecting with bolts - bending tends to be much stronger than bolting as it means the part stays in one continuous piece. If a sheet bender is out of the question, it is possible to use a heat gun or camping burners to heat up the Lexan in order to bend it. This is not recommended as it can cause injury and bubbling if the Lexan is overheated. Alternatively, "cold bending", bending along a straight edge without applying heat can work for thinner sheets.
es_mx: El Lexan fino puede doblarse con una plegadora de metal o una dobladora de chapas. Se recomienda a los equipos que utilicen dobladoras en lugar de tornillos: el doblado suele ser mucho más resistente que el atornillado, ya que la pieza se mantiene en una sola pieza continua. Si no es posible utilizar una dobladora de chapas, se puede utilizar una pistola de calor o quemadores de camping para calentar el Lexan y doblarlo. Esto no es recomendable, ya que puede causar lesiones y burbujas si el Lexan se sobrecalienta. Alternativamente, el "doblado en frío", es doblar a lo largo de un borde recto sin aplicar calor, puede funcionar para las láminas más finas.
fr_ca: Le Lexan fin peut être plié à l'aide d'un frein à métaux ou d'une cintreuse de feuilles. Il est recommandé aux équipes d'utiliser des cintrages plutôt que des assemblages par boulons - le cintrage tend à être beaucoup plus solide que le boulonnage, car la pièce reste d'un seul tenant. S'il n'est pas possible d'utiliser une cintreuse, il est possible d'utiliser un pistolet thermique ou des brûleurs de camping pour chauffer le Lexan afin de le plier. Cette méthode n'est pas recommandée car elle peut provoquer des blessures et des bulles si le Lexan est surchauffé. Une autre solution consiste à plier à froid, c'est-à-dire à plier le long d'un bord droit sans appliquer de chaleur, ce qui peut fonctionner pour les feuilles plus fines.
zh_cn: 薄的Lexan可以用金属制动器或工作表弯曲器弯曲。建议团队使用弯曲而不是用螺丝连接——弯曲往往比螺丝连接强得多，因为这意味着零件保持在一个连续的部件中。如果不可能使用工作表弯曲器，可以使用热枪或野营燃烧器加热Lexan以使其弯曲。不建议这样做，因为如果Lexan过热，它可能会导致受伤和起泡。或者，“冷弯曲”，即沿着直线边缘弯曲而不施加热量，也适用于较薄的工作表。

source: Various ABS plates
es_mx: Varias placas ABS
fr_ca: Diverses plaques ABS
zh_cn: 各种 ABS 板

source: ABS is a hard low-friction plastic that is easily machinable.
es_mx: El ABS es un plástico duro de baja fricción que se maquina fácilmente.
fr_ca: L'ABS est un plastique dur à faible frottement qui peut être facilement usiné.
zh_cn: ABS 是一种坚硬的低摩擦塑料，易于加工。

source: ABS sheet can be used for side panels, ramps, and even drivetrain plates.
es_mx: La chapa ABS puede utilizarse para paneles laterales, rampas e incluso placas del chasis.
fr_ca: La feuille ABS peut être utilisée pour les panneaux latéraux, les rampes et même les plaques de transmission.
zh_cn: ABS工作表可用于侧板、坡道，甚至传动系统板。

source: It is not as strong as Delrin, but strong enough for most purposes.
es_mx: No es tan resistente como el Acetal, pero sí lo suficiente para la mayoría de los usos.
fr_ca: Il n'est pas aussi résistant que le Delrin, mais il l'est suffisamment pour la plupart des usages.
zh_cn: 它不像Delrin那样坚固，但对于大多数用途来说足够坚固。

source: ABS is cheaper than Lexan and Delrin.
es_mx: El ABS es más barato que el Lexan y el Acetal.
fr_ca: L'ABS est moins cher que le Lexan et le Delrin.
zh_cn: ABS 比 Lexan 和 Delrin 便宜。

source: ABS can be machined using hand tools or CNC. ABS sheets can be also bent using sheet bender (recommended) or a heat gun.
es_mx: El ABS puede maquinarse con herramientas manuales o CNC. Las láminas de ABS también se pueden doblar con una dobladora de láminas (recomendada) o una pistola de calor.
fr_ca: L'ABS peut être usiné à l'aide d'outils manuels ou CNC. Les feuilles d'ABS peuvent également être pliées à l'aide d'une cintreuse (recommandée) ou d'un pistolet thermique.
zh_cn: ABS可以用手工工具或数控加工。ABS工作表也可以使用工作表弯曲机（推荐）或热枪弯曲。

source: Thin (1/16 inch) ABS sheets can also be cut using shears.
es_mx: Las láminas de ABS finas (1/16 pulgadas) también pueden cortarse con cizallas.
fr_ca: Les feuilles d'ABS minces (1/16 de pouce) peuvent également être coupées à l'aide d'une cisaille.
zh_cn: 薄（1/16英寸）ABS工作表也可以用剪刀切割。

source: Various acetal/Delrin items, including plates and three sprockets
es_mx: Varios artículos de acetal/Delrin, incluidas placas y tres ruedas dentadas
fr_ca: Diverses pièces en acétal/Delrin, y compris des plaques et trois pignons
zh_cn: 各种乙缩醛/Delrin 项目，包括板和三个链轮
