Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/belt.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Timing Belt
es_mx: Correa Dentada
fr_ca: Courroie dentée
ro_ro: Curea de Distribuție
zh_cn: 同步带

source: When you think of a belt, you're probably thinking of a very important men's fashion accessory. However, there's another type of belt, and it's way more relevant to robotics - the timing belt. If you've ever tinkered with the insides of a car before, you probably recognize timing belts as an important component designed to keep everything under the hood in sync.
es_mx: Cuando piensas en una correa (del ingles "belt"), probablemente se refiera a un importante accesorio de moda masculina. Sin embargo, hay otro tipo de correa mucho más relevante para la robótica: la correa de distribución. Si alguna vez ha jugado con el interior de un coche, probablemente reconocerá las correas de distribución como un componente importante diseñado para mantener todo sincronizado bajo el capó.
fr_ca: Lorsque vous pensez à une courroie, vous pensez probablement à un accessoire de mode masculin très important. Cependant, il existe un autre type de courroie, bien plus pertinent pour la robotique : la courroie de distribution. Si vous avez déjà bricolé l'intérieur d'une voiture, vous savez sans doute que les courroies de distribution sont un composant important destiné à maintenir la synchronisation de tout ce qui se trouve sous le capot.
zh_cn: 提到皮带，您可能会想到一种非常重要的男士时尚配饰。然而，还有一种皮带与机器人技术更为相关--同步带。如果你以前修补过汽车内部，你可能会认识到同步带是一个重要的部件，它的作用是使引擎盖下的所有部件保持同步。

source: Term
es_mx: Términos
fr_ca: Durée
ro_ro: Termen
zh_cn: 术语

source: Timing belts use a series of small, wide teeth to engage a pulley with a number of matching grooves. They earn their name because they can be very precise, transmitting power with virtually no slop and ensuring a snug connection between shafts.
es_mx: Las correas de distribución utilizan una serie de dientes pequeños y anchos para engranar en una polea con una serie de ranuras a juego. Se ganan su nombre porque pueden ser muy precisas, transmitiendo potencia sin apenas holguras y garantizando una conexión ajustada entre ejes.
fr_ca: Les courroies dentées utilisent une série de petites dents larges pour engager une poulie avec un certain nombre de rainures correspondantes. Elles méritent leur nom parce qu'elles peuvent être très précises, transmettant la puissance sans pratiquement aucun jeu et assurant une connexion parfaite entre les arbres.
ro_ro: Curelele de distribuție sunt o serie de "dinți" lați care pun în mișcare o transmisie cu acelaș număr de șanțuri.
zh_cn: 同步带使用一系列小而宽的齿来啮合带有许多匹配沟槽的滑轮。同步带之所以得名，是因为它可以非常精确地传递动力，几乎没有任何偏差，并确保轴之间的紧密连接。

source: A picture of timing belts on a pulley
es_mx: Imagen de correas dentadas en una polea.
fr_ca: Une photo de courroies de distribution sur une poulie
ro_ro: O poză cu niște curele de distribuție pe o transmisie
zh_cn: 同步带轮上的同步带图片

source: Timing belts and a pulley
es_mx: Correas dentadas y una polea.
fr_ca: Courroies de distribution et poulie
ro_ro: Niște curele de distribuție și o transmisie
zh_cn: 同步带和同步带轮

source: While a timing belt may complete a similar objective to :term:`chain <Sprocket>`, its characteristics and strengths are very different. Timing belts are lighter and more compact than chains, but they lack the customizability of their bulkier brother - belts come in a closed loop of predetermined length, and there's no changing that length on the fly.
es_mx: Aunque una correa de distribución puede cumplir un objetivo similar al de la :term:`cadena`<Sprocket>, sus características y puntos fuertes son muy diferentes. Las correas de distribución son más ligeras y compactas que las cadenas, pero carecen de la capacidad de personalización de su hermano más voluminoso: las correas vienen en un bucle cerrado de longitud predeterminada, y no se puede cambiar esa longitud sobre la marcha.
fr_ca: Bien qu'une courroie de distribution puisse remplir un objectif similaire à celui d'une :term:`chaîne <Sprocket>`, ses caractéristiques et ses points forts sont très différents. Les courroies de distribution sont plus légères et plus compactes que les chaînes, mais elles n'ont pas la capacité de personnalisation de leur sœur plus volumineuse - les courroies se présentent sous la forme d'une boucle fermée de longueur prédéterminée, et il n'est pas possible de modifier cette longueur à la volée.

source: Like chain, belt is identified by its :term:`pitch <Pitch>` - common pitches found on FTC robots include HTD 5mm, HTD 3mm, and GT2 3mm.
es_mx: Al igual que la cadena, la correa se identifica por su :term:`pitch <Pitch>` - los "pitch" comunes que se encuentran en los robots FTC incluyen HTD 5mm, HTD 3mm, y GT2 3mm.
ro_ro: Precum lanțul, cureaua este identificată după :term:`pasul<Pitch>` sau - pașii comuni regăsiti pe roboții FTC includ HTD 5mm, HTD 3mm și GT2 3mm.

source: When using timing belts, correct tension is very important. There are two main ways to get your tension right. The first is easy - goBILDA and Actobotics already have belts integrated into their hole patterns. You can buy correctly sized belt directly from each vendor, and your tension will be perfect as soon as the belt is installed. As your designs gain complexity, so will your belt runs - maybe there are more than 2 pulleys, and maybe your pulleys are all different sizes. To compensate for this, the second way to ensure tension is to use a dynamic tensioner, similar to those found in complex chain runs. To design for these tensioners, we recommend planning more complex belt runs in CAD before building them in real life.
es_mx: Cuando se utilizan correas de distribución, tener la tensión correcta es muy importante. Hay dos formas principales de conseguir la tensión correcta. La primera es fácil - goBILDA y Actobotics ya tienen correas integradas en sus patrones de agujeros. Puede comprar la correa del tamaño correcto directamente a cada proveedor, y su tensión será perfecta tan pronto como la correa esté instalada. A medida que tus diseños ganen en complejidad, también lo harán tus recorridos de correa: quizá haya más de 2 poleas, y quizá tus poleas sean todas de tamaños diferentes. Para compensar esta situación, la segunda forma de asegurar la tensión es utilizar un tensor dinámico, similar a los que se encuentran en tramos de cadena complejos. Para diseñar estos tensores, recomendamos planificar los tramos de correa más complejos en CAD antes de construirlos en la vida real.
fr_ca: Lors de l'utilisation de courroies de distribution, il est très important que la tension soit correcte. Il y a deux façons principales d'obtenir une tension correcte. La première est facile - goBILDA et Actobotics ont déjà des courroies intégrées dans leurs schémas de perçage. Vous pouvez acheter une courroie de taille correcte directement auprès de chaque fournisseur, et votre tension sera parfaite dès que la courroie sera installée. Au fur et à mesure que vos conceptions se complexifient, il en va de même pour vos courroies - il y a peut-être plus de 2 poulies, et peut-être que vos poulies sont toutes de tailles différentes. Pour compenser cela, la deuxième façon d'assurer la tension est d'utiliser un tendeur dynamique, similaire à ceux que l'on trouve dans les chaînes complexes. Pour concevoir ces tendeurs, nous recommandons de planifier des parcours de courroies plus complexes en CAO avant de les construire dans la réalité.
ro_ro: Când folosești o curea de distribuție, tensiunea corectă este foarte importantă. Există două metode generale de tensionare a curelelor. Prima este ușoară - goBILDA și Actobotics au deja curelele integrate în tiparul profilelor lor. Poți cumpăra curele cu dimensiuni ideale deja fabricate de la fiecare distribuitor, iar tensiunea lor să fie perfectă după montare. Cu cât design-urile tale devin mai complexe, cu atât și sistemele de curele folosite - probabil sunt mai mult de două transmisii pe robot și probabil transmisiile tale au dimensiuni diferite. Pentru a compensa acest lucru, a doua metodă pentru a asigura tensiunea perfectă este utilizarea unui tensionator dinamic, similar cu acele regăsite în sistemele complexe pe lanț. Pentru a modela aceste tensionatoare, noi îți recomandăm să îți schițezi sisteme mai complexe în CAD, iar apoi să le aplici în viața reală.
zh_cn: 使用同步带时，正确的张力非常重要。有2种主要方法可以使张力正确。第一种方法很简单，goBILDA 和 Actobotics 的孔型中已经集成了同步带。您可以直接从每家供应商处购买尺寸正确的同步带，安装好同步带后，张力就会达到完美状态。随着设计的复杂性增加，您的同步带运行也会越来越复杂--可能有两个以上的同步带轮，可能您的同步带轮尺寸各不相同。为了弥补这一不足，确保张力的第二种方法是使用动态张紧器，类似于复杂链条运行中的张紧器。为了设计这些张紧器，我们建议在实际制造之前先在 CAD 中规划更复杂的皮带运行。

source: Belt Calculator
es_mx: Calculadora de Correas
fr_ca: Calculateur de courroie
zh_cn: 同步带计算器

source: The actual calculations to determine which belt to use to get close to a given center-to-center (:term:`C2C`) distance are complicated. Below is a calculator to help out:
es_mx: Los cálculos reales para determinar qué correa utilizar para acercarse a una distancia dada de centro a centro (:term:`C2C`) son complicados. A continuación encontrarás una calculadora que te ayudará:
fr_ca: Les calculs permettant de déterminer quelle courroie utiliser pour se rapprocher d'une distance centre à centre (:terme:`C2C`) donnée sont compliqués. Vous trouverez ci-dessous une calculatrice pour vous aider :
zh_cn: 确定使用哪种同步带来接近给定的中心到中心(:term:`C2C`)距离的实际计算很复杂。下面的计算器可以提供帮助：

source: The web version of gm0 has a belt calculator available here.
es_mx: La versión web de gm0 tiene una calculadora de correas disponible aquí.
fr_ca: La version web de gm0 dispose d'un calculateur de courroie disponible ici.
zh_cn: gm0 网页版的同步带计算器可在此处使用。

source: This calculator will suggest belt lengths even if they are difficult to get from vendors. Make sure the C2C distance you design around is for a belt length that you can purchase.
es_mx: Esta calculadora le sugerirá longitudes de correa incluso aquellas que son difíciles de conseguir de vendedores conocidos. Asegúrese de que la distancia C2C en torno a la que diseña es para una longitud de correa que puede comprar.
fr_ca: Cette calculatrice proposera des longueurs de courroies même si elles sont difficiles à obtenir auprès des vendeurs. Assurez-vous que la distance C2C que vous concevez correspond à une longueur de courroie que vous pouvez acheter.
zh_cn: 即使很难从供应商处购买到同步带长度，本计算器也会给出建议。请确保您设计的 C2C 距离是您可以购买到的同步带长度。

source: SDP-SI has a `more advanced calculator <https://sdp-si.com/tools/center-distance-designer.php>`_, as does `ReCalc <https://www.reca.lc/belts>`_. The equations for calculating these values by hand can be found in `SDP-SI's Designing a Miniature Belt and Pulley Drive System Design Guide <https://www.sdp-si.com/Belt-Drive/Designing-a-miniature-belt-drive.pdf>`_.
es_mx: SDP-SI dispone de una `more advanced calculator <https://sdp-si.com/tools/center-distance-designer.php>`_, al igual que `ReCalc <https://www.reca.lc/belts>`_ Las ecuaciones para calcular estos valores a mano se pueden encontrar en `SDP-SI's Designing a Miniature Belt and Pulley Drive System Design Guide <https://www.sdp-si.com/Belt-Drive/Designing-a-miniature-belt-drive.pdf>`_.
fr_ca: SDP-SI dispose d'une `calculatrice plus avancée <https://sdp-si.com/tools/center-distance-designer.php>`_, tout comme `ReCalc <https://www.reca.lc/belts>`_. Les équations permettant de calculer ces valeurs à la main se trouvent dans le "Designing a Miniature Belt and Pulley Drive System Design Guide" Guide de conception d'un système d'entraînement miniature par courroie et poulie de SDP-SI <https://www.sdp-si.com/Belt-Drive/Designing-a-miniature-belt-drive.pdf>`_.
zh_cn: SDP-SI 有一个 `更高级的计算器 <https://sdp-si.com/tools/center-distance-designer.php>`_，ReCalc <https://www.reca.lc/belts>`_也有。手工计算这些值的公式可在`SDP-SI 的《微型同步带和同步带传动系统设计指南》 <https://www.sdp-si.com/Belt-Drive/Designing-a-miniature-belt-drive.pdf>`_中找到。

source: Belt Wrap
es_mx: Rodeo de Correa
fr_ca: Angle d’enroulement de la courroie
ro_ro: Îmbrățișarea Curelei
zh_cn: 同步带安装

source: **Belt should, at the very least, have 90° of contact with the pulley. The best practice is to have 180° or more of contact**, as it is very unlikely to fall off with proper tensioning. Belt skipping, especially on drivetrains or arms, is very possible without proper belt wrap or tensioning. When tensioning belt, be sure to not undertension or overtension it. Undertensioning belt can result in the belt falling off the pulley or belt skipping, where the belt can skip along the pulley. Overtensioning belt often results in the motor burning out, or less seriously, a loss of efficiency. Push along the belt, and if it moves slightly without significant resistance, chances are you've done it correctly. If it's too tight, then the belt will barely move under a gentle press.
es_mx: **La correa debe tener, como mínimo, 90° de contacto con la polea. La mejor práctica es tener 180° o más de contacto**, ya que es muy poco probable que se caiga con una tensión adecuada. Es muy posible que la correa salte, especialmente en transmisiones o brazos, si no está bien tensada. Al tensar la correa, asegúrese de no tensarla ni demasiado ni muy poco. Si se tensa demasiado poco, la correa puede caerse de la polea o saltar a lo largo de esta. Si la correa está demasiado tensa, el motor puede quemarse o, lo que es menos grave, perder eficacia. Empuje a lo largo de la correa, y si se mueve ligeramente sin resistencia significativa, lo más probable es que lo haya hecho correctamente. Si está demasiado tensa, entonces la correa apenas se moverá bajo una suave presión.
zh_cn: **同步带至少应与同步带轮呈 90° 接触。最好的做法是 180° 或更多的接触**，因为在正确张紧的情况下，同步带脱落的可能性很小。如果没有正确的缠绕或张紧，同步带很可能跳脱，特别是在传动系统或机械臂上。张紧同步带时，确保不要张紧不足或张紧过度。同步带张力不足会导致同步带从同步带轮上脱落或同步带跳动，即同步带沿着同步带轮跳动。同步带张力过大通常会导致电机烧毁，严重的还会降低效率。沿着同步带推动，如果皮带在没有明显阻力的情况下轻微移动，则很可能是正确的。如果太紧的话，轻轻按压同步带几乎不会移动。

source: Best practices for wrap
es_mx: Mejores Prácticas para el Rodeo
fr_ca: Bonnes pratiques pour l’enroulement de la courroie
ro_ro: Cele mai bune metode de a îmbrățișa cureaua
zh_cn: 安装同步带的最佳实践

source: Properly done belt wrap without tensioners
es_mx: Rodeo de la correa correctamente realizada sin tensores
fr_ca: Enroulement correct de la courroie sans tendeur
ro_ro: Îmbrățișarea corectă a curelei fără tensionatoare
zh_cn: 正确安装同步带，不使用张紧器

source: A drivetrain by 8103 using belt
es_mx: Un chasis con correas hecho por 8103
fr_ca: Une transmission par 8103 utilisant une courroie
ro_ro: Un șasiu construit de echipa 8103 folosind curele de distribuție
zh_cn: 使用同步带的 8103 传动系统

source: 8103 Null Robotics, offseason prototype, properly done belt wrap with tensioners
es_mx: 8103 Null Robotics, prototipo de off-season, rodeo de correa correctamente hecha con tensores.
fr_ca: 8103 Null Robotics, prototype hors saison, courroie correctement enroulée avec tendeurs
ro_ro: 8103 Null Robotics, prototip offseason, îmbrățișarea curelei corectă cu tensionatoare.
zh_cn: 8103 Null Robotics，休赛期原型机，带张紧装置的同步带安装妥当

source: Advantages:
es_mx: Ventajas:
fr_ca: Avantages :
ro_ro: Avantaje:
zh_cn: 优势

source: **Pulleys can be made at home**. Pulleys can be 3D printed for most situations, allowing you to cut costs and create unique tooth counts easily.
es_mx: **Las poleas se pueden fabricar en casa**. Las poleas se pueden imprimir en 3D para la mayoría de las situaciones, lo que le permite reducir costes y crear recuentos de dientes únicos con facilidad.
fr_ca: **Les poulies peuvent être fabriquées à la maison**. Les poulies peuvent être imprimées en 3D pour la plupart des situations, ce qui vous permet de réduire les coûts et de créer facilement des comptes dentaires uniques.
ro_ro: **Angrenajele pot fi făcute acasă**. Angrenajele pot fi printate 3D în majoritatea cazurilor, astfel reducând din costuri și permițăndu-ți să îți personalizezi numărul de dinți pe curea.
zh_cn: **同步带轮可在家中制作**。同步带轮可通过3D打印技术制作，适用于大多数情况，让您可以降低成本，轻松创建独特的齿数。

source: **Belts are very strong**. They're reinforced with fiberglass cords that are incredibly hard to break, giving belts immense strength. (*If you break a belt, it's most likely because it was out of alignment or tensioned far too tightly*.)
es_mx: **Las correas son muy resistentes**. Están reforzadas con cuerdas de fibra de vidrio que son increíblemente difíciles de romper, lo que confiere a las correas una resistencia inmensa. (*Si rompes una correa, lo más probable es que sea porque estaba desalineada o tensada con demasiada fuerza*).
fr_ca: **Les ceintures sont très solides**. Elles sont renforcées par des cordes en fibre de verre qui sont incroyablement difficiles à casser, ce qui leur confère une immense résistance. (*Si vous cassez une courroie, c'est très probablement parce qu'elle n'était pas alignée ou qu'elle était trop tendue*).
zh_cn: **同步带非常结实**。它们由玻璃纤维绳加固，非常不易断裂，因此同步带非常结实。(*如果你弄断了一条同步带，很可能是因为它没有对准或张得太紧*）。

source: **When tensioned correctly, there is absolutely no slop**. Engines use timing belt for a reason - because it's the best possible solution for them to perfectly synchronize their shafts. There's nothing that matches the rotational accuracy of a properly tensioned belt.
es_mx: **Cuando se tensa correctamente, no hay ninguna holgura**. Los motores de los automóviles utilizan correas de distribución por una razón: porque es la mejor solución posible para sincronizar perfectamente sus ejes. No hay nada que iguale la precisión de rotación de una correa correctamente tensada.
fr_ca: **Lorsqu'elle est correctement tendue, il n'y a absolument aucun jeu**. Les moteurs utilisent des courroies de distribution pour une raison précise : c'est la meilleure solution possible pour synchroniser parfaitement leurs arbres. Rien ne peut égaler la précision de rotation d'une courroie correctement tendue.
zh_cn: **当张紧正确时，绝对不会出现松弛**。发动机使用同步带是有原因的，因为它是使轴完全同步的最佳解决方案。没有什么能与正确张紧的同步带的旋转精度相媲美。

source: **Belts are efficient and quiet**. Compared to the loud shredding sound of a chain run, belt runs are dead silent, and they're more efficient than chains (although this makes zero practical impact in the robotics use case).
es_mx: **Las cintas son eficientes y silenciosas**. En comparación con el fuerte sonido de trituración de una cadena, las correas son totalmente silenciosas y más eficientes que las cadenas (aunque esto no tiene ningún impacto práctico en el caso de uso de la robótica).
fr_ca: **Les courroies sont efficaces et silencieuses**. Comparées au bruit de déchiquetage d'une chaîne, les courroies sont parfaitement silencieuses et plus efficaces que les chaînes (bien que cela n'ait aucun impact pratique dans le cas d'utilisation de la robotique).
zh_cn: **同步带高效、安静**。与链条运行时发出的巨大碎裂声相比，同步带运行时噪音极低，而且比链条更高效（尽管这在机器人应用案例中没有任何实际影响）。

source: Disadvantages:
es_mx: Desventajas:
fr_ca: Inconvénients :
ro_ro: Dezavantaje:
zh_cn: 缺点

source: **Belts aren't customizable**. You buy a belt of a specific length and you're stuck with that length until you buy another one. This isn't too bad if you're planning out your robot properly, but chain will work better for prototypes where the chain length will be changing often.
es_mx: **Las correas no son personalizables**. Compras una correa de una longitud específica y te quedas con esa longitud hasta que compras otra. Esto no es tan malo si estás planificando tu robot adecuadamente, pero la cadena funcionará mejor para prototipos donde la longitud de la cadena cambiará a menudo.
fr_ca: **Les courroies ne sont pas personnalisables**. Vous achetez une courroie d'une longueur spécifique et vous êtes coincés avec cette longueur jusqu'à ce que vous en achetiez une autre. Ce n'est pas trop grave si vous planifiez votre robot correctement, mais la chaîne fonctionnera mieux pour les prototypes où la longueur de la chaîne changera souvent.
zh_cn: **同步带不能自由修改长度**。你买了一条特定长度的同步带，就只能用这个长度，直到你再买一条。如果您对机器人进行了合理规划，这并不算太糟糕，但对于链条长度会经常变化的原型机来说，链条的效果会更好。

source: **Belts can be wider than alternatives (especially chain)**. This probably won't have much of an impact, but belt can often be wider than other power transmission methods, so it may not always fit.
es_mx: **Las correas pueden ser más anchas que otras alternativas (especialmente la cadena)**. Esto probablemente no tendrá mucho impacto, pero la correa a menudo puede ser más ancha que otros métodos de transmisión de potencia, por lo que no siempre encaja.
fr_ca: **Les courroies peuvent être plus larges que les autres méthodes de transmission (en particulier les chaînes)**. Cela n'aura probablement pas beaucoup d'impact, mais la courroie est souvent plus large que les autres méthodes de transmission de puissance, de sorte qu'elle n'est pas toujours adaptée.
zh_cn: **同步带可能比其他传动方式（尤其是链条）更宽**。这可能不会有太大影响，但同步带通常比其他动力传输方式更宽，因此不一定总是合适。

source: **Belts can be expensive (but you'll save money with pulleys)**. While you can buy chain 10 feet at a time, you'll most likely be buying each belt brand new. While this can get expensive, you'll be saving money on pulleys.
es_mx: **Las correas pueden ser caras (pero ahorrarás dinero con las poleas)**. Mientras que es posible comprar la cadena de 10 pies y no tener que volver preocuparse, lo más probable es que vas a tener que comprar muchas correas nuevas de diversos tamaños. Aunque esto puede resultar caro, ahorrarás dinero con las poleas.
fr_ca: **Les courroies peuvent être chères (mais vous économiserez de l'argent avec les poulies)**. Bien que vous puissiez acheter une chaîne de 10 pieds à la fois, vous achèterez probablement chaque courroie à l'état neuf. Bien que cela puisse coûter cher, vous économiserez de l'argent en achetant des poulies.
zh_cn: **同步带可能很贵（但使用同步带轮可以省钱）**。虽然您可以一次购买 10 英尺长的链条，但您很可能需要购买全新的皮带。虽然这可能会很贵，但您可以在同步带上省钱。

source: Properly done belt wrap with tensioners
es_mx: Rodeo de la correa correctamente hecha con tensores
fr_ca: Enroulement correct de la courroie avec les tendeurs
ro_ro: Îmbrățișarea unei curele executată corect cu tensionatoare
zh_cn: 带张紧装置的同步带安装正确无误

source: A drivetrain by 8417 using belt
es_mx: Una transmisión por correa por el equipo 8417
fr_ca: Une chaîne cinématique de 8417 utilisant une courroie
ro_ro: Un șasiu construit de echipa 8417 cu ajutorul curelelor de distribuție
zh_cn: 8417 使用的同步带传动系统

source: Purchasing Belts
es_mx: Compra de Correas
fr_ca: Achat de courroies
zh_cn: 采购同步带

source: Once you know what pitch and length belt you want, purchasing a belt requires navigating the vendor's website. Almost every COTS belt vendor will identify belts by 3 values: pitch, pitch length, and width. Pitch is the pitch of the belt, pitch length is the length of the belt (belt teeth times pitch), and width is the width of the belt. From there, its a matter of searching the vendor's page for the right belt.
es_mx: Una vez que sepas qué pitch y que longitud de correa desea, la compra de una correa requiere navegar por el sitio web del proveedor. Casi todos los proveedores de correas COTS identifican las correas por 3 valores: pitch, longitud de pitch y anchura. El pitch es el pitch de la correa, la longitud del pitch es la longitud de la correa (dientes de la correa por pitch) y la anchura es la anchura de la correa. A partir de ahí, es cuestión de buscar la correa adecuada en la página del proveedor.
fr_ca: Une fois que vous savez quel pas et quelle longueur de courroie vous souhaitez, l'achat d'une courroie nécessite de naviguer sur le site web du vendeur. Presque tous les fournisseurs de courroies COTS identifient les courroies par 3 valeurs : le pas, la longueur du pas et la largeur. Le pas est le pas de la courroie, la longueur du pas est la longueur de la courroie (dents de la courroie multipliées par le pas) et la largeur est la largeur de la courroie. À partir de là, il suffit de rechercher la bonne courroie sur la page du vendeur.
zh_cn: 一旦您知道自己需要什么节距和长度的同步带，购买同步带时就需要浏览供应商的网站。几乎所有 COTS 同步带供应商都会用3个值来识别同步带：节距、节距长度和宽度。节距是同步带的间距，节距长度是皮带的长度（同步带齿数乘以间距），宽度是同步带的宽度。然后，就可以在供应商的页面上搜索合适的皮带了。
