Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/belt.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: SDP-SI is an established mechanical parts vendor that sells a large assortment of COTS belts. To navigate the site, go to the `main belts page <https://www.sdp-si.com/products/details/timing-belt-detail.php>`_, navigate to the correct belt type, then select the option for the correct pitch.
es_mx: SDP-SI es un proveedor establecido de piezas mecánicas que vende un gran surtido de correas COTS. Para navegar por el sitio, vaya a la `página principal de correas <https://www.sdp-si.com/products/details/timing-belt-detail.php>`_, navegue hasta el tipo de correa correcto y, a continuación, seleccione la opción del pitch correcto.
fr_ca: SDP-SI est un fournisseur établi de pièces mécaniques qui vend un large assortiment de courroies COTS. Pour naviguer sur le site, allez sur la "page principale des courroies" <https://www.sdp-si.com/products/details/timing-belt-detail.php>`_, naviguez jusqu'au type de courroie approprié, puis sélectionnez l'option correspondant au pas correct.
zh_cn: SDP-SI 是一家知名的机械零件供应商，销售大量的 COTS 同步带。要浏览该网站，请访问 `主要同步带页面 <https://www.sdp-si.com/products/details/timing-belt-detail.php>`_，导航到正确的皮带类型，然后选择正确节距的选项。

source: Make sure to select the Single Sided belt type, and not the Timing Belt Stock type. Timing Belt Stock is a long stretch of belt that is not in a loop, whereas Single Sided belts are a loop.
es_mx: Asegúrese de seleccionar el tipo de correa de un solo lado, y no el tipo de correa de distribución. La correa dentada es un tramo largo de correa que no forma un bucle, mientras que las correas unilaterales forman un bucle.
fr_ca: Veillez à sélectionner le type de courroie simple face et non le type de courroie dentée en stock. Le stock de courroie dentée est un long tronçon de courroie qui n'est pas en boucle, alors que les courroies à simple face sont en boucle.
zh_cn: 确保选择单面同步带类型，而不是同步带库存类型。同步带库存是一段非环形的长带，而单面带是环形的。

source: For example, to purchase an HTD-5 belt, first navigate to GATES HTD Timing Belts, navigate to 5mm pitch, and select buy now under the single sided belt option.
es_mx: Por ejemplo, para comprar una correa HTD-5, primero navegue a GATES HTD Timing Belts, navegue a 5mm pitch, y seleccione buy now bajo la opción single sided belt.
fr_ca: Par exemple, pour acheter une courroie HTD-5, naviguez d'abord sur GATES HTD Timing Belts, naviguez sur 5mm pitch, et sélectionnez «buy now» sous l'option «single sided belt».
zh_cn: 例如，要购买 HTD-5 皮带，首先导航到 GATES HTD 正时皮带，导航到 5mm 间距，然后在单面同步带选项下选择立即购买。

source: V-Belt Guys stocks a large number of options for belts. They are known for stocking almost every width of belt, since they cut belts to size for the order. Searching the site uses belt codes with the format "Pitch Length-Pitch Code-Width". For example, a 200 pitch length HTD5 belt with a 5mm side to side width would be the code 200-5m-5. A list of common pitch codes is below.
es_mx: V-Belt Guys tiene en stock un gran número de opciones de correas. Son conocidos por tener en stock casi todos los anchos de correa, ya que cortan las correas a la medida del pedido. La búsqueda en el sitio utiliza códigos de correa con el formato "Longitud de Pitch-Codigo de Pitch-Anchura". Por ejemplo, una correa HTD5 de largo de 200 con una anchura lateral de 5 mm tendría el código 200-5m-5. A continuación encontrará una lista de los códigos de pitch más comunes.
fr_ca: V-Belt Guys propose un grand nombre d'options pour les courroies. Ils sont connus pour avoir en stock presque toutes les largeurs de courroies, car ils coupent les courroies sur mesure pour la commande. La recherche sur le site utilise les codes de courroie avec le format "Longueur de pas - Code de pas - Largeur". Par exemple, une bande HTD5 d'une longueur de pas de 200 et d'une largeur de 5 mm d'un côté à l'autre porterait le code 200-5m-5. Vous trouverez ci-dessous une liste des codes de pas les plus courants.
zh_cn: V-Belt Guys 库存有大量可供选择的皮带。他们以库存几乎所有宽度的同步带而闻名，因为他们会根据订单的尺寸切割同步带。搜索网站使用的同步带代码格式为 "节距长度-节距代码-宽度"。例如，边宽为 5 毫米、间距长度为 200 的 HTD5 皮带的代码为 200-5m-5。 常用间距代码列表如下。

source: Name
es_mx: Nombre
fr_ca: Nom
zh_cn: 名字

source: Pitch Code
es_mx: Código de Pitch
fr_ca: Code Pitch
zh_cn: 节距代号

source: Like chain, belt is identified by its :term:`pitch <Pitch>` - common pitches found on FTC\ |reg| robots include HTD 5mm, HTD 3mm, and GT2 3mm.
fr_ca: Comme la chaîne, la courroie est identifiée par son :term:`pas <Pitch>` - les pas les plus courants sur les robots FTC sont HTD 5mm, HTD 3mm et GT2 3mm.

source: **Belt should, at the very least, have 90 degrees of contact with the pulley. The best practice is to have 180 degrees or more of contact**, as it is very unlikely to fall off with proper tensioning. Belt skipping, especially on drivetrains or arms, is very possible without proper belt wrap or tensioning. When tensioning belt, be sure to not undertension or overtension it. Undertensioning belt can result in the belt falling off the pulley or belt skipping, where the belt can skip along the pulley. Overtensioning belt often results in the motor burning out, or less seriously, a loss of efficiency. Push along the belt, and if it moves slightly without significant resistance, chances are you've done it correctly. If it's too tight, then the belt will barely move under a gentle press.
fr_ca: **La courroie doit, au minimum, être en contact à 90 degrés avec la poulie. La meilleure pratique consiste à avoir un contact de 180 degrés ou plus**, car il est très peu probable que la courroie tombe si elle est correctement tendue. Le saut de courroie, en particulier sur les transmissions ou les bras, est très possible si la courroie n'est pas correctement enroulée ou tendue. Lors de la tension de la courroie, veillez à ne pas la sous-tendre ou la sur-tendre. Une tension insuffisante peut entraîner la chute de la courroie de la poulie ou un saut de courroie, c'est-à-dire que la courroie peut sauter le long de la poulie. Une surtension de la courroie entraîne souvent une panne du moteur ou, moins grave, une perte d'efficacité. Poussez la courroie, et si elle bouge légèrement sans résistance significative, il y a de fortes chances que vous l'ayez fait correctement. Si elle est trop tendue, la courroie bougera à peine sous une légère pression.

source: When you think of a belt, you’re probably thinking of a very important men’s fashion accessory. However, there’s another type of belt, and it’s way more relevant to robotics - the timing belt. If you’ve ever tinkered with the insides of a car before, you probably recognize timing belts as an important component designed to keep everything under the hood in sync.
ro_ro: Când te gândești la o curea, cel mai probabil te gândești la un accesoriu fashion pentru bărbați. Însă, există un alt timp de curea, și este mult mai relevantă roboticii - cureaua de distribuție. Dacă te-ai uitat în interiorul unei mașini vreodată, probabil ai observat că curelele de distribuție sunt niște componente importante fabricate să țină totul în sincron.

source: While a timing belt may complete a similar objective to :term:`chain <Sprocket>`, its characteristics and strengths are very different. Timing belts are lighter and more compact than chains, but they lack the customizability of their bulkier brother - belts come in a closed loop of predetermined length, and there’s no changing that length on the fly.
ro_ro: Deși o curea de distribuție poate îndeplini acelaș obiectiv ca un :term:`lanț<Sprocket>`, caracteristicile sale sunt foarte diferite. Curelele de distribuție sunt mai ușoare și mai compacte decât lanțurile, însă nu sunt la fel de personalizabile ca fratele lor mai voluminos - curelele de distribuție sunt într-o buclă închisă cu o lungime predeterminată și nu există posibilitatea de a schimba lungimea unei curele fabricate.

source: **Belt should, at the very least, have 90° of contact with the pulley. The best practice is to have 180° or more of contact**, as it is very unlikely to fall off with proper tensioning. Belt skipping, especially on drivetrains or arms, is very possible without proper belt wrap or tensioning. When tensioning belt, be sure to not undertension or overtension it. Undertensioning belt can result in the belt falling off the pulley or belt skipping, where the belt can skip along the pulley. Overtensioning belt often results in the motor burning out, or less seriously, a loss of efficiency. Push along the belt, and if it moves slightly without significant resistance, chances are you’ve done it correctly. If it’s too tight, then the belt will barely move under a gentle press.
ro_ro: **Cureaua ar trebui, cel putin, să aibă 90° de contact cu angrenajul. Cea mai bună practică este să aibă 180° sau mai mult de contact direct**, din moment ce este foarte improbabil să alunece de pe transmisie cu tensiunea corectă. Fenomentul numit "belt skipping", este foarte probabil să aibă loc atunci când cureaua nu are suficient contact cu angrenajele sau este prost tensionată, în general, pe șasiuri sau brațe mecanice. Când tensionezi cureaua, ai grijă să nu o supra-tensionezi sau sub-tensionezi. Sub-tensionarea poate duce la aluncarea curelei de pe angrenaj, sau "belt skipping", care se întâmplă atunci când cureaua sare de-a lungul unui angrenaj. Supra-tensionarea curelei poate duce la arderea motorului, sau mai optimist, o pierdere a eficientei. Împinge de-a lungul curelei, iar dacă se mișcă fără rezistență prea mare, ai tensionat cureaua corect. Dacă este prea strâns, atunci cureaua abia se va mișca sub o împingere ușoară.

source: **Belts are very strong**. They’re reinforced with fiberglass cords that are incredibly hard to break, giving belts immense strength. (*If you break a belt, it’s most likely because it was out of alignment or tensioned far too tightly*.)
ro_ro: **Curelele sunt foarte puternice**. Sunt consolidate cu fibre din sticlă care sunt incredibil de puternice, astfel făcând cureaua foarte rezistentă. (*Dacă rupi o curea, este cel mai probabil din cauză faptului că nu a fost montată corect sau tensionată prea mult.*)

source: **When tensioned correctly, there is absolutely no slop**. Engines use timing belt for a reason - because it’s the best possible solution for them to perfectly synchronize their shafts. There’s nothing that matches the rotational accuracy of a properly tensioned belt.
ro_ro: **Când o curea este tensionată corect, nu există deloc pantă**. Motoarele cu ardere folosesc curele de distribuție cu un motiv - deoarece este cea mai bună soluție posibilă pentru ca ele să se sincronizeze perfect cu axul. Nu există nimic care să se compare cu acuratețea rotațională a unei curele tensionate perfect.

source: **Belts are efficient and quiet**. Compared to the loud shredding sound of a chain run, belt runs are dead silent, and they’re more efficient than chains (although this makes zero practical impact in the robotics use case).
ro_ro: **Curelele sunt eficiente și selențioase**. Comparativ cu lanțurile foarte zgomotoase, curelele sunt complet selențioase, șî sunt mai eficiente decât lanțurile (deși nu are niciun impact practic asupra unui robot FTC).

source: **Belts aren’t customizable**. You buy a belt of a specific length and you’re stuck with that length until you buy another one. This isn’t too bad if you’re planning out your robot properly, but chain will work better for prototypes where the chain length will be changing often.
ro_ro: **Curelele nu sunt personalizabile**. Cumperi o curea de o lungime specifică și rămâi cu acea lungime până când cumperi alta. Acest lucru nu este așa rău dacă iți schițezi bine robotul, însă lantul va funcționa mai bine pentru prototipuri unde lungimea lanțului se poate schimba des.

source: **Belts can be wider than alternatives (especially chain)**. This probably won’t have much of an impact, but belt can often be wider than other power transmission methods, so it may not always fit.
ro_ro: **Curelele pot fi mai late decât alternativele lor (în special lanțul)**. Acest lucru probabil nu va avea un impact așa mare, însă curelele pot fi mai late decât alte tipuri de transmisii, deci s-ar putea să nu funcționeze în locuri strâmte.

source: **Belts can be expensive (but you’ll save money with pulleys)**. While you can buy chain 10 feet at a time, you’ll most likely be buying each belt brand new. While this can get expensive, you’ll be saving money on pulleys.
ro_ro: **Curelele pot fi scumpe (însă vei economi bani cu angrenaje)**. În timp ce poți să cumperi 3 metri de lanț deodată, cel mai probabil vei cumpăra fiecare curea nou nouță. În timp ce acest lucru poate fi scump, vei economi bani pe angrenaje.

source: 7236 Recharged Green, Rover Ruckus
ro_ro: Echipa 7236 Recharged Green, Rover Ruckus
