Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/chain.po
Languages: es_mx, fr_ca, zh_cn

source: Roller Chain
es_mx: Cadena de rodillos
fr_ca: Chaîne à rouleaux
zh_cn: 滚轮链

source: When your shafts aren't right next to each other, roller chain and sprockets will allow you to transmit power securely between your shafts.
es_mx: Cuando los ejes no están uno al lado del otro, la cadena de rodillos y las ruedas dentadas le permitirán transmitir la potencia de forma segura entre los ejes.
fr_ca: Lorsque vos arbres ne sont pas juxtaposés, les chaînes à rouleaux et les pignons vous permettent de transmettre la puissance en toute sécurité entre vos arbres.
zh_cn: 当你的轴不相邻时，滚轮链和链轮能使你在轴之间安全地传输动力。

source: Term
es_mx: Término
fr_ca: Terme
zh_cn: 术语

source: Chain
es_mx: Cadena
fr_ca: Chaîne
zh_cn: 链条

source: Roller chain is made up of a series of links joined by pins. Each link can rotate around its pins, creating a dynamic loop that can conform to any shape. The pins in the chain engage the gaps between teeth on each sprocket.
es_mx: La cadena de rodillos está formada por una serie de eslabones unidos por pasadores. Cada eslabón puede girar alrededor de sus pasadores, creando un bucle dinámico que puede adaptarse a cualquier forma. Los pasadores de la cadena encajan en los huecos entre dientes de cada piñón.
fr_ca: La chaîne à rouleaux est composée d’une série de maillons reliés par des axes. Chaque maillon peut pivoter autour de ses axes, formant une boucle dynamique capable de s’adapter à différentes formes. Les axes de la chaîne s’engagent dans les espaces entre les dents de chaque pignon.
zh_cn: 滚轮链由一系列由销连接的链节组成，每个链节都可以围绕其销旋转，创造出一个可以符合任何形状的动态回路，链中的销接合每个链轮上的齿间间隙。

source: Chain number refers to the type and size of chain that is compatible with the sprocket. #25 chain and 8mm chain are both commonly used in FTC\ |reg|.
es_mx: El número de cadena se refiere al tipo y tamaño de cadena que es compatible con el piñón/rueda dentada. La cadena #25 y la cadena de 8 mm son comúnmente utilizadas en FTC\ |reg|.
fr_ca: Le numéro de chaîne fait référence au type et à la taille de chaîne compatibles avec le pignon. Les chaînes #25 et les chaînes de 8 mm sont toutes deux couramment utilisées en FTC®.
zh_cn: 链号是指与链轮相容的链条类型和尺寸。#25链和8mm链都是FTC比赛中常用的型号。

source: If you've ridden a bike, chances are that you've already seen roller chain - the chain on your FTC robot is similar, but it's probably a different :term:`pitch <Pitch>` (different size). Chains most commonly used in FTC are #25 (1/4 inch pitch) or 8mm pitch.
es_mx: Si ha montado en bicicleta, lo más probable es que ya haya visto cadenas de rodillos; la cadena de su robot FTC es similar, pero probablemente tenga un :term:`pitch<Pitch>` (tamaño diferente). Las cadenas más utilizadas en FTC son de #25 (paso de 1/4 de pulgada) o de 8 mm.
fr_ca: Si vous avez fait du vélo, il y a de fortes chances que vous ayez déjà vu une chaîne à rouleaux - la chaîne de votre robot FTC est similaire, mais elle a probablement un :term:`pitch <Pitch>` (taille différente). Les chaînes les plus couramment utilisées en FTC sont des chaînes #25 (pas de 1/4 de pouce) ou des chaînes de 8 mm.
zh_cn: 如果你骑过自行车，你很可能已经见过滚轮链——你FTC机器人上的链条是相似的，但可能是不同的间距 :term:`pitch <Pitch>` （不同的尺寸）。FTC中最常用的链条是25号（1/4英寸间距）或8毫米间距。

source: When using chain, often there is a master link. This is a special type of link that has a removable end capsule in order to shorten the chain. However, as it is removable, it is not a very reliable chain link and can loosen and fall off under prolonged usage. There have been teams who have had master chain links fail during competition, costing them a match in the elimination rounds.
es_mx: Cuando se utiliza una cadena, suele haber un eslabón maestro. Se trata de un tipo especial de eslabón que tiene una cápsula extraíble en el extremo para acortar la cadena. Sin embargo, al ser desmontable, no es un eslabón de cadena muy fiable y puede aflojarse y caerse con el uso prolongado. Ha habido equipos a los que les han fallado los eslabones maestros de la cadena durante la competición, lo que les ha costado un partido en las rondas eliminatorias.
fr_ca: Lorsqu'on utilise une chaîne, il y a souvent un maillon maître. Il s'agit d'un type de maillon spécial dont l'extrémité est munie d'une capsule amovible afin de raccourcir la chaîne. Cependant, comme il est amovible, ce maillon n'est pas très fiable et peut se desserrer et tomber en cas d'utilisation prolongée. Certaines équipes ont vu leur maillon maître se rompre pendant la compétition, ce qui leur a coûté un match lors des éliminatoires.
zh_cn: 使用链条时，通常会有一个主链节。这是一种特殊类型的链节，有一个可拆卸的末端胶囊，以缩短链条。但是，由于它是可拆卸的，所以它不是一个非常可靠的链节，在长时间使用下会松动和脱落。有些团队在比赛中出现了主链节失败，他们在淘汰赛中损失输掉了一场比赛。

source: A chain breaker eliminates the need for master links because it can break and join chain at any point.
es_mx: Un rompedor de cadena elimina la necesidad de eslabones maestros porque puede romper y unir la cadena en cualquier punto.
fr_ca: Un brise-chaîne élimine le besoin de maillons maîtres car il peut briser et raccorder la chaîne à n'importe quel endroit.
zh_cn: 断链器消除了对主链接的需求，因为它可以在任何时候断开和连接链。

source: It is highly recommended that teams purchase a chain breaker (we recommend the DarkSoul chain breaker for #25 chain, and the goBILDA Chain Breaker for 8mm pitch chain) instead of using master links, which are prone to failure.
es_mx: Se recomienda encarecidamente que los equipos adquieran un rompedor de cadenas (recomendamos el rompedor de cadenas DarkSoul para cadenas del nº 25, y el rompedor de cadenas goBILDA para cadenas de paso de 8 mm) en lugar de utilizar eslabones maestros, que son propensos a fallar.
fr_ca: Il est fortement recommandé que les équipes se procurent un brise-chaîne (nous recommandons le modèle DarkSoul pour les chaînes #25, et le goBILDA Chain Breaker pour les chaînes à pas de 8 mm) plutôt que d’utiliser des maillons maîtres, qui sont sujets aux défaillances.
zh_cn: 强烈建议团队购买断链器（我们推荐#25链使用DarkSoul断链器，8mm间距链使用goBILDA断链器），而不是使用容易出现故障的主链。

source: A disassembled master link
es_mx: Un eslabón maestro desmontado
fr_ca: Un maillon maître désassemblé
zh_cn: 一节被拆卸下来的主链节

source: The removable master link is shown on the right.
es_mx: El eslabón maestro desmontable se muestra a la derecha.
fr_ca: Le lien principal amovible est illustré à droite.
zh_cn: 右图为可拆卸的主链节。

source: Center-to-Center calculations
es_mx: Cálculos de centro a centro
fr_ca: Calculs centre à centre
zh_cn: 中心到中心的计算

source: The equation to calculate :term:`center-to-center <C2C>` for chain is quite complicated. Many `online calculators <https://reca.lc/chains>`_ can calculate C-C distances without going through the tedious calculations. However, the complete formula is below.
es_mx: La ecuación para calcular :term:`centro a centro <C2C>` para cadena es bastante complicada. Muchas `calculadoras en línea <https://reca.lc/chains>`_ pueden calcular las distancias C-C sin pasar por los tediosos cálculos. Sin embargo, la fórmula completa está a continuación.
fr_ca: L'équation permettant de calculer :term:`centre à centre <C2C>` pour une chaîne est assez compliquée. De nombreuses `calculatrices en ligne <https://reca.lc/chains>`_ peuvent calculer les distances C-C sans passer par ces calculs fastidieux. Cependant, la formule complète est présentée ci-dessous.
zh_cn: 计算 :term:`center-to-center <C2C>` 链的方程相当复杂。许多 `在线计算器 <https://reca.lc/chains>`_ 可以计算 C-C 间距，而无需进行繁琐的计算。不过，完整的公式如下。

source: :math:`C` = center-to-center distance, inches
es_mx: :math:`C` = distancia entre ejes, es decir de centro a centro, pulgadas
fr_ca: :math:`C` = distance centre à centre, en pouces
zh_cn: :math:`C` = 中心到中心的距离，英寸

source: :math:`L` = chain length in pitches
es_mx: :math:`L` = longitud de la cadena en pasos
fr_ca: :math:`L` = longueur de la chaîne en pas
zh_cn: :math:`L` = 链长，以节距为单位

source: :math:`P` = pitch of chain
es_mx: :math:`P` = paso de cadena
fr_ca: :math:`P` = pas de la chaîne
zh_cn: :math:`P` = 链条间距

source: :math:`N` = number of teeth in large sprocket
es_mx: :math:`N` = número de dientes de la rueda dentada grande
fr_ca: :math:`N` = nombre de dents du grand pignon
zh_cn: :math:`N` = 大链轮的齿数

source: :math:`n` = number of teeth in small sprocket
es_mx: :math:`n` = número de dientes de la rueda dentada pequeña
fr_ca: :math:`n` = nombre de dents du petit pignon
zh_cn: :math:`n` = 小链轮的齿数

source: Chain Wrap
es_mx: Envoltura de cadena
fr_ca: Enroulement de chaîne
zh_cn: 链条的缠绕

source: **Chain should, at the very least, have 90 degrees of contact with the sprocket. The best practice is to have 180 degrees or more of contact**, as it is very unlikely to fall off with proper tensioning. Chain skipping, especially on drivetrains or arms, is very possible without proper chain wrap or tensioning.
es_mx: **La cadena debe tener, como mínimo, 90 grados de contacto con el piñón. La mejor práctica es tener 180 grados o más de contacto**, ya que es muy poco probable que se salga con una tensión adecuada. Es muy posible que la cadena salte, especialmente en un chasis o brazos, sin un adecuado envoltorio o tensión de la cadena.
fr_ca: **La chaîne doit, au minimum, être en contact à 90 degrés avec la roue dentée. La meilleure pratique consiste à avoir un contact de 180 degrés ou plus**, car il est très peu probable que la chaîne tombe si elle est correctement tendue. Le saut de chaîne, en particulier sur les transmissions ou les bras, est très possible si la chaîne n'est pas correctement enroulée ou tendue.
zh_cn: **链条至少应与链轮接触 90 度。最好的做法是链条与链轮接触 180 度或更多**，因为如果张紧得当，链条脱落的可能性很小。如果没有适当的链条缠绕或张紧，链条很可能跳动，尤其是在传动系统或机械臂上。

source: When tensioning chain, be sure to not undertension or overtension chain. Undertensioning chain can result in the chain falling off the sprocket or chain skipping, where the chain can skip along the sprocket. Overtensioning the chain often results in the motor burning out, or less seriously, a loss of efficiency. Push along the chain run, and if the chain moves slightly without significant resistance, chances are you've done it correctly. If it's too tight, then the chain will barely move under a gentle press.
es_mx: Al tensar la cadena, asegúrese de no tensarla ni demasiado ni demasiado poco. Un tensado insuficiente de la cadena puede provocar que la cadena se salga del piñón o que la cadena salte a lo largo del piñón. Tensar demasiado la cadena a menudo provoca que el motor se queme o, lo que es menos grave, una pérdida de eficiencia. Empuje a lo largo del recorrido de la cadena, y si la cadena se mueve ligeramente sin resistencia significativa, lo más probable es que lo haya hecho correctamente. Si está demasiado tensa, entonces la cadena apenas se moverá bajo una suave presión.
fr_ca: Lors de la tension de la chaîne, veillez à ne pas la sous-tendre ou la sur-tendre. Si la chaîne n'est pas assez tendue, elle peut tomber de la roue dentée ou sauter le long de la roue dentée. Une surtension de la chaîne a souvent pour conséquence de faire griller le moteur ou, moins grave, d'entraîner une perte d'efficacité. Poussez le long de la chaîne, et si la chaîne se déplace légèrement sans résistance significative, il y a de fortes chances que vous l'ayez fait correctement. Si la chaîne est trop tendue, elle bougera à peine sous l'effet d'une légère pression.
zh_cn: 张紧链条时，一定要注意不要张紧不足或张紧过度。链条张力不足会导致链条从链轮上脱落或跳链，即链条沿着链轮跳动。链条张力过大通常会导致电机烧毁，严重的还会降低效率。沿链条运行方向推动，如果链条在没有明显阻力的情况下轻微移动，则很可能是操作正确。如果太紧，那么轻轻一按，链条几乎不会移动。

source: Best practices for wrap
es_mx: Mejores prácticas para la envoltura
fr_ca: Meilleures pratiques pour l'enroulement
zh_cn: 最佳的链条缠绕方法

source: A metal chain for a drivetrain by 724, Rednek Robotics Wun
es_mx: Una cadena metálica para una transmisión de 724, Rednek Robotics Wun
fr_ca: Une chaîne métallique pour une transmission par 724, Rednek Robotics Wun
zh_cn: 724，Rednek Robotics Wun 队制作的用于传动系统的金属链条

source: 724 Rednek Robotics Wun, Relic Recovery
fr_ca: 724 Rednek Robotics Wun, récupération de reliques

source: A metal chain for a drivetrain by 8103, Null Robotics
es_mx: Una cadena metálica para una transmisión de 8103, Null Robotics
fr_ca: Une chaîne métallique pour une transmission par 8103, Null Robotics
zh_cn: 用于传动系统的金属链条，由 8103，Null Robotics 队伍制作

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优点

source: **Chain can take a beating**. No matter what your application is, metal chain is usually up for the challenge. #25 chain can hold up to 930lbs before breaking, and there's nothing you'll do in FTC that will exert that force. (If your chain does break, it's most likely due to a faulty Master Link or sprockets that are not correctly aligned.)
es_mx: **La cadena puede soportar una paliza**. No importa cuál sea su aplicación, la cadena metálica suele estar a la altura del desafío. La cadena #25 puede soportar hasta 930 libras antes de romperse, y no hay nada que puedas hacer en FTC que ejerza esa fuerza. (Si tu cadena se rompe, lo más probable es que se deba a un Master Link defectuoso o a piñones que no están correctamente alineados).
fr_ca: **Les chaînes peuvent être mises à rude épreuve**. Quelle que soit votre application, les chaînes métalliques sont généralement à la hauteur du défi. Une chaîne #25 peut supporter jusqu'à 930lbs avant de se rompre, et il n'y a rien que vous fassiez en FTC qui puisse exercer cette force. (Si votre chaîne se brise, c'est probablement à cause d'un maillon principal défectueux ou de roues dentées mal alignés).
zh_cn: **链条可以经受考验。** 无论你要用他做什么，金属链条通常都能经受住挑战。25 号链条在断裂前可承受 930 磅的重量，而在 FTC 中，你所做的任何事情都不会产生这样的力。(如果你的链条确实断裂，很可能是由于主链环故障或链轮未正确对齐造成的）。

source: **Chain can be however long or short as you wish**. If your ratio changes or your shafts move, it's easy to adapt your chain run - just break the chain and put it back together at its new length. You can often do this without even removing the chain from your robot.
es_mx: **La cadena puede ser tan larga o corta como desee**. Si cambia la relación de transmisión o se mueven los ejes, es fácil adaptar el recorrido de la cadena: basta con romper la cadena y volver a montarla con la nueva longitud. A menudo puede hacerlo sin ni siquiera desmontar la cadena del robot.
fr_ca: **La chaîne peut être aussi longue ou aussi courte que vous le souhaitez**. Si votre ratio change ou si vos arbres se déplacent, il est facile d'adapter votre chaîne - il suffit de casser la chaîne et de la remonter à sa nouvelle longueur. Vous pouvez souvent le faire sans même retirer la chaîne de votre robot.
zh_cn: **链条可长可短。** 如果传动比发生变化或轴发生移动，调整链条运行也很容易，只需将链条折断，然后按新长度重新组装即可。通常情况下，你甚至无需从机器人上拆下链条。

source: **Chain can be pretty precise**. When properly tensioned, roller chain doesn't have very much slop. However, you really need to get your chain tension right to reduce slop, and you'll probably want an adjustable tensioner for when the chain stretches. This can be done easily if using extrusion systems, as the sprocket can be adjusted for tension.
es_mx: **La cadena puede ser muy precisa**. Cuando está bien tensada, la cadena de rodillos no tiene mucha holgura. Sin embargo, hay que tensar bien la cadena para reducir la inclinación, y probablemente querrás un tensor ajustable para cuando la cadena se estire. Esto puede hacerse fácilmente si se utilizan sistemas de extrusión, ya que el piñón puede ajustarse para la tensión.
fr_ca: **La chaîne peut être très précise**. Lorsqu'elle est correctement tendue, la chaîne à rouleaux n'a pas beaucoup de jeu. Cependant, il faut vraiment que la tension de la chaîne soit correcte pour réduire le jeu, et vous aurez probablement besoin d'un tendeur réglable pour les cas où la chaîne s'étire. Cela peut se faire facilement si vous utilisez des systèmes d'extrusion, car la roue dentée peut être déplacée en fonction de la tension.
zh_cn: **链条可以非常精确**。如果张紧得当，滚子链不会有太大的松弛。不过，你需要适当地张紧链条以减少滑动，而且你可能需要一个可调节的张紧器，以便在链条拉伸时使用。如果使用铝型材系统，这一点很容易做到，因为链轮可以根据张力进行调整。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 劣势

source: **Chain stretches over time**. As it's used, the connections between the links and rollers can stretch a bit. While it doesn't look like much, this stretching can introduce lots of slop into your chain run and even derail it in some cases. You'll most likely need an adjustable tensioner to keep your tension over time - some teams have used spring-loaded dynamic tensioners to automatically compensate for any changes.
es_mx: **La cadena se estira con el tiempo**. Con el uso, las conexiones entre los eslabones y los rodillos pueden estirarse un poco. Aunque no parezca gran cosa, este estiramiento puede introducir mucha holgura en el recorrido de la cadena e incluso hacerla descarrilar en algunos casos. Lo más probable es que necesites un tensor ajustable para mantener la tensión a lo largo del tiempo; algunos equipos han utilizado tensores dinámicos con resorte para compensar automáticamente cualquier cambio.
fr_ca: **La chaîne s'étire avec le temps**. Au fur et à mesure de son utilisation, les connexions entre les maillons et les rouleaux peuvent s'étirer un peu. Bien que cela n'ait l'air de rien, cet étirement peut introduire beaucoup de jeu dans votre chaîne et même la faire dérailler dans certains cas. Vous aurez probablement besoin d'un tendeur réglable pour maintenir la tension au fil du temps - certaines équipes ont utilisé des tendeurs dynamiques à ressort pour compenser automatiquement tout changement.
zh_cn: **链条会随着时间的推移而拉伸** 。链条在使用过程中，链节和滚子之间的连接会有一些拉伸。虽然看起来不大，但这种拉伸会给链条运行带来很大的不稳定性，在某些情况下甚至会使链条脱轨。您很可能需要一个可调节的张紧器来长期保持张力--有些车队使用弹簧式动态张紧器来自动补偿任何变化。

source: **The smaller the sprocket, the faster the chain stretch**. This is because when the chain is run on a smaller sprocket, more force is applied due to a smaller radius.
es_mx: **Cuanto más pequeño es el piñón, más rápido se estira la cadena**. Esto se debe a que cuando la cadena se desplaza en un piñón más pequeño, se aplica más fuerza debido a un radio más pequeño.
fr_ca: **Plus la roue dentée est petite, plus la chaîne s'étire rapidement**. En effet, lorsque la chaîne tourne sur une roue dentée plus petite, la force appliquée est plus importante en raison d'un rayon plus petit.
zh_cn: 链轮越小，链条拉伸越快。这是因为当链条在较小的链轮上运行时，由于半径较小，会产生更大的力。

source: **Chain wrap, especially in one chain run, can be problematic**. Typically, teams use either one or two chain runs (pieces of chain) per drivetrain side. However, one chain run can require more than one idler sprocket and get very complex in order to maintain proper chain wrap.
es_mx: **La torsión de la cadena, especialmente en un tramo, puede ser problemática**. Normalmente, los equipos utilizan uno o dos recorridos de cadena (trozos de cadena) por cada lado de la transmisión. Sin embargo, un recorrido de cadena puede requerir más de un piñón loco y volverse muy complejo para mantener una envoltura adecuada de la cadena.
fr_ca: **L'enroulement de la chaîne, en particulier sur un seul brin de chaîne, peut être problématique**. En règle générale, les équipes utilisent une ou deux chaînes (morceaux de chaîne) par côté de la transmission. Cependant, une chaîne peut nécessiter plus d'une roue dentée de renvoi et devenir très complexe pour maintenir un bon enroulement de la chaîne.
zh_cn: **链条缠绕，尤其是在一个链条运行过程中，可能会出现问题**。通常情况下，队伍会在每个传动系统侧使用一条或两条链条（链片）。但是，一条链条运行可能需要一个以上的惰轮链轮，而且为了保持链条的适当缠绕会变得非常复杂。

source: **Sprockets are really big**. If you want a really high reduction using chain, you'll pay for it in the space that it takes up. Sprocket teeth are much larger than gear or pulley teeth, so your reductions are going to be much larger.
es_mx: **Los piñones son realmente grandes**. Si quieres una reducción realmente alta usando cadena, lo pagarás en el espacio que ocupa. Los dientes de los piñones son mucho más grandes que los de los engranajes o las poleas, por lo que las reducciones serán mucho mayores.
fr_ca: **Les roues dentées sont très grosses**. Si vous souhaitez obtenir une réduction très élevée en utilisant une chaîne, vous le paierez en fonction de l'espace qu'elle occupe. Les dents d'une roue dentée sont beaucoup plus grandes que celles d'un engrenage ou d'une poulie, de sorte que vos réductions seront beaucoup plus importantes.
zh_cn: **链轮真的很大**。如果你想用链条获得很高的减速比，你就得为它占用的空间付出代价。链轮的齿要比齿轮或滑轮的齿大得多，因此减速比也会大得多。

source: A metal chain for a drivetrain by 7244, OUT of the BOX Robotics
es_mx: Una cadena metálica para una transmisión de 7244, OUT of the BOX Robotics
fr_ca: Une chaîne métallique pour une transmission par 7244, OUT of the BOX Robotics
zh_cn: 用于传动系统的金属链条，由 7244、OUT of the BOX Robotics 队伍提供

source: 7244 OUT of the BOX Robotics, Relic Recovery
fr_ca: 7244 OUT of the BOX Robotique, Relic Recovery

source: A plastic chain on an intake by 9794, Wizards.exe
es_mx: Una cadena de plástico en un intake de 9794, Wizards.exe
fr_ca: Une chaîne en plastique sur une prise d'eau par 9794, Wizards.exe
zh_cn: 吸入拾取装置上的塑料链条，由 9794，Wizards.exe制作

source: 9794 Wizards.exe, Rover Ruckus, plastic chain on intake
es_mx: 9794 Wizards.exe, Rover Ruckus, cadena de plástico en el intake
fr_ca: 9794 Wizards.exe, Rover Ruckus, chaîne en plastique sur l'admission
zh_cn: 9794 Wizards.exe，Rover Ruckus，吸入拾取装置塑料链条

source: Properly done chain wrap with tensioners
es_mx: Envoltura de cadena correctamente realizada con tensores
fr_ca: Enroulement de la chaîne correctement réalisé avec des tendeurs
zh_cn: 使用张紧器进行适当的链条缠绕

source: Properly done chain wrap with the REV system
es_mx: Envoltura de cadena correctamente realizada con el sistema REV
fr_ca: Enroulement de la chaîne correctement effectué avec le système REV
zh_cn: 使用 REV 系统正确进行链条缠绕

source: 8103 Null Robotics, Rover Ruckus
zh_cn: 8103 Null Robotics, Rover Ruckus队伍
