Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/direct-drive.po
Languages: es_mx, fr_ca, zh_cn

source: Direct Drive
es_mx: Transmisión Directa
fr_ca: Entraînement direct
zh_cn: 直接驱动

source: Term
es_mx: Término
fr_ca: Définition
zh_cn: 术语

source: Powering a mechanical part (most commonly a drive wheel) directly from the motor axis. Many new and inexperienced teams will use this method to power their drivetrain as it is the simplest way to do so. However, there are significant drawbacks to this method.
es_mx: Accionar una pieza mecánica (normalmente una rueda motriz) directamente desde el eje del motor. Muchos equipos nuevos e inexpertos utilizarán este método para alimentar su chasis, ya que es la forma más sencilla de hacerlo. Sin embargo, este método presenta importantes inconvenientes.
fr_ca: L'alimentation d'une pièce mécanique (le plus souvent une roue motrice) directement à partir de l'axe du moteur. De nombreuses équipes nouvelles et inexpérimentées utilisent cette méthode pour alimenter leur groupe motopropulseur, car c'est le moyen le plus simple de le faire. Cependant, cette méthode présente des inconvénients importants.
zh_cn: 直接从电机轴为机械部件（最常见的是驱动轮）提供动力。许多没有经验的新团队会使用这种方法为传动系统提供动力，因为这是最简单的方法。然而，这种方法也有很大的缺点。

source: Direct drive puts unnecessary load on the drive motor. This is because shock loads can destroy gearboxes, even :term:`planetary gearboxes <Planetary Gear>`. Gearboxes are able to withstand load along the axis of rotation, such as what occurs when the wheel changes direction. This is a normal situation of load. However, in direct drive, the gearbox shaft can be exposed to other shock loads outside of the normal axis. This happens when the wheel comes into contact with another robot or the field wall, which honestly happens more than you'd think. This can bend the motor shaft or permanently damage the gearbox.
es_mx: La transmisión directa impone una carga innecesaria al motor de transmisión. Esto se debe a que las cargas de choque pueden destruir las cajas de engranajes, incluso las :term:`cajas de engranajes planetarias <Planetary Gear>`. Las cajas de engranajes pueden soportar cargas a lo largo del eje de rotación, como las que se producen cuando la rueda cambia de dirección. Ésta es una situación normal de carga. Sin embargo, en la transmisión directa, el eje de la caja de engranajes puede estar expuesto a otras cargas de choque fuera del eje normal. Esto ocurre cuando la rueda entra en contacto con otro robot o con la pared del campo, lo que honestamente ocurre más de lo que se piensa. Esto puede doblar el eje del motor o dañar permanentemente la caja de engranajes.
fr_ca: L'entraînement direct impose une charge inutile au moteur d'entraînement. En effet, les chocs peuvent détruire les réducteurs, même :term:`réducteurs planétaires <Planetary Gear>`. Les réducteurs sont capables de supporter une charge le long de l'axe de rotation, comme c'est le cas lorsque la roue change de direction. Il s'agit d'une situation de charge normale. Toutefois, dans le cas d'une transmission directe, l'arbre du réducteur peut être exposé à d'autres chocs en dehors de l'axe normal. C'est le cas lorsque la roue entre en contact avec un autre robot ou avec le mur du champ, ce qui, honnêtement, arrive plus souvent qu'on ne le pense. Cela peut déformer l'arbre du moteur ou endommager de manière permanente la boîte de vitesses.
zh_cn: 直接驱动会给驱动电机带来不必要的负载。这是因为冲击负荷会破坏齿轮箱，即使是 :term:`planetary gearboxes <Planetary Gear>`。齿轮箱能够承受沿旋转轴方向的负载，例如车轮改变方向时的负载。这是正常的负载情况。但是，在直接驱动中，齿轮箱轴可能会受到正常轴以外的其他冲击载荷。当车轮接触到另一个机器人或场地墙壁时，就会发生这种情况。这会导致电机轴弯曲或永久性损坏齿轮箱。

source: It also limits the :term:`gear ratio <Gear Reduction>` to whatever ratio the motor gearbox is at. One advantage of all the other three transmission systems is the ability to gear up or down, based on a team's needs. Direct drive cannot do so, and if your drivetrain uses 40:1 gearboxes, there is no way to reduce this ratio to a faster 20:1 gearbox, for example.
es_mx: También limita la :term:`relación de engranes <Gear Reduction>` a la relación que tenga la caja de engranajes del motor. Una de las ventajas de los otros tres sistemas de transmisión es la posibilidad de aumentar o reducir la velocidad en función de las necesidades del equipo. La transmisión directa no puede hacerlo, y si tu transmisión utiliza cajas de cambios de 40:1, no hay forma de reducir esta relación a una caja de cambios más rápida de 20:1, por ejemplo.
fr_ca: Il limite également le :term:`rapport de vitesse <Gear Reduction>` au rapport de la boîte de vitesses du moteur. L'un des avantages des trois autres systèmes de transmission est la possibilité d'augmenter ou de diminuer le rapport de transmission en fonction des besoins de l'équipe. La transmission directe ne le permet pas, et si votre système de transmission utilise des boîtes de vitesses 40:1, il n'y a aucun moyen de réduire ce rapport à une boîte de vitesses 20:1 plus rapide, par exemple.
zh_cn: 它还将 :term:`gear ratio <Gear Reduction>` 限制为电机变速箱的任何传动比。其他三种传动系统的一个优点是可以根据车队的需要增减齿轮。而直接驱动则无法做到这一点，例如，如果您的传动系统使用40:1的变速箱，则无法将此比率降低到更快的20:1变速箱。

source: Motor shafts are not built to carry large amounts of downward load. This can lead to bending of the motor shaft, since in direct drive the shaft is only supported by one side, the gearbox. Generally, a principle among all engineers is to support the shaft on both sides, which isn't possible in this case. This leads to :term:`cantilevering <Cantilever>` the shaft, something that should be avoided in general. Thus, with a heavy robot the motor shafts can easily be bent due to a lack of support. (While typically it is impossible to support a motor shaft on both ends, it is a common rule of thumb to have dual support on wheels or other non-motor shafts.)
es_mx: Los ejes del motor no están diseñados para soportar grandes cargas descendentes. Esto puede provocar la flexión del eje del motor, ya que en la transmisión directa el eje sólo se apoya en un lado, la caja de engranajes. Generalmente, un principio entre todos los ingenieros es apoyar el eje en ambos lados, lo que no es posible en este caso. Esto conduce al :term:`voladizo <Cantilever>` del eje, algo que debería evitarse en general. Así, con un robot pesado los ejes del motor pueden doblarse fácilmente debido a la falta de apoyo. (Aunque normalmente es imposible apoyar un eje de motor en ambos extremos, es una regla común tener doble apoyo en las ruedas u otros ejes no motores).
fr_ca: Les arbres de moteur ne sont pas conçus pour supporter de grandes quantités de charges descendantes. Cela peut entraîner une flexion de l'arbre du moteur, étant donné qu'en entraînement direct, l'arbre n'est soutenu que d'un seul côté, celui de la boîte de vitesses. En règle générale, tous les ingénieurs ont pour principe de soutenir l'arbre des deux côtés, ce qui n'est pas possible dans ce cas. Cela conduit à :term:`cantilevering <Cantilever>` l'arbre, ce qui devrait être évité en général. Ainsi, avec un robot lourd, les arbres des moteurs peuvent facilement être pliés en raison d'un manque de support. (Bien qu'il soit généralement impossible de soutenir un arbre moteur aux deux extrémités, il est courant de prévoir un double support pour les roues ou d'autres arbres non moteurs).
zh_cn: 电机轴的构造不能承受较大的向下负荷。这可能会导致电机轴弯曲，因为在直接驱动中，轴仅由一侧（即变速箱）支撑。一般来说，所有工程师的原则都是在两侧支撑轴，但在这种情况下是不可能的。这将导致: term:`悬臂 <Cantilever>` 轴的倾斜，而这在一般情况下是应该避免的。因此，对于重型机器人来说，由于缺乏支撑，电机轴很容易弯曲。(虽然电机轴的两端通常不可能都有支撑，但通常的经验法则是在轮子或其他非电机轴上设置双重支撑）。

source: Cantilever
es_mx: Voladizo
fr_ca: Porte-à-faux
zh_cn: 悬臂式

source: A cantilever refers to when an object (usually a :term:`shaft <Shaft>`) is only supported on one side. While this provides theoretically less support, as long as the shaft is still supported at two points by :term:`bearings <Ball Bearing>` or :term:`bushings <Bushing>`, cantilever is still a sound building technique. Many drivetrains are cantilevered, which provides for easy access to wheels.
es_mx: Se habla de voladizo cuando un objeto (normalmente un :term:`eje <Shaft>`) sólo está apoyado en un lado. Aunque en teoría esto proporciona menos apoyo, siempre que el eje siga apoyado en dos puntos sobre :term:`cojinetes <Ball Bearing>` o :term:`empotramientos <Bushing>`, el voladizo sigue siendo una buena técnica de construcción. Muchos chasises son en voladizo, lo que facilita el acceso a las ruedas.
fr_ca: On parle de porte-à-faux lorsqu'un objet (généralement un :term:`arbre <Shaft>`) n'est soutenu que d'un seul côté. Bien que ce type de support soit théoriquement plus faible, tant que l'arbre est toujours soutenu en deux points par des :term:`bearings <Ball Bearing>` ou des :term:`bushings <Bushing>`, le porte-à-faux reste une bonne technique de construction. De nombreuses transmissions sont en porte-à-faux, ce qui facilite l'accès aux roues.
zh_cn: 悬臂是指一个物体（通常是一根 :term:`轴 <Shaft>`）只有一侧有支撑。虽然从理论上讲，悬臂提供的支撑较少，但只要轴的两点仍由 :term:`球承轴 <Ball Bearing>` 或 :term:`轴套 <Bushing>` 支撑，悬臂仍不失为一种合理的建筑技术。许多传动系统都是悬臂式的，这样可以方便地接触车轮。

source: Supporting a shaft on both sides is theoretically more structurally sound, although in most cases you won't notice a difference.
es_mx: Apoyar un eje en ambos lados es teóricamente más sólido desde el punto de vista estructural, aunque en la mayoría de los casos no se notará la diferencia.
fr_ca: Soutenir un arbre des deux côtés est théoriquement plus sain sur le plan structurel, bien que dans la plupart des cas, vous ne remarquerez pas de différence.
zh_cn: 从理论上讲，两侧支撑轴的结构更合理，但在大多数情况下，你不会注意到有什么不同。

source: Sanford's cantilever 6WD prototype
es_mx: Prototipo 6WD en voladizo de Sanford
fr_ca: Le prototype de 6 roues motrices en porte-à-faux de Sanford
zh_cn: Sanford的悬臂式6WD原型车

source: Sanford's Prototype
es_mx: Prototipo de Sanford
fr_ca: Le prototype de Sanford
zh_cn: Sanford的原型

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优点

source: Saves space
es_mx: Ahorra espacio
fr_ca: Sauve de la place
zh_cn: 节省空间

source: Easy to build; most simple form of transmission
es_mx: Fácil de construir; la forma de transmisión más sencilla
fr_ca: Facile à construire ; forme de transmission la plus simple
zh_cn: 易于建造；最简单的传动形式

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Prone to shock loads which destroy the gearbox
es_mx: Propensos a cargas de choque que destruyen la caja de engranajes
fr_ca: Sujet à des chocs qui détruisent la boîte de vitesses
zh_cn: 易受冲击载荷的影响而损坏齿轮箱

source: Limited gear ratio to the motor itself
es_mx: Relación de transmisión limitada al propio motor
fr_ca: Rapport de vitesse limité au moteur lui-même
zh_cn: 电机本身的传动比有限

source: Wears the gearbox of the motor faster
es_mx: Desgasta más rápido la caja de engranajes del motor
fr_ca: Usure plus rapide de la boîte de vitesses du moteur
zh_cn: 电机变速箱磨损更快

source: Can bend the motor shaft
es_mx: Puede doblar el eje del motor
fr_ca: Peut plier le manche du moteur
zh_cn: 会使电机轴弯曲

source: A drivetrain with the wheel directly driven, but with an externally supported shaft
es_mx: Una chasis con la rueda accionada directamente, pero con un eje apoyado externamente.
fr_ca: Une transmission dont la roue est directement entraînée, mais dont l'arbre est supporté par l'extérieur.
zh_cn: 直接驱动车轮的传动系统，但有外部支撑轴

source: 11316, Weapons of Mass Construction
fr_ca: Weapons of Mass Construction 11316

source: *Outside* Supported Direct Drive (**Preferred Version of Direct Drive**)
es_mx: *Exterior* Compatible con Transmisión Directa (**Versión preferida de Transmisión Directa**)
fr_ca: *Extérieur* Entrainement direct pris en charge (**Version préférée d'entrainement direct**)
zh_cn: *外部*支持直接驱动（**直接驱动的首选版本**）

source: A drivetrain with the wheel directly driven, but with an internally supported shaft
es_mx: Un chasis con la rueda accionada directamente, pero con un eje apoyado internamente.
fr_ca: Une transmission dont la roue est directement entraînée, mais dont l'arbre est supporté de manière interne.
zh_cn: 直接驱动车轮的传动系统，但有内部支撑轴

source: *Inside* Supported Direct Drive (**Preferred Version of Direct Drive**)
es_mx: *Dentro* Compatible con Transmisión Directa (**Versión preferida de Transmisión Directa**)
fr_ca: *Intérieur* Entrainement direct pris en charge (**Version préférée d'entrainement direct**)
zh_cn: *内部* 支持直接驱动（**直接驱动的首选版本**）

source: A drivetrain with the wheel direct mounted, but with an unsupported shaft
es_mx: Una transmisión con la rueda montada directamente, pero con un eje sin soporte.
fr_ca: Une transmission avec une roue montée directement, mais avec un arbre non supporté.
zh_cn: 车轮直接安装但无支撑轴的传动系统

source: Unsupported Direct Drive (**not recommended**)
es_mx: Transmisión Directa no compatible (**no recomendado**)
fr_ca: Entraînement direct sans support (**non recommandé**)
zh_cn: 不支持直接驱动（**不推荐**）。
