Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/gears.po
Languages: es_mx, fr_ca, zh_cn

source: **Gears require no tensioning: once the spacing is correct, the gears will operate quickly**. Unlike chain or belt, there is nothing further transferring the power, which cuts out the need to properly tension chain or belt. This of course has the drawback of not being able to transfer power far distances.
es_mx: **Los engranajes no requieren tensado: una vez que la separación es correcta, los engranajes funcionan rápidamente**. A diferencia de la cadena o la correa, no hay nada más que transfiera la potencia, lo que elimina la necesidad de tensar correctamente la cadena o la correa. Por supuesto, esto tiene el inconveniente de no poder transferir la potencia a grandes distancias.
fr_ca: **Les engrenages ne nécessitent aucune tension : une fois que l'espacement est correct, les engrenages fonctionnent rapidement**. Contrairement à la chaîne ou à la courroie, il n'y a rien d'autre qui transfère la puissance, ce qui élimine la nécessité de tendre correctement la chaîne ou la courroie. Cela présente bien sûr l'inconvénient de ne pas pouvoir transférer la puissance sur de longues distances.
zh_cn: 齿轮不需要张紧：一旦行间距正确，齿轮将快速运行。与链条或皮带不同，没有任何东西可以进一步传递动力，这就不需要适当地张紧链条或皮带。这当然有一个缺点，那就是不能将动力传递到很远的地方。

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: **Sometimes, the ratio you want might not be easy to build**. Channel spacing limits gear ratios, but this can be circumvented with compound ratios and a bit of creativity.
es_mx: **A veces, la relación deseada no es fácil de fabricar**. La separación entre canales limita las relaciones de transmisión, pero esto puede evitarse con relaciones compuestas y un poco de creatividad.
fr_ca: **Parfois, le rapport que vous souhaitez n'est pas facile à construire**. L'espacement des canaux limite les rapports de transmission, mais cela peut être contourné avec des rapports composés et un peu de créativité.
zh_cn: 有时，您想要的比率可能不容易建立。通道行间距限制了齿轮比率，但这可以通过复合比率和一点创造力来规避。

source: **Long distance power transfer is impractical with gears**. If you need to transfer power long distances, gear combinations can become complicated very quickly, so belt/chain is preferable.
fr_ca: **Le transfert de puissance sur de longues distances n'est pas pratique avec les engrenages**. Si vous devez transférer de la puissance sur de longues distances, les combinaisons d'engrenages peuvent devenir rapidement compliquées, il est donc préférable d'utiliser une courroie/chaîne.

source: **Meshing gears can be tricky**. It's only made worse by the sensitivity of a gear mesh. However, channels do solve this problem, providing pre-spaced holes to easily mesh your gears. Do keep in mind that gear mesh may not be perfect, even with channel.
es_mx: **Engranar engranajes puede ser complicado**. La sensibilidad del engranaje lo empeora. Sin embargo, los canales resuelven este problema, proporcionando agujeros pre-espaciados para engranar fácilmente sus engranajes. Ten en cuenta que el engrane de los engranajes puede no ser perfecto, incluso con canales.
fr_ca: **Le maillage des engrenages peut s'avérer délicat**. La sensibilité de l'engrènement ne fait qu'aggraver la situation. Cependant, les canaux résolvent ce problème, en fournissant des trous pré-espacés pour faciliter l'engrènement de vos engrenages. N'oubliez pas que l'engrènement peut ne pas être parfait, même avec un canal.
zh_cn: 啮合齿轮可能很棘手。齿轮啮合的灵敏度只会让情况变得更糟。然而，通道确实解决了这个问题，提供了预间隔的孔来轻松啮合你的齿轮。请记住，齿轮啮合可能并不完美，即使有通道。

source: **Gears usually wear faster than sprockets** if there is too much friction between the gears. Teams can use white lithium grease or similar lubricant to help remedy this problem.
es_mx: **Los engranajes suelen desgastarse más rápido que los piñones** si hay demasiada fricción entre ellos. Los equipos pueden utilizar grasa blanca de litio o un lubricante similar para ayudar a remediar este problema.
fr_ca: **Les engrenages s'usent généralement plus vite que les pignons** s'il y a trop de friction entre les engrenages. Les équipes peuvent utiliser de la graisse blanche au lithium ou un lubrifiant similaire pour remédier à ce problème.
zh_cn: 齿轮通常比链轮磨损得更快，如果齿轮之间的摩擦太大，团队可以使用白色锂润滑脂或类似的润滑剂来帮助解决这个问题。

source: A gear-based drivetrain by 11115, Gluten Free
es_mx: Una transmisión por engranajes de 11115, Gluten Free
fr_ca: Une transmission à engrenages par 11115, Gluten Free
zh_cn: 11115Gluten 可调节的齿轮传动系统

source: 11115 Gluten Free gear-based drivetrain
es_mx: 11115 Transmisión por engranajes Gluten Free
fr_ca: Châssis à base d'engrenages de l'équipe 11115 Gluten Free
zh_cn: 11115Gluten 可调节的齿轮传动系统

source: A gear-based drivetrain by 13075, Coram Deo Robotics
es_mx: Una transmisión basada en engranajes de 13075, Coram Deo Robotics
fr_ca: Un châssis à engrenages par 13075, Coram Deo Robotics
zh_cn: 由13075Coram Deo Robotics开发的齿轮传动系统

source: 13075 Coram Deo Robotics, Rover Ruckus gear-based drivetrain
es_mx: 13075 Coram Deo Robotics, transmisión por engranajes Rover Ruckus
fr_ca: Un châssis à engrenages par 13075, Coram Deo Robotics pour le défi Rover Ruckus
zh_cn: 13075Coram Deo Robotics，Rover Ruckus齿轮传动系统

source: **Long distance power transfer is impractical with gears**. If you need to transfer power long distances, gear combinations can become complicated very quickly, so belt/chain is preferrable.
zh_cn: 远距离动力传递使用齿轮是不切实际的，如果你需要传递动力远距离，齿轮组合可以变得非常复杂，所以皮带/链条是首选。
