Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/gears.po
Languages: es_mx, fr_ca, zh_cn

source: Gears
es_mx: Engranajes
fr_ca: Engrenages
zh_cn: 齿轮

source: Gears, like sprockets and pulleys, are used in power transmission for three common applications: changing the direction of power, changing the amount of torque, and changing RPM. Gears are a less common transmission option than chain, but are still very viable for most use cases. Gears are equally as reliable as chain, but can't be used for transferring power over long distances. Many teams dislike gears when using kit-based channels because the hole pattern limits which combinations of gears can be used. Consequently, it may be difficult to achieve a desired specific gear ratio. However, with :term:`extrusion <Extrusion>` systems, it's very easy to use different ratios, since the gears can be moved around in extrusion.
es_mx: Los engranajes, al igual que las ruedas dentadas y las poleas, se utilizan en la transmisión de potencia para tres aplicaciones comunes: cambiar la dirección de la potencia, cambiar la cantidad de torque y cambiar las RPM. Los engranajes son una opción de transmisión menos común que la cadena, pero siguen siendo muy viables para la mayoría de los casos de uso. Los engranajes son igual de fiables que la cadena, pero no pueden utilizarse para transferir potencia a largas distancias. A muchos equipos no les gustan los engranajes cuando utilizan canales basados en kits porque el patrón de orificios limita las combinaciones de engranajes que se pueden utilizar. En consecuencia, puede resultar difícil conseguir una relación de transmisión específica deseada. Sin embargo, con los sistemas :term:`extrusión <Extrusion>`, es muy fácil utilizar diferentes relaciones, ya que los engranajes se pueden desplazar en extrusión.
fr_ca: Les engrenages, comme les pignons et les poulies, sont utilisés dans la transmission de puissance pour trois applications courantes : le changement de direction de la puissance, le changement de la quantité de couple et le changement de régime. Les engrenages sont une option de transmission moins courante que la chaîne, mais ils sont encore très viables pour la plupart des cas d'utilisation. Les engrenages sont tout aussi fiables que les chaînes, mais ne peuvent pas être utilisés pour transférer de la puissance sur de longues distances. De nombreuses équipes n'aiment pas les engrenages lorsqu'elles utilisent des chaînes en kit, car la configuration des trous limite les combinaisons d'engrenages possibles. Par conséquent, il peut être difficile d'obtenir un rapport de transmission spécifique. Toutefois, avec les systèmes :term:`extrusion <Extrusion>`, il est très facile d'utiliser différents rapports, puisque les engrenages peuvent être déplacés dans l'extrusion.
zh_cn: 齿轮与链轮和皮带轮一样，在动力传输中用于三种常见应用：改变动力方向、改变扭矩大小和改变转速。与链条相比，齿轮传动是一种不太常见的传动方式，但在大多数情况下仍然非常可行。齿轮传动与链条传动同样可靠，但不能用于长距离动力传输。许多车队在使用套件通道时不喜欢齿轮，因为孔型限制了齿轮的组合。因此，可能很难达到理想的特定齿轮比。但是，使用 :term:`extrusion <Extrusion>` 系统时，由于齿轮可以在挤压过程中移动，因此可以很容易地使用不同的齿轮比。

source: Term
es_mx: Término
fr_ca: Définition
zh_cn: 术语

source: Gear
es_mx: Engranaje
fr_ca: Engrenages
zh_cn: 齿轮

source: A gear is a machine part that has cut teeth, usually written in the form "numberT" (e.g. 32T, 86T). It is a form of power transmission that reverses the direction of rotation when used. The most common material for gears to be made of is aluminum or delrin plastic.
es_mx: Un engranaje es una pieza de máquina que tiene dientes tallados, normalmente escritos en forma de "númeroT" (por ejemplo, 32T, 86T). Es una forma de transmisión de potencia que invierte el sentido de giro cuando se utiliza. El material más común con el que se fabrican los engranajes es el aluminio o el plástico delrin.
fr_ca: Un engrenage est une pièce de machine qui comporte des dents taillées, généralement écrites sous la forme "nombreT" (par exemple 32T, 86T). Il s'agit d'une forme de transmission de puissance qui inverse le sens de rotation lorsqu'elle est utilisée. Le matériau le plus courant pour les engrenages est l'aluminium ou le plastique delrin.
zh_cn: 齿轮是具有切齿的机器部件，通常以“numberT”（例如32T、86T）的形式书写。它是一种动力传输形式，在使用时可以逆转旋转方向。齿轮最常见的材料是铝或聚甲醛树脂塑料。

source: A 56T REV aluminum gear
es_mx: Un engranaje de aluminio REV de 56T
fr_ca: Un engrenage 56T REV en aluminium
zh_cn: 56TREV铝齿轮

source: 56T REV aluminum gear
es_mx: Engranaje de aluminio 56T REV
fr_ca: Pignon 56T REV en aluminium
zh_cn: 56TREV铝齿轮

source: Gears are made in different materials, with the most common being 7075 aluminum. **Never mesh plastic and metal gears together**. It is acceptable to mesh different types of metal gears together, as long as they have the same diametral pitch. It is advised to stay away from TETRIX aluminum gears as they wear down very easily. Some REV gears are made out of Delrin, a self-lubricating plastic. It is a durable material, but keep in mind that it is very possible to strip the bore using a plastic gear. Thus, we advise using the REV Hex Hub Strengthener to avoid stripping the bore on Delrin gears.
es_mx: Los engranajes se fabrican en diferentes materiales, siendo el más común el aluminio 7075. **Nunca engrane engranajes de plástico con engranajes metálicos**. Es aceptable engranar diferentes tipos de engranajes metálicos, siempre que tengan el mismo paso diametral. Se recomienda evitar los engranajes de aluminio TETRIX, ya que se desgastan con mucha facilidad. Algunos engranajes REV están hechos de Delrin, un plástico autolubricante. Es un material duradero, pero hay que tener en cuenta que es muy posible rayar el agujero utilizando un engranaje de plástico. Por lo tanto, le aconsejamos que utilice el REV Hex Hub Strengthener para evitar que se dañe el orificio de los engranajes de Delrin.
fr_ca: Les engrenages sont fabriqués dans différents matériaux, le plus courant étant l'aluminium 7075. **Ne jamais engrener des engrenages en plastique et en métal ensemble**. Il est acceptable d'engrener différents types d'engrenages métalliques, à condition qu'ils aient le même pas diamétral. Il est conseillé d'éviter les engrenages en aluminium TETRIX, car ils s'usent très facilement. Certains engrenages REV sont fabriqués en Delrin, un plastique autolubrifiant. Il s'agit d'un matériau durable, mais il faut garder à l'esprit qu'il est très possible de dénuder l'alésage avec un engrenage en plastique. Nous conseillons donc d'utiliser le REV Hex Hub Strengthener pour éviter d'endommager l'alésage des engrenages en Delrin.
zh_cn: 齿轮由不同的材料制成，最常见的是7075铝。永远不要将塑料和金属齿轮啮合在一起。将不同类型的金属齿轮啮合在一起是可以接受的，只要它们具有相同的直径间距。建议远离TETRIX铝齿轮，因为它们很容易磨损。一些REV齿轮由自润滑塑料聚甲醛树脂制成。这是一种耐用的材料，但请记住，使用塑料齿轮剥离孔是很有可能的。因此，我们建议使用REV六角轮毂加强器来避免剥离聚甲醛树脂齿轮上的孔。

source: Bevel gears are a special type of gear that allows power transmission in two different planes. It is especially useful in tight spaces where a regular motor mounting position would not work.
es_mx: Los engranajes cónicos son un tipo especial de engranaje que permite la transmisión de potencia en dos planos diferentes. Es especialmente útil en espacios reducidos en los que una posición normal de montaje del motor no funcionaría.
fr_ca: Les engrenages coniques sont un type spécial d'engrenage qui permet la transmission de puissance dans deux plans différents. Il est particulièrement utile dans les espaces restreints où une position de montage normale du moteur ne fonctionnerait pas.
zh_cn: 伞形齿轮是一种特殊类型的齿轮，允许在两个不同的平面上进行动力传输。在常规电机安装位置不起作用的狭小空间中，它特别有用。

source: Pitch Diameter Calculation
es_mx: Cálculo del diámetro de paso
fr_ca: Calcul du diamètre du pas
zh_cn: 节圆直径计算

source: PD = Module * Number\ of\ Teeth DP = \frac{Number\ of\ Teeth}{PD} PD = OD - (2 * Module)
es_mx: PD = Módulo * Número de dientes DP = \frac{Número de dientes}{PD} PD = OD - (2 * Módulo)
fr_ca: PD = Module * Nombre\ de\ dents DP = \frac{Nombre\ de\ dents}{PD} PD = OD - (2 * Module)
zh_cn: 分度圆直径 = 模数 * 齿数 径节=齿数/分度圆直径 分度圆直径=外径-(2*模数)

source: Pitch circle refers to an imaginary circle that contacts the pitch circle of any other gear with which it is in mesh. Basically, each gear has a pitch circle. When gear 1 is meshed with gear 2, the pitch circles of both gears should touch exactly in the middle of where the teeth interlock with each other.
es_mx: El círculo de paso es un círculo imaginario que está en contacto con el círculo de paso de cualquier otra rueda dentada con la que esté engranada. Básicamente, cada rueda dentada tiene un círculo de paso. Cuando el engranaje 1 está engranado con el engranaje 2, los círculos de paso de ambos engranajes deben tocarse exactamente en el centro del punto en el que los dientes se entrelazan entre sí.
fr_ca: Le cercle primitif est un cercle imaginaire qui entre en contact avec le cercle primitif de tout autre engrenage avec lequel il est en prise. En principe, chaque engrenage possède un cercle primitif. Lorsque l'engrenage 1 est engrené avec l'engrenage 2, les cercles primitifs des deux engrenages doivent se toucher exactement au milieu de l'endroit où les dents s'emboîtent l'une dans l'autre.
zh_cn: 节距圆是指一个假想的圆，它与与其啮合的任何其他齿轮的节距圆接触。基本上，每个齿轮都有一个节距圆。当齿轮1与齿轮2啮合时，两个齿轮的节距圆应该正好接触到齿相互联锁的中间。

source: Meshing Gears
es_mx: Engranajes Engranados
fr_ca: Maillage des engrenages
zh_cn: 啮合齿轮

source: Mesh
es_mx: Engranar
fr_ca: Maille
zh_cn: 啮合

source: Meshing refers to the overlapping contact between a gear tooth and another gear tooth, chain and sprocket, or belt and pulley.
es_mx: El engrane se refiere al contacto solapado entre un diente de engranaje y otro diente de engranaje, cadena y rueda dentada, o correa y polea.
fr_ca: L'engrènement désigne le contact par chevauchement entre une dent d'engrenage et une autre dent d'engrenage, une chaîne et un pignon, ou une courroie et une poulie.
zh_cn: 啮合是指一个齿轮齿与另一个齿轮齿、链条与链轮或皮带与皮带轮的重叠接触。

source: A proper mesh is essential to ensure maximum torque transmission. Too little mesh can result in no power transfer, derailment or gears grinding/wearing down faster. Too much mesh can produce unwanted friction and introduce inefficiencies within the drive system.
es_mx: Un engrane adecuado es esencial para garantizar la máxima transmisión de torque. Un engrane demasiado pequeño puede hacer que no se transmita potencia, que se descarrilen o que los engranajes se desgasten más rápido. Demasiado engrane puede producir fricción no deseada e introducir ineficiencias en el sistema de transmisión.
fr_ca: Un bon engrènement est essentiel pour assurer une transmission maximale du couple. Un engrènement trop faible peut entraîner une absence de transfert de puissance, un déraillement ou un grincement/une usure plus rapide des engrenages. Un engrènement trop important peut produire des frottements indésirables et introduire des inefficacités dans le système d'entraînement.
zh_cn: 适当的啮合对于确保最大扭矩传递至关重要。啮合太少会导致没有动力传递、脱轨或齿轮磨削/磨损更快。过多的啮合会产生不必要的摩擦，并在驱动系统中引入低效率。

source: When meshing gears, it is important that the gears are not too loose nor too tight. If the gears are too loose, the teeth will easily wear out, decreasing its longevity. If the gears are too tight, however, they will have too much friction and possibly grind or bind up. The ideal way to mesh gears are to make sure the teeth interlock and just touch the base of the gear.
es_mx: Al engranar engranajes, es importante que éstos no estén ni demasiado sueltos ni demasiado apretados. Si los engranajes están demasiado flojos, los dientes se desgastarán fácilmente, disminuyendo su longevidad. Sin embargo, si los engranajes están demasiado apretados, tendrán demasiada fricción y es posible que rechinen o se atasquen. La forma ideal de engranar los engranajes es asegurarse de que los dientes se entrelazan y apenas toquen la base del engranaje.
fr_ca: Lors de l'engrènement, il est important que les engrenages ne soient ni trop lâches ni trop serrés. Si les engrenages sont trop lâches, les dents s'useront facilement, ce qui réduira leur longévité. En revanche, si les engrenages sont trop serrés, ils auront trop de friction et risqueront de se gripper ou de s'enliser. L'idéal est de s'assurer que les dents s'emboîtent et touchent juste la base de l'engrenage.
zh_cn: 啮合齿轮时，重要的是齿轮不要太松也不要太紧。如果齿轮太松，牙齿很容易磨损，降低其寿命。然而，如果齿轮太紧，它们会有太多的摩擦力，可能会磨碎或粘合。齿轮啮合的理想方法是确保齿互锁，只需接触齿轮的底部。

source: If possible, it's best to avoid meshing gears with a clamping motor mount -- due to the sensitivity of the mesh, even the slightest movement of the motor inside the clamping mount can cause the gears to slip or damage each other.
es_mx: Si es posible, es mejor evitar engranar engranajes con un soporte de motor de sujeción: debido a la sensibilidad del engrane, incluso el más mínimo movimiento del motor dentro del soporte de sujeción puede hacer que los engranajes patinen o se dañen entre sí.
fr_ca: Dans la mesure du possible, il est préférable d'éviter d'engrener des engrenages avec un support de moteur à serrage - en raison de la sensibilité de l'engrènement, le moindre mouvement du moteur à l'intérieur du support de serrage peut faire glisser les engrenages ou les endommager l'un l'autre.
zh_cn: 如果可能，最好避免与夹紧电机支架啮合齿轮-由于啮合的敏感性，即使电机在夹紧支架内最轻微的移动也会导致齿轮滑动或相互损坏。

source: Calculating center-to-center distances using gears is quite simple. In order to calculate the desired center distance between two given gears, you must know the number of teeth for each gear and the **diametral pitch** of your gears (the number of teeth per inch of the gear's diameter). With these two pieces of information, you can use the equation :math:`D=\frac{T_{1}+T_{2}}{P}`. In this equation, :math:`D` is the distance between the center of both gears, :math:`T_1` and :math:`T_2` are the number of teeth of each gear in question, and :math:`P` is the diametral pitch of the gears.
es_mx: El cálculo de distancias entre ejes mediante engranajes es bastante sencillo. Para calcular la distancia entre ejes deseada entre dos engranajes dados, debe conocer el número de dientes de cada engranaje y el **paso diametral** de sus engranajes (el número de dientes por pulgada del diámetro del engranaje). Con estos dos datos, puede utilizar la ecuación :math:`D=\frac{T_{1}+T_{2}}{P}`. En esta ecuación, :math:`D` es la distancia entre el centro de ambos engranajes, :math:`T_1` y :math:`T_2` son el número de dientes de cada engranaje en cuestión, y :math:`P` es el paso diametral de los engranajes.
fr_ca: Le calcul de l'entraxe à l'aide d'engrenages est assez simple. Pour calculer l'entraxe souhaité entre deux engrenages donnés, vous devez connaître le nombre de dents de chaque engrenage et le **pas diamétral** de vos engrenages (le nombre de dents par pouce de diamètre de l'engrenage). Avec ces deux informations, vous pouvez utiliser l'équation :math:`D=\frac{T_{1}+T_{2}}{P}`. Dans cette équation, :math:`D` est la distance entre les centres des deux engrenages, :math:`T_1` et :math:`T_2` sont le nombre de dents de chaque engrenage en question, et :math:`P` est le pas diamétral des engrenages.
zh_cn: 使用齿轮计算中心到中心的距离非常简单。为了计算两个给定齿轮之间所需的中心距离，您必须知道每个齿轮的齿数和齿轮的径向间距（齿轮直径每英寸的齿数）。有了这两条信息，您可以使用等式D=（T1+T2）/P。在这个等式中，D是两个齿轮中心之间的距离，T1和T2是每个有问题的齿轮的齿数，P是齿轮的径向间距。

source: The **module** (abbreviated **MOD**) of a gear is used similarly to diametral pitch. It is the number of millimeters of the gear's diameter per tooth of the gear. The equation to find center distance :math:`D` is :math:`D = \frac{(T_{1} + T_{2}) * M}{2}`, where :math:`T_{1}` and :math:`T_2` are the number of teeth of each gear in question, and :math:`M` is the module of the gear.
es_mx: El **módulo** (abreviado **MOD**) de un engranaje se utiliza de forma similar al paso diametral. Es el número de milímetros del diámetro del engranaje por diente del engranaje. La ecuación para hallar la distancia entre ejes :math:`D` es :math:`D = \frac{(T_{1} + T_{2}) * M}{2}`, donde :math:`T_{1}` y :math:`T_2` son el número de dientes de cada engranaje en cuestión, y :math:`M` es el módulo del engranaje.
fr_ca: Le **module** (abrégé **MOD**) d'un engrenage est utilisé de la même manière que le pas diamétral. Il s'agit du nombre de millimètres du diamètre de l'engrenage par dent de l'engrenage. L'équation pour trouver l'entraxe :math:`D` est :math:`D = \frac{(T_{1} + T_{2}) * M}{2}`, où :math:`T_{1}` et :math:`T_2` sont le nombre de dents de chaque engrenage en question, et :math:`M` est le module de l'engrenage.
zh_cn: 齿轮的模数（缩写为MOD）与直径节距类似。它是齿轮每齿直径的毫米数。求中心距离D的方程是D=（T1+T2）*M/2，其中T1和T2是所讨论的每个齿轮的齿数，M是齿轮的模数。

source: Be sure to never :term:`mesh <Mesh>` gears that are not of the same diametral pitch. (A notable exception is 32 diametral pitch and 0.8 MOD gears. These are close enough to be perfectly fine.)
es_mx: Asegúrese de no utilizar nunca el :term:`engrane <Mesh>` de engranajes que no tengan el mismo paso diametral. (Una excepción notable son los engranajes de 32 de paso diametral y 0,8 de MOD. Estos están lo suficientemente cerca como para estar perfectamente bien).
fr_ca: Veillez à ne jamais :term:`mailler <Mesh>` des engrenages qui n'ont pas le même pas diamétral. (Une exception notable est constituée par les engrenages à pas diamétral de 32 et à MOD de 0,8. Ils sont suffisamment proches pour convenir parfaitement).
zh_cn: 请确保不要使用 :term:`mesh <Mesh>` 直径节距不相同的齿轮。(32直径节距和0.8MOD齿轮是一个明显的例外。这些齿轮非常紧密，完全没有问题）。

source: Additionally, it is possible to average the pitch diameters of the two gears to find the correct center-to-center distance.
es_mx: Además, es posible promediar los diámetros de paso de los dos engranajes para hallar la distancia correcta entre centros.
fr_ca: En outre, il est possible de faire la moyenne des diamètres primitifs des deux engrenages pour trouver l'entraxe correct.
zh_cn: 此外，可以平均两个齿轮的间距直径，以找到正确的中心到中心距离。

source: 2 correctly meshed gears floating midair in a render
es_mx: 2 engranajes correctamente engranados flotando en el aire en un render
fr_ca: 2 engrenages correctement engrenés flottant dans l'air dans un rendu
zh_cn: 在效果图中，2个正确啮合的齿轮漂浮在半空中

source: Correct gear mesh
es_mx: Engranaje correcto
fr_ca: Engrenage correct
zh_cn: 正确的齿轮啮合

source: As with sprockets, it is important to line up the gears so that they do not accidentally slip. Especially when using extrusion, it is possible that the gear may not be parallel to the extrusion, as the two supporting ends may not be perfectly in line with one another. It is imperative that the gear be lined up as straight as possible to prevent damage or gear binding.
es_mx: Al igual que con las ruedas dentadas, es importante alinear los engranajes para que no se deslicen accidentalmente. Especialmente cuando se utiliza extrusión, es posible que el engranaje no quede paralelo a la extrusión, ya que los dos extremos de apoyo pueden no estar perfectamente alineados entre sí. Es imperativo que el engranaje esté alineado lo más recto posible para evitar daños o que se atasque.
fr_ca: Comme pour les pignons, il est important d'aligner les engrenages afin qu'ils ne glissent pas accidentellement. En particulier lorsqu'il s'agit d'extrusion, il est possible que l'engrenage ne soit pas parallèle à l'extrusion, car les deux extrémités de support peuvent ne pas être parfaitement alignées l'une par rapport à l'autre. Il est impératif que l'engrenage soit aligné aussi droit que possible afin d'éviter tout dommage ou grippage de l'engrenage.
zh_cn: 与链轮一样，重要的是要将齿轮排成直线，以免意外打滑。特别是在使用挤压时，齿轮可能与挤压不平行，因为两个支撑端可能不完全一致。齿轮必须尽可能排成直线，以防止损坏或齿轮间形成高度差。

source: It is highly recommended to use white lithium grease or a similar lubricant between the gears to reduce friction and possible binding.
es_mx: Es muy recomendable utilizar grasa blanca de litio o un lubricante similar entre los engranajes para reducir la fricción y posibles atascos.
fr_ca: Il est fortement recommandé d'utiliser de la graisse blanche au lithium ou un lubrifiant similaire entre les engrenages afin de réduire les frottements et les risques de grippage.
zh_cn: 强烈建议在齿轮之间使用白色锂润滑脂或类似的润滑剂，以减少摩擦和可能的高低不平。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: **Gears are a solid and proven power transmission method**. Early examples of gears date back to the 4th century BC, so you're using technology with millennia of development behind it. When it comes to gears, there's not much that we haven't figured out.
es_mx: **Los engranajes son un método de transmisión de potencia sólido y probado**. Los primeros ejemplos de engranajes se remontan al siglo IV a.C., por lo que estamos utilizando una tecnología con milenios de desarrollo a sus espaldas. Cuando se trata de engranajes, no hay mucho que no hayamos descubierto.
fr_ca: **Les engrenages sont une méthode de transmission de puissance solide et éprouvée**. Les premiers exemples d'engrenages remontent au 4e siècle avant J.-C., ce qui signifie que vous utilisez une technologie vieille de plusieurs millénaires. En matière d'engrenages, il n'y a pas grand-chose que nous n'ayons pas encore compris.
zh_cn: 齿轮是一种可靠且经过验证的动力传动方法。齿轮的早期例子可以追溯到4世纪BC，所以你使用的技术背后有几千年的发展。说到齿轮，我们没有什么不知道的。

source: **Gears are simple to use with both channel and extrusion**. On channel, your gears are already spaced correctly - you just need to choose the right pair of gears. Extrusion gives you even more flexibility - just slide your gears into mesh, and you can have whatever ratio you want.
es_mx: **Los engranajes son fáciles de usar tanto en canal como en extrusión**. En el canal, los engranajes ya están espaciados correctamente: sólo tienes que elegir el par de engranajes adecuado. La extrusión ofrece aún más flexibilidad: basta con deslizar los engranajes para engranarlos y obtener la relación que desees.
fr_ca: **Les engrenages sont simples à utiliser, que ce soit avec des profilés ou des profilés extrudés**. Sur le canal, vos engrenages sont déjà correctement espacés - il vous suffit de choisir la bonne paire d'engrenages. L'extrusion vous offre encore plus de flexibilité - il vous suffit de faire glisser vos engrenages pour qu'ils s'engrènent, et vous pouvez obtenir le rapport que vous souhaitez.
zh_cn: 齿轮很容易与通道和挤压一起使用。在通道上，你的齿轮已经间隔正确——你只需要选择合适的齿轮对。挤压给你更大的灵活性——只需将齿轮滑入啮合，你就可以拥有任何你想要的比例。

source: **Gears can give you big reductions in small areas**. Depending on the gear combination, one can achieve big ratios in reduction in very small spaces (for example, a 10 tooth gear and a 100 tooth gear will take much less space than a 10 tooth sprocket and a 100 tooth sprocket).
es_mx: **Los engranajes pueden proporcionar grandes reducciones en espacios reducidos**. Dependiendo de la combinación de engranajes, se pueden conseguir grandes ratios de reducción en espacios muy reducidos (por ejemplo, un engranaje de 10 dientes y otro de 100 ocuparán mucho menos espacio que un piñón de 10 dientes y otro de 100).
fr_ca: **Les engrenages permettent d'obtenir de grandes réductions dans de petits espaces**. En fonction de la combinaison d'engrenages, il est possible d'obtenir de grands rapports de réduction dans des espaces très réduits (par exemple, un engrenage de 10 dents et un engrenage de 100 dents prendront beaucoup moins de place qu'un pignon de 10 dents et un pignon de 100 dents).
zh_cn: 齿轮可以给你大减少在小区域，根据齿轮组合，一个可以实现大比例的减少在非常小的空间（例如，一个10齿齿轮和100齿齿轮将采取少得多的空间比10齿链轮和100齿链轮）。
