Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/motion-mounting.po
Languages: es_mx, fr_ca, zh_cn

source: Motion Mounting
es_mx: Montaje de Movimiento
fr_ca: Système de transmission
zh_cn: 运动安装

source: When mounting a mechanism, it is important to know how to transfer power to it. There are many ways of accomplishing this using an axle.
es_mx: Al montar un mecanismo, es importante saber cómo transferirle potencia. Hay muchas formas de conseguirlo utilizando un eje.
fr_ca: Lors du montage d'un mécanisme, il est important de savoir comment lui transférer de la puissance. Il existe de nombreuses façons d'y parvenir à l'aide d'un essieu.
zh_cn: 在安装机械装置时，了解如何将动力传递给机械装置非常重要。有许多方法可以利用轴来实现这一目的。

source: Live Axle
es_mx: Eje vivo
fr_ca: Essieu moteur
zh_cn: 活轴

source: Term
es_mx: Término
fr_ca: Définition
zh_cn: 术语

source: The simplest method of power transmission is called "Live Axle". In this case, the mechanism is physically mounted on a powered axle: **when the axle turns, the mechanism turns with it**. The mechanism on the axle generally is mounted to a hub or pattern adaptor which transmits power from the axle. For this reason, live axle is generally recommended when powering multiple things together on one axle.
es_mx: El método más sencillo de transmisión de potencia se denomina "eje motor". En este caso, el mecanismo está montado físicamente sobre un eje accionado: **Cuando el eje gira, el mecanismo gira con él**. El mecanismo en el eje generalmente está montado en un buje o adaptador de patrón que transmite la potencia desde el eje. Por esta razón, generalmente se recomienda el eje accionado cuando se accionan varias cosas juntas en un eje.
fr_ca: La méthode la plus simple de transmission de la puissance est appelée "essieu moteur". Dans ce cas, le mécanisme est physiquement monté sur un essieu moteur : **lorsque l'essieu tourne, le mécanisme tourne avec lui**. Le mécanisme sur l'essieu est généralement monté sur un moyeu ou un adaptateur de modèle qui transmet la puissance à partir de l'essieu. C'est pourquoi il est généralement recommandé d'utiliser un essieu moteur pour alimenter plusieurs éléments sur un même essieu.
zh_cn: 最简单的动力传输方式称为 "活轴"。在这种情况下，机械装置实际安装在动力轴上：当轴转动时，机械装置也随之转动。轮轴上的机械装置一般安装在 hub 或模式适配器上，由轮轴传输动力。因此，当在一根轴上为多个装置提供动力时，一般建议使用活轴。

source: This method of power transmission is most commonly used on mechanisms that are mounted directly on a motor, as well as some mechanisms like intakes.
es_mx: Este método de transmisión de potencia es el más utilizado en los mecanismos que se montan directamente sobre un motor, así como en algunos mecanismos como los intakes.
fr_ca: Cette méthode de transmission de la puissance est le plus souvent utilisée sur les mécanismes qui sont montés directement sur un moteur, ainsi que sur certains mécanismes comme les prises d'air.
zh_cn: 这种动力传输方式最常用于直接安装在电机上的机械装置以及一些机械装置（如吸入拾取装置）。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Simplest power transmission to build
es_mx: La transmisión de potencia más sencilla de construir
fr_ca: La transmission de puissance la plus simple à construire
zh_cn: 最简单的动力传输系统

source: Buildable with any COTS system
es_mx: Construible con cualquier sistema COTS
fr_ca: Constructible avec n'importe quel système COTS
zh_cn: 可与任何 COTS 系统一起构建

source: Can power several mechanisms on the same axle together easily
es_mx: Puede accionar varios mecanismos del mismo eje a la vez con facilidad
fr_ca: Peut facilement alimenter plusieurs mécanismes sur le même axe
zh_cn: 可轻松为同一轴上的多个机构提供动力

source: Can be used directly off of a motor shaft
es_mx: Puede utilizarse directamente del eje de un motor
fr_ca: Peut être utilisé directement sur l'arbre d'un moteur
zh_cn: 可直接在电机轴上使用

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 缺点

source: Can physically take up more space (bearings needed on either side of a shaft)
es_mx: Puede ocupar físicamente más espacio (rodamientos necesarios a ambos lados de un eje)
fr_ca: Peut prendre physiquement plus de place (roulements nécessaires de part et d'autre d'un arbre)
zh_cn: 实际占用空间较大（轴的两侧都需要轴承）

source: Usually requires some form of :doc:`/docs/common-mechanisms/power-transmission/shaft-retention` to prevent the shaft from moving
fr_ca: Il faut généralement une forme de :doc:`/docs/common-mechanisms/power-transmission/shaft-retention` pour empêcher l'arbre de bouger
zh_cn: 通常需要某种形式的 :doc:`/docs/common-mechanisms/power-transmission/shaft-retention` 来防止轴移动

source: Dead Axle
es_mx: Eje muerto
fr_ca: Essieu mort
zh_cn: 固定轴

source: Another form of power transmission is called "Dead Axle". In a dead axle setup, the mechanism is mounted on a fixed axle via bearings: **it is free to spin around the axle**. This method requires the power transmission to be physically bolted to the mechanism, because the axle itself will not rotate. For this reason, dead axle is generally recommended when powering one thing that is between two plates, as the axle itself can serve as a standoff to provide support between the plates.
es_mx: Otra forma de transmisión de potencia se denomina "eje muerto". En una configuración de eje muerto, el mecanismo está montado sobre un eje fijo mediante rodamientos: **Es libre de girar alrededor del eje**. Este método requiere que la transmisión de potencia esté físicamente atornillada al mecanismo, ya que el propio eje no girará. Por esta razón, el eje muerto se recomienda generalmente cuando se acciona una cosa que está entre dos placas, ya que el propio eje puede servir como un separador para proporcionar apoyo entre las placas.
fr_ca: Une autre forme de transmission de puissance est appelée "Essieu Mort". Dans une configuration d'essieu mort, le mécanisme est monté sur un essieu fixe par l'intermédiaire de roulements : **il est libre de tourner autour de l'axe**. Cette méthode exige que la transmission de puissance soit physiquement boulonnée au mécanisme, car l'essieu lui-même ne tourne pas. Pour cette raison, l'axe mort est généralement recommandé lorsqu'il s'agit d'alimenter un élément situé entre deux plaques, car l'axe lui-même peut servir de support entre les plaques.
zh_cn: 另一种动力传输方式称为 固定轴。在固定轴装置中，机械装置通过轴承安装在固定轴上：它可以绕轴自由旋转。这种方法需要将动力传动装置用螺丝固定在机械装置上，因为轴本身不会旋转。因此，位于两块板之间的一个物体提供动力时，通常建议使用固定轴，因为轴本身可以作为支座，为两块板之间提供支撑。

source: Simple power transmission with custom building
es_mx: Transmisión de potencia sencilla con construcción a medida
fr_ca: Une transmission de puissance simple avec une construction sur mesure
zh_cn: 简单的电力传输与定制搭建

source: Axle can be used as a standoff support between different plates
es_mx: El eje puede utilizarse como soporte de separación entre diferentes placas
fr_ca: L'axe peut être utilisé comme support d'écartement entre différentes plaques.
zh_cn: 轴可用作不同板之间的支架

source: Can require less parts then a live axle setup
es_mx: Puede requerir menos piezas que una configuración de eje vivo
fr_ca: Peut nécessiter moins de pièces qu'une configuration d'essieu vivant
zh_cn: 可能需要比活轴设置更少的零件

source: Harder to transmit power over a long shaft
es_mx: Es más difícil transmitir potencia a través de un eje largo
fr_ca: Difficile de transmettre la puissance sur un arbre long
zh_cn: 很难通过长轴传递能量

source: Usually limited to powering mechanisms between two parallel plates
es_mx: Normalmente se limita a accionar mecanismos entre dos placas paralelas
fr_ca: Généralement limité à l'alimentation de mécanismes entre deux plaques parallèles
zh_cn: 通常仅限于两个平行板之间的动力机构

source: Zombie Axle (Coaxial)
es_mx: Eje Zombie (Coaxial)
fr_ca: Essieu zombie (coaxial)
zh_cn: 僵尸轴（同轴）

source: Zombie Axle
es_mx: Eje Zombie
fr_ca: Essieu zombie
zh_cn: 僵尸车轴

source: Zombie axle is when one shaft serves as a dead axle for one mechanism and a live axle for another mechanism. This means **one mechanism is mounted on the shaft via bearings, but the shaft is free to rotate independently to power a second mechanism**. This setup can be used to transmit power to two things using the same revolution point, making it easy to power mechanisms like arms with intakes, or suspension drivetrain pods. Zombie Axle is only recommended when two mechanisms must be powered coaxially to each other.
es_mx: Se habla de eje zombie cuando un eje sirve de eje muerto para un mecanismo y de eje vivo para otro mecanismo. Esto significa que **un mecanismo está montado en el eje a través de rodamientos, pero el eje es libre de girar de forma independiente para alimentar un segundo mecanismo**. Esta configuración se puede utilizar para transmitir potencia a dos cosas utilizando el mismo punto de revolución, por lo que es fácil de alimentar mecanismos como brazos con intakes, o cápsulas de suspensión del chasis. El eje zombie sólo se recomienda cuando dos mecanismos deben ser alimentados coaxialmente entre sí.
fr_ca: L’axe Zombie correspond à un arbre qui sert d’axe mort pour un mécanisme et d’axe moteur pour un autre mécanisme. Cela signifie **qu’un mécanisme est monté sur l’arbre via des roulements, mais que l’arbre peut tourner librement pour entraîner un second mécanisme.** Cette configuration permet de transmettre la puissance à deux éléments en utilisant le même point de rotation, ce qui facilite l’alimentation de mécanismes comme des bras avec des intakes ou des modules de suspension du train de roulement. L’axe zombie n’est recommandé que lorsque deux mécanismes doivent être entraînés coaxialement.
zh_cn: 僵尸轴是指一个轴作为一个机构的死轴和另一个机构的活轴。这意味着一个机构通过轴承安装在轴上，但轴可以自由独立旋转以为第二个机构提供动力这种设置可用于使用相同的转点将动力传递给两个物体，从而很容易为带进气口的机械臂或悬挂传动系统吊舱等机构提供动力。只有当两个机构必须相互同轴供电时，才建议使用僵尸轴。

source: Only power transmission method that can power two mechanisms on the same revolution point
es_mx: Único método de transmisión de potencia que puede accionar dos mecanismos en el mismo punto de revolución.
fr_ca: Seule méthode de transmission de puissance permettant d'alimenter deux mécanismes sur le même point de révolution
zh_cn: 唯一能在同一旋转点为两个机构提供动力的动力传输方式

source: Has the disadvantages of both live and dead axle
es_mx: Tiene las desventajas del eje vivo y del eje muerto
fr_ca: Présente les inconvénients de l'essieu moteur et de l'essieu traîné.
zh_cn: 有活轴和死轴的缺点

source: More mechanically complex
es_mx: Mayor complejidad mecánica
fr_ca: Plus complexe sur le plan mécanique
zh_cn: 机械上更复杂
