Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/power-transmission-glossary.po
Languages: es_mx, fr_ca, zh_cn

source: Power Transmission Glossary
es_mx: Glosario de transmisión de potencia
fr_ca: Glossaire de la transmission de puissance
zh_cn: 动力传动术语表

source: Center to center (C2C) refers to the distance between the centers of a pair of :term:`sprockets <Sprocket>`, pulleys or :term:`gears <Gear>`. This will affect :term:`chain <Chain>`/:term:`belt <Timing Belt>` tension and gear meshing, so calculating this correctly is essential.
es_mx: Centro a centro (C2C) se refiere a la distancia entre los centros de un par de :term:`piñones <Sprocket>`, poleas o :term:`engranajes <Gear>`. Esto afectará a la tensión de la :term:`cadena <Chain>`/:term:`correa dentada<Timing Belt>` y al engrane de los engranajes, por lo que es esencial calcularlo correctamente.
fr_ca: L'entraxe (C2C) désigne la distance entre les centres d'une paire de :term:`pignons <Sprocket>`, de poulies ou de :term:`engrenages <Gear>`. Cette distance affecte la tension de la :term:`chaîne <Chain>`/:term:`courroie <Timing Belt>` et l'engrènement des engrenages, c'est pourquoi il est essentiel de la calculer correctement.
zh_cn: 中心到中心 (C2C) 是指一对 :term:` 链轮 <Sprocket>`、滑轮或 :term:` 齿轮 <Gear>` 的中心之间的距离。这将影响 :term:`链条 <Chain>`/:term:`皮带 <Timing Belt>` 张力和齿轮啮合，因此正确计算至关重要。

source: Clearance Diameter
es_mx: Diámetro libre
fr_ca: Diamètre de dégagement
zh_cn: 净空直径

source: The clearance diameter is the diameter of the imaginary circle that contains the entire pulley, sprocket, or gear. For pulleys and sprockets, this includes the belt or chain on the component. Clearance diameter is used to check for interferences with other mechanisms. It is usually larger then :term:`Pitch Diameter (PD)` and :term:`Outside Diameter (OD)`
es_mx: El diámetro libre es el diámetro del círculo imaginario que contiene toda la polea, piñon o engranaje. En el caso de poleas y piñones, esto incluye la correa o cadena del componente. El diámetro libre se utiliza para comprobar si hay interferencias con otros mecanismos. Suele ser mayor que el :term:`Diámetro de paso (PD)` y :term:`Diámetro exterior (OD)`.
fr_ca: Le diamètre de dégagement est le diamètre du cercle imaginaire qui contient l'ensemble de la poulie, du pignon ou de l'engrenage. Pour les poulies et les pignons, ce diamètre inclut la courroie ou la chaîne du composant. Le diamètre de dégagement est utilisé pour vérifier l'absence d'interférences avec d'autres mécanismes. Il est généralement plus grand que :term:`Diamètre primitif (PD)` et :term:`Diamètre extérieur (OD)`
zh_cn: 净空直径是包含整个滑轮、链轮或齿轮的假想圆的直径。对于滑轮和链轮，这包括部件上的皮带或链条。间隙直径用于检查是否与其他机构发生干涉。它通常大于 :term:`Pitch Diameter (PD)` 和 :term:`Outside Diameter (OD)` 。

source: GT2 Belt
es_mx: Cinturón GT2
fr_ca: Courroie GT2
zh_cn: GT2 同步带

source: GT2 belt is a type of synchronous timing belt commonly used on drivetrains and other mechanisms. Its available in different widths and pitches, although the most common is GT2 3mm (3mm :term:`Pitch`), compatible with REV Robotics :term:`COTS` Pulleys. See :term:`Timing Belt`
es_mx: La correa GT2 es un tipo de correa dentada síncrona utilizada habitualmente en chasises y otros mecanismos. Está disponible en diferentes anchuras y pasos, aunque la más común es GT2 3mm (3mm :term:`Pitch`), compatible con las poleas :term:`COTS` de REV Robotics. Ver :term:`Correas dentadas`.
fr_ca: La courroie GT2 est un type de courroie synchronisée couramment utilisée sur les chaînes cinématiques et autres mécanismes. Elle est disponible en différentes largeurs et pas, mais la plus courante est la GT2 3mm (3mm :term:`Pas`), compatible avec les poulies REV Robotics :term:`COTS`. Voir :term:`Courroie de réglage`
zh_cn: GT2 皮带是一种同步定时皮带，常用于传动系统和其他机构。它有不同的宽度和间距，但最常见的是 GT2 3mm（3mm :term: `间距`），与 REV Robotics 的 :term: `COTS`滑轮兼容。请参阅 :term: `定时皮带` 。

source: HTD Belt
es_mx: Correa HTD
fr_ca: Courroie HTD
zh_cn: HTD 同步带

source: HTD belt is a type of synchronous timing belt commonly used on drivetrains. It is available in different widths to accommodate different sized pulleys. The most common is HTD3 (3mm :term:`Pitch`) and HTD5 (5mm :term:`Pitch`) belts, as these are compatible with goBILDA :term:`COTS` pulleys. See :term:`Timing Belt`
es_mx: La correa HTD es un tipo de correa dentada síncrona que se utiliza habitualmente en chasises. Está disponible en diferentes anchuras para adaptarse a poleas de diferentes tamaños. Las más comunes son las correas HTD3 (3mm :term:`Pitch`) y HTD5 (5mm :term:`Pitch`), ya que son compatibles con las poleas goBILDA :term:`COTS`. Ver :term:`Correas dentadas
fr_ca: La courroie HTD est un type de courroie de distribution synchrone couramment utilisé sur les chaînes cinématiques. Elle est disponible en différentes largeurs pour s'adapter à des poulies de différentes tailles. Les courroies HTD3 (3mm :term:`Pitch`) et HTD5 (5mm :term:`Pitch`) sont les plus courantes, car elles sont compatibles avec les poulies goBILDA :term:`COTS`. Voir :term:`Courroie de réglage`
zh_cn: HTD 皮带是一种同时同步带，通常用于传动系统。它有不同的宽度，以适应不同尺寸的带轮。最常见的是 HTD3（3 毫米 :term:`Pitch`) 和 HTD5（5 毫米 :term:`Pitch`) 皮带，因为它们与 goBILDA :term:` COTS` 滑轮兼容。请参阅 :term:` 定时皮带` 。

source: Idler
es_mx: Rodillo
fr_ca: Roue libre
zh_cn: 转向器

source: An idler :term:`gear <Gear>`, :term:`sprocket <Sprocket>`, or pulley is one that is purposely not used for driving anything else on the :term:`shaft <Shaft>`. The purpose of this idler is, in the case of gears, to transfer power to another direction.
es_mx: Un rodillo :term:`engranaje <Gear>`, :term:`piñon <Sprocket>`, o polea es aquella que no se utiliza a propósito para accionar nada más en el :term:`eje <Shaft>`. El propósito de esta polea es, en el caso de los engranajes, transferir potencia a otra dirección.
fr_ca: Un :term:`engrenage <Gear>`, :term:`pignon <Sprocket>` ou poulie libre est une poulie qui n'est volontairement pas utilisée pour entraîner quoi que ce soit d'autre sur l' :term:`arbre <Shaft>`. Dans le cas des engrenages, l'objectif de cette poulie est de transférer la puissance dans une autre direction.
zh_cn: 转向器 :term:` gear <Gear>`、:term:` sprocket <Sprocket>` 或滑轮是特意不用于驱动 :term:`shaft <Shaft>` 上任何其他东西的装置。就齿轮而言，惰轮的作用是将动力传递到另一个方向。

source: For :term:`chain <Chain>` and :term:`belt <Timing Belt>`, idlers are more common, and are usually adjustable to maintain tension.
es_mx: Para :term:`cadena <Chain>` y :term:`correa <Timing Belt>`, los rodillos tensores son más comunes, y suelen ser ajustables para mantener la tensión.
fr_ca: Pour :term:`chaîne <Chain>` et :term:`courroie <Timing Belt>`, les rouleaux sont plus courants et sont généralement réglables pour maintenir la tension.
zh_cn: 对于 :term:`chain <Chain>` 和 :term:`belt <Timing Belt>`，转向器更为常见，通常可调节以保持张力。

source: Loctite
zh_cn: 乐泰胶

source: Loctite is thread locking fluid used so that bolts do not come loose under use and vibration. Loctite should be applied to the threads of the bolts. There are two types of Loctite: blue, which is removable, and red, which is permanent (and we mean it).
zh_cn: 乐泰胶是一种螺纹锁固液，用于防止螺栓在使用和振动时松动。乐泰胶应涂在螺栓的螺纹上。乐泰胶有两种类型：蓝色，可拆卸；红色，永久性（我们是认真的）。

source: It is highly recommended that teams use Loctite on all motor and :term:`servo <Servo>` mounts, as well as any mechanism prone to vibration.
zh_cn: 强烈建议车队在所有电机和 :term: ` 舵机 <Servo>` 支架以及任何易振动的机构上使用 乐泰胶。

source: **THE BOTTLE COLOR AND THE FLUID COLOR ARE REVERSED.** When we refer to the "color", we mean the fluid color. Blue loctite usually comes in a red bottle.
zh_cn: ** 当我们提到 "颜色 "时，我们指的是液体的颜色。**蓝色乐泰胶通常装在红色瓶子里。

source: A red bottle containing blue (removable) loctite, and a blue bottle containing red (permament) loctite
zh_cn: 一个红色瓶子装有蓝色（可拆卸）乐泰胶，一个蓝色瓶子装有红色（永久型）乐泰胶

source: Blue Loctite (removable, in red tube), Red Loctite (permament, in blue tube)
zh_cn: 蓝色乐泰胶（可拆卸，装在红色管中），红色乐泰胶（永久性，装在蓝色管中）

source: Outside Diameter (OD)
es_mx: Diámetro exterior (OD)
fr_ca: Diamètre extérieur (OD)
zh_cn: 外径（OD）

source: The diameter of the imaginary circle traced by the outermost face of the teeth on a gear, sprocket, or pulley. This will be larger then the :term:`Pitch Diameter (PD)` for a gear, but smaller then the :term:`Pitch Diameter (PD)` for a pulley or sprocket.
es_mx: Diámetro del círculo imaginario trazado por la cara más externa de los dientes de un engranaje, piñon o polea. Será mayor que el :term:`Diámetro de paso (PD)` de un engranaje, pero menor que el :term:`Diámetro de paso (PD)` de una polea o piñon.
fr_ca: Le diamètre du cercle imaginaire tracé par la face extérieure des dents d'un engrenage, d'un pignon ou d'une poulie. Ce diamètre est plus grand que le :term:`Diamètre primitif (PD)` d'un engrenage, mais plus petit que le :term:`Diamètre primitif (PD)` d'une poulie ou d'un pignon.
zh_cn: 齿轮、链轮或滑轮最外侧齿面所描绘的假想圆的直径。它大于齿轮的 :term: `Pitch Diameter (PD)`，但小于滑轮或链轮的 :term: `Pitch Diameter (PD)`。

source: Pitch
es_mx: Paso
fr_ca: Pas
zh_cn: 间距

source: Pitch refers to the distance between the center of one tooth of a gear, sprocket, or pulley to another. In chains it refers to the distance from one pin to another, and in belts it refers to the distance betewen one groove to another.
es_mx: El paso se refiere a la distancia entre el centro de un diente de un engranaje, piñon o polea y otro. En las cadenas, se refiere a la distancia de un perno a otro, y en las correas, a la distancia entre una ranura y otra.
fr_ca: Le pas désigne la distance entre le centre d'une dent d'un engrenage, d'un pignon ou d'une poulie et celui d'une autre dent. Dans les chaînes, il s'agit de la distance entre un axe et un autre, et dans les courroies, de la distance entre une rainure et une autre.
zh_cn: 间距是指齿轮、链轮或滑轮的一个齿中心到另一个齿中心之间的距离。在链条中，它指一个销轴到另一个销轴之间的距离；在皮带中，它指一个槽到另一个槽之间的距离。

source: Pitch Diameter (PD)
es_mx: Diámetro de paso (PD)
fr_ca: Diamètre primitif (PD)
zh_cn: 间距直径 (PD)

source: An imaginary circle around a component used for various calculations. For gears, it is the imaginary circle that mates with any other gear's pitch diameter when the gears are properly spaced. For chain and belt, it is the circle which is traced by the middle of the belt or chain as the pulley or sprocket rotates. For gears, the pitch diameter will be smaller then the :term:`Outside Diameter (OD)`, but with chain and belts, the pitch diameter will be larger. :math:`PD = (tooth * pitch)/\pi`
es_mx: Círculo imaginario alrededor de un componente utilizado para diversos cálculos. En el caso de los engranajes, es el círculo imaginario que coincide con el diámetro de paso de cualquier otro engranaje cuando los engranajes están correctamente espaciados. En el caso de cadenas y correas, es el círculo trazado por el centro de la correa o cadena al girar la polea o piñon. En los engranajes, el diámetro de paso será menor que el :term:`Diámetro exterior (DE)`, pero en las cadenas y correas, el diámetro de paso será mayor. :math:`PD = (diente * paso)/\pi`.
fr_ca: Un cercle imaginaire autour d'un composant utilisé pour divers calculs. Pour les engrenages, il s'agit du cercle imaginaire qui correspond au diamètre primitif de tout autre engrenage lorsque les engrenages sont correctement espacés. Pour les chaînes et les courroies, il s'agit du cercle tracé par le milieu de la courroie ou de la chaîne lorsque la poulie ou le pignon tourne. Pour les engrenages, le diamètre primitif sera plus petit que le :term:`Diamètre extérieur (DO)`, mais pour les chaînes et les courroies, le diamètre primitif sera plus grand. :math:`PD = (dent * pas)/\pi`
zh_cn: 用于各种计算的部件周围的假想圆。对于齿轮来说，当齿轮间距适当时，它是与任何其他齿轮的节圆直径相匹配的假想圆。对于链条和皮带，它是皮带轮或链轮旋转时，皮带或链条中间所划过的圆。对于齿轮，节圆直径会小于 :term: `Outside Diameter (OD)`，但是对于链条和皮带，节圆直径会大一些。 :math: `PD = (tooth * pitch)/\pi`

source: Sprocket
es_mx: Piñón
fr_ca: Pignon
zh_cn: 链轮

source: A sprocket is a mechanical part that transfers power through its cogs, which fit into chain. It is similar to a :term:`gear <Gear>`, except that instead of meshing with another gear, the sprocket meshes with chain. See :term:`Chain`
es_mx: Un piñón es una pieza mecánica que transfiere potencia a través de sus dientes, que encajan en la cadena. Es similar a un :term:`engranaje <Gear>`, salvo que en lugar de engranar con otro engranaje, el piñón engrana con la cadena. Véase :term:`Cadena
fr_ca: Un pignon est une pièce mécanique qui transfère la puissance par l'intermédiaire de ses dents, qui s'insèrent dans une chaîne. Il est similaire à un :term:`engrenage <Gear>`, sauf qu'au lieu de s'engrener avec un autre engrenage, le pignon s'engrène avec une chaîne. Voir :term:`Chaîne`
zh_cn: 链轮是一种机械部件，通过与链条配合的齿轮传递动力。它类似于 :term: `齿轮 <Gear>`，只不过链轮不是与另一个齿轮啮合，而是与链条啮合。参见 :term: `Chain

source: A REV Robotics Delrin 20 Tooth #25 sprocket
es_mx: Un piñón REV Robotics Delrin 20 Dientes #25
fr_ca: Un pignon REV Robotics Delrin 20 dents #25
zh_cn: 一个 REV Robotics Delrin 20 齿 #25 链轮

source: Delrin 20 Tooth #25 sprocket
es_mx: Piñón Delrin 20 Dientes #25
fr_ca: Pignon Delrin 20 dents #25
zh_cn: Delrin 20 齿 #25 链轮
