Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/power-transmission/shaft-retention.po
Languages: es_mx, fr_ca, zh_cn

source: Shaft Retention
es_mx: Retención del eje
fr_ca: Rétention de l'arbre
zh_cn: 轴固定

source: If you are powering any mechanism with a :term:`live axle <Live Axle>` system, you will need a way to retain the shaft so that it does not move axially (along its length). It is necessary to constrain movement in both directions, and two methods can be mixed and matched on one shaft. Generally, this is done by having something contact the bearing's inner race that is constrained axially on the shaft. It is important to make sure the bearings themselves are also constrained.
es_mx: Si va a accionar cualquier mecanismo con un sistema :term:`eje vivo<Live Axle>`, necesitará una forma de retener el eje para que no se mueva axialmente (a lo largo de su longitud). Es necesario restringir el movimiento en ambas direcciones, y se pueden mezclar y combinar dos métodos en un eje. Generalmente, esto se consigue haciendo que algo entre en contacto con el anillo interior del rodamiento que está limitado axialmente en el eje. Es importante asegurarse de que los propios rodamientos también están limitados.
fr_ca: Si vous alimentez un mécanisme avec un système :term:`axe vivant <Live Axle>`, vous aurez besoin d'un moyen de retenir l'arbre afin qu'il ne se déplace pas axialement (sur sa longueur). Il est nécessaire de limiter les mouvements dans les deux sens, et deux méthodes peuvent être combinées sur un même arbre. En général, il faut que quelque chose entre en contact avec la bague intérieure du roulement qui est contraint axialement sur l'arbre. Il est important de s'assurer que les roulements eux-mêmes sont également contraints.
zh_cn: 如果使用 :term:`live axle<Live Axle>` 系统为任何机构提供动力，则需要一种方法来固定轴，使其不会沿轴向（其长度方向）移动。有必要对两个方向的运动进行限制，可以在一根轴上混合使用两种方法。一般来说，要做到这一点，需要有东西接触轴上轴向受限的轴承内圈。重要的是要确保轴承本身也受到约束。

source: Make sure to use an appropriately sized shim/washer between the thing retaining the shaft and the bearing, such that it only touches the bearings inner race. Otherwise, the rubbing will lead to inefficiency.
es_mx: Asegúrese de utilizar una cuña/arandela del tamaño adecuado entre el elemento que sujeta el eje y el rodamiento, de forma que sólo toque el anillo interior del rodamiento. De lo contrario, el rozamiento provocará ineficacia.
fr_ca: Veillez à utiliser une cale/rondelle de taille appropriée entre l'élément qui retient l'arbre et le roulement, de manière à ce qu'elle n'entre en contact qu'avec la bague intérieure du roulement. Dans le cas contraire, le frottement entraînera un manque d'efficacité.
zh_cn: 确保在固定轴和轴承之间使用适当尺寸的垫片/垫圈，使其仅接触轴承内圈。否则，摩擦将导致效率低下。

source: Outlined below are some common methods FTC teams use for shaft retention.
es_mx: A continuación se describen algunos métodos comunes que utilizan los equipos de la FTC para la retención de los ejes.
fr_ca: Voici quelques méthodes couramment utilisées par les équipes de la FTC pour conserver les arbres.
zh_cn: 下面概述了 FTC 团队用于固定轴的一些常用方法。

source: Shaft Collars
es_mx: Collares de eje
fr_ca: Colliers d’arbre
zh_cn: 轴环

source: Shaft collars are fitted onto a shaft in order to secure it. There are two primary types: set screw collars and clamping collars.
es_mx: Los collarines se colocan en un eje para fijarlo. Existen dos tipos principales: los collarines con tornillos de fijación y los collarines de sujeción.
fr_ca: Les colliers d'arbre sont montés sur un arbre afin de le sécuriser. Il en existe deux types principaux : les colliers à vis de réglage et les colliers de serrage.
zh_cn: 轴环安装在轴上以固定轴。主要有两种类型：固定螺丝轴环和夹紧轴环。

source: Set Screw Collars
es_mx: Collares roscados
fr_ca: Colliers à vis de réglage
zh_cn: 固定螺丝轴环

source: A set screw collar with a grub screw.
es_mx: Un collarín con tornillo prisionero.
fr_ca: Un collier à vis de réglage avec une vis sans tête.
zh_cn: 固定螺丝轴环，带一个防松螺丝。

source: Set screw collars use a set screw (typically a grub screw) to tighten down onto the shaft. While set screw collars are cheap and readily available, there are some disadvantages. The screw digs into the shaft, creating a raised burr, making it difficult to remove/adjust the collar or to use the shaft for something else in the future.
es_mx: Los collares roscados utilizan un tornillo de fijación (normalmente un tornillo prisionero) para apretar el eje. Aunque son baratos y fáciles de conseguir, presentan algunas desventajas. El tornillo se clava en el eje, creando una rebaba, lo que dificulta la extracción/ajuste del collar o el uso del eje para otra cosa en el futuro.
fr_ca: Les colliers à vis de réglage utilisent une vis de réglage (généralement une vis sans tête) pour serrer l'arbre. Bien que les colliers à vis de blocage soient bon marché et facilement disponibles, ils présentent certains inconvénients. La vis s'enfonce dans l'arbre, créant une bavure, ce qui rend difficile le retrait/ajustement du collier ou l'utilisation ultérieure de l'arbre pour un autre usage.
zh_cn: 固定螺丝轴环使用一个固定螺丝（通常是一个防松螺丝）来拧紧轴。虽然固定螺丝轴环既便宜又容易获得，但也有一些缺点。螺丝会钻入轴中，形成一个凸起的毛刺，导致难以移除/调整轴环或将来将轴用于其他用途。

source: Clamping Collars
es_mx: Collares de sujeción
fr_ca: Colliers de serrage
zh_cn: 夹紧环

source: A clamping shaft collar.
es_mx: Un collar de sujeción del eje.
fr_ca: Un collier de serrage du manche.
zh_cn: 夹紧轴环。

source: A clamping shaft collar uses typical bolts to clamp the shaft, applying force all around the shaft instead of just in one place. They may or may not have a built-in shim to rest against a bearing race. They are generally recommended over set screw collars, especially for high-load applications. However, they do tend to be more expensive and larger.
es_mx: Un collarín de sujeción del eje utiliza pernos típicos para sujetar el eje, aplicando fuerza alrededor de todo el eje en lugar de sólo en un lugar. Pueden tener o no una cuña incorporada para apoyarse en el anillo de rodadura del rodamiento. Por lo general, se recomiendan más que los collarines con tornillos de fijación, especialmente para aplicaciones con cargas elevadas. Sin embargo, suelen ser más caros y grandes.
fr_ca: Un collier de serrage utilise des boulons typiques pour serrer l'arbre, appliquant une force tout autour de l'arbre au lieu d'un seul endroit. Il peut ou non comporter une cale intégrée pour s'appuyer sur la bague d'un roulement. Ils sont généralement recommandés par rapport aux colliers à vis de blocage, en particulier pour les applications à forte charge. Cependant, ils ont tendance à être plus chers et plus grands.
zh_cn: 夹紧轴环使用典型的螺栓夹紧轴，在轴的四周而不仅仅是一个地方施加力。这种轴环可能有内置垫片，也可能没有内置垫片，用于靠在轴承滚道上。一般推荐使用这种轴环，而不是固定螺钉轴环，尤其是在高负荷应用中。不过，它们往往更贵、更大。

source: Shaft Retaining Rings
es_mx: Anillos de retención del eje
fr_ca: Bagues de retenue du manche
zh_cn: 轴固定环

source: a shaft with a shaft retaining ring
es_mx: un eje con un anillo de retención del eje
fr_ca: un arbre avec une bague de retenue de l'arbre
zh_cn: 带轴卡环的轴

source: Shaft retaining rings clip into a groove in a shaft and provide a simple and compact way to retain it. Unlike collars, they cannot be moved along the shaft and are reliant on having a machined groove in the correct location. Many teams use E-clips, a type of retaining ring, with goBILDA's 8mm REX shafting, as it can be bought with an E-clip preinstalled.
es_mx: Los anillos de retención del eje se encajan en una ranura del eje y proporcionan una forma sencilla y compacta de retenerlo. A diferencia de los collares, no se pueden mover a lo largo del eje y dependen de tener una ranura mecanizada en la ubicación correcta. Muchos equipos utilizan E-clips, un tipo de anillo de retención, con el eje REX de 8 mm de goBILDA, ya que se puede comprar con un E-clip preinstalado.
fr_ca: Les bagues de retenue d'arbre se clipsent dans une rainure de l'arbre et constituent un moyen simple et compact de le retenir. Contrairement aux colliers, elles ne peuvent pas être déplacées le long de l'arbre et dépendent de la présence d'une rainure usinée au bon endroit. De nombreuses équipes utilisent des E-clips, un type d'anneau de retenue, avec l'arbre REX de 8 mm de goBILDA, car il peut être acheté avec un E-clip préinstallé.
zh_cn: 轴用卡环夹在轴的凹槽中，提供了一种简单紧凑的固定方式。与轴环不同的是，轴环不能沿轴移动，必须在正确的位置加工出凹槽。许多车队在使用 goBILDA 的 8 毫米 REX 传动轴时都会使用 E 形夹（一种卡环），因为在购买时已经预装了 E 形夹。

source: Bolts and Washers
es_mx: Pernos y arandelas
fr_ca: Boulons et rondelles
zh_cn: 螺栓和垫圈

source: When using a shaft with a threaded bore, you can use a bolt and washer on each end to retain it. It is important to use a thread locking compound to prevent the bolts from loosening over time.
es_mx: Si utiliza un eje con rosca, puede utilizar un perno y una arandela en cada extremo para retenerlo. Es importante utilizar un compuesto de bloqueo de roscas para evitar que los pernos se aflojen con el tiempo.
fr_ca: Lorsque vous utilisez un arbre avec un alésage fileté, vous pouvez utiliser un boulon et une rondelle à chaque extrémité pour le retenir. Il est important d'utiliser un produit de blocage des filets pour éviter que les boulons ne se desserrent avec le temps.
zh_cn: 使用带螺纹孔的轴时，可以在两端各使用一个螺栓和垫圈来固定。重要的是要使用螺纹锁紧剂，以防止螺栓随着时间的推移而松动。

source: 9804 Bomb Squad's H-Drive
fr_ca: Le H-Drive de Bomb Squad 9804
zh_cn: 9804 Bomb Squad 的 H 型底盘

source: 9804 Bomb Squad's Relic Recovery bot used bolts to retain its wheel shafts.
es_mx: El robot de Relic Recovery del Bomb Squad 9804 utilizaba pernos para sujetar los ejes de sus ruedas.
fr_ca: 9804 Bomb Squad's robot Relic Recovery utilisait des boulons pour maintenir ses arbres de roue.
zh_cn: 9804 Bomb Squad 在 Relic Recovery 赛季的机器人使用螺丝固定轮轴。
