Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/cad-tutorials.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: CAD Tutorials
es_mx: Tutoriales CAD
fr_ca: Tutoriels CAO
ro_ro: Tutoriale CAD
zh_cn: CAD教程

source: CAD Tutorial Part 1 - Drivetrain in an Hour
es_mx: Tutorial CAD Parte 1 - Chasis en una hora
fr_ca: Tutoriel CAO Partie 1 - Châssis en une heure
ro_ro: Tutorial CAD Partea 1 - Șasiu într-o Oră
zh_cn: CAD教程第1部分-一小时内的传动系统

source: Choosing the Drivetrain
es_mx: Elegir el chasis
fr_ca: Choisir le châssis
ro_ro: Alegerea șasiului
zh_cn: 选择传动系统

source: After learning your :term:`CAD <Computer-aided design (CAD)>` program of choice, determine the necessary requirements for the drivetrain based on the current game. Teams should shoot for the wheelbase that works the best in that specific field's layout.
es_mx: Después de aprender el programa :term:`CAD <Computer-aided design (CAD)>` de su elección, determine los requisitos necesarios para chasis en función del juego actual. Los equipos deberían optar por el chasis que mejor funcione en el trazado de ese campo específico.
fr_ca: Après avoir appris le programme :term:`CAD <Computer-aided design (CAD)>` de votre choix, déterminez les exigences nécessaires pour le châssis en fonction du jeu en cours. Les équipes doivent viser l'empattement qui fonctionne le mieux dans la configuration du terrain en question.
zh_cn: 在学习了您选择的计算机辅助设计 :term:`CAD <Computer-aided design (CAD)>` 程序后，根据当前游戏确定动力传动系统的必要要求。团队应该寻找在特定领域布局中效果最好的轴距。

source: For instance, in Relic Recovery (2017-2018) a drivetrain required precision to not only grab glyphs from the center pit, but also to line up against the cryptobox. Thus, mecanum wheels and a wide center section of the robot proved an advantage over a 6 wheel tank drive. (However, it should be noted that with sufficient practice and competent drivers, any drive base can be competitive up to a certain extent).
es_mx: Por ejemplo, en Relic Recovery (2017-2018) un chasis requería precisión no solo para agarrar glifos del foso central, sino también para alinearse contra la criptocaja. Así, las ruedas mecanum y una sección central ancha del robot resultaron ser una ventaja frente a una tracción de tanque de 6 ruedas. (Sin embargo, hay que señalar que, con suficiente práctica y conductores competentes, cualquier chasis puede ser competitivo hasta cierto punto).
fr_ca: Par exemple, dans Relic Recovery (2017-2018), une chaîne cinématique exigeait de la précision non seulement pour saisir les glyphes dans la fosse centrale, mais aussi pour s'aligner contre la cryptobox. Ainsi, les roues mecanum et une large section centrale du robot se sont révélées être un avantage par rapport à une transmission de tank à 6 roues. (Toutefois, il convient de noter qu'avec une pratique suffisante et des pilotes compétents, n'importe quelle base d'entraînement peut être compétitive jusqu'à un certain point).
ro_ro: De exemplu, în Relic Recovery (2017-2018), un șasiu a necesitat precizie nu doar pentru a lua glife din zona centrală, ci și pentru a se alinia la cryptobox. Astfel, roțile mecanum și o secțiune centrală largă a robotului s-au dovedit a fi un avantaj comparativ cu o tracțiune alcătuită din 6 roți. (Cu toate acestea, trebuie remarcat faptul că, cu suficientă practică și piloți competenți, orice șasiu se poate ridica la un nivel înalt într-o anumită măsură).
zh_cn: 例如，在 Relic Recovery（2017-2018）中，动力传动系统不仅需要精确地从中心坑抓取字形，还需要与密码盒对齐。因此，mecanum车轮和机器人的宽中心部分被证明是6轮坦克驱动的优势。（然而，应该注意的是，只要有足够的练习和称职的司机，任何驱动基础都可以在一定程度上具有竞争力）。

source: After selecting a drivebase, determine the number of motors. Keep in mind the eight motor limit is a pain that shouldn't be ignored. A good rule of thumb is four motors for driving and four motors for the other mechanisms (e.g. intakes, linear slides, arm, etc.) For most modern FTC\ |reg| games, you need minimum 7 motors to be highly competitive, although 8 is a good rule of thumb.
es_mx: Después de seleccionar un chasis, determina el número de motores. Ten en cuenta que el límite de ocho motores es una molestia que no debe ser ignorada. Una buena regla general es utilizar cuatro motores para la conducción y cuatro motores para los otros mecanismos (por ejemplo, intakes, deslizadores lineales, brazo, etc.). Para la mayoría de los juegos modernos de FTC\ |reg|, necesitas un mínimo de 7 motores para ser altamente competitivo, aunque 8 es una buena regla general.
fr_ca: Après avoir choisi un châssis, déterminez le nombre de moteurs. Gardez à l'esprit que la limite de huit moteurs est une contrainte qu'il ne faut pas ignorer. Une bonne règle générale est d’utiliser quatre moteurs pour la propulsion et quatre moteurs pour les autres mécanismes (par exemple : les systèmes de ramassage, les glissières linéaires, le bras, etc.). Pour la plupart des jeux modernes FTC\ |reg|, vous avez besoin d'au moins 7 moteurs pour être très compétitif, bien que 8 soit une bonne règle de base.
zh_cn: 选择驱动基座后，确定电机数量。请记住，八个电机的限制是一个不容忽视的问题。一个好的经验法则是四个电机用于驱动，四个电机用于其他机构（如吸入拾取装置、线性滑轨、机械臂等）。对于大多数现代 FTC |reg| 游戏来说，您至少需要 7 个电机才能具有较强的竞争力，尽管 8 个电机也是一个好的经验法则。

source: Designing the Drivetrain Plates
es_mx: Diseño de las Placas del Chasis
fr_ca: Conception des plaques du châssis
ro_ro: Proiectarea plăcilor de șasiu
zh_cn: 设计传动系统板

source: After learning the CAD software, it's time to start the actual design. Here are some things to figure out before starting:
es_mx: Después de aprender el software CAD, es hora de empezar el diseño propiamente. He aquí algunas cosas que hay que tener en cuenta antes de empezar:
fr_ca: Après avoir appris à utiliser le logiciel de CAO, il est temps de commencer la conception proprement dite. Voici quelques points à prendre en compte avant de commencer :
ro_ro: După ce ați învățat software-ul CAD, este timpul să începeți proiectarea propriu-zisă. Iată câteva lucruri la care trebuie să vă gândiți înainte de a începe:
zh_cn: 学习CAD软件后，是时候开始实际设计了。在开始之前需要弄清楚一些事情：

source: Drive Type (mecanum, 6wd, 8wd, etc.)
es_mx: Tipo de conducción (mecanum, 6wd, 8wd, etc.)
fr_ca: Type de transmission (mecanum, 6 roues motrices, 8 roues motrices, etc.)
ro_ro: Tipul de șasiu (mecanum, 6wd, 8wd, etc.)
zh_cn: 驱动类型（mecanum、6wd、8wd等）

source: Number of Motors (four motors recommended in most cases)
es_mx: Número de motores (se recomiendan cuatro motores en la mayoría de los casos)
fr_ca: Nombre de moteurs (quatre moteurs recommandés dans la plupart des cas)
ro_ro: Numărul de motoare (patru motoare recomandate în majoritatea cazurilor)
zh_cn: 电机数量（大多数情况下建议使用四台电机）

source: Type of wheels (:term:`Traction <Traction Wheel>`, :term:`omni <Omni Wheel>`, etc.)
es_mx: Tipo de ruedas (:term:`Traction <Traction Wheel>`, :term:`omni <Omni Wheel>`, etc.)
fr_ca: Type de roues (:term:`Traction <Traction Wheel>`, :term:`omni <Omni Wheel>`, etc.)
ro_ro: Tipul de roți (:term:`Tractiune <Traction Wheel>`, :term:`omni <Omni Wheel>`, etc.)
zh_cn: 车轮类型（牵引力、全方位等） (:term:`Traction <Traction Wheel>`, :term:`omni <Omni Wheel>`, etc.)

source: Drive power (:term:`belt <HTD Belt>`, :term:`chain <Sprocket>`, :term:`gear <Gear>`)
es_mx: Potencia motriz (:term:`correa <HTD Belt>`, :term:`cadena <Sprocket>`, :term:`engranaje <Gear>`)
fr_ca: Puissance d'entraînement (:term:`courroie <HTD Belt>`, :term:`chaîne <Sprocket>`, :term:`engrenage <Gear>`)
ro_ro: Distribuție a puterii (:term:`curea <HTD Belt>`, :term:`lanț <Sprocket>`, :term:`agrenaj <Gear>`)
zh_cn: 驱动功率（皮带、链条、齿轮） (:term:`belt <HTD Belt>`, :term:`chain <Sprocket>`, :term:`gear <Gear>`)

source: To keep it simple, this example uses a 4 wheel tank drive using four motors. The wheels selected are 2 Colson wheels for traction, and 2 omni wheels to aid in turning.
es_mx: Para simplificar, este ejemplo utiliza una tracción en tanque de 4 ruedas con cuatro motores. Las ruedas seleccionadas son 2 ruedas Colson para tracción, y 2 ruedas omni para ayudar en el giro.
fr_ca: Pour rester simple, cet exemple utilise une traction à 4 roues utilisant 4 moteurs. Les roues sélectionnées sont 2 roues Colson pour la traction, et 2 roues omni pour aider à tourner.
ro_ro: Pentru a simplifica lucrurile, acest exemplu utilizează un șasiu pe 4 roți, folosind patru motoare. Roțile selectate sunt 2 roți Colson pentru tracțiune și 2 roți omni pentru a ajuta la întoarcere.
zh_cn: 为了简单起见，本例使用四个电机的四轮油箱驱动。选择的车轮是2个用于牵引的科尔森车轮和2个用于辅助转向的全向车轮。

source: First, make the left side of the drivebase. After completing it, all you have to do is mirror the left side to the right, so you don't have to do each side individually. Start with a 2D sketch of everything before trying to extrude and make actual 3D objects.
es_mx: Primero, has la placa lado izquierdo. Después de completarlo, todo lo que tienes que hacer es reflejar el lado izquierdo al derecho, por lo que no tienes que hacer cada lado individualmente. Empieza con un boceto 2D de todo antes de intentar extruir y hacer objetos 3D reales.
fr_ca: Commencez par faire le côté gauche de la base d'entraînement. Après l'avoir terminé, il vous suffira de refléter le côté gauche sur le côté droit, de sorte que vous n'aurez pas à faire chaque côté individuellement. Commencez par une esquisse en 2D avant d'essayer d'extruder et de créer des objets en 3D.
zh_cn: 首先，制作驾驶座的左侧。完成后，你所要做的就是将左侧镜像到右侧，这样你就不必单独做每一侧。在尝试挤压和制作实际的3D对象之前，先从所有东西的2D草图开始。

source: Drivetrain Plate Technical Drawing
es_mx: Placas del Chasis Dibujo Técnico
fr_ca: Dessin technique de la plaque de transmission
ro_ro: Desenul tehnic al plăcii de șasiu
zh_cn: 传动系统板技术图纸

source: This is a sketch of the inner plate of the drive base. Everything should be laid out in a 2D sketch to determine the mounting holes, :term:`bore <Bore>`, :term:`center-to-center distance <C2C>`, etc. 2D sketches are extremely helpful and are highly recommended in any project. After the sketch is completed, everything else falls into place and becomes pretty simple.
es_mx: Esto es un dibujo de la placa interior de la base de accionamiento. Todo debe trazarse en un dibujo 2D para determinar los orificios de montaje, :term:`agujero de eje <Bore>`, :term:`distancia de centro a centro <C2C>`, etc. Los croquis 2D son extremadamente útiles y muy recomendables en cualquier proyecto. Una vez realizado el croquis, todo lo demás encaja y resulta bastante sencillo.
fr_ca: Voici un croquis de la plaque intérieure de la base d'entraînement. Tout doit être représenté sur un croquis en 2D afin de déterminer les trous de montage, :term:`ennui <Bore>`, :term:`distance centre à centre <C2C>`, etc. Les croquis en 2D sont extrêmement utiles et vivement recommandés dans tout projet. Une fois le croquis réalisé, tout le reste se met en place et devient très simple.
ro_ro: Aceasta este o schiță a plăcii interioare a șasiului. Totul ar trebui să fie prezentat într-o schiță 2D pentru a determina găurile de montare, :term:`alveolele <Bore>`, :term:`distanța între centre <C2C>`, etc. Schițele 2D sunt extrem de utile și sunt foarte recomandate în orice proiect. După ce schița este finalizată, toate celelalte lucruri se rezolvă de la sine, devenind totul destul de simplu.
zh_cn: 是驱动底座内板的草图。一切都应该在2D草图中进行布局，以确定安装孔、孔、中心到中心的距离等。 :term:`bore <Bore>`, :term:`center-to-center distance <C2C>` 2D草图非常有帮助，在任何项目中都强烈推荐。草图完成后，其他一切都就位了，变得非常简单。

source: After this, extrude that sketch into the first plate of the drivetrain. Typically, a standard thickness of aluminum plate is 1/8". Thinner plate (3/32") can be used as well, but generally most teams stick to 1/8". Extrude the plate to that thickness. Below is the sketch after extruding.
es_mx: Después de esto, extruir ese boceto en la primera placa del chasis. Normalmente, el grosor estándar de la placa de aluminio es de un 1/8 de pulgada También se pueden utilizar placas más finas ( un 3/32 de pulgada), pero la mayoría de los equipos suelen utilizar placas de un 1/8 de pulgada. Extruir la placa a ese espesor. A continuación se muestra el boceto después de la extrusión.
fr_ca: Ensuite, cette esquisse est extrudée dans la première plaque de la transmission. L'épaisseur standard d'une plaque d'aluminium est de 1/8". Des plaques plus fines (3/32") peuvent également être utilisées, mais la plupart des équipes s'en tiennent généralement à 1/8". Extrudez la plaque à cette épaisseur. Vous trouverez ci-dessous le croquis après l'extrusion.
zh_cn: 在此之后，将草图拉伸为传动系统的第一个板。通常，铝板的标准厚度为1/8英寸。也可以使用更薄的板（3/32英寸），但通常大多数团队坚持1/8英寸。将板拉伸到该厚度。下面是拉伸后的草图。

source: Inner Drivetrain Plate
es_mx: Placa Interior del Chasis
fr_ca: Plaque intérieure du châssis
ro_ro: Placă interioară de șasiu
zh_cn: 内传动系板

source: The next step will be making the outer plate for the drivebase. It is even faster to do than the inner. To do this, simply create a new part. Go back to your inner plate and start a 2D sketch.
es_mx: El siguiente paso será hacer la placa exterior para la base del chasis. Es aún más rápido de hacer que la interior. Para ello, basta con crear una nueva pieza. Vuelve a tu placa interior e inicia un boceto 2D.
fr_ca: L'étape suivante consistera à fabriquer la plaque extérieure du châssis. Elle est encore plus rapide à réaliser que la plaque intérieure. Pour ce faire, il suffit de créer une nouvelle pièce. Revenez à votre plaque intérieure et commencez un croquis en 2D.
ro_ro: Următorul pas va fi realizarea plăcii exterioare pentru șasiu. Este chiar mai rapid de realizat decât cea interioară. Pentru a face acest lucru, creați pur și simplu o piesă nouă. Întoarceți-vă la placa interioară și începeți o schiță 2D.
zh_cn: 下一步将是为驱动底座制作外板。它比内部更快。为此，只需创建一个新零件。回到您的内板并开始2D草图。

source: Drivetrain Plate, with entire face seleected
es_mx: Placa del chasis, con toda la cara seleccionada
fr_ca: Plaque de transmission, avec la face entière sélectionnée
ro_ro: Placă de șasiu, cu întreaga față selectată
zh_cn: 传动系统板，整个板面均被切除

source: After starting the new sketch on the inner plate, hit "Project Geometry" and just click anywhere on the part. It should highlight every outline of the part. (Shown here is a yellow line; yours might be red, blue or some other color.) Now click and drag across the part selecting every line on the screen. Now go hit CTRL + C, then go to the new part and hit create 2D Sketch. Next hit CTRL + V.
es_mx: Tras iniciar el nuevo boceto en la placa interior, pulsa "Proyectar geometría" y haz clic en cualquier parte de la pieza. Debería resaltar todos los contornos de la pieza. (Aquí se muestra una línea amarilla; la tuya puede ser roja, azul o de otro color.) Ahora haz clic y arrastra a través de la pieza seleccionando cada línea en la pantalla. Ahora pulsa CTRL + C, luego ve a la nueva pieza y pulsa crear un dibujo 2D. A continuación, pulsa CTRL + V.
fr_ca: Après avoir commencé la nouvelle esquisse sur la plaque intérieure, appuyez sur "Projeter la géométrie" et cliquez n'importe où sur la pièce. Tous les contours de la pièce doivent être mis en évidence. (Ici, la ligne est jaune ; la vôtre peut être rouge, bleue ou d'une autre couleur.) Cliquez ensuite sur la pièce et faites-la glisser en sélectionnant toutes les lignes à l'écran. Appuyez sur CTRL + C, puis allez sur la nouvelle pièce et appuyez sur Créer un croquis 2D. Appuyez ensuite sur CTRL + V.
zh_cn: 在内板上开始新草图后，点击“项目几何”，只需单击零件上的任何位置。它应该突出显示零件的每个轮廓。（此处显示的是一条黄线；你的可能是红色、蓝色或其他颜色。）现在单击并拖动零件，选择屏幕上的每一行。现在点击CTRL+C，然后转到新零件并点击创建2D草图。下一步点击CTRL+V。

source: Drivetrain inner plate with the parts specific to the inner plate selected
es_mx: Placa interior del chasis con las piezas específicas de la placa interior seleccionada
fr_ca: Plaque intérieure du châssis avec les pièces spécifiques à la plaque intérieure sélectionnée
ro_ro: Placă interioară a sasiului cu piesele specifice plăcii interioare selectate
zh_cn: 传动系统内板，包括所选内板的专用部件

source: It should look like an exact copy of the inner plate but now as a sketch. Delete your motor mounts out of the middle, then extrude the outer plate.
es_mx: Debe parecer una copia exacta de la placa interior pero ahora como un boceto. Elimina los soportes del motor del centro y extruye la placa exterior.
fr_ca: Elle devrait ressembler à une copie exacte de la plaque intérieure, mais sous forme de croquis. Supprimez vos supports de moteur au milieu, puis extrudez la plaque extérieure.
ro_ro: Ar trebui să arate ca o copie exactă a plăcii interioare, dar pentru moment ca o schiță. Ștergeți suporturile de motor din mijloc, apoi extrudeți placa exterioară.
zh_cn: 它应该看起来像内板的精确副本，但现在作为草图。从中间删除电机口，然后拉伸出外板。

source: Outer Drivetrain Plate
es_mx: Placa Exterior del Chasis
fr_ca: Plaque extérieure du châssis
ro_ro: Placa exterioară de șasiu
zh_cn: 外传动系板

source: This is what the outer plate looks like, an almost exact copy of the inner one without the holes for the motors. Now with those two plates made, it's really just time to assemble the rest of the drivetrain, which is by far the most time consuming. Now, for some info on what to use to attach the two plates together, generally standoffs or churro is highly recommended. To attach the two halves of the drivetrain, use either channel, extrusion, or a custom u-brace. Some teams prefer a custom brace as it is a good way to stiffen up the drivetrain while requiring very little maintenance over the season. It is possible to use peanut extrusion or kit channel, which alternatively works just as well.
es_mx: Este es el aspecto de la placa exterior, una copia casi exacta de la interior sin los agujeros para los motores. Ahora con esas dos placas hechas, es realmente sólo el momento de montar el resto del chasis, que es, con mucho, el que más tiempo consume. Ahora, para obtener información sobre lo que se debe utilizar para unir las dos placas, por lo general standoffs o churros es muy recomendable. Para unir las dos mitades del chasis, se puede utilizar u canal, extrusión o una abrazadera en U personalizada. Algunos equipos prefieren una abrazadera a medida, ya que es una buena manera de endurecer el chasis y requiere muy poco mantenimiento a lo largo de la temporada. Es posible utilizar extrusión de cacahuete o canal de kit, que alternativamente funciona igual de bien.
fr_ca: Voici à quoi ressemble la plaque extérieure, une copie presque exacte de la plaque intérieure sans les trous pour les moteurs. Maintenant que ces deux plaques sont faites, il ne reste plus qu'à assembler le reste du châssis, ce qui est de loin le plus long. Pour savoir comment attacher les deux plaques ensemble, il est fortement recommandé d'utiliser des standoffs ou des churros. Pour attacher les deux moitiés du châssis, utilisez soit un canal, soit une extrusion, soit un support en U personnalisé. Certaines équipes préfèrent un support personnalisé, car c'est un bon moyen de rigidifier le châssis tout en nécessitant très peu d'entretien au cours de la saison. Il est possible d'utiliser de l'extrusion d'arachide ou des rails en kit, qui fonctionnent tout aussi bien.
zh_cn: 这是外板的样子，几乎完全复制了内板，没有电机孔。现在制作了这两块板，现在真的只是组装动力传动系统其余部分的时间，这是迄今为止最耗时的。现在，关于如何将两块板连接在一起的一些信息，强烈推荐使用支架或梁柱。要连接两部分的动力传动系统，请使用管道、拉伸或定制的u型支架。一些团队更喜欢定制支架，因为这是一种加强动力传动系统的好方法，同时在整个季节几乎不需要维护。可以使用花生梁或套件管道，这也同样有效。

source: Note that when using a custom drivetrain, you can cut out material from your drivetrain plates. This process is called **pocketing**. While not a vital step, pocketing helps you save weight. However, be careful not to remove too much material; if done, the plates become less sturdy. More about pocketing is in the next section.
es_mx: Tener en cuenta que cuando se utiliza un chasis personalizado, puede recortar material de sus placas del chasis. Este proceso se llama **pocketing**. Aunque no es un paso vital, el pocketing ayuda a ahorrar peso. Sin embargo, se debe tener cuidado de no quitar demasiado material; si lo hace, las placas se vuelven menos resistentes. Más información sobre el pocketing en la siguiente sección.
fr_ca: Notez que lorsque vous utilisez un châssis personnalisé, vous pouvez découper du matériel sur vos plaques de transmission. Ce processus est appelé **pocketing** ou mise en poche. Bien qu'il ne s'agisse pas d'une étape essentielle, la mise en poche permet de gagner du poids. Attention toutefois à ne pas enlever trop de matière, sinon les plaques deviendront moins solides. Vous trouverez plus d'informations sur la mise en poche dans la section suivante.
ro_ro: Aveți în vedere că atunci când folosiți o transmisie personalizată, puteți tăia material din plăcile de transmisie. Acest proces se numește **pocketing**. Deși nu este un pas esențial, pocketing-ul vă ajută să economisiți greutate. Cu toate acestea, aveți grijă să nu eliminați prea mult material; dacă o faceți, plăcile devin mai puțin rezistente. Mai multe despre pocketing se află în secțiunea următoare.
zh_cn: 请注意，当使用自定义动力传动系统时，您可以从动力传动系统板上切割材料。这个过程称为装袋。虽然装袋不是重要的一步，但它可以帮助您减轻重量。但是，注意不要移除太多材料；如果这样做，板会变得不那么坚固。更多关于装袋的信息在下一节中。

source: Additional Considerations
es_mx: Consideraciones Adicionales
fr_ca: Autres considérations
ro_ro: Considerente suplimentare
zh_cn: 其他考虑因素

source: Powering wheels can be done is a couple different ways through either belts and pulleys, chains and sprockets, gears, or even powered directly from the motor. Direct drive and chains are the simpler of the options, with direct drive not needing a calculated distance at all just have to set the motor exactly where the center of the wheel is. Chains allow for a little bit of slack not needing an exact center to center distance in the wrap like belts and pulleys do. Finally gears which need to be a certain distance apart from each other to mesh properly and not skip or bind.
es_mx: El accionamiento de las ruedas puede hacerse de maneras diferentes: mediante correas y poleas, cadenas y piñones, engranajes o incluso directamente desde el motor. La transmisión directa y las cadenas son las opciones más sencillas, ya que la transmisión directa no necesita una distancia calculada, sólo hay que colocar el motor exactamente en el centro de la rueda. Las cadenas permiten un poco de holgura al no necesitar una distancia exacta de centro a centro en la envoltura como hacen las correas y las poleas. Por último, los engranajes deben estar a cierta distancia unos de otros para engranar correctamente y no saltar o atascarse.
fr_ca: L'entraînement des roues peut se faire de différentes manières, soit par des courroies et des poulies, soit par des chaînes et des pignons, soit par des engrenages, soit encore directement par le moteur. L'entraînement direct et les chaînes sont les options les plus simples. L'entraînement direct ne nécessite pas de distance calculée, il suffit de placer le moteur exactement là où se trouve le centre de la roue. Les chaînes permettent un peu de jeu et n'ont pas besoin d'une distance exacte de centre à centre comme les courroies et les poulies. Enfin, les engrenages doivent être à une certaine distance les uns des autres pour s'engrener correctement et ne pas sauter ou se bloquer.
ro_ro: Acționarea roților se poate face în câteva moduri diferite, fie prin intermediul curelelor și a scripeților, a lanțurilor și a roților dințate, a angrenajelor sau chiar direct de la motor. Transmisia directă și lanțurile sunt cele mai simple dintre opțiuni, cu transmisie directă neavând nevoie deloc de o distanță calculată, trebuie doar ca motorul să fie setat exact unde se află centrul roții. Lanțurile permit un pic de slăbiciune, neavând nevoie de o distanță exactă între centrele înfășurării, așa cum fac curelele și scripeții. În cele din urmă, angrenajele care trebuie să fie la o anumită distanță una față de cealaltă pentru a se cupla în mod corespunzător și a nu sări sau a nu se bloca.
zh_cn: 为车轮提供动力可以通过皮带和皮带轮、链条和链轮、齿轮，甚至直接由电机提供动力来实现。直接驱动和链条是更简单的选择，直接驱动根本不需要计算距离，只需将电机精确设置在车轮中心的位置。链条允许一点松弛，而不需要像皮带和皮带轮那样在包裹中精确的中心到中心的距离。最后，需要彼此相距一定距离的齿轮才能正确啮合，而不是跳跃或捆绑。
