Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/cad-tutorials.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Mounting motors is done in a plate style by face mounting the motor into the innermost drivetrain plate. It can also be done by mounting the motors to a 3rd plate, located in between the outside and inside. This allows for the motor to take up less space in the middle of the robot, but adds complexity. Motors should always be as low as possible and depending where you want the center of mass, either the middle or towards the back of the robot. It is also worth keeping in mind the type of power transmission and the expediency of doing so in light of the motor placement.
es_mx: El montaje de los motores se realiza en un estilo de placa mediante el montaje frontal del motor en la placa de transmisión más interna. También puede hacerse montando los motores en una 3era placa, situada entre el exterior y el interior. Esto permite que el motor ocupe menos espacio en el centro del robot, pero añade complejidad. Los motores siempre deben estar lo más abajo posible y dependiendo de dónde quieras el centro de masa, en el centro o hacia la parte trasera del robot. También conviene tener en cuenta el tipo de transmisión de potencia y la conveniencia de hacerlo en función de la colocación del motor.
fr_ca: Le montage des moteurs s'effectue dans le style d'une plaque, en montant le moteur en face de la plaque du châssis la plus intérieure. Il est également possible de monter les moteurs sur une 3e plaque, située entre l'extérieur et l'intérieur. Cela permet au moteur de prendre moins de place au milieu du robot, mais ajoute de la complexité. Les moteurs doivent toujours être aussi bas que possible et le centre de masse doit être placé au milieu ou à l'arrière du robot. Il convient également de garder à l'esprit le type de transmission de puissance et l'opportunité de le faire à la lumière de l'emplacement du moteur.
ro_ro: Montarea motoarelor se face în stil placă, prin montarea frontală a motorului în cea mai interioară placă de transmisie. De asemenea, se poate realiza prin montarea motoarelor pe o a treia placă, situată între exterior și interior. Acest lucru permite ca motorul să ocupe mai puțin spațiu în mijlocul robotului, dar adaugă complexitate. Motoarele ar trebui să fie întotdeauna cât mai jos posibil și, în funcție de locul în care doriți centrul de greutate, fie la mijloc, fie spre partea din spate a robotului. De asemenea, merită să țineți cont de tipul de transmisie a puterii și de posibilitatea de a face acest lucru în funcție de amplasarea motorului.
zh_cn: 安装电机是通过将电机正面安装到最内侧的传动系统板上来完成的。也可以通过将电机安装到位于内外之间的第三个板上来完成。这允许电机在机器人中间占用更少的空间，但增加了复杂性。电机应该总是尽可能低，并且取决于你想要的质心位置，无论是机器人的中间还是后面。还值得记住的是动力传输的类型以及根据电机位置这样做的便利性。

source: Ground clearance is all dependent on if there are any obstacles on the field, as well as what your team wants to do in that game in regards to said obstacles.
es_mx: La distancia al suelo depende de si hay obstáculos en el campo, así como de lo que tu equipo quiera hacer en ese partido con respecto a dichos obstáculos.
fr_ca: La garde au sol dépend de la présence ou non d'obstacles sur le terrain, ainsi que de ce que votre équipe veut faire dans ce jeu par rapport à ces obstacles.
ro_ro: Ampatamentul la sol depinde de existența unor obstacole pe teren, precum și de felul in care echipa ta dorește să acționeze în acel joc în ceea ce privește obstacolele date.
zh_cn: 场地净空完全取决于场地上是否有任何障碍物，以及你的球队在比赛中想要做什么来处理这些障碍物。

source: For example, in Rover Ruckus some teams with tank drivetrains decided to enter the crater. Therefore, they left enough space to not beach themselves on top of the crater, a common mistake that inexperienced teams often make.
es_mx: Por ejemplo, en Rover Ruckus algunos equipos con una configuración tanque en su chasis decidieron entrar en el cráter. Por lo tanto, dejaron espacio suficiente para no vararse encima del cráter, un error común que suelen cometer los equipos inexpertos.
fr_ca: Par exemple, dans Rover Ruckus, certaines équipes dotées d'un châssis de type tank ont décidé d'entrer dans le cratère. Elles ont donc laissé suffisamment d'espace pour ne pas s'échouer au sommet du cratère, une erreur fréquente que les équipes inexpérimentées commettent souvent.
zh_cn: 例如，在Rover Ruckus中，一些配备坦克传动系统的团队决定进入火山口。因此，他们留出了足够的空间，以免自己在火山口顶部搁浅，这是缺乏经验的团队经常犯的常见错误。

source: Other teams decided to ignore driving over the crater and decided to reach over with an arm or slide system, which meant they didn't need a lot of ground clearance for their drivebase.
es_mx: Otros equipos decidieron ignorar la conducción sobre el cráter y optaron por alcanzarlo con un brazo o un sistema de deslizamiento, lo que significaba que no necesitaban mucha distancia al suelo para su base de su chasis.
fr_ca: D'autres équipes ont décidé de ne pas rouler sur le cratère et de l'atteindre à l'aide d'un bras ou d'un système de glissière, ce qui signifie qu'elles n'avaient pas besoin d'une grande garde au sol pour leur châssis.
zh_cn: 其他车队决定忽略开车越过火山口，并决定使用手臂或滑轨系统伸出手来，这意味着他们的驾驶基础不需要太多的离地间隙。

source: Typically, anywhere from .25 inches of clearance to .5 inches (if you want to be safe) on a completely flat field will allow for the weight of the robot to push into the foam tiles. Nothing else from the robot should touch the ground.
es_mx: Normalmente, desde .25 pulgadas (0.7 centímetros) de espacio libre hasta .5 pulgadas (1.3 centímetros) (si quieres estar seguro) en un campo completamente plano permitirá que el peso del robot se empuje hacia las baldosas de espuma. Nada más del robot debe tocar el suelo.
fr_ca: En règle générale, un espace de 0,25 pouce à 0,5 pouce (si vous voulez être sûr) sur un terrain complètement plat permet au poids du robot de pousser dans les tuiles en mousse. Rien d'autre du robot ne doit toucher le sol.
zh_cn: 通常，在完全平坦的场地上，从0.25英寸到0.5英寸（如果你想安全的话）的间隙将允许机器人的重量推入泡沫瓷砖。机器人的其他任何东西都不应接触地面。

source: Something you can do is set the robot in CAD onto a field. Set up obstacles such as the crater and simulate driving over the crater by moving it across like you think it would in the real world.
es_mx: Algo que puedes hacer es colocar el robot en CAD sobre un terreno. Coloca obstáculos como el cráter y simula la conducción sobre el cráter moviéndolo como crees que lo haría en el mundo real.
fr_ca: Vous pouvez par exemple placer le robot dans le système CAD sur un terrain. Mettez en place des obstacles tels que le cratère et simulez la conduite sur le cratère en le déplaçant comme vous pensez qu'il le ferait dans le monde réel.
zh_cn: 您可以做的事情是将CAD中的机器人设置到一个地面上。设置陨石坑等障碍物，并通过像您在现实世界中想象的那样移动它来模拟在陨石坑上行驶。

source: If either of the plates intersect with the obstacle, add some more clearance so you don't get beached like a sad whale.
es_mx: Si alguna de las placas se cruza con el obstáculo, añade algo más de espacio libre para que no quedes varado como una triste ballena.
fr_ca: Si l'une des plaques croise l'obstacle, augmentez l'espace libre afin de ne pas vous échouer comme une triste baleine.
zh_cn: 如果任何一个板块与障碍物相交，增加一些间隙，这样你就不会像悲伤的鲸鱼一样搁浅。

source: A general rule of thumb for most teams is the wider the intake, the better the chance of picking up the game piece. However, this is super game dependent. If you need to pick up a 6" cube like in Relic Recovery then you would not need 14" of space for your intake.
es_mx: Una regla general para la mayoría de los equipos es que cuanto más amplia sea la entrada, mayor será la posibilidad de recoger la ficha de juego. Sin embargo, esto depende mucho del juego. Si necesitas recoger un cubo de 6 pulgadas, como en Relic Recovery, no necesitarás 14 pulgadas de espacio para la entrada.
fr_ca: La règle générale pour la plupart des équipes est que plus la prise est large, plus les chances de récupérer la pièce de jeu sont grandes. Cependant, cela dépend beaucoup du jeu. Si vous devez ramasser un cube de 6" comme dans Relic Recovery, vous n'aurez pas besoin d'un espace de 14" pour votre admission.
zh_cn: 大多数团队的一般经验法则是摄入量越大，获得游戏碎片的机会就越大。然而，这是超级游戏依赖的。如果你需要像遗迹恢复中那样拿起一个6英寸的立方体，那么你就不需要14英寸的空间来摄入。

source: However, if you need to pick up a ball like in Velocity Vortex, the bigger the intake gives you better chances of grabbing the balls. Keep this in mind when designing drive pods - try to keep them as thin as possible without sacrificing rigidity and strength to maximize space for other mechanisms and wiring.
es_mx: Sin embargo, si necesitas recoger una bola como en Velocity Vortex, cuanto mayor sea la entrada más posibilidades tendrás de agarrar las bolas. Ten esto en cuenta al diseñar las cápsulas de propulsión: intenta que sean lo más finas posible sin sacrificar rigidez y resistencia para maximizar el espacio para otros mecanismos y cableado.
fr_ca: Cependant, si vous devez attraper une balle comme dans Velocity Vortex, plus le ramasseur est grand, plus vous avez de chances d'attraper les balles. Gardez cela à l'esprit lorsque vous concevez des pods d'entraînement - essayez de les rendre aussi fins que possible sans sacrifier la rigidité et la solidité afin de maximiser l'espace pour les autres mécanismes et le câblage.
zh_cn: 然而，如果你需要像在速度涡流中那样捡起一个球，吸入拾取装置越大，你就有更好的机会抓住球。在设计驱动吊舱时请记住这一点——尽量保持它们薄，而不牺牲刚性和强度，以最大限度地增加其他机构和布线的空间。

source: Connecting your two plates together is really simple. Some standoffs or churro extrusion from AndyMark is a relatively easy way to connect them together with a few bolts. Just make a few 1/4 in. holes in your sketch where you want the churro tube to be. Decide how long the churro needs to be. Remember to leave enough space between the plates for your wheels, pulleys, sprockets, and spacers. You don't need to go overkill on how many standoffs you need in between your plates; however, put them in strategic places where support is needed.
es_mx: Conectar las dos placas es muy sencillo. Algunos separadores o churro extrusión de AndyMark es una manera relativamente fácil de conectarlos entre sí con unos pocos tornillos. Sólo tienes que hacer unos agujeros de 1/4 pulg. en tu boceto donde quieres que esté el tubo de churro. Decide la longitud que debe tener el churro. Recuerda dejar suficiente espacio entre las placas para tus ruedas, poleas, piñones y espaciadores. No es necesario que te pases con el número de separadores que necesitas entre las placas; sin embargo, colócalos en lugares estratégicos donde se necesite apoyo.
fr_ca: La connexion des deux plaques est très simple. Quelques vis de fixation ou des extrusions de churro d'AndyMark sont un moyen relativement facile de les relier avec quelques boulons. Il suffit de faire quelques trous d'1/4 de pouce dans votre croquis à l'endroit où vous voulez que le tube churro soit placé. Décidez de la longueur du churro. N'oublie pas de laisser suffisamment d'espace entre les plaques pour les roues, les poulies, les pignons et les entretoises. Il n'est pas nécessaire d'exagérer le nombre d'entretoises entre les plaques, mais placez-les aux endroits stratégiques où un soutien est nécessaire.
zh_cn: 将两个板连接在一起非常简单。AndyMark的一些支架或油条挤压是一种相对简单的方法，可以用几个螺丝将它们连接在一起。只需在你的草图中做几个1/4英寸的孔。你想让油条管在哪里。决定油条需要多长时间。记住在板之间留出足够的空间来放你的轮子、滑轮、链轮和垫片。你不需要在板之间需要多少支架；然而，把它们放在需要支持的战略位置。

source: Shown below is a drive pod, which is one half of the drivetrain, including the shafts, bearings, wheels, motors, belts, etc. In short, the drive pod has everything that will be built in real life. This particular one is the left side, but to make the right side create an offset plane, select the mirror tool, then hit mirror.
es_mx: A continuación, se muestra una cápsula de conducción, que es la mitad del chasis, incluyendo los ejes, rodamientos, ruedas, motores, correas, etc. En resumen, la cápsula de conducción tiene todo lo que se construirá en la vida real. Esta en particular es la parte izquierda, pero para crear un plano de desplazamiento en el lado derecho, selecciona la herramienta de espejo y luego presiona espejo.
fr_ca: L'illustration ci-dessous montre un module d’entraînement, qui représente la moitié du châssis, y compris les arbres, les roulements, les roues, les moteurs, les courroies, etc. En bref, il contient tout ce qui sera construit dans la réalité. Celui-ci est le côté gauche, mais pour faire le côté droit, créez un plan décalé, sélectionnez l'outil miroir, puis cliquez sur miroir.
zh_cn: 下面显示的是一个驱动吊舱，它是传动系统的一半，包括轴、轴承、轮子、电机、皮带等。简而言之，驱动吊舱拥有现实生活中将要建造的一切。这个特别的是左侧，但要使右侧创建一个偏移平面，请选择镜像工具，然后点击镜像。

source: Left side drivetrain pod
es_mx: Módulo del chasis izquierdo
fr_ca: Boîte d'entraînement côté gauche
zh_cn: 左侧传动系统吊舱

source: After mirroring the drive pod to make your opposite side, connect those two halves together and you're done with the drivetrain. Below is a rendering of the complete drivetrain in CAD.
es_mx: Después de reflejar la cápsula de conducción para hacer su lado opuesto, conectar las dos mitades juntas y ya terminaste con el chasis. A continuación, se muestra una representación del chasis completo en CAD.
fr_ca: Après avoir dupliqué le module d'entraînement pour obtenir le côté opposé, connectez ces deux moitiés ensemble et vous avez terminé le châssis. Vous trouverez ci-dessous un rendu de la chaîne cinématique complète en CAO.
zh_cn: 在镜像驱动吊舱以制作您的另一侧后，将这两半连接在一起，您就完成了动力传动系统。下面是CAD中完整动力传动系统的渲染。

source: CAD Tutorial Part 2 - Pocketing Guide
es_mx: Tutorial CAD Parte 2 - Guía de Pocketing
fr_ca: CAD tutoriel 2 - Guide de mise en poche
zh_cn: CAD教程第2部分-口袋指南

source: Term
es_mx: Término
fr_ca: Durée
zh_cn: 术语

source: Pocketing
fr_ca: Usinage de poche
zh_cn: 口袋化

source: "Pocketing" is a common term in FTC and FRC\ |reg| lingo that refers to cutting out excess material from a CAD designed part. Pocketing helps to reduce weight and can increase strength of a part. This may seem counterintuitive (how can removing material strengthen a part?) but pocketing can reduce stress buildup, especially at corners.
es_mx: "Pocketing" es un término común en la jerga de FTC y FRC que se refiere a recortar el exceso de material de una pieza diseñada con CAD. El Pocketing ayuda a reducir el peso y puede aumentar la resistencia de una pieza. Esto puede parecer contradictorio (¿cómo puede reforzar una pieza la eliminación de material?), pero el pocketing puede reducir la acumulación de tensiones, especialmente en las esquinas.
fr_ca: La "poketing" ou mise en poche est un terme courant dans le jargon de FTC et FRC, qui fait référence à la découpe de l'excédent de matière d'une pièce conçue par CAO. La mise en poche permet de réduire le poids et d'augmenter la résistance d'une pièce. Cela peut sembler contre-intuitif (comment enlever de la matière peut-elle renforcer une pièce ?), mais les poches peuvent réduire l'accumulation de contraintes, en particulier dans les angles.
zh_cn: “口袋”是FTC和FRC®百科中的一个常用术语，指的是从CAD设计的零件中去除多余的材料。口袋有助于减轻重量，增加零件的强度。这可能看起来违反直觉（去除材料如何加强零件？）但是口袋可以减少应力积累，尤其是在角落。

source: Pocketing is often seen on drivetrain sheet metal plates which will be CNC machined. In FRC, pocketing is often used to reduce weight of the rectangular aluminum tubes.
es_mx: El Pocketing se ve a menudo en las placas de metal del chasis que serán maquinadas por CNC. En FRC, el pocketing se utiliza a menudo para reducir el peso de los tubos rectangulares de aluminio.
fr_ca: Les poches sont souvent visibles sur les plaques de tôle du châssis qui seront usinées par commande numérique. En FRC, les poches sont souvent utilisées pour réduire le poids des tubes rectangulaires en aluminium.
zh_cn: 在数控加工的传动系统工作表金属板上经常可以看到口袋。在FRC中，口袋通常用于减轻矩形铝管的重量。

source: There are several ways to machine pockets into material including milling, routing, water jet cutting, laser cutting and even hand drilling. Depending on your access to tooling, pocketing can be more or less difficult for you.
es_mx: Hay varias formas de maquinar cavidades en el material: trituración, enrutamiento, corte por chorro de agua, corte por láser e incluso taladrado manual. Dependiendo de su acceso a las herramientas, el pocketing puede resultarle más o menos difícil.
fr_ca: Il existe plusieurs façons d'usiner des poches dans un matériau : le fraisage, le détourage, la découpe au jet d'eau, la découpe au laser et même le perçage manuel. En fonction de votre accès à l'outillage, l'usinage de poches peut être plus ou moins difficile pour vous.
zh_cn: 有几种方法可以将口袋加工成材料，包括铣削、布线、喷水切割、激光切割甚至手工钻孔。根据您获得工具的情况，装袋对您来说或多或少是困难的。

source: CNC milling and routing excel at pocketing aluminum box tubing, whereas water jet and laser cutting excel at pocketing plates. Whether pocketing on box tubing or plates, the design is fairly similar.
es_mx: El fresado y enrutamiento CNC son excelentes para hacer pocketing en tubos de aluminio, mientras que el corte por chorro de agua y láser son excelentes para hacer pocketing en placas. Ya sea en tubos o placas, el diseño es bastante similar.
fr_ca: Le fraisage CNC et le découpage par routeur excellent dans l’usinage de poches sur des profilés tubulaires en aluminium, tandis que le jet d'eau et la découpe au laser excellent dans la réalisation de poches sur des plaques. Qu'il s'agisse de poches sur des tubes ou des plaques, la conception est assez similaire.
zh_cn: 数控铣削和布线擅长装入铝箱管，而水射流和激光切割擅长装入板。无论是装入箱管还是板材，设计都非常相似。

source: When designing pockets, **it's important to consider the type of material, thickness, and how much stress will be on the part**. Materials that are weaker, thinner or under significant stress should have less "aggressive" pocketing and materials that are stronger, thicker or under less stress can have more "aggressive" pocketing. Aggressive pocketing refers to the amount of material removal from the blank part (more aggressive = more material removal).
es_mx: Al diseñar pockets, **es importante tener en cuenta el tipo de material, el grosor y la tensión a la que estará sometida la pieza**. Los materiales más débiles, más finos o sometidos a una tensión mayor deben tener un pocketing menos "agresivo" y los materiales más fuertes, más gruesos o sometidos a menos tensión pueden tener un pocketing más "agresivo". El pocketing agresivo se refiere a la cantidad de material eliminado de la pieza en bruto (más agresivo = más material eliminado).
fr_ca: Lors de la conception des poches, **il est important de tenir compte du type de matériau, de l'épaisseur et de l'intensité des contraintes qui s'exerceront sur la pièce**. Les matériaux plus faibles, plus minces ou soumis à des contraintes importantes doivent avoir un emboîtage moins "agressif", tandis que les matériaux plus forts, plus épais ou soumis à des contraintes moindres peuvent avoir un emboîtage plus "agressif". L'agressivité de la poche fait référence à l'importance de l'enlèvement de matière sur la pièce brute (plus agressif = plus d'enlèvement de matière).
zh_cn: 在设计口袋时，重要的是要考虑材料的类型、厚度以及零件上的应力大小。较弱、较薄或承受重大压力的材料应该具有较少的“侵略性”口袋，而较强、较厚或承受较小压力的材料可以具有更“侵略性”口袋。侵略性口袋是指从空白部分移除材料的量（更具侵略性=更多材料移除）。

source: Although a bit complex to understand, FEA (finite element analysis) can be used to determine appropriate strut thickness when pocketing. FEA can be used to generate pocketing geometry, but that is an entirely different rabbit hole.
es_mx: Aunque es un poco complicado de entender, el AEF (análisis de elementos finitos) puede utilizarse para determinar el grosor adecuado de los puntales con el pocketing. El AEF también puede utilizarse para generar la geometría del pocketing, pero eso es algo totalmente distinto.
fr_ca: Bien qu'un peu complexe à comprendre, l'analyse par éléments finis (FEA) peut être utilisée pour déterminer l'épaisseur appropriée de la jambe de force lors de l'empochement. L'analyse par éléments finis peut être utilisée pour générer la géométrie des poches, mais il s'agit là d'un tout autre problème.
zh_cn: 虽然理解起来有点复杂，但FEA（有限元分析）可用于确定装袋时的适当支柱厚度。FEA可用于生成装袋几何形状，但那是一个完全不同的复杂情况。

source: FEA of inner drivetrain plate
es_mx: AEF de la placa del chasis interior
fr_ca: Analyse par éléments finis de la plaque intérieure du châssis
zh_cn: 传动系统内板的有限元分析

source: 731 Wannabee Strange, Rover Ruckus, FEA of inner drivetrain plate
es_mx: 731 Wannabee Strange, Rover Ruckus, FEA de la placa del chasis interna
fr_ca: 731 Wannabee Strange, Rover Ruckus, FEA de la plaque intérieure du châssis
zh_cn: 731 Wannabee Strange、Rover Ruckus、传动系统内板有限元分析

source: Designing concise and advantageous pocketing is as simple as drawing circles and tangent lines. Parametric pockets can be defined by one or two offset values. The offset values determine the thickness of the remaining material.
es_mx: Diseñar pocketing concisos y ventajosas es tan sencillo como dibujar círculos y líneas tangentes. Los pockets paramétricos pueden definirse mediante uno o dos valores de desplazamiento. Los valores de desplazamiento determinan el grosor del material restante.
fr_ca: Concevoir des poches concises et avantageuses est aussi simple que de dessiner des cercles et des lignes tangentes. Les poches paramétriques peuvent être définies par une ou deux valeurs de décalage. Les valeurs de décalage déterminent l'épaisseur du matériau restant.
zh_cn: 设计简洁有利的口袋就像画圆圈和切线一样简单。参数口袋可以由一个或两个偏移值定义。偏移值决定了剩余材料的厚度。

source: Parametric means that the entire sketch is defined by a parameter, in this case is the offset value which when adjusted will automatically adjust the entire sketch (in terms of material thickness).
es_mx: Paramétrico significa que todo el sketch está definido por un parámetro, en este caso es el valor de desplazamiento que cuando se ajusta ajustará automáticamente todo el sketch (en términos de espesor del material).
fr_ca: Paramétrique signifie que l'ensemble de l'esquisse est défini par un paramètre, dans ce cas la valeur de décalage qui, lorsqu'elle est ajustée, ajuste automatiquement l'ensemble de l'esquisse (en termes d'épaisseur du matériau).
zh_cn: 参数化是指整个草图由参数定义，在这种情况下是偏移值，当调整时会自动调整整个草图（就材料厚度而言）。

source: There are several references that can be drawn on every plate/tube which are screw holes, bearing holes, and corners. Each reference will get its own construction/sketch circle or two. Ideally all of the construction circles are one of less than 4 sizes to keep the pocketing consistent and simple.
es_mx: Hay varias referencias que se pueden dibujar en cada placa/tubo, que son los agujeros de los tornillos, los agujeros de los cojinetes y las esquinas. Cada referencia tendrá su propio círculo de construcción/esbozo o dos. Idealmente todos los círculos de construcción son uno de menos de 4 tamaños para mantener el pocketing consistente y simple.
fr_ca: Plusieurs références peuvent être dessinées sur chaque plaque/tube, à savoir les trous de vis, les trous de roulement et les coins. Chaque référence aura son propre cercle de construction/esquisse ou deux. Dans l'idéal, tous les cercles de construction ont une taille inférieure à 4 pour que les poches soient cohérentes et simples.
zh_cn: 每个板/管上都可以绘制几个参考，分别是螺丝孔、轴承孔和角。每个参考都将获得自己的构造/草图圆或两个。理想情况下，所有的构造圆都小于4个尺寸之一，以保持口袋的一致性和简单性。
