Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/cad-tutorials.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: First are the screw hole construction circles with radius of the screw hole radius plus the offset value. Next are bearing holes with radius of bearing hole radius plus offset value. Then are edges with construction circles with the radius of an offset value. Then the most important circles are at each of the screw and bearing holes, which will define the strut thickness.
es_mx: En primer lugar están los círculos de construcción del agujero del tornillo con el radio del agujero del tornillo más el valor de desplazamiento. A continuación, los orificios de apoyo con el radio del radio del orificio de apoyo más el valor de desplazamiento. Luego están los bordes con círculos de construcción con el radio de un valor de desplazamiento. Luego están los círculos más importantes en cada uno de los agujeros de tornillo y cojinete, que definirán el grosor del puntal.
fr_ca: Les premiers sont les cercles de construction des trous de vis dont le rayon est égal au rayon du trou de vis en plus de la valeur de décalage. Viennent ensuite les trous d'appui dont le rayon est égal au rayon du trou d'appui plus la valeur de décalage. Viennent ensuite les bords avec des cercles de construction dont le rayon correspond à une valeur de décalage. Les cercles les plus importants se trouvent à chacun des trous de vis et de palier, qui définissent l'épaisseur de la jambe de force.
zh_cn: 首先是螺丝孔半径加偏移值的螺丝孔构造圆。接下来是轴承孔半径加偏移值的轴承孔。然后是具有偏移值半径的构造圆的边缘。然后最重要的圆位于每个螺丝和轴承孔，这将决定支柱厚度。

source: The circles at the center of each screw and bearing hole will have the diameter of an offset value. After all of the construction circles are drawn, tangent lines can be drawn to create the pocketing geometry. Using the parametric offset value will make it easy to adjust strut thickness by just changing one or two values.
es_mx: Los círculos en el centro de cada tornillo y agujero de cojinete tendrán el diámetro de un valor de desplazamiento. Después de dibujar todos los círculos de construcción, se pueden dibujar las líneas tangentes para crear la geometría de las cavidades. El uso del valor de desplazamiento paramétrico facilitará el ajuste del grosor del puntal con sólo cambiar uno o dos valores.
fr_ca: Les cercles au centre de chaque vis et de chaque trou d'appui auront le diamètre d'une valeur de décalage. Une fois tous les cercles de construction dessinés, des lignes tangentes peuvent être tracées pour créer la géométrie des poches. L'utilisation de la valeur de décalage paramétrique permet d'ajuster facilement l'épaisseur de la jambe de force en modifiant simplement une ou deux valeurs.
zh_cn: 每个螺丝和轴承孔中心的圆圈将具有偏移值的直径。绘制所有构造圆圈后，可以绘制切线来创建口袋几何形状。使用参数偏移值将很容易通过更改一个或两个值来调整支柱厚度。

source: Tangent lines are drawn between the circles on the edges with other circles on edges and between the circles at the center of each bearing and screw hole. The circles with radius of bearing hole and screw hole plus offset value make sure that there is enough material around the bearing and screw holes. An example is below.
es_mx: Se trazan líneas tangentes entre los círculos de los bordes con otros círculos de los bordes y entre los círculos del centro de cada agujero de cojinete y tornillo. Los círculos con el radio del orificio del cojinete y del orificio del tornillo más el valor de desplazamiento garantizan que haya suficiente material alrededor de los orificios del cojinete y del tornillo. A continuación, se muestra un ejemplo.
fr_ca: Des lignes tangentes sont tracées entre les cercles sur les bords et d'autres cercles sur les bords, ainsi qu'entre les cercles au centre de chaque roulement et trou de vis. Les cercles avec le rayon du trou de roulement et du trou de vis plus la valeur de décalage permettent de s'assurer qu'il y a suffisamment de matière autour des trous de roulement et de vis. Un exemple est donné ci-dessous.
zh_cn: 在每个轴承和螺丝孔的边缘上的圆与其他圆之间以及中心的圆之间画切线。轴承孔和螺丝孔半径加上偏移值的圆确保轴承和螺丝孔周围有足够的材料。下面是一个例子。

source: Outer mechanism plate with pocketing sketch highlighted
es_mx: Placa de mecanismo exterior con sketch del pocketing resaltado
fr_ca: Plaque de mécanisme extérieure avec croquis de poche mis en évidence
zh_cn: 外侧机构板上有突出的口袋简图

source: Outer mechanism plate with all functional geometry
es_mx: Placa de mecanismo exterior con toda la geometría funcional
fr_ca: Plaque extérieure du mécanisme avec toute la géométrie fonctionnelle
zh_cn: 带所有功能几何图形的外机构板

source: Outer mechanism plate fully pocketed
es_mx: Placa de mecanismo exterior totalmente embolsada
fr_ca: Plaque de mécanisme extérieure entièrement empochée
zh_cn: 外侧机构板完全袋装

source: 731 Wannabee Strange, 2019 Summer VCC Cadathon, Outer Mechanism Plate
es_mx: 731 Wannabee Strange, Cadatón VCC de verano de 2019, placa de mecanismo exterior.
fr_ca: 731 Wannabee Strange, 2019 Summer VCC Cadathon, Plaque de mécanisme extérieur
zh_cn: 731 Wannabee Strange，2019 年夏季 VCC Cadathon，外机制板

source: The last step in pocketing is adding rounds to each and every corner, especially inner corners. Rounds relieve stress buildup at corners and make it easier to machine. Some machines, such as mills and routers, are also unable to machine tight internal corners. For those parts that need minimum rigidity loss and a lot more machine time on their hands, pockets don't need to be cut all the way.
es_mx: El último paso en el pocketing es añadir redondeos a todas y cada una de las esquinas, especialmente las interiores. Los redondeos alivian la tensión acumulada en las esquinas y facilitan el maquinado. Algunas máquinas, como fresadoras y enrutadores, tampoco pueden mecanizar esquinas internas estrechas. Para las piezas que necesitan una pérdida mínima de rigidez y mucho más tiempo de mecanizado, no es necesario cortar las cavidades por completo.
fr_ca: La dernière étape de l'empochement consiste à ajouter des arrondis à chaque coin, en particulier aux coins intérieurs. Les arrondis réduisent l'accumulation de contraintes dans les coins et facilitent l'usinage. Certaines machines, telles que les fraiseuses et les défonceuses, ne sont pas en mesure d'usiner des angles internes serrés. Pour les pièces qui nécessitent une perte de rigidité minimale et beaucoup plus de temps d'usinage, il n'est pas nécessaire de découper les poches jusqu'au bout.
zh_cn: 装袋的最后一步是在每个角落增加圆角，尤其是内角。圆角可以减轻角落的压力，使加工更容易。一些机器，如铣床和路由器，也无法加工紧密的内角。对于那些需要最小刚性损失和更多机器时间的零件，口袋不需要一路切割。

source: :term:`Waterjet cutters <Waterjet cutter>` and :term:`laser cutters <Laser cutter>` are only able to cut material all the way through, but routers and mills are able to make surface pockets. These pockets don't go all the way through the material and are multitudes more rigid than thru pocketing.
es_mx: Las cortadoras de chorro de agua<Waterjet cutter> y las cortadoras láser<Laser cutter> solo pueden cortar el material completamente, pero los enrutadores y fresadoras pueden crear bolsillos en la superficie. Estos bolsillos no atraviesan completamente el material y son mucho más rígidos que el pocketing a través.
fr_ca: Les :term:`découpeurs à jet d'eau <Waterjet cutter>` et les :term:`découpeurs laser <Laser cutter>` ne peuvent découper le matériau que sur toute sa longueur, mais les routeurs et les fraiseuses sont capables de réaliser des poches superficielles. Ces poches ne traversent pas le matériau de part en part et sont beaucoup plus rigides que les poches traversantes.
zh_cn: :term:`水射流切割机 <Waterjet cutter>` 和 :term:`激光切割机 <Laser cutter>` 只能切割材料，但是路由器和磨坊能够制造表面口袋。这些口袋不会一直穿过材料，而且比通过口袋更坚硬。

source: The downside is increased machining time. The increased time is from the "lawn mowing" tool cutting path verses simply cutting the edges of the geometry. It is also more difficult to machine, because more material is milled out and chip ejection becomes more important.
es_mx: El inconveniente es el aumento del tiempo de maquinado. El aumento de tiempo se debe a la trayectoria de corte de la herramienta "cortadora de césped" en lugar de simplemente cortar los bordes de la geometría. También es más difícil de mecanizar, porque se muele más material y la expulsión de virutas es más importante.
fr_ca: L'inconvénient est l'augmentation du temps d'usinage. L'augmentation du temps est due à la trajectoire de coupe de l'outil "tondeuse à gazon" par rapport à la simple coupe des bords de la géométrie. L'usinage est également plus difficile, car il faut extraire plus de matière et l'éjection des copeaux devient plus importante.
zh_cn: 缺点是加工时间增加。增加的时间是从“割草”工具切割路径到简单地切割几何形状的边缘。它也更难加工，因为更多的材料被铣削出来，切屑喷射变得更加重要。

source: Outer mechanism plate surface pocketed
es_mx: Superficie de la placa del mecanismo exterior embolsada
fr_ca: Surface de la plaque du mécanisme extérieur empochée
zh_cn: 外机构板表面挖孔

source: Surface Pocketing Example
es_mx: Ejemplo de embolsado en superficie
fr_ca: Exemple d'empochement de surface
zh_cn: 表面挖孔实例

source: If you don't have access to any precision tools, a hand drill/drill press and large drill bit/flat bottom boring bits can create pockets in material. Although this is the simplest form of pocketing, there is a straightforward way to optimize the circular drill method.
es_mx: Si no tiene acceso a ninguna herramienta de precisión, un taladro de mano/una prensa de taladrar y una broca grande/una broca de fondo plano pueden crear cavidades en el material. Aunque esta es la forma más sencilla de pocketing, hay una forma sencilla de optimizar el método de taladro circular.
fr_ca: Si vous n'avez pas accès à des outils de précision, une perceuse à main/une perceuse à colonne et un grand foret/une mèche à fond plat peuvent créer des poches dans le matériau. Bien qu'il s'agisse de la forme de poche la plus simple, il existe un moyen direct d'optimiser la méthode de la perceuse circulaire.
zh_cn: 如果您无法获得任何精密工具，手钻/钻床和大钻头/平底钻头可以在材料中创建口袋。虽然这是最简单的口袋形式，但有一种直接的方法可以优化圆形钻孔方法。

source: Since the main goal of pocketing is to remove as much material as possible without significantly sacrificing the structural stability, the holes need to be drilled in specific positions with the right size bit.
es_mx: Dado que el objetivo principal del pocketing es eliminar la mayor cantidad de material posible sin sacrificar significativamente la estabilidad estructural, los orificios deben perforarse en posiciones específicas con la broca del tamaño adecuado.
fr_ca: L'objectif principal de l'empochement étant d'enlever autant de matière que possible sans sacrifier de manière significative la stabilité de la structure, les trous doivent être percés dans des positions spécifiques à l'aide d'une mèche de taille appropriée.
zh_cn: 由于凹坑的主要目标是在不显著牺牲结构稳定性的情况下去除尽可能多的材料，因此需要在特定位置用合适尺寸的钻头钻孔。

source: The most effective way to find the specific positions and drill bit sizes, is to first create a pocketing design as you would do with circles and tangent lines. Then draw holes tangent to the struts created by the circles and tangent lines. An example is below with the orange as the holes to drill positioned tangentially to the regular pocketed edges.
es_mx: La forma más eficaz de encontrar las posiciones específicas y los tamaños de las brocas es crear primero un diseño de pocketing de cómo se haría con círculos y líneas tangentes. A continuación, dibuje orificios tangentes a los puntales creados por los círculos y las líneas tangentes. A continuación, se muestra un ejemplo con la naranja como los agujeros para perforar colocados tangencialmente a los bordes embolsados regulares.
fr_ca: La manière la plus efficace de trouver les positions spécifiques et les tailles de mèches est de créer d'abord un dessin de poche comme vous le feriez avec des cercles et des lignes tangentes. Dessinez ensuite des trous tangents aux entretoises créées par les cercles et les lignes tangentes. L'exemple ci-dessous montre que les trous à percer sont orange et qu'ils sont positionnés tangentiellement par rapport aux bords réguliers de la poche.
zh_cn: 找到具置和钻头尺寸的最有效方法是首先创建一个口袋设计，就像你对圆形和切线所做的那样。然后绘制与圆形和切线创建的支柱相切的孔。下面是一个例子，橙色作为钻孔定位在常规口袋边缘的切线上。

source: Outer mechanism plate showing the tangent circles between the pockets
es_mx: Placa exterior del mecanismo que muestra los círculos tangentes entre las bolsas
fr_ca: Plaque extérieure du mécanisme montrant les cercles tangents entre les poches
zh_cn: 外层机构板显示挖孔之间的切圆

source: Outer mechanism plate showing optimal drill pockets
es_mx: Placa de mecanismo exterior que muestra las cavidades de perforación óptimas
fr_ca: Plaque extérieure du mécanisme montrant les poches de forage optimales
zh_cn: 外机构板显示最佳钻孔槽

source: Optimal Drill Pocketing Method Example
es_mx: Ejemplo de método óptimo de pocketing/perforación
fr_ca: Exemple de méthode de forage optimale
zh_cn: 最佳钻孔方法示例

source: Although it may look like a random mess and it may take a while longer than just randomly "cheese holing", this method will yield the greatest weight reduction to structural rigidity loss ratio using the drill pocketing method.
es_mx: A pesar de que puede parecer un desastre al azar y puede tomar un poco más de tiempo que sólo al azar "cheese holing", este método producirá la mayor reducción de peso a la relación de pérdida de rigidez estructural utilizando el método de perforación.
fr_ca: Bien que le résultat puisse sembler désordonné et qu'il prenne plus de temps qu'un simple "trou de fromage", cette méthode permet d'obtenir le meilleur rapport entre la réduction du poids et la perte de rigidité de la structure dans le cadre de la méthode de perçage.
zh_cn: 虽然它可能看起来像一个随机的混乱，它可能需要比仅仅随机“奶酪打孔”更长的时间，但这种方法将使用钻孔方法产生最大的重量减轻结构刚性损失比。

source: A very important tip to pocketing is to do it last when designing a part. Parts should not be designed around the pocketing pattern, rather the pocketing should be designed around the part. If there are too many holes in a part, or the part is too small to be pocketed with an offset value, then it's probably not worth it to pocket.
es_mx: Un consejo muy importante para el "pocketing" es hacerlo en último lugar cuando se diseña una pieza. Las piezas no deben diseñarse en función del patrón del pocketing, sino que el pocketing debe diseñarse en función de la pieza. Si hay demasiados orificios en una pieza, o la pieza es demasiado pequeña para hacer pocketing con un valor de desplazamiento, probablemente no merezca la pena hacer pocketing.
fr_ca: Un conseil très important pour la mise en poche est de le faire en dernier lors de la conception d'une pièce. Les pièces ne doivent pas être conçues autour du modèle de poche, mais la poche doit être conçue autour de la pièce. S'il y a trop de trous dans une pièce, ou si la pièce est trop petite pour être empochée avec une valeur de décalage, cela ne vaut probablement pas la peine de l'empocher.
zh_cn: 口袋设计的一个很重要的技巧是在设计零件时要最后做。零件不应该围绕口袋图案设计，而应该围绕零件设计口袋。如果一个零件上的孔太多，或者零件太小而不能用偏移值装进口袋，那么很可能不值得装进口袋。

source: Pocketing can reduce part weight, but when using traditional machining methods can take a significant amount of extra time. Although, when adding pockets to parts that are going to be 3D printed, it can in some cases decrease print time as well as material used.
es_mx: El pocketing puede reducir el peso de la pieza, pero si se utilizan métodos de maquinado tradicionales, puede requerir mucho tiempo adicional. Sin embargo, si se añaden bolsillos a piezas que se van a imprimir en 3D, en algunos casos se puede reducir el tiempo de impresión y el material utilizado.
fr_ca: La mise en poche permet de réduire le poids des pièces, mais l'utilisation de méthodes d'usinage traditionnelles peut prendre beaucoup de temps. En revanche, l'ajout de poches à des pièces destinées à être imprimées en 3D peut, dans certains cas, réduire le temps d'impression ainsi que les matériaux utilisés.
zh_cn: 口袋可以减轻零件重量，但是当使用传统的加工方法时，可能会花费大量的额外时间。然而，当在将要3D打印的零件上添加口袋时，在某些情况下，它可以减少打印时间和使用的材料。

source: The pocketing method above is the simplest parametric method to pocketing, but more complex methods exist. For instance, the image below is an example of a complex double iso-grid pocketing pattern optimized for metal 3D printing.
es_mx: El método de pocketing anterior es el método paramétrico más sencillo de pocketing, pero existen métodos más complejos. Por ejemplo, la imagen siguiente es un ejemplo de un complejo patrón de pocketing de doble iso-rejilla optimizado para la impresión 3D en metal.
fr_ca: La méthode de mise en poche ci-dessus est la méthode paramétrique la plus simple, mais il existe des méthodes plus complexes. Par exemple, l'image ci-dessous est un exemple d'un modèle de poche complexe à double grille isométrique optimisé pour l'impression 3D de métal.
zh_cn: 上面的口袋方法是口袋的最简单的参数方法，但更复杂的方法存在。例如，下图是针对金属3D印刷优化的复杂双等网格口袋图案的示例。

source: Arm pivot mount with complex double iso-grid pocketing pattern
es_mx: Soporte de pivote de brazo con complejo patrón de pocketing de doble iso-rejilla
fr_ca: Support de bras pivotant avec double grille isométrique complexe
zh_cn: 支臂转轴固定装置，带有复杂的双等格网袋纹

source: 731 Wannabee Strange, Rover Ruckus, Arm Pivot Mount
es_mx: 731 Wannabee Strange, Rover Ruckus, Montaje de brazo pivotante
fr_ca: bras Pivotant de ''731 Wannabee Strange"
zh_cn: 731 Wannabee Strange、Rover Ruckus、臂枢轴支架

source: When the pockets are designed around a 3D printed part, many new possibilities open up in terms of minimum inner corner radius, resolution and dimensions. Now of course, 3D printed parts can be pocketed in the same way as traditional parts with similar results.
es_mx: Cuando el pocketing se diseña en torno a una pieza impresa en 3D, se abren muchas nuevas posibilidades en cuanto a radio mínimo de las esquinas interiores, resolución y dimensiones. Ahora, por supuesto, en las piezas impresas en 3D se puede hacer el pocketing del mismo modo que las piezas tradicionales con resultados similares.
fr_ca: Lorsque les poches sont conçues autour d'une pièce imprimée en 3D, de nombreuses nouvelles possibilités s'ouvrent en termes de rayon minimal de l'angle intérieur, de résolution et de dimensions. Bien entendu, les pièces imprimées en 3D peuvent être empochées de la même manière que les pièces traditionnelles, avec des résultats similaires.
zh_cn: 当口袋围绕3D印刷零件设计时，在最小内角半径、分辨率和尺寸方面开辟了许多新的可能性。现在当然，3D印刷零件可以像传统零件一样装入口袋，结果相似。

source: CAD Tutorial Part 3 - Custom Pulley Template
es_mx: Tutorial CAD Parte 3 - Plantilla de polea personalizada
fr_ca: CAO Tutoriel Partie 3 - Modèle de poulie personnalisé
zh_cn: CAD教程第3部分-定制滑轮模板

source: When designing methods of power transmission, it's useful to have an adjustable pulley generator to rapidly rearrange C-C (center to center) distance for design changes. Typically, FTC teams use the HTD5 belt profile due to its deep tooth profile, which adds resistance to slipping and increases load capacity. This tutorial will focus on the HTD5 profile, but it is relatively easy to adapt for different profiles.
es_mx: A la hora de diseñar métodos de transmisión de potencia, resulta útil disponer de un generador de poleas ajustable que permita reajustar rápidamente la distancia C-C (centro a centro) para realizar cambios en el diseño. Normalmente, los equipos de FTC utilizan el perfil de correa HTD5 debido a su perfil de dientes profundos, que añade resistencia al deslizamiento y aumenta la capacidad de carga. Este tutorial se centrará en el perfil HTD5, pero es relativamente fácil de adaptar para diferentes perfiles.
fr_ca: Lors de la conception de méthodes de transmission de puissance, il est utile de disposer d'un générateur de poulie réglable pour réorganiser rapidement la distance C-C (centre à centre) en cas de modification de la conception. En général, les équipes de FTC utilisent le profil de courroie HTD5 en raison de sa denture profonde, qui augmente la résistance au glissement et la capacité de charge. Ce tutoriel se concentre sur le profil HTD5, mais il est relativement facile de l'adapter à d'autres profils.
zh_cn: 在设计动力传动方法时，有一个可调节的皮带轮发生器来快速重新安排C-C（中心到中心）距离以进行设计更改是很有用的。通常，FTC团队使用HTD5皮带轮廓，因为它的深齿形增加了滑动阻力并增加了负载能力。本教程将重点介绍HTD5轮廓，但它相对容易适应不同的轮廓。

source: To make the pulley fully parametric (adjustable without redoing the base sketch), we will use Equations (in Solidworks and Creo), Parameters (Fusion 360 and Inventor) or Variables (Onshape). Equations allow a user to quickly adjust values and change multiple dimensions in a sketch or feature.
es_mx: Para hacer la polea totalmente paramétrica (ajustable sin rehacer el croquis base), utilizaremos Ecuaciones (en Solidworks y Creo), Parámetros (Fusion 360 e Inventor) o Variables (Onshape). Las ecuaciones permiten al usuario ajustar rápidamente valores y cambiar múltiples dimensiones en un croquis o elemento.
fr_ca: Pour rendre la poulie entièrement paramétrique (réglable sans avoir à refaire l'esquisse de base), nous utiliserons des équations (dans Solidworks et Creo), des paramètres (Fusion 360 et Inventor) ou des variables (Onshape). Les équations permettent à l'utilisateur d'ajuster rapidement les valeurs et de modifier plusieurs dimensions dans une esquisse ou un élément.
zh_cn: 为了使滑轮完全参数化（无需重做基本草图即可调整），我们将使用方程式（在Solidworks和Creo中）、参数（Fusion 360和Inventor）或变量（Onform）。方程式允许用户快速调整值并更改草图或特征中的多个维度。

source: A screenshot of the "Equations, Global Variables, and Dimensions" view
es_mx: Captura de pantalla de la vista "Ecuaciones, variables globales y dimensiones".
fr_ca: Capture d'écran de la vue "Equations, variables globales et dimensions".
zh_cn: 方程、全局变量和维度 "视图截图

source: First, define a new variable "n" and set a default value of 24. This is crucial since "n" will affect the number of teeth, which will define the angle between teeth and the circular pattern.
es_mx: En primer lugar, defina una nueva variable "n" y establezca un valor por defecto de 24. Esto es crucial ya que "n" afectará al número de dientes, que definirá el ángulo entre los dientes y el patrón circular.
fr_ca: Tout d'abord, définissez une nouvelle variable "n" et fixez une valeur par défaut de 24. Cette étape est cruciale car "n" affectera le nombre de dents, qui définira l'angle entre les dents et le motif circulaire.
zh_cn: 首先，定义一个新变量“n”并设置默认值为24。这一点至关重要，因为“n”将影响牙齿的数量——这将定义牙齿和圆形图案之间的角度。

source: Copy the sketch below.
es_mx: Copia el siguiente esquema.
fr_ca: Copiez le croquis ci-dessous.
zh_cn: 复制下面的草图。

source: The sketch to copy
es_mx: El boceto a copiar
fr_ca: Le croquis à copier
zh_cn: 要复制的草图

source: The 15\ |deg| equation is done by typing =360/"n" into the text box.
es_mx: La ecuación 15\ |deg| se hace escribiendo =360/"n" en la caja de texto.
fr_ca: L'équation de 15\ |deg| se fait en tapant =360/"n" dans la zone de texte.
zh_cn: 在文本框中输入 =360/"n"，就可以得到 15 |deg|等式。

source: Note that 5mm dimension at the top describes arc length, which is done in Solidworks by first selecting the two points and the connecting arc.
es_mx: Tenga en cuenta que los 5 mm de la parte superior describe la longitud del arco, que se realiza en Solidworks seleccionando primero los dos puntos y el arco de conexión.
fr_ca: Notez que la dimension de 5 mm en haut décrit la longueur de l'arc, ce qui est fait dans Solidworks en sélectionnant d'abord les deux points et l'arc de connexion.
zh_cn: 请注意，顶部的5mm尺寸描述了弧长，这是在Solidworks中通过首先选择两点和连接弧来完成的。

source: The two big circles are tangent to the two smaller circles, but the two smaller circles are not tangent to each other.
es_mx: Las dos circunferencias grandes son tangentes a las dos circunferencias pequeñas, pero las dos circunferencias pequeñas no son tangentes entre sí.
fr_ca: Les deux grands cercles sont tangents aux deux petits cercles, mais les deux petits cercles ne sont pas tangents entre eux.
zh_cn: 两个大圆与两个小圆相切，但两个小圆互不相切。
