Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/cad-tutorials.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Leave this sketch as a reference and use "Convert Entities" to create sketches for additional features.
es_mx: Deje este boceto como referencia y utilice "Convertir entidades" para crear bocetos de características adicionales.
fr_ca: Laissez cette esquisse comme référence et utilisez "Convertir les entités" pour créer des esquisses pour des caractéristiques supplémentaires.
zh_cn: 保留此草图作为参考，并使用“转换实体”为附加功能创建草图。

source: The profile of the pulley
es_mx: El perfil de la polea
fr_ca: Le profil de la poulie
zh_cn: 滑轮轮廓

source: Next, extrude the outer bold circle. Cut-extrude the profile in the reference sketch. Do these features separately.
es_mx: A continuación, extruya el círculo exterior en negrita. Corte-extruya el perfil en el croquis de referencia. Realice estas operaciones por separado.
fr_ca: Ensuite, extrudez le cercle extérieur en gras. Coupez-extrudez le profil de l'esquisse de référence. Réalisez ces fonctions séparément.
zh_cn: 接下来，挤出外部粗体圆圈。切割-挤出参考草图中的轮廓。分别执行这些功能。

source: A screenshot of the tool to create the circular pattern of the next step
es_mx: Una captura de pantalla de la herramienta para crear el patrón circular del siguiente paso
fr_ca: Capture d'écran de l'outil permettant de créer le motif circulaire de l'étape suivante
zh_cn: 创建下一步的圆形图案的工具截图

source: Now, just create a Circular Pattern. Define Direction 1 as the top face and create "n" instances of the cut-extrude feature.
es_mx: Ahora, cree un Patrón Circular. Defina la Dirección 1 como la cara superior y cree "n" instancias de la función cortar-extruir.
fr_ca: Il suffit maintenant de créer un motif circulaire. Définissez la direction 1 comme la face supérieure et créez "n" instances de la fonction de découpe-extrusion.
zh_cn: 现在，只需创建一个圆形图案。将方向1定义为顶面并创建“n”个切割挤压特征的实例。

source: The CAD of the pulley with dimensions
es_mx: El CAD de la polea con dimensiones
fr_ca: La CAD de la poulie avec ses dimensions
zh_cn: 滑轮 CAD 的尺寸

source: Now just sketch on the side plane and sketch the flanges. This is up to you, but I prefer to keep the outer point vertical to a point pierced through the outer circle. That way, the flange changes with respect to "n".
es_mx: Ahora dibuje en el plano lateral y dibuje las bridas. Esto depende de ti, pero yo prefiero mantener el punto exterior vertical a un punto atravesado por el círculo exterior. De esta forma, la brida cambia con respecto a "n".
fr_ca: Il ne reste plus qu'à faire une esquisse sur le plan latéral et à dessiner les brides. C'est à vous de décider, mais je préfère garder le point extérieur vertical à un point percé dans le cercle extérieur. De cette façon, la bride change par rapport à "n".
zh_cn: 现在只需在侧平面上绘制草图并绘制法兰。这取决于你，但我更喜欢保持外部点垂直于穿过外部圆的点。这样，法兰相对于“n”发生变化。

source: The complete CAD of the pulley
es_mx: El CAD completo de la polea
fr_ca: La CAD complète de la poulie
zh_cn: 滑轮的完整 CAD

source: After selecting a drivebase, determine the number of motors. Keep in mind the eight motor limit is a pain that shouldn't be ignored. A good rule of thumb is four motors for driving and four motors for the other mechanisms (e.g. intakes, linear slides, arm, etc.) For most modern FTC games, you need minimum 7 motors to be highly competitive, although 8 is a good rule of thumb.
ro_ro: După selectarea unui șasiu, determinați numărul de motoare. Rețineți că limita de opt motoare este o cerintă care nu trebuie ignorată. Un sfat este sa folosești patru motoare pentru transmisie și patru motoare pentru celelalte mecanisme (de exemplu intake, glisiere liniare, braț etc.) Pentru majoritatea jocurilor FTC moderne, aveți nevoie de minimum 7 motoare pentru a fi foarte competitivi, deși 8 este o bună regulă de bază.
