Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/cad.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: However, **it isn't available for Mac users**, and you'll need a pretty beefy computer to run it (16GB RAM is standard). SolidWorks also comes with a solid simulation program if you wish to test the structural properties of your robot or a custom-designed part.
es_mx: Sin embargo, **no está disponible para usuarios de Mac**, y necesitarás un ordenador bastante potente para ejecutarlo (16 GB de RAM de serie). SolidWorks también incluye un programa de simulación de sólidos si desea probar las propiedades estructurales de su robot o de una pieza diseñada a medida.
fr_ca: Cependant, **il n'est pas disponible pour les utilisateurs de Mac**, et vous aurez besoin d'un ordinateur assez puissant pour le faire fonctionner (16 Go de RAM en standard). SolidWorks est également livré avec un programme de simulation des solides si vous souhaitez tester les propriétés structurelles de votre robot ou d'une pièce conçue sur mesure.
ja_jp: ただし、**Macユーザーは利用できない**。他にも、実行するにはかなり強力なコンピューターが必要だ（16GB RAMが標準）。SolidWorksには、ロボットやカスタム設計部品の構造特性をテストするためのソリッドシミュレーションプログラムも付属している。
ru_ru: Однако **она недоступна для пользователей Mac**, и для ее запуска вам понадобится довольно мощный компьютер (в стандартную комплектацию входит 16 ГБ оперативной памяти). При этом SolidWorks располагает встроенным модулем прочностного анализа, позволяющим тестировать конструкцию робота и собственных деталей на нагрузку.
zh_cn: 然而，**它不适用于Mac用户**，你需要一台相当结实的计算机来运行它（标准运行内存大小为16GB RAM）。如果你想测试机器人或定制设计部件的结构特性，SolidWorks还带有一个可靠的模拟程序。

source: If you have mentors or team members with previous experience in SolidWorks or an engineering class at your school that teaches SolidWorks, it will be your best choice.
es_mx: Si tiene mentores o miembros del equipo con experiencia previa en SolidWorks o una clase de ingeniería en su escuela que enseñe SolidWorks, será su mejor opción.
fr_ca: Si vous avez des mentors ou des membres de l'équipe qui ont déjà une expérience de SolidWorks ou un cours d'ingénierie dans votre école qui enseigne SolidWorks, ce sera votre meilleur choix.
ja_jp: SolidWorksの使用経験があるメンターやチームメンバーがいる場合、または学校でSolidWorksを教えるエンジニアリングクラスがある場合は、SolidWorksが最適のオプションだろう。
ro_ro: Dacă ai mentori sau membri în echipă cu experiență în SolidWorks sau ai cursuri la școală care te învață SolidWorks, este cea mai bună opțiune pentru tine.
ru_ru: Если у вас есть наставники или участники команды с предыдущим опытом работы в SolidWorks или в вашей школе есть инженерный класс, где преподается SolidWorks, это будет ваш лучший выбор.
zh_cn: 如果你有导师或团队成员有SolidWorks的经验，或者你的学校有教授SolidWorks的工程课程，这将是你最好的选择。

source: Autodesk's industrial CAD offering. It offers many similar features to SolidWorks, but has a different UI and three distinct assembly modes.
es_mx: La oferta de CAD industrial de Autodesk. Ofrece muchas funciones similares a SolidWorks, pero tiene una interfaz de usuario diferente y tres modos de ensamblaje distintos.
fr_ca: L'offre de CAD industrielle d'Autodesk. Elle offre de nombreuses fonctionnalités similaires à celles de SolidWorks, mais dispose d'une interface utilisateur différente et de trois modes d'assemblage distincts.
ja_jp: Autodeskが提供する産業用CAD。SolidWorksと似たような機能を多く備えているが、UIが異なり、3つのアセンブリモードがある。
ru_ru: Промышленный CAD Autodesk. Он предлагает множество функций, схожих с SolidWorks, но отличается пользовательским интерфейсом и тремя различными режимами работы со сборками.
zh_cn: Autodesk的工业CAD产品。它提供了许多与SolidWorks相似的功能，但具有不同的UI和三种不同的组装模式。

source: While it's used by many companies in the industry, it doesn't appear in very many college curriculums. Inventor is generally the second choice for companies who don't use SolidWorks but instead are based around the Autodesk universe.
es_mx: Aunque lo utilizan muchas empresas del sector, no aparece en muchos planes de estudios universitarios. Inventor suele ser la segunda opción para las empresas que no utilizan SolidWorks, sino que se basan en el universo de Autodesk.
fr_ca: Bien qu'il soit utilisé par de nombreuses entreprises du secteur, il ne figure pas dans beaucoup de programmes d'études universitaires. Inventor est généralement le deuxième choix pour les entreprises qui n'utilisent pas SolidWorks mais sont plutôt basées sur l'univers Autodesk.
ja_jp: 産業界の多くの企業で使用されているが、大学のカリキュラムにはあまり登場しない。Inventorは一般的に、SolidWorksを使用せず、Autodeskのサービスをベースとする企業のCADプログラムとして2番目の選択肢となっている。
ru_ru: Хотя его используют многие компании в отрасли, он редко встречается в университетских программах. Inventor обычно становится выбором компаний, которые не работают с SolidWorks, а ориентированы на экосистему Autodesk.
zh_cn: 虽然该行业的许多公司都在使用它，但它并没有出现在很多大学课程中。对于不使用SolidWorks而是基于Autodesk universe.来说，Inventor通常是第二选择。

source: **Inventor is also not available for Mac**, but it may run better on lower-spec PCs.
es_mx: **Inventor tampoco está disponible para Mac**, pero es posible que funcione mejor en PCs con menor rendimiento.
fr_ca: **Inventor n'est pas non plus disponible pour Mac**, mais il fonctionnera peut-être mieux sur des PC moins performants.
ja_jp: **InventorはMacでは使用できない**が、低スペックのPCでは他のCADプログラムと比べよく動作するかもしれない。
ro_ro: **Inventor de asemenea nu este disponibil pentru Mac**, însă poate rula mai bine pe calculatoarele mai puțin perfomante.
ru_ru: **Inventor также недоступен для Mac**, но может работать лучше на менее производительных ПК.
zh_cn: **Inventor也不适用于Mac**，但它可能在低规格的PC上运行得更好。

source: If you have mentors or team members with previous experience in Inventor or an engineering class at your school that teaches Inventor, it will be your best choice.
es_mx: Si tienes mentores o miembros del equipo con experiencia previa en Inventor o una clase de ingeniería en tu escuela que enseñe Inventor, será tu mejor opción.
fr_ca: Si vous avez des mentors ou des membres de l'équipe qui ont déjà une expérience d'Inventor ou si vous avez une classe d'ingénierie dans votre école qui enseigne Inventor, ce sera votre meilleur choix.
ja_jp: Inventorの使用経験があるメンターやチームメンバーがいる場合、または学校でInventorを使うエンジニアリングクラスがある場合は、Inventorが最適のオプションだろう。
ro_ro: Daca ai mentori sau membri cu experiență în Inventor sau un curs la școală care predă Inventor, este cea mai bună opțiune pentru tine.
ru_ru: Если у вас есть наставники или участники команды с предыдущим опытом работы в Inventor или в вашей школе есть инженерный класс, где преподается Inventor, это будет ваш лучший выбор.
zh_cn: 如果你有导师或团队成员有在Inventor的经验，或者在你的学校教授Inventor的工程课程，这将是你最好的选择。

source: A cloud-based all-in-one CAD/CAM package, also made by Autodesk. Fusion 360 is cross platform compatible, although it doesn't run very well on low-spec computers.
es_mx: Un paquete de CAD/CAM todo en uno basado en la nube, también de Autodesk. Fusion 360 es compatible con varias plataformas, aunque no funciona muy bien en ordenadores de bajo rendimiento.
fr_ca: Un logiciel de CAO/FAO tout-en-un basé sur le nuage informatique, également fabriqué par Autodesk. Fusion 360 est compatible avec toutes les plateformes, bien qu'il ne fonctionne pas très bien sur les ordinateurs de faible puissance.
ja_jp: 同じくAutodesk製のクラウドベースのオールインワンCAD/CAM（Computer-aided manufucturing） パッケージ。Fusion 360はクロスプラットフォームに対応しているが、低スペックのコンピューターではあまりうまく動作しない。
ru_ru: Облачный комплексный CAD/CAM-пакет, также созданный Autodesk. Fusion 360 совместим с несколькими платформами, хотя и не очень хорошо работает на слабых компьютерах.
zh_cn: 基于云的一体化CAD/CAM包，也是由Autodesk制造的。Fusion 360是跨平台兼容的，尽管它在低规格计算机上运行得不太好。

source: It has a powerful CAM environment for machining your parts, and it has intuitive and easy cloud rendering that gives the heavy lifting to Autodesk's servers. To maintain a simpler UI, Fusion skips out on a lot of the more advanced features found in SolidWorks and Inventor, although this isn't really much of a problem.
es_mx: Dispone de un potente entorno CAM para el maquinado de sus piezas, y cuenta con un renderizado en la nube intuitivo y sencillo que cede el trabajo pesado a los servidores de Autodesk. Para mantener una interfaz de usuario más sencilla, Fusion omite muchas de las funciones más avanzadas de SolidWorks e Inventor, aunque esto no supone un gran problema.
fr_ca: Il dispose d'un puissant environnement de FAO pour l'usinage de vos pièces et d'un rendu intuitif et facile dans le nuage informatique qui confie le gros du travail aux serveurs d'Autodesk. Pour conserver une interface utilisateur plus simple, Fusion ne dispose pas d'un grand nombre de fonctionnalités plus avancées que l'on trouve dans SolidWorks et Inventor, mais ce n'est pas vraiment un problème.
ja_jp: パーツを加工するための強力なCAM環境があり、直感的で簡単なクラウドレンダリングにより、重労働をAutodeskのサーバーに任せることができる。シンプルなUIを提供するため、FusionはSolidWorksやInventorにある多くの高度な機能を省いているが、これはさほどの問題ではない。
ru_ru: Он обладает мощной CAM-средой для обработки ваших деталей на станках с ЧПУ, а также интуитивно понятной облачной системой рендеринга, которая перекладывает основную вычислительную нагрузку на серверы Autodesk. Чтобы упростить пользовательский интерфейс, Fusion отказывается от многих более продвинутых функций SolidWorks и Inventor, хотя на самом деле это не такая уж большая проблема.
zh_cn: 它有一个强大的计算机辅助制造环境来加工你的零件，它有直观简单的云渲染，给Autodesk的服务器带来了繁重的工作。为了保持更简单的UI，Fusion简化了SolidWorks和Inventor中的许多更高级的功能，尽管这不是什么大问题。

source: However, a more noteworthy difference is that Fusion ignores every single industry standard, creating its own structure and organizational system. Beyond simple sketches and extrude features, Fusion's modeling and assembly system is unique and not compatible with any other CAD software, making it hard to switch away from Fusion.
es_mx: Sin embargo, una diferencia más notable es que Fusion ignora todos y cada uno de los estándares del sector, creando su propia estructura y sistema organizativo. Más allá de simples bocetos y funciones de extrusión, el sistema de modelado y ensamblaje de Fusion es único y no es compatible con ningún otro software de CAD, por lo que resulta difícil cambiar de Fusion.
fr_ca: Cependant, la différence la plus notable est que Fusion ignore toutes les normes industrielles et crée sa propre structure et son propre système d'organisation. Au-delà des simples esquisses et des fonctions d'extrusion, le système de modélisation et d'assemblage de Fusion est unique et n'est compatible avec aucun autre logiciel de CAD, ce qui fait qu'il est difficile de se passer de Fusion.
ja_jp: しかし、それ以上に注目すべき点は、Fusion 360があらゆる業界標準を無視し、独自の構造と組織システムを構築していることだ。単純なスケッチや押し出し機能を除くと、フュージョンのモデリングとアセンブリのシステムは独特で、他のCADソフトとの互換性がないため、フュージョンから乗り換えるのは難しい。
ru_ru: Однако более примечательным отличием является то, что Fusion игнорирует все отраслевые стандарты, создавая свою собственную структуру и организационную систему. Помимо простых скетчей и функций вытягивания, система моделирования и сборки Fusion уникальна и не совместима ни с каким другим программным обеспечением САПР, что затрудняет переход от Fusion к другому программному обеспечению.
zh_cn: 然而，更值得注意的区别是，Fusion忽略了所有行业标准，创建了自己的结构和组织系统。除了简单的草图和导出功能之外，Fusion的建模和组装系统是独一无二的，与任何其他CAD软件都不兼容，这使得它很难从Fusion中切换出来。

source: Because of this, if you aren't careful, Fusion's file hierarchy can actively encourage bad design habits and discourages reusability by allowing users to create new parts without designing them individually first.
es_mx: Debido a esto, si no se tiene cuidado, la jerarquía de archivos de Fusion puede fomentar activamente los malos hábitos de diseño y desalienta la reutilización al permitir a los usuarios crear nuevas piezas sin diseñarlas primero individualmente.
fr_ca: C'est pourquoi, si vous n'y prenez pas garde, la hiérarchie des fichiers de Fusion peut encourager activement les mauvaises habitudes de conception et décourager la réutilisation en permettant aux utilisateurs de créer de nouvelles pièces sans les concevoir d'abord individuellement.
ja_jp: このため気をつけないと、Fusion 360のファイル階層は悪い設計習慣を助長する。ユーザーは最初に個別に設計することなく新しいパーツを作成できるため、設計の再利用性を阻害してしまう可能性がある。
ru_ru: Из-за этого, если вы не будете осторожны, файловая иерархия Fusion может активно поощрять плохие привычки проектирования и препятствовать повторному использованию, позволяя пользователям создавать новые детали без предварительного их индивидуального проектирования.
zh_cn: 因此，如果你不小心，Fusion的文件层次结构可以通过允许用户创建新部件而不首先单独设计它们来积极鼓励不良设计习惯并阻止可重用性。

source: If one is careful to follow good design practices, Fusion is a solid option.
es_mx: Si se tienen en cuenta las buenas prácticas de diseño, Fusion es una opción sólida.
fr_ca: Si l'on veille à respecter les bonnes pratiques de conception, Fusion est une option solide.
ja_jp: 優れた設計手法に注意深く従えば、Fusion 360は堅実な選択肢だ。
ro_ro: Dacă ești atent să urmezi obiceiuri bune de design, Fusion este o alegere bună.
ru_ru: При осознанном соблюдении принципов грамотного проектирования Fusion представляет собой надежный и продуманный инструмент.
zh_cn: 如果一个人小心翼翼地遵循良好的设计实践，Fusion是一个可靠的选择。

source: `Creo (formerly known as Pro/E) <https://www.ptc.com/en/products/education/free-software/standalone-educator>`_
ro_ro: `Creo (numit înainte Pro/E) <https://www.ptc.com/en/products/education/free-software/standalone-educator>`_
zh_cn: `Creo (之前称为 Pro/E) <https://www.ptc.com/en/products/education/free-software/standalone-educator>`_

source: A family of CAD/CAM applications developed by PTC (Parametric Technology Corporation). Creo parametric is the main CAD package that includes robust assembly and part modeling similar to Solidworks.
es_mx: Familia de aplicaciones CAD/CAM desarrollada por PTC (Parametric Technology Corporation). Creo parametric es el principal paquete CAD que incluye un sólido modelado de ensamblajes y piezas similar al de Solidworks.
fr_ca: Famille d'applications de CAD/FAO développée par PTC (Parametric Technology Corporation). Creo parametric est le principal logiciel de CAD qui comprend des fonctions robustes d'assemblage et de modélisation de pièces similaires à celles de Solidworks.
ja_jp: PTC（Parametric Technology Corporation）が開発したCAD/CAMアプリケーションの群。主要なCADパッケージCreo parametricは、Solidworksに似た堅牢なアセンブリとパーツモデリングを含む。
ro_ro: O familie de aplicații CAD/CAM dezvoltată de PTC (Parametric Technology Corporation). Creo este aplicația principală CAD care include un sistem robust de asamblare și modelare similară cu SolidWorks.
ru_ru: Семейство CAD/CAM-приложений, разработанных компанией PTC (Parametric Technology Corporation). Creo parametric - это основной пакет CAD, который включает в себя надежную сборку и моделирование деталей, аналогичное Solidworks.
zh_cn: 由PTC（参数化技术公司）开发的一系列CAD/CAM应用程序。Creo参数化是主要的CAD软件包，包括类似于Solidworks的装配体和零件建模。

source: The main advantage of Creo compared to other CAD software is the complex part relations and constraints, however, most new users find this aspect difficult to grasp completely. The Creo package includes an integrated local rendering engine and thorough simulation system. The rendering engine can be used to create photo-realistic renders of anything between single-part simple to multi-component complex designs. Design enhancements can be directly integrated into parts from materials/geometry simulations in Creo Simulate.
es_mx: La principal ventaja de Creo frente a otros programas de CAD son las complejas relaciones y restricciones de las piezas; sin embargo, a la mayoría de los nuevos usuarios les resulta difícil comprender completamente este aspecto. El paquete Creo incluye un motor de renderizado local integrado y un minucioso sistema de simulación. El motor de renderizado puede utilizarse para crear renderizados fotorrealistas de todo tipo de diseños, desde los sencillos de una sola pieza hasta los complejos de varios componentes. Las mejoras de diseño pueden integrarse directamente en las piezas a partir de simulaciones de materiales/geometría en Creo Simulate.
fr_ca: Le principal avantage de Creo par rapport à d'autres logiciels de CAD réside dans les relations et les contraintes complexes entre les pièces, mais la plupart des nouveaux utilisateurs ont du mal à saisir complètement cet aspect. Le logiciel Creo comprend un moteur de rendu local intégré et un système de simulation complet. Le moteur de rendu peut être utilisé pour créer des rendus photoréalistes de n'importe quel type de conception, qu'il s'agisse de pièces simples ou de conceptions complexes à plusieurs composants. Les améliorations apportées à la conception peuvent être directement intégrées aux pièces à partir de simulations de matériaux/géométrie dans Creo Simulate.
ja_jp: 他のCADソフトウェアと比較した場合のCreoの主な利点は、複雑な部品関係と拘束条件が反映されることである。しかし、ほとんどの新規ユーザーはこの側面を完全に把握することが困難であると感じるだろう。Creoパッケージには、ローカルレンダリングエンジンと徹底したシミュレーションシステムが組み込まれている。レンダリングエンジンを使用すると、単一部品のシンプルな設計から複数部品の複雑な設計まで、フォトリアリスティックなレンダリングを作成できる。また、Creo Simulateでのマテリアル/ジオメトリシミュレーションから、設計の改良を部品に直接統合することができる。
ro_ro: Avantajul principal al Creo comparativ cu alte programe CAD este sistemul complex de relaționare și constrângere, totuși, multi utilizatori găsesc acest aspect greu de înțeles. Programul Creo include un sistem integrat de randare și simulare cuprinzător. Motorul de randare poate fi folosit pentru a crea randări foto-realistice pentru piese unice sau design-uri cu mai multe componente. Cu Creo Simulate, poți integra îmbunătățiri ale modelelor 3D direct din materialul/geometria componentelor.
ru_ru: Основным преимуществом Creo по сравнению с другими CAD-программами — сложные параметрические связи и зависимости между компонентами, однако большинству новичков этот аспект сложно полностью освоить. Пакет Creo включает в себя интегрированный локальный движок рендеринга и систему тщательного моделирования. Движок рендеринга можно использовать для создания фотореалистичных изображений любых объектов - от простых однокомпонентных до сложных многокомпонентных конструкций. Улучшения дизайна могут быть непосредственно интегрированы в детали с помощью моделирования материалов/геометрии в Creo Simulate.
zh_cn: 与其他CAD软件相比，Creo的主要优势在于复杂的零件关系和约束，然而，大多数新用户发现这方面很难完全掌握。Creo软件包包括一个集成的本地渲染引擎和全面的模拟系统。渲染引擎可用于创建从单部分简单到多组件复杂设计之间的任何事物的照片般逼真的渲染。设计增强功能可以直接集成到Creo模拟中的材料/几何模拟中的零件中。

source: Creo has many features, but the general 80-20 rule applies - 20% of the features will create 80% of the designs. The Creo package also includes a version based file sharing system called Windchill which most professional companies use, but for FTC purposes Grabcad will suffice.
es_mx: Creo tiene muchas funciones, pero se aplica la regla general del 80-20: el 20% de las funciones creará el 80% de los diseños. El paquete Creo también incluye un sistema de intercambio de archivos basado en versiones llamado Windchill, que utilizan la mayoría de las empresas profesionales, pero para los fines de FTC bastará con Grabcad.
fr_ca: Creo possède de nombreuses fonctionnalités, mais la règle générale des 80-20 s'applique - 20 % des fonctionnalités créeront 80 % des conceptions. L'ensemble Creo comprend également un système de partage de fichiers basé sur les versions, appelé Windchill, que la plupart des entreprises professionnelles utilisent, mais pour les besoins en FTC, Grabcad suffira.
ja_jp: Creoには多くの機能があるが、一般的な80：20の法則が適用され‐20%の機能で80%の設計ができる。Creoのパッケージには、Windchillと呼ばれるバージョンベースのファイル共有システムも含まれており、ほとんどの専門企業はこれを使用するが、FTCの用途にはGrabcadで十分だ。
ro_ro: Creo are multe funcții, dar în general regula 80-20 se aplică - 20% din funcții sunt folosite pentru a crea 80% din modele. Pachetul Creo de asemenea include un sistem de partajare al fișierelor pe versiuni numit Windchill, pe care cele mai multe companii îl folosesc, însă pentru FTC, Grabcad este suficient.
ru_ru: Creo обладает множеством функций, но действует общее правило 80 на 20: 20% функций позволят создать 80% проектов. Пакет Creo также включает в себя версию системы обмена файлами Windchill, которую используют большинство профессиональных компаний, но для целей FTC будет достаточно Grabcad.
zh_cn: Creo有很多功能，但是一般的80-20规则适用——20%的功能将创建80%的设计。Creo软件包还包括一个基于版本的文件共享系统，称为Windchill，大多数专业公司都使用它，但对于FTC目的，Grabcad就足够了。

source: Learning Creo can be more of a challenge than other CAD software, because of the limited available tutorials online in addition to the complex relations and constraints structure. Our recommendation is to learn Creo from someone who already has experience with the software.
es_mx: El aprendizaje de Creo puede ser más complicado que el de otros programas CAD, debido a la escasez de tutoriales disponibles en línea, además de la compleja estructura de relaciones y restricciones. Nuestra recomendación es aprender Creo de alguien que ya tenga experiencia con el software.
fr_ca: L'apprentissage de Creo peut s'avérer plus difficile que celui d'autres logiciels de CAO, en raison du nombre limité de tutoriels disponibles en ligne et de la structure complexe des relations et des contraintes. Nous vous recommandons d'apprendre Creo avec quelqu'un qui a déjà de l'expérience avec le logiciel.
ja_jp: Creoの学習は、複雑な関係と制約の構造に加えて、オンラインで利用できるチュートリアルが限られているため、他のCADソフトウェアよりも難しいと感じる場合が多い。すでにCreoを使用した経験のある人からCreoを学ぶことができるならお勧めする。
ro_ro: A învăța Creo poate să fie mai greu decât orice alt program CAD, din cauza lipsei de tutoriale online, plus sistemul complex de relaționare și constrângere. Recomandarea noastră este să înveți Creo de la cineva care are deja experiență cu acest program.
ru_ru: Изучение Creo может оказаться более сложной задачей, чем других программ CAD, из-за ограниченного количества доступных онлайн-руководств, а также сложной системы параметрических связей. Мы рекомендуем изучать Creo у тех, кто уже имеет опыт работы с этим программным обеспечением.
zh_cn: 学习Creo可能比其他CAD软件更具挑战性，因为除了复杂的关系和约束结构之外，在线可用教程有限。我们的建议是向已经使用该软件的人学习Creo。

source: College-level engineering classes as well as numerous companies in the automotive, aerospace and consumer industry use Creo. Since Creo makes use of Windows OS file system it will not run on Mac. However, a Windows emulator can be installed to run Creo on Mac.
es_mx: Las clases de ingeniería de nivel universitario, así como numerosas empresas de la industria automóvilistíca, aeroespacial y de consumo utilizan Creo. Dado que Creo utiliza el sistema de archivos del sistema operativo Windows, no funciona en Mac. Sin embargo, puede instalarse un emulador de Windows para ejecutar Creo en Mac.
fr_ca: Des classes d'ingénieurs de niveau universitaire ainsi que de nombreuses entreprises des secteurs de l'automobile, de l'aérospatiale et des biens de consommation utilisent Creo. Comme Creo utilise le système de fichiers du système d'exploitation Windows, il ne fonctionnera pas sur Mac. Toutefois, un émulateur Windows peut être installé pour faire fonctionner Creo sur Mac.
ja_jp: Creoは、大学レベルのエンジニアリングクラスや、自動車、航空宇宙、コンシューマー業界の数多くの企業で使用されている。相変わらずCreoはWindows OSのファイルシステムを使用しているため、Macでは動作しない。ただし、Windowsエミュレータをインストールすることで、Mac上でCreoを実行することもできる。
ro_ro: Cursurile de inginerie ale universitatilor și numeroase companii din industria auto, aerospațială și a consumatorilor folosesc Creo. Din moment ce Creo se folosește de sistemul Windows, acesta nu poate rula pe Mac. Totuși, un emulator de Windows poate fi instalat pentru a utiliza Creo pe Mac.
ru_ru: На инженерных факультетах колледжей, а также во многих компаниях автомобильной, аэрокосмической и потребительской промышленности используется Creo. Поскольку Creo использует файловую систему операционной системы Windows, она не будет работать на Mac. Однако для запуска Creo на Mac можно установить эмулятор Windows.
zh_cn: 大学级别的工程课程以及汽车、航空航天和消费行业的许多公司都使用Creo。由于Creo使用WindowsOS文件系统，因此无法在Mac上运行。但是，可以安装一个Windows模拟器来在Mac上运行Creo。

source: Getting Parts
es_mx: Obtención de piezas
fr_ca: Obtention de pièces
ja_jp: 部品調達
ro_ro: Descărcarea Pieselor
ru_ru: Готовые детали
zh_cn: 获取零件模型
