Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/cad.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: All vendors (REV, goBILDA, Actobotics, AndyMark, Tetrix) provide 3d models of the parts they sell in STEP format, which can be imported by any of the CAD programs above. Some vendors also offer repositories or zip files containing :term:`STEP file` of all the models they sell.
es_mx: Todos los vendedores (REV, goBILDA, Actobotics, AndyMark, Tetrix) proporcionan modelos 3d de las piezas que venden en formato STEP, que pueden ser importados por cualquiera de los programas CAD mencionados anteriormente. Algunos proveedores también ofrecen repositorios o archivos zip que contienen :term:`archivo STEP` de todos los modelos que venden.
fr_ca: Tous les fournisseurs (REV, goBILDA, Actobotics, AndyMark, Tetrix) fournissent des modèles 3D des pièces qu'ils vendent au format STEP, qui peuvent être importés par n'importe lequel des programmes de CAO ci-dessus. Certains fournisseurs proposent également des référentiels ou des fichiers zip contenant :term:`STEP file` de tous les modèles qu'ils vendent.
ja_jp: すべてのベンダー（REV、goBILDA、Actobotics、AndyMark、Tetrix）は、販売しているパーツの3DモデルをSTEPフォーマットで提供している。ベンダーによっては、販売しているすべてのモデルの :term:`STEPファイル` を含むリポジトリやzipファイルを提供しているところもある。
ro_ro: Toți vânzătorii (REV, goBILDA, Actobotics, AndyMark, Tetrix) au pus la dispoziție modele 3D pentru piesele pe care le vând în format STEP, care poate fi importat în orice program CAD descris mai sus. Unii vânzători de asemenea oferă repository-uri sau fișiere zip cu :term:`fisierele STEP` ale tuturor modelor pe care le vând.
ru_ru: Все поставщики (REV, goBILDA, Actobotics, AndyMark, Tetrix) предоставляют 3d-модели деталей, которые они продают, в формате STEP, которые могут быть импортированы с помощью любой из вышеперечисленных CAD-программ. Некоторые производители дополнительно публикуют централизованные репозитории или zip-файлы с полными каталогами своей продукции в STEP-формате.
zh_cn: 所有供应商（REV、goBILDA、Actobotics、AndyMark、Tetrix）都以STEP格式提供他们销售的零件的3D模型，可以通过上述任何CAD程序导入。一些供应商还提供包含他们销售的所有模型的STEP文件的存储库或zip文件。

source: Vendor CAD Libraries
es_mx: Bibliotecas CAD de proveedores
fr_ca: Bibliothèques des fournisseurs CAD
ja_jp: ベンダーCADライブラリ
ro_ro: Librării CAD
ru_ru: Библиотеки CAD поставщиков
zh_cn: 供应商CAD库

source: `10650 Hazmat Robotics CAD Library <https://workbench.grabcad.com/workbench/projects/gcpgZgLBwhIdL0FfUKJJfM75cqa9RW1ncXaL-lQ4KOl1wa#/space/gcSzacmSeI-l19BYQNPm422pSHLenRxOxVtmaD-Pzynwsq/folder/6578524>`_
ro_ro: `Librăria CAD a echipei 10650 Hazmat Robotics <https://workbench.grabcad.com/workbench/projects/gcpgZgLBwhIdL0FfUKJJfM75cqa9RW1ncXaL-lQ4KOl1wa#/space/gcSzacmSeI-l19BYQNPm422pSHLenRxOxVtmaD-Pzynwsq/folder/6578524>`_
zh_cn: `10650 Hazmat Robotics CAD 库 <https://workbench.grabcad.com/workbench/projects/gcpgZgLBwhIdL0FfUKJJfM75cqa9RW1ncXaL-lQ4KOl1wa#/space/gcSzacmSeI-l19BYQNPm422pSHLenRxOxVtmaD-Pzynwsq/folder/6578524>`_

source: `FTC Onshape Parts Library (contains a majority of parts from most major vendors) <https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_
es_mx: `FTC Onshape Biblioteca de Partes (contiene la mayoría de las piezas de los principales proveedores) <https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_
fr_ca: `FTC Onshape Parts Library (contient une majorité de pièces de la plupart des grands fournisseurs) <https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_
ja_jp: `FTC Onshape Parts Library (ほとんどの主要ベンダーのパーツが含まれている) <https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_
ru_ru: `FTC Onshape Parts Library (содержит большинство комплектующих от многих крупных производителей) <https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_
zh_cn: `FTC Onshape 零件库（包含大多数主要供应商的大部分零件） <https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_

source: File sharing
es_mx: Compartir archivos
fr_ca: Partage de fichiers
ja_jp: ファイル共有
ro_ro: Partajarea Fișierelor
ru_ru: Общий доступ к файлам
zh_cn: 文件共享

source: Teams often have multiple members working on CAD models, and thus require a file sharing system for ensuring that each person has up-to-date files. Some recommendations include GrabCAD, Box, Google Drive, or Dropbox.
es_mx: Los equipos suelen tener varios miembros trabajando en modelos CAD, por lo que necesitan un sistema para compartir archivos que garantice que cada persona dispone de archivos actualizados. Algunas recomendaciones son GrabCAD, Box, Google Drive o Dropbox.
fr_ca: Les équipes comptent souvent plusieurs membres travaillant sur des modèles de CAO et ont donc besoin d'un système de partage de fichiers pour s'assurer que chaque personne dispose de fichiers à jour. Nous recommandons notamment GrabCAD, Box, Google Drive ou Dropbox.
ja_jp: チームでは、複数のメンバーでCADモデルを作業することが多い。そのため、各自が最新のファイルを持つためのファイル共有システムが必要になる。ファイル共有にはGrabCAD、Box、Google Drive、Dropboxなどがおすすめだ。
ro_ro: Echipele de obicei au mai mulți membri care lucrează la modele CAD, și astfel au nevoie de un sistem de partajare a fișierelor pentru a se asigura că fiecare persoană au fișiere actualizate la zi. Niste recomandări includ GrabCAD, Box, Google Drive, sau Dropbox.
ru_ru: В командах над CAD-моделями часто работают несколько участников, поэтому им необходима система обмена файлами, чтобы у каждого были актуальные версии документов. В числе рекомендуемых решений — GrabCAD, Box, Google Drive или Dropbox.
zh_cn: 团队通常有多名成员处理CAD模型，因此需要一个文件共享系统来确保每个人都拥有最新的文件。一些建议包括GrabCAD、Box、Google Drive或Dropbox。

source: It is also a good idea that one team member work on the model at a time to prevent confusion.
es_mx: También es buena idea que un miembro del equipo trabaje en el modelo a la vez para evitar confusiones.
fr_ca: Il est également souhaitable qu'un seul membre de l'équipe travaille sur le modèle à la fois afin d'éviter toute confusion.
ja_jp: また、混乱を防ぐために、一度に一人のチームメンバーのみがモデルの設計に取り組むようにする方が良いだろう。
ro_ro: Este de asemenea recomandat să nu se lucreze simultan pe acelaș model CAD pentru a preveni confuzii.
ru_ru: Также рекомендуется, чтобы над моделью в один момент времени работал только один участник команды — это поможет избежать путаницы.
zh_cn: 此外，最好每次只有一名团队成员制作模型，以防混淆。

source: Useful Resources
es_mx: Recursos útiles
fr_ca: Ressources utiles
ja_jp: 有用な参考資料
ru_ru: Полезные Ресурсы
zh_cn: 有用资源

source: More CAD resources can be found in the :ref:`CAD section of the Useful Resources page <useful-resources-cad>`.
es_mx: Encontrará más recursos CAD en la sección :ref:`CAD de la página Recursos útiles <useful-resources-cad>`.
fr_ca: D'autres ressources CAO sont disponibles dans la section :ref:`CAD de la page Ressources utiles <useful-resources-cad>`.
ja_jp: その他CADのリソースは、:ref:`CAD section of the Useful Resources page <useful-resources-cad>`で見つけられる。
ru_ru: Дополнительные ресурсы по CAD можно найти в соответствующем разделе на странице :ref:`Полезные ресурсы <useful-resources-cad>`.
zh_cn: 更多的CAD资源可以在这里找到 :ref:`CAD section of the Useful Resources page <useful-resources-cad>`.

source: `Creo (formerly known as Pro/E) <https://www.ptc.com/en/education/free-software/creo-standalone-educator>`_
ru_ru: `Creo (ранее известный как Pro/E) <https://www.ptc.com/en/education/free-software/creo-standalone-educator>`_

source: `10650 Hazmat Robotics CAD Library + MiSUMI Parts <https://grabcad.com/library/ftc-cad-files-w-misumi-parts-1>`_
ru_ru: `10650 Hazmat Robotics CAD Library + Детали MiSUMI <https://grabcad.com/library/ftc-cad-files-w-misumi-parts-1>`_

source: CAD is software most commonly used to aid the design and drafting of parts and assemblies in engineering. In FTC, CAD is used to make 3D models of robots as well as design custom parts.
ro_ro: CAD-ul este software cel mai des folosit pentru a facilita design-ul și proiectarea părților și componentelor în inginerie. În FTC, CAD-ul este folosit pentru a face modele 3D ale roboților, cât și pentru design-ul pieselor personalizate.

source: **CAD is not necessary in FTC to build a successful robot.** Many successful teams didn’t CAD their robot at all. Other successful teams only made parts of their robot in CAD. Still other teams fully designed their robot in CAD.
ro_ro: **CAD-ul nu este necesar în FTC pentru a construi un robot de succes.** Multe echipe de succes nu au folosit CAD în roboții lor deloc. Alte echipe de succes au folosit strict CAD pentru a fabrica piese pentru roboții lor. Alte echipe și-au proiectat în totalitate robotul în CAD.

source: There are many possible CAD programs that teams can learn, all of which can be downloaded for free under a student or FTC team license. You’ll have to do a bit of research here, as the requirements for free copies vary based on the program. Here are a couple suggestions to consider:
ro_ro: Există multe programe CAD pe care echipele le pot învăța, toate care pot fi descărcate gratis sub o licență de student sau de echipa FTC. Va trebui să faci puțin research aici, din moment ce obligațiile pentru o copie gratis variază de la program la altul. Aici sunt câteva sugestii:

source: It has all of the same core features as SolidWorks and Inventor, as well as the best collaboration workflow in the industry - many people call it “the Google Docs of CAD.” Onshape allows multiple people to work on the same document at the same time, and allows users to “follow” each other and see what’s on another user’s screen.
ro_ro: Are toate caracteristicile de bază ale programului SolidWorks și Inventor, de asemenea și cel mai bun sistem de colaborare din industrie - mulți îl numesc "Google Docs-ul CAD-ului". Onshape permite mai multor persoane să lucreze pe acelaș document simultan, și le permite acestora să se "urmeze" unul pe altul și să vadă ce este pe ecranul altora.

source: If you’re just starting out with CAD, or you don’t have access to powerful computers, Onshape is the software for you.
ro_ro: Dacă tocmai ai început să înveți CAD, sau nu ai acces la calculatoare performante, Onshape este programul potrivit pentru tine.

source: An industry standard CAD package made by Dassault Systemes. It’s as fully featured as CAD software gets, including great simulation features and a very robust assembly environment. It’s used widely in industry and is also the program of choice for most college-level engineering classes.
ro_ro: Un program standard în îndustria CAD dezvoltat de Dassault Systems. Este cel mai cuprinzător program CAD posibil, cu funcții speciale pentru simulare și un mediu robust de asamblare. Este folosit cel mai mult în industrie și este și cel mai popular program pentru cursurile de inginerie din universități.

source: However, **it isn’t available for Mac users**, and you’ll need a pretty beefy computer to run it (16GB RAM is standard). SolidWorks also comes with a solid simulation program if you wish to test the structural properties of your robot or a custom-designed part.
ro_ro: Totuși, **nu este disponibil pentru utilizatorii de Mac**, și ai nevoie de un calculator performant pentru a-l rula (16GB RAM standard). Solidworks are și un sistem robust de simulare dacă vrei să testezi proprietățile structurale are robotului tău ale pieselor personalizate.

source: Autodesk’s industrial CAD offering. It offers many similar features to SolidWorks, but has a different UI and three distinct assembly modes.
ro_ro: Programul CAD dezvoltat de Autodesk. Oferă multe funcții similare cu SolidWorks, însă are un meniu diferit și trei moduri distincte de asamblare.

source: While it’s used by many companies in the industry, it doesn’t appear in very many college curriculums. Inventor is generally the second choice for companies who don’t use SolidWorks but instead are based around the Autodesk universe.
ro_ro: Deși este folosit de multe companii în industrie, nu este inclus în programul multor universități. Inventor este în general a doua alegere pentru companiile care nu folosesc SolidWorks, însă sunt implicate în ecosistemul Autodesk.

source: A cloud-based all-in-one CAD/CAM package, also made by Autodesk. Fusion 360 is cross platform compatible, although it doesn’t run very well on low-spec computers.
ro_ro: Un program online CAD/CAM, de asemenea dezvoltat de Autodesk. Fusion 360 este disponibil pe toate platformele, însă nu rulează prea bine pe calculatoare slabe.

source: It has a powerful CAM environment for machining your parts, and it has intuitive and easy cloud rendering that gives the heavy lifting to Autodesk’s servers. To maintain a simpler UI, Fusion skips out on a lot of the more advanced features found in SolidWorks and Inventor, although this isn’t really much of a problem.
ro_ro: Este un mediu CAM puternic pentru fabricarea pieselor tale, și are intuiția și randarea online care pune greutatea pe serverele Autodesk. Pentru a menține un meniu simplu, Fusion nu are funcții la fel de avansate găsite în SolidWorks și Inventor, însă nu este o problemă așa mare.

source: However, a more noteworthy difference is that Fusion ignores every single industry standard, creating its own structure and organizational system. Beyond simple sketches and extrude features, Fusion’s modeling and assembly system is unique and not compatible with any other CAD software, making it hard to switch away from Fusion.
ro_ro: Totuși, este o diferență semnificativă faptul că Fusion ignoră orice standard al industriei, creându-și propria structură și sistem de organizare. Dincolo de schițe simple și funcțiile de extrudare, modelarea în Fusion și sistemul de asamblare este unic și nu este compatibil cu alt program CAD, fiind destul de greu să încerci alt program decât Fusion.

source: Because of this, if you aren’t careful, Fusion’s file hierarchy can actively encourage bad design habits and discourages reusability by allowing users to create new parts without designing them individually first.
ro_ro: Din cauza asta, dacă nu ești atent, ierarhia fișierelor în Fusion poate încuraja obiceiuri rele în design și descurajează reutilizarea prin permiterea utilizatorilor să creeze piese noi fără modelarea individuală a lor.

source: `2901 Purple Gears Onshape Parts Library <https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_
ro_ro: `Librăria Onshape a echipei 2901 Purple Gears<https://ftconshape.com/introduction-to-the-ftc-parts-library/>`_
