Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/cad.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: Computer-aided design (CAD)
es_mx: Diseño asistido por computadora (CAD)
fr_ca: Conception assistée par ordinateur (CAO)
ja_jp: コンピュータ支援設計(CAD）
ro_ro: Design Computerizat (CAD)
ru_ru: Computer-aided design (CAD) - Автоматизированное проектирование
zh_cn: 计算机辅助设计（CAD）

source: Introduction
es_mx: Introducción
ja_jp: はじめに
ro_ro: Introducere
ru_ru: Вступление
zh_cn: 简介

source: Term
es_mx: Término
fr_ca: Définition
ja_jp: 用語
ro_ro: Termeni
zh_cn: 术语

source: CAD is software most commonly used to aid the design and drafting of parts and assemblies in engineering. In FTC\ |reg|, CAD is used to make 3D models of robots as well as design custom parts.
es_mx: CAD es el software más comúnmente utilizado para ayudar en el diseño y dibujo de piezas y ensamblajes en ingeniería. En FTC\ |reg|, CAD se utiliza para crear modelos 3D de robots, así como para diseñar piezas personalizadas.
fr_ca: La CAO est un logiciel couramment utilisé pour faciliter la conception et le dessin de pièces et d'assemblages dans le domaine de l'ingénierie. En FTC, la CAO est utilisée pour créer des modèles 3D de robots et concevoir des pièces personnalisées.
ja_jp: CAD（Computer‐aided design）は、エンジニアリングにおける部品やアセンブリの設計や製図を支援するために一般的に使用されるソフトウェアです。FTCでは、ロボットの3Dモデルを作ったり、カスタムパーツを設計したりするのに使われます。
ru_ru: CAD - это программное обеспечение, наиболее часто используемое для проектирования и создания деталей и сборок в инженерии. В FTC\ |reg|, CAD используется для создания 3D-моделей роботов, а также для проектирования нестандартных деталей.
zh_cn: CAD是工程设计中最常用的辅助设计和绘制零件和装配图的软件。在 FTC\ |reg| 中，CAD用于制作机器人的3D模型以及设计定制部件。

source: **CAD is not necessary in FTC to build a successful robot.** Many successful teams didn't CAD their robot at all. Other successful teams only made parts of their robot in CAD. Still other teams fully designed their robot in CAD.
es_mx: **El CAD no es necesario en FTC para construir un robot exitoso.** Muchos equipos exitosos no hicieron el CAD de su robot en absoluto. Otros sólo diseñaron partes de su robot en CAD. Otros equipos diseñaron completamente su robot en CAD.
fr_ca: **La CAO n'est pas nécessaire en FTC pour construire un robot réussi.** De nombreuses équipes gagnantes n'ont pas du tout utilisé la CAO pour leur robot. D'autres équipes n'ont fait que des parties de leur robot en CAO. D'autres encore ont entièrement conçu leur robot en CAO.
ja_jp: **FTCで成功するロボットを作るのにCADは必須ではない。**CADでロボットを完全に設計したチームが多いのは事実だ。しかしそれでも成功した多くのチームの中にはロボットの一部だけをCADで作成しただけのチームもいる。
ru_ru: **Для создания успешного робота в FTC не требуется CAD.** Многие успешные команды вообще не создавали своих роботов в CAD. Другие успешные команды создавали только отдельные части своих роботов в CAD. Другие команды полностью проектировали своих роботов в CAD.
zh_cn: 在FTC建造一个成功的机器人时，计算机辅助设计不是必需的。许多成功的团队根本没有对他们的机器人进行计算机辅助设计。其他成功的团队只在计算机辅助设计中制造了机器人的一部分。还有一些团队完全用计算机辅助设计了他们的机器人。

source: So, what's the point of CAD, then? It is encouraged that new teams try their hand at CAD, especially if you have a mentor or parent who is experienced in such an area. CAD is beneficial for multiple reasons.
es_mx: Entonces, ¿para qué sirve el CAD? Se recomienda a los nuevos equipos que prueben el CAD, sobre todo si tienen un mentor o un padre con experiencia en este campo. El CAD es beneficioso por múltiples razones.
fr_ca: Alors, quel est l'intérêt de la CAO ? Les nouvelles équipes sont encouragées à s'essayer à la CAO, surtout si elles ont un mentor ou un parent qui a de l'expérience dans ce domaine. La CAO est bénéfique pour de multiples raisons.
ja_jp: では、CADは何のためにあるのだろうか？新チームがCADに挑戦することは、特にその分野の経験豊富な指導者や保護者がいる場合に奨励される。CADが有益な理由は複数ある。
ro_ro: Atunci, care e rostul CAD-ului? Este recomandat ca echipele noi să își încerce mâna la CAD, în special dacă ai un mentor sau părinte care are experiență în acest domeniu. CAD este benefic din mai multe motive.
ru_ru: Итак, в чем же тогда смысл CAD? Приветствуется, чтобы новые команды пробовали свои силы в CAD, особенно если у вас есть наставник или родитель, имеющий опыт работы в этой области. CAD полезен по нескольким причинам.
zh_cn: 那么，CAD有什么意义呢？鼓励新团队尝试CAD，特别是如果你有在这方面经验丰富的导师或父母。CAD有多种益处。

source: CAD solves a lot of preventable headaches, such as spacing issues. Thus, it will save time when you discover problems in CAD that you can remediate before you build your robot.
es_mx: El CAD resuelve muchos dolores de cabeza evitables, como los problemas de espaciado. Así, ahorrará tiempo cuando descubra problemas en CAD que podrá solucionar antes de construir su robot.
fr_ca: La CAO permet de résoudre de nombreux problèmes évitables, tels que les problèmes d'espacement. Ainsi, vous gagnerez du temps lorsque vous découvrirez des problèmes dans la CAO auxquels vous pourrez remédier avant de construire votre robot.
ja_jp: CADは、スペーシングの問題など、予防可能な悩みの種の多くを解決する。そのため、CADで問題を発見した場合、ロボットを製作する前に設計の修正することができ、時間の節約につなる。
ro_ro: CAD-ul previne multe dureri de cap, precum probleme legate de spațiu. Asfel, îți va salva timpul când descoperi probleme în CAD ca să le remediezi înainte să îți construiești robotul.
ru_ru: CAD помогает предотвратить множество типичных ошибок, например, проблемы с расположением компонентов. Таким образом, при обнаружении проблем в CAD, которые можно устранить до сборки робота, вы сэкономите время.
zh_cn: CAD能解决许多可预防的问题，例如行间距问题。因此，当你发现CAD中的问题时，它将节省时间，你可以在构建机器人之前修复这些问题。

source: CAD is a professional tool that is used in many STEM fields. Having CAD knowledge and skills will be beneficial in your future career, should you study and work in those fields.
es_mx: El CAD es una herramienta profesional que se utiliza en muchos campos STEM. Tener conocimientos y habilidades de CAD será beneficioso en tu futura carrera, en caso de que estudies y trabajes en esos campos.
fr_ca: La CAO est un outil professionnel utilisé dans de nombreux domaines des STIM. Avoir des connaissances et des compétences en CAO sera bénéfique pour votre future carrière, si vous étudiez et travaillez dans ces domaines.
ja_jp: CADは、多くのSTEM分野で使用されている専門的なツールである。CADの知識とスキルを身につけることは、将来そのような分野で学んだり働いたりする際に有益となるだろう。
ro_ro: CAD-ul este o unealta profesionala care este folosit in multe domenii STEM. Să ai cunoștințe și îndemânare în software CAD va fi benefic în viitoarea ta carieră.
ru_ru: CAD - это профессиональный инструмент, который используется во многих областях STEM. Знания и навыки в области CAD будут полезны в вашей будущей карьере, если вы будете учиться и работать в этих областях.
zh_cn: CAD是一种专业工具，应用于许多STEM领域。如果你在这些领域学习和工作，拥有计算机辅助设计知识和技能将对你未来的职业生涯有益。

source: If you desire to create 3D-printed or machined parts, CAD will be necessary to do so.
es_mx: Si desea crear piezas impresas en 3D o maquinadas, necesitará CAD para ello.
fr_ca: Si vous souhaitez créer des pièces imprimées en 3D ou usinées, la CAO sera nécessaire.
ja_jp: 3Dプリントや機械加工による部品を作りたい場合は、CADが必要になる。
ro_ro: Dacă dorești să creezi piese printate 3D sau fabricate la CNC, CAD-ul este necesar.
ru_ru: Если вы планируете создавать детали с помощью 3D-печати или механической обработки, то использование CAD будет необходимым условием для этого.
zh_cn: 如果你希望创造3D打印或机械加工的零件，CAD将是必要的。

source: CAD can reduce the cost of building a robot by helping to determine which parts you need for a robot before actually spending the money to buy those parts.
es_mx: El CAD puede reducir el coste de construcción de un robot al ayudar a determinar qué piezas se necesitan para un robot antes de gastar realmente el dinero para comprar esas piezas.
fr_ca: La CAO peut réduire le coût de construction d'un robot en aidant à déterminer les pièces dont vous avez besoin pour le robot avant de dépenser l'argent pour acheter ces pièces.
ja_jp: CADは、実際にお金をかけて部品を購入する前に、ロボットに必要な部品を決定するのに役立ち、ロボット製作のコストを削減することにつながる。
ru_ru: Использование CAD позволяет снизить стоимость сборки робота, поскольку помогает точно определить, какие детали вам понадобятся, до фактических затрат на их покупку.
zh_cn: CAD可以通过在实际花钱购买这些零件之前帮助确定你需要机器人的哪些零件来降低构建机器人的成本。

source: **However, CAD is not the magic genie that will guarantee you success in FTC.** When used properly, it is a great tool to aid teams in building their robot. Keep in mind, though, that many teams have had success without CAD.
es_mx: **Sin embargo, el CAD no es el genio mágico que le garantizará el éxito en FTC.** Cuando se utiliza correctamente, es una gran herramienta para ayudar a los equipos en la construcción de su robot. Sin embargo, hay que tener en cuenta que muchos equipos han tenido éxito sin CAD.
fr_ca: **Cependant, la CAO n'est pas le génie magique qui vous garantira le succès en FTC.** Lorsqu'elle est utilisée correctement, c'est un outil formidable pour aider les équipes à construire leur robot. N'oubliez pas, cependant, que de nombreuses équipes ont réussi sans CAO.
ja_jp: **しかし、CAD は FTC での成功を保証する魔法の精霊ではない。CADは正しく扱えたときはじめてロボットの設計を助ける非常に強いツールとなる。多くのチームがCADなしで成功を収めていることを覚えておこう。**
ro_ro: **Totuși, CAD-ul nu este magia care îți va garanta succes în FTC.** Când este folosit corect, este o unealtă foarte bună pentru a ajuta echipele noi în construcția robotului. Reține, totuși, ca multe echipe au avut succes fără CAD.
ru_ru: **Однако CAD - это не волшебный инструмент, который гарантирует вам успех в FTC.** При правильном использовании это отличный инструмент, помогающий командам создавать своих роботов. Однако имейте в виду, что многие команды добились успеха и без CAD.
zh_cn: 然而，CAD并不是保证你FTC比赛成功的魔法精灵。如果使用得当，它是帮助团队构建机器人的绝佳工具。不过，请记住，许多团队在没有CAD的情况下都取得了成功。

source: Starting off, choose a CAD program and learn it as well as possible. It may be a good idea to spend a few weeks just finding objects lying around, sit down with a ruler or calipers, and make a quick CAD model. A good way to test accuracy is to choose a solid object made up of one known material. Weigh the object and make the model in CAD, apply that material to it, and see what the weight difference is. This is a good way to test how accurate the CAD model is to the real part. It really doesn't matter what object it is - just find something and make it to the best of your abilities. There are also tons of videos on YouTube; a good one is TFI who makes detailed tutorials for Autodesk Inventor.
es_mx: Para empezar, elige un programa de CAD y apréndelo lo mejor posible. Puede ser una buena idea pasar unas semanas buscando objetos por ahí, sentarse con una regla o unos calibradores y hacer un modelo CAD rápido. Una buena forma de comprobar la precisión es elegir un objeto sólido de un material conocido. Pesar el objeto y hacer el modelo en CAD, aplicarle ese material y ver cuál es la diferencia de peso. Esta es una buena forma de comprobar la precisión del modelo CAD con respecto a la pieza real. No importa de qué objeto se trate, sólo tienes que encontrar algo y hacerlo lo mejor que puedas. También hay toneladas de vídeos en YouTube; uno bueno es TFI que hace tutoriales detallados para Autodesk Inventor.
fr_ca: Pour commencer, choisissez un programme de CAO et apprenez-le aussi bien que possible. Il peut être judicieux de passer quelques semaines à trouver des objets qui traînent, de s'asseoir avec une règle ou un pied à coulisse et de réaliser un modèle CAO rapide. Un bon moyen de tester la précision consiste à choisir un objet solide composé d'un matériau connu. Pesez l'objet, réalisez le modèle en CAO, appliquez-y le matériau en question et voyez quelle est la différence de poids. C'est un bon moyen de tester la précision du modèle CAO par rapport à la pièce réelle. Peu importe l'objet, il suffit de trouver quelque chose et de le fabriquer au mieux de ses capacités. Il existe également des tonnes de vidéos sur YouTube ; un bon exemple est celui de TFI, qui réalise des tutoriels détaillés pour Autodesk Inventor.
ja_jp: まずは、CADプログラムを選び、できる限りよく学ぼう。数週間かけて、その辺に転がっている物を見つけ、定規やノギスを持って、手早くCADモデルを作る、を繰り返すのはいい練習方法かもしれない。CADモデルが実際の部品に対してどれだけ正確かをテストする良い方法がある。1つの既知の材料でできた物体を選び、物体の重さを量り、CADでモデルを作ろう。選んだ物体の材料をCADで適用して設計と実際の重さの違いを見る。重さの違いが少ないほどいい設計であると言えるだろう。 設計する物体がどのようなものであるかは関係ない。ただ何かを見つけて、自分の能力の限りを尽くして設計してみることが重要だ。YouTubeにもたくさんの動画があり、中でもAutodesk Inventorの詳細なチュートリアルを作っているTFIは良い動画である。
ro_ro: Pentru început, alege un program CAD și învață-l cât mai bine posibil. Este o idee bună să îți petreci câteva săptămâni doar găsind obiecte prin casă, să le măsori dimensiunile, și să faci un model CAD. Este o idee bună să testezi acuratețea și să alegi un obiect solid fabricat dintr-un material cunoscut. Cântărește obiectul și fă modelul în CAD, aplică materialul obiectului, și vezi diferența de greutate. Este o metodă bună de a testa acuratețea modelului CAD față de obiectul real. Nu contează prea mult ce obiect este - doar găsește ceva fi fă-o cât de bine poți. Există și o tonă de video-uri pe YouTube; unul bun fiind TFI care face tutoriale detalitate despre Inventor.
ru_ru: Для начала выберите CAD-программу и изучите ее как можно лучше. Возможно, стоит потратить несколько недель на то, чтобы брать случайные предметы из окружающей обстановки, вооружиться линейкой или штангенциркулем и создавать их быстрые CAD-модели. Хороший способ проверить точность - выбрать монолитный объект. Взвесьте объект и создайте модель в CAD, задайте этот материал и посмотрите, какова разница в весе. Это хороший способ проверить, насколько модель CAD соответствует реальной детали. Неважно, что именно это будет — просто найдите любой предмет и смоделируйте его как сумеете. На YouTube также есть множество видеоуроков: хорошим примером является канал TFI, который создаёт детальные учебные пособия по Autodesk Inventor.
zh_cn: 从一开始，选择一个CAD程序，并尽可能地学习它。花几个星期的时间寻找周围的物体，用尺子或卡尺坐下来，制作一个快速的CAD模型可能是个好主意。测试准确性的一个好方法是选择一个由一种已知材料组成的固体物体。称重物体并在CAD中制作模型，将该材料应用于它，看看重量差异是什么。这是测试CAD模型对真实零件的准确性的好方法。它真的不重要——只要找到一些东西，并尽你所能地制作它。YouTube上也有大量的视频；一个很好的方法是TFI，他为Autodesk Inventor制作详细的教程。

source: Overview of CAD Programs
es_mx: Visión general de los programas CAD
fr_ca: Aperçu des programmes de CAD
ja_jp: CADプログラムの概要
ro_ro: Prezentarea Generală a Programelor CAD
ru_ru: Обзор CAD-программ
zh_cn: CAD程序概述

source: There are many possible CAD programs that teams can learn, all of which can be downloaded for free under a student or FTC team license. You'll have to do a bit of research here, as the requirements for free copies vary based on the program. Here are a couple suggestions to consider:
es_mx: Hay muchos programas CAD posibles que los equipos pueden aprender, todos los cuales pueden descargarse gratuitamente con una licencia de estudiante o de equipo FTC. Tendrás que investigar un poco, ya que los requisitos para obtener copias gratuitas varían según el programa. Aquí tienes un par de sugerencias a tener en cuenta:
fr_ca: Il existe de nombreux programmes de CAO que les équipes peuvent apprendre et qui peuvent tous être téléchargés gratuitement sous une licence d'étudiant ou d'équipe FTC. Vous devrez faire quelques recherches à ce sujet, car les conditions d'obtention de copies gratuites varient en fonction du programme. Voici quelques suggestions à prendre en considération :
ja_jp: チームが学ぶことのできるCADプログラムは数多くあり、そのすべてが学生またはFTCチームのライセンスで無料でダウンロードできる。無料コピーを使える条件はプログラムによって異なるので、ここで少し調べる必要がある。以下は、検討すべきいくつかの提案だ：
ru_ru: Существует множество программ CAD, которые могут освоить команды, причем все их можно загрузить бесплатно по учебной лицензии или лицензии для команд FTC. Здесь потребуется немного изучить вопрос, поскольку условия получения бесплатных версий различаются в зависимости от программы. Вот несколько предложений, которые стоит рассмотреть:
zh_cn: 团队可以学习许多可能的CAD程序，所有这些程序都可以在学生或FTC团队许可下免费下载。你必须在这里做一些研究，因为免费副本的要求因程序而异。以下是一些需要考虑的建议：

source: A fully-featured CAD package, but it runs entirely in the cloud. It can run on any computer (even Chromebooks!) and has iOS, iPadOS, and Android apps as well.
es_mx: Un paquete CAD con todas las funciones, pero que se ejecuta completamente en la nube. Puede ejecutarse en cualquier ordenador (¡incluso en Chromebooks!) y también tiene aplicaciones para iOS, iPadOS y Android.
fr_ca: Un logiciel de CAO complet, mais qui fonctionne entièrement dans le nuage informatique. Il peut fonctionner sur n'importe quel ordinateur (même les Chromebooks !) et dispose également d'applications iOS, iPadOS et Android.
ja_jp: フル機能のCADパッケージだが、すべてクラウド上で動作する。どんなコンピューター（Chromebookでも！）でも動作し、iOS、iPadOS、Androidアプリもある。
ro_ro: Un program CAD complet, care rulează pe cloud (online). Poate rula pe orice calculator (chiar și Chromebook-uri!) și are aplicații pentru iOS, iPadOS și Android.
ru_ru: Это полнофункциональный пакет CAD, но он полностью работает в облаке. Он может работать на любом компьютере (даже на ноутбуках Chromebook!), а также поддерживает приложения для iOS, iPadOS и Android.
zh_cn: 一个功能齐全的CAD包，但它完全在云中运行。它可以在任何计算机上运行（甚至Chromebook！），也有iOS、iPadOS和安卓应用程序。

source: It has all of the same core features as SolidWorks and Inventor, as well as the best collaboration workflow in the industry - many people call it "the Google Docs of CAD." Onshape allows multiple people to work on the same document at the same time, and allows users to "follow" each other and see what's on another user's screen.
es_mx: Tiene las mismas funciones básicas que SolidWorks e Inventor, así como el mejor flujo de trabajo colaborativo del sector: muchos lo llaman "el Google Docs del CAD". Onshape permite que varias personas trabajen en el mismo documento al mismo tiempo, y permite a los usuarios "seguirse" unos a otros y ver lo que hay en la pantalla de otro usuario.
fr_ca: Il possède toutes les mêmes fonctionnalités de base que SolidWorks et Inventor, ainsi que le meilleur flux de travail collaboratif de l'industrie - de nombreuses personnes l'appellent "le Google Docs de la CAO". Onshape permet à plusieurs personnes de travailler sur le même document en même temps, et permet aux utilisateurs de se "suivre" mutuellement et de voir ce qui se passe sur l'écran d'un autre utilisateur.
ja_jp: Onshapeは、SolidWorksやInventorと同じ基本的機能に加え、業界最高のコラボレーションワークフローを備えている。Onshapeでは、複数の人が同じドキュメントで同時に作業することができ、ユーザーはお互いを「フォロー」して、他のユーザーの画面に表示されているものを見ることができる。
ru_ru: Он обладает всеми основными функциями SolidWorks и Inventor, а также лучшим в отрасли системой совместной работы - многие называют его “Google Docs of CAD”. Onshape позволяет нескольким людям работать с одним и тем же документом одновременно и позволяет пользователям “следить” друг за другом и посмотрите, что находится на экране другого пользователя.
zh_cn: 它具有与SolidWorks和Inventor相同的核心功能，以及业内最好的协作工作流程——许多人称之为“计算机辅助设计的谷歌文档”Onform允许多人同时处理同一个文档，并允许用户相互“跟踪”，查看另一个用户屏幕上的内容。

source: OnShape also has FeatureScript, a programming language where you can write custom features. The community has created a lot of very useful FeatureScripts already which you can use completely for free.
es_mx: OnShape también tiene FeatureScript, un lenguaje de programación donde se pueden escribir características personalizadas. La comunidad ya ha creado un montón de FeatureScripts muy útiles que puedes utilizar de forma totalmente gratuita.
fr_ca: OnShape dispose également de FeatureScript, un langage de programmation qui permet d'écrire des fonctionnalités personnalisées. La communauté a déjà créé de nombreux FeatureScripts très utiles que vous pouvez utiliser gratuitement.
ja_jp: OnShapeには、カスタム機能を作成できるプログラミング言語、FeatureScriptがある。コミュニティではすでに多くの便利なFeatureScriptが作成されており、これらのカスタム機能は完全に無料で使用することができる。
ro_ro: De asemenea, OnShape are FeatureScript, un limbaj de programare unde poți scrie funcții personalizate. Comunitatea a creat multe programe FeatureScript pe care le poți folosi gratis.
ru_ru: В OnShape также есть FeatureScript, язык программирования, на котором вы можете создавать пользовательские функции. Сообщество уже создало множество очень полезных FeatureScripts, которые вы можете использовать совершенно бесплатно.
zh_cn: OnShape还有FeatureScript，这是一种编程语言，你可以在其中编写自定义功能。社区已经创建了许多非常有用的FeatureScricript，你可以完全免费使用它们。

source: Onshape also has a comprehensive tutorial system (https://learn.onshape.com) that will not only teach you how to use their software, but how to approach design problems.
es_mx: Onshape también cuenta con un completo sistema de tutoriales (https://learn.onshape.com) que no sólo te enseñará a utilizar su software, sino también a enfocar los problemas de diseño.
fr_ca: Onshape dispose également d'un système de tutorat complet (https://learn.onshape.com) qui vous apprendra non seulement à utiliser le logiciel, mais aussi à aborder les problèmes de conception.
ja_jp: また、Onshapeには包括的なチュートリアルシステム（https://learn.onshape.com）があり、ソフトウェアの使い方だけでなく、設計上の問題へのアプローチ方法も教えてくれる。
ro_ro: Onshape are și un sistem de tutoriale cuprinzătoare (https://learn.onshape.com) care te va învăța cum să le folosești programul, dar și cum să abordezi probleme legate de design.
ru_ru: У Onshape также есть комплексная обучающая система (https://learn.onshape.com), которая научит вас не только пользоваться их программным обеспечением, но и как подходить к решению задач проектирования.
zh_cn: Onshape 还有一个全面的教程系统 (https://learn.onshape.com)，不仅教你如何使用软件，还教你如何解决设计问题。

source: If you're just starting out with CAD, or you don't have access to powerful computers, Onshape is the software for you.
es_mx: Si estás empezando con CAD o no tienes acceso a computadoras potentes, Onshape es el software para ti.
fr_ca: Si vous débutez dans la CAD ou si vous n'avez pas accès à des ordinateurs puissants, Onshape est le logiciel qu'il vous faut.
ja_jp: CADを始めたばかりの人や、パワフルなコンピュータを使える環境にない人には、オンシェイプが最適なオプションだろう。
ru_ru: Если вы только начинаете работать с CAD или у вас нет доступа к мощным компьютерам, Onshape - идеальный вариант для вас.
zh_cn: 如果你刚刚开始使用CAD，或者你无法使用功能强大的计算机，那么Onform就是适合你的软件。

source: An industry standard CAD package made by Dassault Syst\ |egrave|\ mes. It's as fully featured as CAD software gets, including great simulation features and a very robust assembly environment. It's used widely in industry and is also the program of choice for most college-level engineering classes.
es_mx: Un paquete de CAD estándar fabricado por Dassault Syst\ |egrave| mes. Es el software CAD más completo, con excelentes funciones de simulación y un sólido entorno de ensamblaje. Se utiliza mucho en la industria y es el programa preferido en la mayoría de las clases universitarias de ingeniería.
fr_ca: Il s'agit d'un logiciel de CAD standard fabriqué par Dassault Syst\ |egrave|\ mes. Il s'agit d'un logiciel de CAD aussi complet que possible, qui comprend d'excellentes fonctions de simulation et un environnement d'assemblage très robuste. Il est largement utilisé dans l'industrie et constitue également le programme de choix pour la plupart des cours d'ingénierie au niveau universitaire.
ja_jp: SolidWorksはDassault Syst\ |egrave|\ mes製の業界標準CADパッケージ。優れたシミュレーション機能や非常に堅牢なアセンブリ環境など、CADソフトウェアとしてはこれ以上ない機能を備えている。産業界で広く使用されているほか、ほとんどの大学レベルのエンジニアリングクラスで採用されているプログラムでもある。
ru_ru: Стандартный пакет CAD от Dassault Syst\ |egrave|\ mes. Он настолько полнофункционален, насколько это возможно в программном обеспечении CAD, включая продвинутые инструменты симуляции и надежную среду работы со сборками. Он широко используется в промышленности, а также является предпочтительной программой для большинства инженерных курсов на уровне колледжей.
zh_cn: 这是一款由 Dassault Syst\ |egrave|\ mes 生产的工业标准 CAD 软件包。它是功能齐全的 CAD 软件，包括强大的仿真功能和非常强大的装配环境。它广泛应用于工业领域，也是大多数大学工程课程的首选程序。
