Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/design-strategy.po
Languages: es_mx, fr_ca, ro_ro, ru_ru

source: Design Strategy
es_mx: Estrategia de Diseño
fr_ca: Stratégie de conception
ro_ro: Strategia de design
ru_ru: Стратегия Проектирования

source: A useful resource is the championship conference presentation from Karthik Kanagasabapathy, former lead mentor (and current advisor) of Hall of Fame team FRC\ |reg| 1114, Simbotics, on effective design and competition strategies: `Effective FIRST Strategies. <https://www.youtube.com/watch?v=5fifL47TvzE>`_ See also the `slideshow from the presentation <https://www.simbotics.org/_files/ugd/81d293_2417ace601d84fb5afaf62f424ad5bd3.pdf>`_.
es_mx: Un recurso útil es la presentación en la conferencia del campeonato de Karthik Kanagasabapathy, antiguo mentor principal (y actual asesor) del equipo del Salón de la Fama FRC\ |reg| 1114, Simbotics, sobre estrategias eficaces de diseño y competición: Estrategias eficaces de FIRST. <https://www.youtube.com/watch?v=5fifL47TvzE> Véase también el `slideshow de la presentación <https://www.simbotics.org/_files/ugd/81d293_2417ace601d84fb5afaf62f424ad5bd3.pdf>`_.
fr_ca: Une ressource utile est la présentation de Karthik Kanagasabapathy, ancien mentor principal (et conseiller actuel) de l'équipe du Panthéon FRC\ |reg| 1114, Simbotics, sur les stratégies efficaces de conception et de compétition : `Stratégies efficaces pour FIRST. <https://www.youtube.com/watch?v=5fifL47TvzE>`_ Voir aussi le `slideshow de la présentation <https://www.simbotics.org/_files/ugd/81d293_2417ace601d84fb5afaf62f424ad5bd3.pdf>`_.
ru_ru: Полезным ресурсом является презентация Картика Канагасабапати, бывшего главного наставника (и нынешнего стороннего эксперта) команды Hall of Fame FRC\ |reg| 1114, Simbotics, на конференции по эффективным стратегиям проектирования и соревнований: `Effective FIRST Strategies. <https://www.youtube.com/watch?v=5fifL47TvzE>`_ Смотрите также слайд-шоу из презентации <https://www.simbotics.org/_files/ugd/81d293_2417ace601d84fb5afaf62f424ad5bd3.pdf>`_.

source: General Design Tips and Mistakes
es_mx: Consejos y Errores Generales de Diseño
fr_ca: Conseils généraux et erreurs de conception
ro_ro: Sfaturi și Greșeli Generale de Proiectare
ru_ru: Общие Советы и Ошибки при Проектировании

source: Here are some good tips for teams to make decisions in the high-level design and strategic planning stages.
es_mx: He aquí algunos buenos consejos para que los equipos tomen decisiones en las fases de diseño de alto nivel y planificación estratégica.
fr_ca: Voici quelques bons conseils pour aider les équipes à prendre des décisions aux stades de la conception de haut niveau et de la planification stratégique.
ro_ro: Iată câteva sfaturi bune pentru ca echipele să ia decizii în etapele de proiectare la nivel înalt și de planificare strategică.
ru_ru: Вот несколько полезных советов для команд по принятию решений на этапах разработки и стратегического планирования на высоком уровне.

source: Problem
es_mx: Problema
fr_ca: Problème
ro_ro: Problemă
ru_ru: Проблема

source: Solution
es_mx: Solución
ro_ro: Soluție
ru_ru: Решение

source: **Do everything at once**
es_mx: **Hazlo todo a la vez**
fr_ca: **Faire tout en même temps**
ro_ro: **Faceți totul deodată**
ru_ru: **Делать все сразу**.

source: Robot becomes half-baked
es_mx: El robot se queda a medias
fr_ca: Le robot devient bâclé
ro_ro: Robotul devine pe jumătate pregătit
ru_ru: Робот становится полуфабрикатом

source: Cannot excel in one area
es_mx: No puede destacar en un área
fr_ca: Ne peut exceller dans un domaine
ro_ro: Nu poate excela într-un singur domeniu
ru_ru: Невозможно преуспеть в одной области

source: **Perfect one objective first**
es_mx: **Perfecciona primero un objetivo**
fr_ca: **Percetionner d'abord un objectif**
ro_ro: **Perfecționează mai întâi un obiectiv**
ru_ru: **Сначала выполните одну цель**

source: Robot is highly optimized
es_mx: El robot está muy optimizado
fr_ca: Le robot est hautement optimisé
ro_ro: Robotul este foarte optimizat
ru_ru: Робот очень оптимизирован

source: Consistently excels in one area
es_mx: Destaca sistemáticamente en un área
fr_ca: Excelle constamment dans un domaine
ro_ro: Excelează în mod constant într-un singur domeniu
ru_ru: Постоянно преуспевает в одной области

source: **Overcomplicate**
es_mx: **Sobrecomplicar**
fr_ca: **Trop compliqué**
ro_ro: **Excesiv de complicat**
ru_ru: **Сверхусложнение**

source: More time needed to iterate
es_mx: Se necesita más tiempo para iterar
fr_ca: Plus de temps nécessaire à l'itération
ro_ro: Este nevoie de mai mult timp pentru a repeta
ru_ru: Требуется больше времени на доработку

source: Less reliable
es_mx: Menos fiable
fr_ca: Moins fiable
ro_ro: Mai puțin fiabile
ru_ru: Менее надежно

source: **Simplify**
es_mx: **Simplificar**
fr_ca: **Simplifier**
ro_ro: **Simplificați*
ru_ru: **Упрощение**

source: Best designs are usually simplest
es_mx: Los mejores diseños suelen ser los más sencillos
fr_ca: Les meilleures design sont généralement les plus simples
ro_ro: Cele mai bune modele sunt de obicei cele mai simple
ru_ru: Лучшие дизайны обычно самые простые

source: Less moving parts
es_mx: Menos piezas móviles
fr_ca: Moins de pièces mobiles
ro_ro: Mai puține piese în mișcare
ru_ru: Меньше движущихся частей

source: **Score-first design**
es_mx: **Diseño de anotar primero**
fr_ca: **Conception axée sur le score**
ro_ro: **Designul de tip primul punctaj**
ru_ru: **Дизайн ориентированный на результат**.

source: Neglect proper principles
es_mx: Descuidar los principios adecuados
fr_ca: Négliger les principes appropriés
ro_ro: Neglijarea principiilor corecte
ru_ru: Пренебрежение принципами

source: Often wildly inconsistent
es_mx: A menudo muy incoherente
fr_ca: Souvent très incohérent
ro_ro: Adesea extrem de inconsecventă
ru_ru: Часто бывает непоследовательным

source: **Design for consistency**
es_mx: **Diseño para la consistencia**
fr_ca: **Conception pour la cohérence**
ro_ro: **Design pentru consistență**
ru_ru: **Проектирование для последовательности**

source: Usually reliability > scoring ability
es_mx: Por lo general, fiabilidad > capacidad de puntuación
fr_ca: En général, la fiabilité est supérieure à la capacité de notation
ro_ro: De obicei, fiabilitatea > capacitatea de notare
ru_ru: Обычно надежность > способность набирать очки

source: Great plus for alliance selection
es_mx: Gran ventaja para la selección de alianzas
fr_ca: Un grand plus pour la sélection des alliances
ro_ro: Un mare plus pentru selecția de alianțe
ru_ru: Большой плюс при выборе альянса

source: **Build haphazardly**
es_mx: **Construir al azar**
fr_ca: **Construire au hasard**
ro_ro: **Construiește la întâmplare**
ru_ru: **Собирать бессистемно**

source: Build with subpar materials
es_mx: Construido con materiales de baja calidad
fr_ca: Construction avec des matériaux de qualité médiocre
ro_ro: Construiți cu materiale inferioare
ru_ru: Сборка из некачественных материалов

source: Inadequate support structure
es_mx: Estructura de apoyo inadecuada
fr_ca: Structure de soutien inadéquate
ro_ro: Structură de sprijin inadecvată
ru_ru: Неадекватная структура поддержки

source: **Build for reliability**
es_mx: **Construir para la fiabilidad**
fr_ca: **Construire pour la fiabilité**
ro_ro: **Construiți pentru fiabilitate**
ru_ru: **Собирать надежно**

source: Remove unneeded moving parts
es_mx: Elimina las piezas móviles innecesarias
fr_ca: Supprimer les pièces mobiles inutiles
ro_ro: Îndepărtați piesele mobile inutile
ru_ru: Убирает ненужные движущиеся части

source: Eliminate single points of failure
es_mx: Elimina los puntos únicos de fallo
fr_ca: Éliminer les points de défaillance uniques
ro_ro: Eliminarea punctelor unice de eșec
ru_ru: Убирает отдельные неработающие части

source: **Fret about design**
es_mx: **Preocúpate por el diseño**
fr_ca: **Se soucier du design**
ro_ro: **Sunt îngrijorat de design**
ru_ru: **Волнение по поводу проектирования**

source: Wastes testing time
es_mx: Pérdida de tiempo en las pruebas
fr_ca: Perte de temps pour les tests
ro_ro: Pierde timp de testare
ru_ru: Трата времени на тестирование

source: Design alone is not enough
es_mx: El diseño por sí solo no basta
fr_ca: Le design seule ne suffit pas
ro_ro: Doar designul nu este suficient
ru_ru: Одного дизайна недостаточно

source: **Focus on execution**
es_mx: **Centrarse en la ejecución**
fr_ca: **Se concentrer sur l'exécution**
ro_ro: **Concentrați-vă pe execuție**
ru_ru: **Сфокусируйтесь на выполнении**

source: Make a decision, then stick to it
es_mx: Tome una decisión y cúmplala
fr_ca: Prendre une décision et s'y tenir
ro_ro: Luați o decizie, apoi respectați-o
ru_ru: Примите решение и придерживайтесь его

source: Execution often beats design
es_mx: La ejecución suele superar al diseño
fr_ca: L'exécution l'emporte souvent sur la conception
ro_ro: Execuția învinge adesea designul
ru_ru: Исполнение часто побеждает дизайн

source: Doing Everything At Once |rarr| Perfecting One Objective First
es_mx: Haciendo todo a la vez |rarr| Perfeccionando primero un objetivo
fr_ca: Tout Faire En Même Temps |rarr| Perfectionner d'Abord Un Objectif
ru_ru: Делать все и сразу |rarr| Сначала довести до совершенства одну цель

source: **Consistency is king.**
es_mx: **La consistencia es el rey.**
fr_ca: **La consistance est la clé.**
ro_ro: **Consistența este rege.**
ru_ru: **Последовательность - король.**

source: A common pitfall for first year teams is trying to accomplish all the game objectives at once, especially in tele-op and endgame.
es_mx: Una trampa común para los equipos de primer año es intentar cumplir todos los objetivos del juego a la vez, especialmente en la teleoperación y el final del juego.
fr_ca: Un écueil fréquent pour les équipes de première année est d'essayer d'atteindre tous les objectifs du jeu en même temps, en particulier en télé-opération et en fin de partie.
ro_ro: O capcană obișnuită pentru echipele aflate în primul an este încercarea de a îndeplini toate obiectivele jocului deodată, în special în teleop și endgame.
ru_ru: Распространенный подводный камень для команд первого года обучения - попытка выполнить все игровые задачи сразу, особенно в Управляемом периоде и Эндгейме.

source: **This is highly discouraged** because oftentimes new teams do not have the experience to do so. It is no small achievement to have a consistent robot that completes all objectives in competition, even at the higher levels.
es_mx: **Esto está totalmente desaconsejado** porque a menudo los nuevos equipos no tienen la experiencia necesaria para hacerlo. No es un logro menor tener un robot consistente que complete todos los objetivos en competición, incluso en los niveles más altos.
fr_ca: **Ceci est fortement déconseillé** car souvent les nouvelles équipes n'ont pas l'expérience nécessaire pour le faire. Ce n'est pas une mince affaire que d'avoir un robot cohérent qui remplit tous les objectifs de la compétition, même aux niveaux les plus élevés.
ro_ro: **Acest lucru este foarte descurajat** deoarece, de multe ori, echipele noi nu au experiența necesară pentru a face acest lucru. Nu este o realizare mică să ai un robot consistent care să îndeplinească toate obiectivele în competiție, chiar și la nivelurile superioare.
ru_ru: **Это крайне не рекомендуется**, так как зачастую у новых команд нет достаточного опыта для этого. Это немалое достижение, когда робот последовательно выполняет все задачи на соревнованиях, даже на высоких уровнях.

source: Too often, we see teams bring half-baked robots that will attempt to do everything in a match, but excel at nothing. Even if they succeed, it is often by thin margins and cannot be repeated. This robot could be much more successful if the team spent their time to perfect one mechanism first.
es_mx: Con demasiada frecuencia, vemos que los equipos traen robots a medio hacer que intentan hacer de todo en una partida, pero no destacan en nada. Incluso si lo consiguen, suele ser por escaso margen y no pueden repetirse. Este robot podría tener mucho más éxito si el equipo dedicara su tiempo a perfeccionar primero un mecanismo.
fr_ca: Trop souvent, nous voyons des équipes apporter des robots à moitié construits qui tenteront de tout faire dans un match, mais qui n'excelleront en rien. Même s'ils réussissent, c'est souvent par une marge infime et ils ne peuvent pas répéter l'expérience. Ce robot pourrait avoir beaucoup plus de succès si l'équipe avait consacré son temps à perfectionner d'abord un seul mécanisme.
ro_ro: De prea multe ori, vedem echipe care aduc roboți pe jumătate pregătiți, care vor încerca să facă totul într-un meci, dar nu excelează la nimic. Chiar dacă reușesc, deseori reușesc cu o marjă mică și nu pot fi repetate. Acest robot ar putea avea mult mai mult succes dacă echipa și-ar petrece timpul pentru a perfecționa mai întâi un mecanism.
ru_ru: Слишком часто мы видим, как команды привозят полуживых роботов, которые пытаются сделать в матче все, но не преуспевают ни в чем. Даже если они и добиваются успеха, то зачастую с небольшим отрывом и не могут повторить его. Этот робот мог бы быть гораздо успешнее, если бы команда потратила время на совершенствование одного механизма.

source: Teams should always remember the principle that a robot that can complete one thing consistently will likely be more competitive than the robot that does everything inconsistently. We recommend teams focus on one objective during tele-op/endgame and perfect it.
es_mx: Los equipos deben recordar siempre el principio de que un robot que puede completar una cosa de forma consistente será probablemente más competitivo que el robot que lo hace todo de forma inconsistente. Recomendamos a los equipos que se centren en un objetivo durante la teleoperación o el juego final y lo perfeccionen.
fr_ca: Les équipes doivent toujours garder à l'esprit le principe selon lequel un robot capable de réaliser une seule chose de manière cohérente sera probablement plus compétitif qu'un robot qui fait tout de manière incohérente. Nous recommandons aux équipes de se concentrer sur un seul objectif pendant la télé-opération/fin de partie et de le perfectionner.
ro_ro: Echipele ar trebui să își amintească întotdeauna principiul conform căruia un robot care poate realiza un singur lucru în mod constant va fi probabil mai competitiv decât un robot care face totul în mod inconsecvent. Recomandăm echipelor să se concentreze asupra unui singur obiectiv în timpul teleop/endgame-ului și să îl perfecționeze.
ru_ru: Команды должны всегда помнить принцип: робот, который может выполнить одну задачу последовательно, скорее всего, будет более конкурентоспособным, чем робот, который делает все непоследовательно. Мы рекомендуем командам сосредоточиться на одной задаче во время Управляемого периода/Эндгейма и довести ее до совершенства.

source: Typically, teams which have a solid autonomous and consistent endgame can be competitive at the Qualifier level. This is a recommended goal for new teams.
es_mx: Normalmente, los equipos que tienen un juego autónomo sólido y un final consistente pueden ser competitivos en el nivel de clasificación. Este es un objetivo recomendado para los equipos nuevos.
fr_ca: En général, les équipes qui ont une autonomie solide et une fin de partie cohérente peuvent être compétitives au niveau des qualifications. Il s'agit d'un objectif recommandé pour les nouvelles équipes.
ro_ro: De obicei, echipele care au o echipă autonomie solidă și un endgame consistent pot fi competitive la nivelul calificărilor. Acesta este un obiectiv recomandat pentru echipele noi.
ru_ru: Как правило, команды, имеющие хороший Автономный период и Эндгейм, могут быть конкурентоспособными на уровне Отборочных соревнований. Это рекомендуемая цель для новых команд.

source: Overcomplex |rarr| Simple
es_mx: Hipercomplejo |rarr| Simple
fr_ca: Rendre complexe ce qui est simple |rarr|
ru_ru: Сложный |rarr| Простой

source: Another common trap that teams fall into is to overcomplicate needlessly. Simplifying your robot simplifies possible headaches later.
es_mx: Otra trampa común en la que caen los equipos es complicarse innecesariamente. Simplificar el robot evita posibles dolores de cabeza posteriores.
fr_ca: Un autre piège dans lequel tombent souvent les équipes consiste à compliquer inutilement les choses. En simplifiant votre robot, vous vous épargnez d'éventuels maux de tête ultérieurs.
ro_ro: O altă capcană frecventă în care cad echipele este aceea de a complica inutil. Simplificarea robotului simplifică posibilele dureri de cap ulterioare.
ru_ru: Еще одна распространенная ловушка, в которую попадают команды, - излишнее усложнение. Упрощение робота упрощает возможную головную боль в дальнейшем.

source: While some robots are very complicated, keep in mind that those teams are generally experienced, have some sort of machining capability, and fully design their robot in CAD. However, many world-class teams often build designs that are ingenious yet ridiculously simple.
es_mx: Aunque algunos robots son muy complicados, hay que tener en cuenta que esos equipos suelen tener experiencia, algún tipo de capacidad de mecanizado y diseñan completamente su robot en CAD. Sin embargo, muchos equipos de talla mundial suelen construir diseños ingeniosos pero ridículamente sencillos.
fr_ca: Si certains robots sont très compliqués, il ne faut pas oublier que ces équipes sont généralement expérimentées, qu'elles disposent d'une certaine capacité d'usinage et qu'elles conçoivent entièrement leur robot à l'aide de la CAO. Toutefois, de nombreuses équipes de niveau international conçoivent souvent des robots ingénieux mais ridiculement simples.
ro_ro: În timp ce unii roboți sunt foarte complicați, rețineți că echipele respective au, în general, experiență, au un fel de capacitate de prelucrare și își proiectează complet robotul în CAD. Cu toate acestea, multe echipe de talie mondială construiesc adesea proiecte ingenioase, dar ridicol de simple.
ru_ru: Хотя некоторые роботы очень сложны, имейте в виду, что такие команды, как правило, имеют опыт, обладают определенными возможностями для изготовления деталей и полностью проектируют своего робота в САПР-системах. Однако многие команды мирового уровня часто создают гениальные, но до смешного простые конструкции.

source: Some advantages to simplicity are that the robot has less points of failure, given that the robot has less moving parts. Additionally, it takes much less time to iterate through and perfect a simple mechanism as opposed to a complicated one. The reasoning is that a complicated system has many more variables that need to be adjusted/could cause problems.
es_mx: Algunas ventajas de la simplicidad son que el robot tiene menos puntos de fallo, dado que tiene menos piezas móviles. Además, lleva mucho menos tiempo iterar y perfeccionar un mecanismo sencillo que uno complicado. El razonamiento es que un sistema complicado tiene muchas más variables que hay que ajustar o que podrían causar problemas.
fr_ca: Parmi les avantages de la simplicité, on peut citer le fait que le robot a moins de points de défaillance, étant donné qu'il comporte moins de pièces mobiles. En outre, il faut beaucoup moins de temps pour répéter et perfectionner un mécanisme simple qu'un mécanisme compliqué. Le raisonnement est le suivant : un système compliqué comporte beaucoup plus de variables qui doivent être ajustées ou qui peuvent causer des problèmes.
ro_ro: Unele avantaje ale simplității sunt că robotul are mai puține puncte de defecțiune, având în vedere că are mai puține piese mobile. În plus, este nevoie de mult mai puțin timp pentru a repeta și perfecționa un mecanism simplu, spre deosebire de unul complicat. Raționamentul este că un sistem complicat are mult mai multe variabile care trebuie ajustate/pot cauza probleme.
ru_ru: Некоторые преимущества простоты заключаются в том, что у робота меньше вещей, которые могут сломаться, поскольку в нем меньше движущихся частей. Кроме того, на отработку и совершенствование простого механизма уходит гораздо меньше времени, чем сложного. Это объясняется тем, что в сложной системе гораздо больше переменных, которые нужно регулировать и которые могут вызвать проблемы.

source: Keeping things simple can be practically achieved through a couple of ways.
es_mx: Simplificar las cosas puede conseguirse prácticamente de dos maneras.
fr_ca: Il existe plusieurs façons de simplifier les choses.
ro_ro: Păstrarea lucrurilor simple poate fi realizată în practică în câteva moduri.
ru_ru: Простота может быть достигнута несколькими способами.

source: Limit the degrees of motion that the mechanism operates in. For example, a linear slide goes in and out in a straight line, as opposed to an arm, which rotates along an axis. Doing so will serve to eliminate forces that otherwise could adversely affect the mechanism.
es_mx: Limite los grados de movimiento en los que funciona el mecanismo. Por ejemplo, un riel lineal entra y sale en línea recta, a diferencia de un brazo, que gira a lo largo de un eje. De este modo se eliminan fuerzas que, de otro modo, podrían afectar negativamente al mecanismo.
fr_ca: Limiter les degrés de mouvement du mécanisme. Par exemple, une glissière linéaire entre et sort en ligne droite, contrairement à un bras qui tourne le long d'un axe. Cela permet d'éliminer les forces qui pourraient autrement affecter le mécanisme.
ro_ro: Limitați gradele de mișcare în care funcționează mecanismul. De exemplu, o glisieră intră și iese în linie dreaptă, spre deosebire de un braț, care se rotește de-a lungul unei axe. Acest lucru va servi la eliminarea forțelor care altfel ar putea afecta negativ mecanismul.
ru_ru: Ограничьте количество степеней свободы, в которых работает механизм. Например, линейная система движется по прямой линии, в отличие от манипулятора, который вращается вокруг оси. Это позволит устранить силы, которые в противном случае могли бы негативно повлиять на механизм.

source: Another way to simplify is to build for the shortest travel distance. Obviously, the shortest distance from A to B is in a straight line, so teams should strive to keep the game elements approximately within a reasonably straight line. This can help in solving possible problems if the game elements need to change direction too many times.
es_mx: Otra forma de simplificar es construir para recorrer la distancia más corta. Obviamente, la distancia más corta de A a B es en línea recta, por lo que los equipos deben esforzarse por mantener los elementos del juego aproximadamente dentro de una línea razonablemente recta. Esto puede ayudar a resolver posibles problemas si los elementos del juego tienen que cambiar de dirección demasiadas veces.
fr_ca: Une autre façon de simplifier est de construire en fonction de la distance la plus courte. Il est évident que la distance la plus courte entre A et B est une ligne droite. Les équipes doivent donc s'efforcer de maintenir les éléments du jeu dans une ligne raisonnablement droite. Cela peut aider à résoudre d'éventuels problèmes si les éléments du jeu doivent changer de direction trop souvent.
ro_ro: Un alt mod de a simplifica este de a construi pentru cea mai scurtă distanță de deplasare. Evident, cea mai scurtă distanță de la A la B este în linie dreaptă, astfel încât echipele ar trebui să se străduiască să mențină elementele de joc într-o linie aproximativ dreaptă. Acest lucru poate ajuta la rezolvarea eventualelor probleme în cazul în care elementele de joc trebuie să schimbe traiectoria de prea multe ori.
ru_ru: Еще один способ упростить игру - построить ее с учетом кратчайшего расстояния. Очевидно, что кратчайшее расстояние от точки А до точки Б проходит по прямой, поэтому команды должны стремиться к тому, чтобы игровые элементы располагались примерно на одной прямой. Это поможет решить возможные проблемы, если игровым элементам придется слишком часто менять направление.
