Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/design-strategy.po
Languages: es_mx, fr_ca, ro_ro, ru_ru

source: It is important to discuss different designs and debate the pros & cons, but after a design has been picked, stay with it unless there are major flaws that were originally overlooked. Changing designs will throw away the time spent on the original design, when teams could have kept improving it or practiced more. It is possible to rebuild your robot mid-season, and many top teams have done so to great success.
es_mx: Es importante discutir los diferentes diseños y debatir los pros y los contras, pero una vez elegido un diseño, hay que quedarse con él a menos que haya fallos importantes que se pasaron por alto en un principio. Cambiar de diseño tirará por la borda el tiempo invertido en el diseño original, cuando los equipos podrían haber seguido mejorándolo o haber practicado más. Es posible reconstruir el robot a mitad de temporada, y muchos de los mejores equipos lo han hecho con gran éxito.
fr_ca: Il est important de discuter des différentes conceptions et de débattre des avantages et des inconvénients, mais une fois qu'une conception a été choisie, il faut s'y tenir, à moins qu'elle ne présente des défauts majeurs qui avaient été négligés à l'origine. Changer de conception revient à perdre le temps passé sur la conception originale, alors que les équipes auraient pu continuer à l'améliorer ou à s'entraîner davantage. Il est possible de reconstruire son robot en cours de saison, et de nombreuses équipes de haut niveau l'ont fait avec succès.
ro_ro: Este important să discutați despre diferite modele și să dezbateți avantajele și dezavantajele, dar după ce ați ales un model, rămâneți cu el, cu excepția cazului în care există defecte majore care au fost trecute cu vederea inițial. Schimbarea modelelor va arunca pe apa sâmbetei timpul petrecut pe modelul inițial, când echipele ar fi putut continua să îl îmbunătățească sau să exerseze mai mult. Este posibil să vă reconstruiți robotul la jumătatea sezonului și multe echipe de top au făcut acest lucru cu mare succes.
ru_ru: Важно обсуждать различные концепции и анализировать их плюсы и минусы, но после выбора окончательного варианта следует придерживаться его, если только не обнаружатся изначально упущенные критические недостатки. Постоянная смена концепций сводит на нет все усилия, затраченные на первоначальную разработку — время, которое можно было бы направить на совершенствование конструкции или дополнительные тренировки. При этом следует помнить, что возможна и пересборка робота в середине сезона, что не раз успешно демонстрировали ведущие команды.

source: However, this is not recommended for rookie and new teams due to the general lack of experience. Realistically, expect to spend 50-100+ hours to rebuild a robot from the ground up. Focus on how you can iterate your current design to be as effective, efficient, and refined as possible.
es_mx: Sin embargo, esto no es recomendable para equipos novatos y nuevos debido a la falta general de experiencia. Siendo realistas, hay que calcular entre 50--100+ horas para reconstruir un robot desde cero. Concéntrate en cómo puedes iterar tu diseño actual para que sea lo más eficaz, eficiente y refinado posible.
fr_ca: Toutefois, cette méthode n'est pas recommandée pour les équipes débutantes ou nouvelles en raison du manque général d'expérience. De manière réaliste, attendez-vous à passer entre 50-100+ heures pour reconstruire un robot à partir de zéro. Concentrez-vous sur la façon dont vous pouvez itérer votre conception actuelle pour la rendre aussi efficace, efficiente et raffinée que possible.
ro_ro: Cu toate acestea, nu este recomandat pentru echipele începătoare și noi, din cauza lipsei generale de experiență. În mod realist, așteptați-vă să petreceți 50-100+ ore pentru a reconstrui un robot de la zero. Concentrează-te pe modul în care poți repeta designul tău actual pentru a fi cât mai eficient, eficace și rafinat posibil.
ru_ru: Однако это не рекомендуется для новичков и новых команд из-за общего недостатка опыта. Реально можно рассчитывать на 50-100+ часов, чтобы переделать робота с нуля. Сосредоточьтесь на том, как можно итерационно изменить текущую конструкцию, чтобы сделать ее максимально эффективной, действенной и совершенной.

source: Competition Tips and Mistakes
es_mx: Consejos y Errores en la Competencia
fr_ca: Conseils et erreurs en matière de concurrence
ro_ro: Sfaturi și greșeli în materie de concurență
ru_ru: Советы и Ошибки на Соревнованиях

source: Here are some good tips for teams to make decisions in the execution stage.
es_mx: He aquí algunos buenos consejos para que los equipos tomen decisiones en la fase de ejecución.
fr_ca: Voici quelques bons conseils pour aider les équipes à prendre des décisions au cours de la phase d'exécution.
ro_ro: Iată câteva sfaturi bune pentru ca echipele să ia decizii în etapa de execuție.
ru_ru: Вот несколько полезных рекомендаций, которые помогут командам принимать решения на этапе реализации проекта.

source: **Problem**
es_mx: **Problema**
fr_ca: **Problème**
ro_ro: **Problemă**
ru_ru: **Проблема**

source: **Solution**
es_mx: **Solución**
ro_ro: **Soluție**
ru_ru: **Решение**

source: **Neglect drive practice**
es_mx: **Descuidar la práctica de los conductores**
fr_ca: **Négliger la pratique des pilotes **
ro_ro: **Practică de conducere neglijentă**
ru_ru: **Недостаточная тренировка операторов**

source: Drivers unfamiliar with robot
es_mx: Conductores no familiarizados con el robot
fr_ca: Pilotes ne connaissant pas le robot
ro_ro: Driverii care nu sunt familiarizați cu robotul
ru_ru: Операторы, не знакомые с роботом

source: Robot reliability untested
es_mx: Fiabilidad del robot no probada
fr_ca: La fiabilité du robot n'a pas été testée
ro_ro: Fiabilitatea robotului nu a fost testată
ru_ru: Надежность робота не проверена

source: **Constant driver training**
es_mx: **Formación constante de los conductores**
fr_ca: **Formation continue des pilotes**
ro_ro: **Antrenament constant al driverilor**
ru_ru: **Постоянная тренировка операторов**

source: Drivers comfortable with controls
es_mx: Conductores cómodos con los controles
fr_ca: Des pilotes à l'aise avec les commandes
ro_ro: Driverii se simt confortabil cu comenzile
ru_ru: Управление робота настроено под опреаторов

source: Proven and tested robot
es_mx: Robot con eficacia probada
fr_ca: Un robot éprouvé et testé
ro_ro: Robot dovedit și testat
ru_ru: Проверенный и испытанный робот

source: **No game strategy**
es_mx: **Sin estrategia de juego**
fr_ca: **Aucune stratégie de jeu**
ro_ro: **Nicio strategie de joc**
ru_ru: **Нет игровой стратегии**

source: Lack of contingency plans
es_mx: Falta de planes de contingencia
fr_ca: Absence de plans d'urgence
ro_ro: Lipsa planurilor de urgență
ru_ru: Отсутствие планов на случай непредвиденных обстоятельств

source: Weakens alliance strength
es_mx: Debilita la fuerza de la alianza
fr_ca: Affaiblit la force de l'alliance
ro_ro: Slăbește puterea alianței
ru_ru: Ослабляет результативность альянса

source: **Strategical driving**
es_mx: **Conducción estratégica**
fr_ca: **Conduite stratégique**
ro_ro: **Conducere strategică**
ru_ru: **Управление роботом с учетом стратегии**.

source: Only purposeful actions taken
es_mx: Sólo se realizan acciones intencionadas
fr_ca: Seules les actions intentionnelles sont entreprises
ro_ro: Numai acțiunile întreprinse în mod intenționat
ru_ru: Только целенаправленные действия

source: Efficient and effective driving
es_mx: Conducción eficiente y eficaz
fr_ca: Une conduite efficace et efficiente
ro_ro: Conducerea eficientă și eficace
ru_ru: Эффективное и рациональное управление роботом

source: **Fully driver-controlled**
es_mx: **Totalmente controlado por el conductor**
fr_ca: **Tout est contrôlé par le pilote**
ro_ro: **Controlat integral de driver**
ru_ru: **Полностью управляемый оператором**

source: Less efficient
es_mx: Menos eficiente
fr_ca: Moins efficace
ro_ro: Mai puțin eficient
ru_ru: Менее эффективно

source: Requires more practice
es_mx: Requiere más práctica
fr_ca: Nécessite plus de pratique
ro_ro: Necesită mai multă practică
ru_ru: Требуется больше практики

source: **Partially automated tasks**
es_mx: **Tareas parcialmente automatizadas**
fr_ca: **Tâches partiellement automatisées**
ro_ro: ** Sarcini parțial automatizate**
ru_ru: **Частично автоматизированные задачи**.

source: Relieves stress on driver
es_mx: Alivia el estrés del conductor
fr_ca: Soulage le pilote
ro_ro: Reduce stresul asupra driver-ului
ru_ru: Снимает напряжение с операторов

source: Removes human error
es_mx: Elimina el error humano
fr_ca: Supprime l'erreur humaine
ro_ro: Elimină eroarea umană
ru_ru: Устраняет человеческий фактор

source: Neglecting driver practice |rarr| Constant driver training
es_mx: Descuido de la práctica del conductor |rarr| Entrenamiento constante del conductor
fr_ca: Négliger la pratique de la conduite |rarr| Formation constante des pilotes
ru_ru: Пренебрежение тренировкой операторов |rarr| Постоянная практика операторов

source: A persistent problem with new teams is neglecting driver practice. Drive practice is to be done throughout the season, **not the week before competition.**
es_mx: Un problema persistente con los nuevos equipos es descuidar las prácticas de conducción. Las prácticas de conducción deben realizarse a lo largo de la temporada, **no la semana anterior a la competición.**
fr_ca: Un problème persistant chez les nouvelles équipes est la négligence de l'entraînement des pilotes. L'entraînement des pilotes doit se faire tout au long de la saison, **pas la semaine précédant la compétition**.
ro_ro: O problemă persistentă a echipelor noi este neglijarea antrenamentelor driverilor. Antrenamentele trebuie făcute pe parcursul sezonului, **nu în săptămâna dinaintea competiției.**
ru_ru: Постоянная проблема новых команд - пренебрежение тренировками операторов. Тренировки должны проводиться в течение всего сезона, **а не за неделю до соревнований.**

source: No matter how good your robot is, the robot is only 50% of the equation. The driver(s) are the other 50% which determine the success of the team as a whole. Even if your robot is the best in the world, an inferior robot with a competent drive team more than likely will beat your robot with a poor drive team. By April's world championships, most top teams have run hundreds of practice matches.
es_mx: No importa lo bueno que sea tu robot, el robot es sólo el 50% de la ecuación. Los conductores son el otro 50% que determina el éxito del equipo en su conjunto. Aunque su robot sea el mejor del mundo, es más que probable que un robot inferior con un equipo de conductores competente venza a su robot con un equipo de conductores deficiente. Para los campeonatos mundiales de abril, la mayoría de los mejores equipos han realizado cientos de partidos de entrenamiento.
fr_ca: Quelle que soit la qualité de votre robot, celui-ci ne représente que 50 % de l'équation. Les pilote(s) représentent les 50 % restants et déterminent le succès de l'équipe dans son ensemble. Même si votre robot est le meilleur au monde, un robot inférieur doté d'une équipe de pilotes compétents battra plus que probablement votre robot doté d'une équipe de pilotes médiocre. Avant les championnats du monde d'avril, la plupart des meilleures équipes ont organisé des centaines de matchs d'entraînement.
ro_ro: Indiferent cât de bun este robotul tău, acesta reprezintă doar 50% din ecuație. Pilotul(Piloții) reprezintă cealaltă jumătate, care determină succesul echipei în ansamblu. Chiar dacă robotul dvs. este cel mai bun din lume, un robot inferior cu o echipă de piloți competentă va învinge, mai mult ca sigur, robotul dvs. cu o echipă de piloți slabă. Până la campionatele mondiale din aprilie, majoritatea echipelor de top au efectuat sute de meciuri de antrenament.
ru_ru: Неважно, насколько хорош ваш робот, робот - это только 50% уравнения. Остальные 50% определяют успех команды в целом. Даже если ваш робот лучший в мире, более чем вероятно, что уступающий робот с компетентной командой операторов победит вашего робота с плохой командой операторов. К апрельскому чемпионату мира большинство лучших команд проводят сотни тренировочных матчей.

source: This gives some obvious advantages compared to a team with lesser practice.
es_mx: Esto aporta algunas ventajas evidentes en comparación con un equipo con menos práctica.
fr_ca: Cela présente des avantages évidents par rapport à une équipe moins expérimentée.
ro_ro: Acest lucru oferă câteva avantaje evidente în comparație cu o echipă cu mai puțină pregătită.
ru_ru: Это дает некоторые очевидные преимущества по сравнению с командой с меньшим количеством тренировок.

source: The driver(s) are totally familiar with handling the robot in every situation.
es_mx: El conductor o conductores están totalmente familiarizados con el manejo del robot en cualquier situación.
fr_ca: Le(s) conducteur(s) est (sont) parfaitement familiarisé(s) avec le maniement du robot dans toutes les situations.
ro_ro: Driverul (driverii) sunt complet familiarizați cu manevrarea robotului în orice situație.
ru_ru: Оператор(ы) полностью владеет навыками управления роботом в любой ситуации.

source: The robot is proven to be reliable enough to survive hours of operation.
es_mx: El robot ha demostrado ser lo suficientemente fiable como para sobrevivir horas de funcionamiento.
fr_ca: Le robot s'est avéré suffisamment fiable pour survivre à des heures de fonctionnement.
ro_ro: Robotul s-a dovedit a fi suficient de fiabil pentru a supraviețui ore întregi de funcționare.
ru_ru: Робот оказался достаточно надежным, чтобы выдержать многочасовую эксплуатацию.

source: The immense data that teams gather from test runs are used to optimize every element of the robot.
es_mx: Los inmensos datos que los equipos recopilan en las pruebas se utilizan para optimizar todos los elementos del robot.
fr_ca: Les immenses données que les équipes recueillent lors des essais sont utilisées pour optimiser chaque élément du robot.
ro_ro: Datele pe care echipele le adună în urma testelor sunt folosite pentru a optimiza fiecare element al robotului.
ru_ru: Огромные данные, которые команды собирают в ходе тренировок, используются для оптимизации каждого элемента робота.

source: Driver practice not only familiarizes the driver(s) with the robot and serves as a test of robot reliability, it also simulates in-game conditions. **Learning to push the limits of your robot should be done during practice, not at a competition.** This way, drivers will become more comfortable driving under stress and pressure. Teams with intensive driver practice will purposely make things more difficult (such as placing a disabled robot in the middle of the field or unplugging a drivetrain motor).
es_mx: Las prácticas de conducción no sólo sirven para que los conductores se familiaricen con el robot y comprueben su fiabilidad, sino que también simulan las condiciones del juego. **De este modo, los conductores se sentirán más cómodos conduciendo bajo estrés y presión. Los equipos con prácticas intensas de conducción harán las cosas más difíciles a propósito (como colocar un robot inutilizado en medio del campo o desconectar un motor de la transmisión).
fr_ca: L'entraînement des pilotes permet non seulement de les familiariser avec le robot et de tester sa fiabilité, mais aussi de simuler les conditions du jeu. **Apprendre à repousser les limites de son robot doit se faire lors de l'entraînement, et non lors d'une compétition. Les équipes qui s'entraînent intensivement rendront les choses plus difficiles (par exemple en plaçant un robot hors d'usage au milieu du terrain ou en débranchant un moteur de la chaîne cinématique).
ro_ro: Practica driverului nu numai că îl familiarizează pe acesta cu robotul, dar servește ca test de fiabilitate a robotului, ci simulează și condițiile din timpul jocului. **Limitele robotului ar trebui să fie aflate în timpul antrenamentelor, nu la o competiție.** În acest fel, driverii vor deveni mai confortabili la condus în condiții de stres și presiune. Echipele cu un antrenament intensiv al driverilor vor face în mod intenționat lucrurile mai dificile (cum ar fi plasarea unui robot dezactivat în mijlocul terenului sau deconectarea unui motor de transmisie).
ru_ru: Тренировка операторов не только знакомит их с роботом и служит проверкой надежности робота, но и имитирует игровые условия. **Учиться выжимать максимум из своего робота следует на тренировках, а не на соревнованиях.** Таким образом, операторы будут лучше чувствовать себя в условиях стресса и давления. Команды, интенсивно тренирующие операторов, будут специально усложнять ситуацию (например, ставить неработающего робота в центр поля или отключать мотор колесной базы).

source: While this may seem extreme, it is really just a form of preparedness. If your driver doesn't know how to react, then you need more drive practice.
es_mx: Aunque esto pueda parecer extremo, en realidad no es más que una forma de preparación. Si su conductor no sabe cómo reaccionar, entonces necesita más práctica al volante.
fr_ca: Bien que cela puisse sembler extrême, il s'agit en fait d'une forme de préparation. Si votre conducteur ne sait pas comment réagir, il faut qu'il s'exerce davantage à la conduite.
ro_ro: Deși acest lucru poate părea extrem, este de fapt doar o formă de pregătire. Dacă driverul dvs. nu știe cum să reacționeze, atunci aveți nevoie de mai multă practică de conducere.
ru_ru: Хотя это может показаться крайностью, на самом деле это просто форма готовности. Если ваш оператор не знает, как реагировать, значит, вам нужно больше практиковаться в управлении роботом.

source: No game strategy |rarr| Strategic driving
es_mx: No estrategia de juego |rarr| Conducción estratégica
fr_ca: Pas de stratégie de jeu |rarr| Conduite stratégique
ru_ru: Нет стратегии игры |rarr| Управление роботом с учетом стратегии

source: Similar to drive practice, this is something that many inexperienced teams ignore. A sports example is handy - even with the most talented players, a team won't go far without good game strategy.
es_mx: Al igual que ocurre con la práctica de la conducción, esto es algo que muchos equipos inexpertos ignoran. Un ejemplo deportivo es práctico: incluso con los jugadores de más talento, un equipo no llegará lejos sin una buena estrategia de juego.
fr_ca: Comme pour l'entraînement à la conduite, il s'agit d'un aspect que de nombreuses équipes inexpérimentées ignorent. Un exemple sportif est pratique : même avec les joueurs les plus talentueux, une équipe n'ira pas loin sans une bonne stratégie de jeu.
ru_ru: Как и в случае с тренировками операторов, многие неопытные команды игнорируют это. Удобен спортивный пример - даже с самыми талантливыми игроками команда не сможет далеко продвинуться без хорошей игровой стратегии.

source: A less capable team with better strategy execution can often pull off an upset. Planning a strategy ensures that every second in the 2:30 game time is used to maximum efficiency, which yields maximum points.
es_mx: Un equipo menos capaz, pero con una mejor ejecución de la estrategia, a menudo puede dar la sorpresa. Planificar una estrategia garantiza que cada segundo del tiempo de juego de 2:30 se utilice con la máxima eficacia, lo que se traduce en un máximo de puntos.
fr_ca: Une équipe moins performante, mais dont la stratégie est mieux exécutée, peut souvent créer la surprise. La planification d'une stratégie permet d'utiliser au mieux chaque seconde des 2:30 de jeu, ce qui permet d'obtenir un maximum de points.
ru_ru: Менее способная команда с лучшей стратегией часто может одержать победу. Планирование стратегии гарантирует, что каждая секунда в течение 2:30 игрового времени будет использована с максимальной эффективностью, что принесет максимум очков.

source: For example, drivers should know exactly where the robot needs to be positioned after the autonomous to tele-op switch. Practicing this switch will save a couple of seconds when drivers have to think "what do I do now?" In very competitive matches, these few seconds may be able to gain your team an extra cycle. Knowing when to transition from a tele-op to endgame objective is equally important (hint: perfect one first) and will save valuable time. Strategy should **always be used to maximize points** - whether this is a positioning strategy to access the game elements, or a defensive strategy to hinder the other alliance from scoring.
es_mx: Por ejemplo, los conductores deben saber exactamente dónde debe colocarse el robot tras el cambio de autónomo a teleoperado. Practicar este cambio ahorrará un par de segundos cuando los conductores tengan que pensar "¿qué hago ahora?". En partidos muy competitivos, estos pocos segundos pueden hacer ganar a tu equipo un ciclo extra. Saber cuándo pasar de una teleoperación a un juego final es igualmente importante (pista: perfeccionar uno primero) y ahorrará un tiempo valioso. La estrategia debe **utilizarse siempre para maximizar los puntos**, ya sea una estrategia de posicionamiento para acceder a los elementos del juego o una estrategia defensiva para impedir que la otra alianza marque.
fr_ca: Par exemple, les pilotes doivent savoir exactement où le robot doit être positionné après le passage de l'autonomie à la télé-opération. En pratiquant ce changement, les pilotes gagneront quelques secondes lorsqu'ils devront se demander "que dois-je faire maintenant ?". Dans les matchs très compétitifs, ces quelques secondes peuvent permettre à votre équipe de gagner un cycle supplémentaire. Savoir quand passer d'une télé-opération à un objectif de fin de partie est tout aussi important (indice : perfectionnez-en un d'abord) et vous fera gagner un temps précieux. La stratégie doit **toujours être utilisée pour maximiser les points** - qu'il s'agisse d'une stratégie de positionnement pour accéder aux éléments du jeu ou d'une stratégie défensive pour empêcher l'autre alliance de marquer des points.
ru_ru: Например, операторы должны точно знать, куда нужно поставить робота после переключения с Автономного периода на Управляемый период. Отработка этого перехода сэкономит несколько секунд, которые обычно тратятся на размышления «что делать дальше?». В напряжённых матчах эти секунды могут позволить команде выполнить дополнительный цикл. Не менее важно понимать, когда переходить от Управляемого периода к Эндгейму (подсказка: сначала доведите ее до совершенства) — это также сбережёт ценное время. Стратегия **всегда должна быть направлена на максимизацию очков** - будь то стратегия позиционирования для доступа к игровым элементам или оборонительная стратегия (defense), чтобы помешать другому альянсу набрать очки.

source: In most seasons, denying the other alliance 10 points is the same value as scoring 10 points in every match.
es_mx: En la mayoría de las temporadas, negar 10 puntos a la otra alianza tiene el mismo valor que anotar 10 puntos en cada partido.
fr_ca: Dans la plupart des saisons, refuser 10 points à l'autre alliance a la même valeur que marquer 10 points à chaque match.
ru_ru: В большинстве сезонов лишить другой альянс 10 очков - это то же самое, что набрать 10 очков в каждом матче.
