Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/design-strategy.po
Languages: es_mx, fr_ca, ro_ro, ru_ru

source: Score-first Designing |rarr| Designing for Consistency
es_mx: Diseño de anotar primero |rarr| Diseño para la consistencia
fr_ca: Conception basée sur le score d'abord |rarr| Conception basée sur la cohérence
ru_ru: Проектирование, ориентированное на результат |rarr| Проектирование, ориентированное на стабильность

source: Teams should prioritize consistency over scoring ability.
es_mx: Los equipos deben priorizar la regularidad sobre la capacidad de puntuación.
fr_ca: Les équipes doivent privilégier la régularité plutôt que la capacité à marquer des points.
ro_ro: Echipele ar trebui să prioritizeze consecvența în detrimentul capacității de a marca.
ru_ru: Команды должны отдавать предпочтение стабильности, а не способности набирать очки.

source: The tortoise beats the rabbit. An overused parable, but it still holds a kernel of truth. Why? Because the tortoise, which plodded along consistently, beat the rabbit, which had hot and cold streaks.
es_mx: La tortuga vence al conejo. Es una parábola sobre utilizada, pero encierra algo de verdad. ¿Por qué? Porque la tortuga, que avanzaba con constancia, venció al conejo, que tenía rachas frías y calientes.
fr_ca: La tortue bat le lapin. C'est une parabole galvaudée, mais elle contient toujours une part de vérité. Pourquoi ? Parce que la tortue, qui avance régulièrement, bat le lapin, qui a des hauts et des bas.
ro_ro: Broasca țestoasă îl bate pe iepure. O parabolă prea des folosită, dar care conține totuși un sâmbure de adevăr. De ce? Pentru că broasca țestoasă, care a înaintat constant, l-a învins pe iepure, care avea perioade calde și reci.
ru_ru: Черепаха побеждает кролика. Избитая притча, но в ней все равно есть доля истины. Почему? Потому что черепаха, которая упорно шла вперед, победила кролика, у которого были то горячие, то холодные полосы.

source: A hallmark of any successful team is consistency and reliability throughout the competition season and even across seasons. Sports dynasties are dynasties for the reason that they compete at a high level not for a couple games, but for multiple seasons. Without the power of consistency, it will be nearly impossible to win games, let alone a tournament.
es_mx: Un rasgo distintivo de cualquier equipo de éxito es la constancia y la fiabilidad a lo largo de la temporada de competición e incluso entre temporadas. Las dinastías deportivas lo son porque compiten a un alto nivel no durante un par de partidos, sino durante varias temporadas. Sin el poder de la consistencia, será casi imposible ganar partidos, por no hablar de un torneo.
fr_ca: Une équipe performante se caractérise par sa cohérence et sa fiabilité tout au long de la saison de compétition et même d'une saison à l'autre. Les dynasties sportives sont des dynasties parce qu'elles se battent à un haut niveau non pas pendant quelques matchs, mais pendant plusieurs saisons. Sans le pouvoir de la constance, il est pratiquement impossible de gagner des matchs, sans parler d'un tournoi.
ro_ro: Un semn distinctiv al oricărei echipe de succes constă în consecvența și fiabilitatea de care dau dovadă, atât pe parcursul sezonului competițional, cât și de-a lungul mai multor sezoane. Dinastiile sportive sunt dinastii pentru că ele concurează la un nivel înalt nu pentru câteva meciuri, ci pentru mai multe sezoane. Fără puterea consecvenței, va fi aproape imposibil să câștigi meciuri, ca să nu mai vorbim de un turneu.
ru_ru: Отличительной чертой любой успешной команды является стабильность и надежность на протяжении всего сезона соревнований и даже межсезонья. Спортивные династии потому и династии, что они выступают на высоком уровне не в течение пары игр, а на протяжении нескольких сезонов. Без силы стабильности практически невозможно выигрывать игры, не говоря уже о турнирах.

source: Too many teams fall into the pit of prioritizing scoring ability more than anything else, which is a grave error. In keeping with the first tip, to perfect one objective first, this practice will serve to increase consistency.
es_mx: Demasiados equipos caen en el pozo de priorizar la capacidad de puntuación por encima de cualquier otra cosa, lo cual es un grave error. De acuerdo con el primer consejo, perfeccionar primero un objetivo, esta práctica servirá para aumentar la regularidad.
fr_ca: Trop d'équipes tombent dans le piège qui consiste à donner la priorité à la capacité de marquer des points avant toute autre chose, ce qui est une grave erreur. Conformément au premier conseil, à savoir perfectionner d'abord un objectif, cette pratique permettra d'accroître la cohérence.
ro_ro: Prea multe echipe cad în capcana de a prioritiza capacitatea de a marca mai mult decât orice altceva, ceea ce reprezintă o eroare gravă. În conformitate cu primul sfat, de a perfecționa mai întâi un obiectiv, această practică va servi la creșterea consecvenței.
ru_ru: Многие команды совершают грубую ошибку, концентрируясь исключительно на способности робота зарабатывать очки, забывая о других аспектах. Следуя первому правилу — сначала доведи до совершенства один элемент, — такой подход позволит добиться стабильности работы.

source: While scoring ability should be a priority and objective when designing mechanisms, it is not everything in this game. We advise being consistent at low and medium scoring levels than inconsistently scoring at a high level.
es_mx: Aunque la capacidad de puntuar debe ser una prioridad y un objetivo a la hora de diseñar mecanismos, no lo es todo en este juego. Aconsejamos ser coherente en los niveles de puntuación bajos y medios que hacerlo de forma incoherente en un nivel alto.
fr_ca: Si la capacité à marquer des points doit être une priorité et un objectif lors de la conception des mécanismes, ce n'est pas tout dans ce jeu. Nous conseillons d'être cohérent à des niveaux de score faibles et moyens plutôt que d'être incohérent à un niveau élevé.
ro_ro: Deși capacitatea de a înscrie puncte ar trebui să fie o prioritate și un obiectiv atunci când se proiectează mecanismele, aceasta nu este totul în acest joc. Vă sfătuim să fiți consecvenți la niveluri de scoruri mici și medii decât să fiți inconsecvenți la un nivel înalt.
ru_ru: Хотя способность набирать очки должна быть приоритетом и целью при разработке механизмов, это не все в этой игре. Мы советуем скорее быть последовательными на низких и средних уровнях, чем непоследовательно набирать очки на высоком уровне.

source: Focus on being able to do that one thing every single time throughout your matches, and you will begin to see how important consistency is. **This tip is equally as important during alliance selections. Top teams will prioritize teams that are consistent far more than scoring ability.** They are not afraid to look at teams who can't score much, but can contribute every time to the alliance score, rather than selecting a boom-or-bust pick.
es_mx: Concéntrate en ser capaz de hacer esa única cosa cada vez a lo largo de tus partidas, y empezarás a ver lo importante que es la consistencia. **Este consejo es igual de importante a la hora de elegir alianzas. Los mejores equipos darán prioridad a los equipos que sean constantes mucho más que a los que sean capaces de anotar.** No tienen miedo de fijarse en equipos que no puedan anotar mucho, pero que puedan contribuir siempre a la puntuación de la alianza, en lugar de seleccionar una selección de auge o fracaso.
fr_ca: Concentrez-vous sur cette seule chose à chaque fois que vous jouez, et vous commencerez à voir à quel point la cohérence est importante. **Ce conseil est tout aussi important lors de la sélection des alliances. Les meilleures équipes donneront la priorité aux équipes qui sont constantes bien plus qu'à celles qui marquent des points**. Elles n'ont pas peur d'examiner les équipes qui ne peuvent pas marquer beaucoup de points, mais qui peuvent contribuer à chaque fois au score de l'alliance, plutôt que de sélectionner une équipe qui ne peut pas faire que des miracles.
ru_ru: Сосредоточьтесь на том, чтобы выполнять это одно действие стабильно в течение всех матчей, и вы увидите, насколько важна стабильность. Этот совет столь же важен на этапе формирования альянсов. Сильнейшие команды будут отдавать приоритет стабильным командам, а не тем, кто просто умеет разово набирать много очков. Они не побоятся обратить внимание на команды, которые не показывают высоких результатов в матче, но могут стабильно приносить очки альянсу — вместо выбора непредсказуемого партнера.

source: Building haphazardly |rarr| Building for reliability
es_mx: Construyendo al azar |rarr| Construyendo para la confiabilidad
fr_ca: Construire au hasard |rarr| Construire pour la fiabilité
ru_ru: Бессистемная сборка |rarr| Сборка для надежности

source: Build for the worst case scenario, not the best case scenario. When building, teams often overlook a key principle: build for reliability. All too often, teams skimp on the quality of construction as well as materials, which leads to one of the most common reasons for unsuccessful tournaments: part failure.
es_mx: Construya para el peor de los casos, no para el mejor. A la hora de construir, los equipos suelen pasar por alto un principio clave: construir para la fiabilidad. Con demasiada frecuencia, los equipos escatiman en la calidad de la construcción, así como en los materiales, lo que conduce a una de las razones más comunes del fracaso de los torneos: el fallo de las piezas.
fr_ca: Construire en fonction du pire scénario, et non du meilleur. Lors de la construction, les équipes négligent souvent un principe essentiel : la fiabilité. Trop souvent, les équipes lésinent sur la qualité de la construction et des matériaux, ce qui conduit à l'une des raisons les plus courantes de l'échec des tournois : la défaillance d'une pièce.
ro_ro: Construiți pentru cel mai rău scenariu, nu pentru cel mai bun scenariu. Atunci când construiesc, echipele trec adesea cu vederea un principiu cheie: construiți pentru fiabilitate. Mult prea des, echipele se zgârcesc la calitatea construcției, precum și la cea a materialelor, ceea ce duce la unul dintre cele mai frecvente motive pentru turneele nereușite: defectarea pieselor.
ru_ru: Собирайте с расчетом на худший, а не на лучший сценарий. При сборке команды часто упускают из виду ключевой принцип: делать с расчетом на надежность. Слишком часто команды экономят на качестве конструкции и материалов, что приводит к одной из самых распространенных причин неудачных турниров - поломке деталей.

source: Teams also do not take into account the rigors of competition and build as if the robot will not encounter opposing robots. Sufficient driver practice will be able to better simulate in-game conditions and test the reliability of the robot. To remedy this problem, refer to the :doc:`Materials Guide </docs/custom-manufacturing/materials-guide>` to gain a better understanding of what materials are recommended for use.
es_mx: Los equipos tampoco tienen en cuenta los rigores de la competición y construyen como si el robot no fuera a encontrarse con robots rivales. Si los conductores practican lo suficiente, podrán simular mejor las condiciones del juego y poner a prueba la fiabilidad del robot. Para remediar este problema, consulte la :doc:`Guía de materiales </docs/custom-manufacturing/materials-guide>` para comprender mejor qué materiales se recomienda utilizar.
fr_ca: Les équipes ne prennent pas non plus en compte les rigueurs de la compétition et construisent leur robot comme s'il n'allait pas rencontrer de robots adverses. Une pratique suffisante des pilotes permettra de mieux simuler les conditions du jeu et de tester la fiabilité du robot. Pour remédier à ce problème, consultez le :doc:`Guide des matériaux </docs/custom-manufacturing/materials-guide>` pour mieux comprendre les matériaux qu'il est recommandé d'utiliser.
ro_ro: De asemenea, echipele nu iau în considerare rigorile competiției și construiesc ca și cum robotul nu va întâlni roboți adversari. Antrenamentul suficient al piloților va putea să simuleze mai bine condițiile din timpul jocului și să testeze fiabilitatea robotului. Pentru a remedia această problemă, consultați :doc:`Materials Guide </docs/custom-manufacturing/materials-guide>` pentru a înțelege mai bine ce materiale se recomandă a fi utilizate.
ru_ru: Команды также не учитывают суровые условия соревнований и собирают робота так, будто он не столкнется с роботами соперников. Достаточная количество тренировок операторов позволит лучше смоделировать игровые условия и проверить надежность робота. Чтобы решить эту проблему, обратитесь к :doc:`Руководство по материалам </docs/custom-manufacturing/materials-guide>`, чтобы лучше понять, какие материалы рекомендуется использовать.

source: If possible, teams should build with redundancy in mind. For example, if one set of linear slides fails due to a wire snapping, having a second set will still allow the robot to operate instead of sitting dead in the water. Practically, doubling mechanisms, motors, and servos is a common method to build for redundancy.
es_mx: Si es posible, los equipos deben construir pensando en la redundancia. Por ejemplo, si un juego de rieles lineales falla porque se rompe un cable, tener un segundo juego permitirá que el robot funcione en lugar de quedarse parado en el agua. En la práctica, duplicar los mecanismos, motores y servos es un método común de construcción redundante.
fr_ca: Dans la mesure du possible, les équipes doivent construire en pensant à la redondance. Par exemple, si un jeu de glissières linéaires tombe en panne à cause de la rupture d'un fil, un deuxième jeu permettra au robot de fonctionner au lieu de rester inerte. En pratique, doubler les mécanismes, les moteurs et les servomoteurs est une méthode courante de construction pour assurer la redondance.
ro_ro: Dacă este posibil, echipele ar trebui să construiască cu gândul la redundanță. De exemplu, dacă un set de glisiere liniare se defectează din cauza ruperii unui cablu, existența unui al doilea set va permite robotului să funcționeze în loc să nu mai poată funcționa. Practic, dublarea mecanismelor, a motoarelor și a servomotoarelor este o metodă obișnuită de a construi pentru redundanță.
ru_ru: По возможности, команды должны собирать роботов с учетом поломок. Например, если один комплект линейных направляющих выйдет из строя из-за обрыва провода, наличие второго комплекта позволит роботу работать, а не бездействовать. Практически, удвоение механизмов, моторов и сервоприводов является распространенным методом создания резерва.

source: In addition, teams often forget to account for twisting or compression forces that may occur upon the mechanism.
es_mx: Además, los equipos a menudo olvidan tener en cuenta las fuerzas de torsión o compresión que pueden producirse sobre el mecanismo.
fr_ca: En outre, les équipes oublient souvent de prendre en compte les forces de torsion ou de compression qui peuvent s'exercer sur le mécanisme.
ro_ro: În plus, echipele uită adesea să ia în considerare forțele de torsiune sau de compresie care pot apărea asupra mecanismului.
ru_ru: Кроме того, команды часто забывают учесть силы скручивания или сжатия, которые могут возникнуть в механизме.

source: While we cannot give any specific recommendations, do keep in mind what forces the support structure of your mechanism must bear along the full range of motion, and account for what occurs when it might hit another robot/field wall/field. Building more robustly is always worth the time spent. However, it is good to think about the extra weight that results.
es_mx: Aunque no podemos dar recomendaciones específicas, ten en cuenta qué fuerzas debe soportar la estructura de soporte de su mecanismo a lo largo de todo el rango de movimiento, y tenga en cuenta lo que ocurre cuando puede chocar con otro robot/pared de campo/campo. Construir de forma más robusta siempre vale la pena. Sin embargo, es bueno pensar en el peso extra resultante.
fr_ca: Bien que nous ne puissions pas donner de recommandations spécifiques, gardez à l'esprit les forces que la structure de support de votre mécanisme doit supporter sur toute l'amplitude du mouvement, et tenez compte de ce qui se passe lorsqu'il est susceptible de heurter un autre robot/mur/terrain. Il vaut toujours la peine de consacrer du temps à la construction d'un mécanisme plus robuste. Cependant, il est bon de penser au poids supplémentaire qui en résulte.
ro_ro: Deși nu putem oferi recomandări specifice, țineți cont de forțele pe care trebuie să le suporte structura de susținere a mecanismului dvs. de-a lungul întregului interval de mișcare și luați în considerare ceea ce se întâmplă atunci când acesta ar putea lovi un alt robot/perete/teren. Construirea mai solidă merită tot timpul alocat acesteia. Cu toate acestea, este bine să vă gândiți la greutatea suplimentară care rezultă.
ru_ru: Хотя мы не можем дать никаких конкретных рекомендаций, помните о том, какие силы должна выдерживать несущая конструкция вашего механизма во время всего диапазона движения, и учитывайте, что он может удариться о другого робота/борт поля/поле. Более надежная конструкция всегда стоит потраченного времени. Однако стоит подумать и о дополнительном весе.

source: Furthermore, a common cause of robot disconnect is wiring issues. Refer to the :doc:`Wiring section </docs/power-and-electronics/wiring>` for more information; in short, make sure to plan ahead and leave space for wires, and use strain relief whenever possible.
es_mx: Además, una causa común de desconexión del robot son los problemas de cableado. Consulta la sección :doc:`Cableado </docs/power-and-electronics/wiring>` para obtener más información; en resumen, asegúrate de planificar con antelación y dejar espacio para los cables, y utiliza alivio de tensión siempre que sea posible.
fr_ca: En outre, les problèmes de câblage sont une cause fréquente de déconnexion des robots. Reportez-vous à la :doc:`Section Câblage </docs/power-and-electronics/wiring>` pour plus d'informations ; en bref, assurez-vous de planifier à l'avance et de laisser de l'espace pour les câbles, et utilisez une décharge de traction chaque fois que cela est possible.
ro_ro: În plus, o cauză frecventă a deconectării robotului este reprezentată de problemele de cablare. Consultați secțiunea :doc:`Wiring section</docs/power-and-electronics/wiring>` pentru mai multe informații; pe scurt, asigurați-vă că planificați din timp și lăsați spațiu pentru cabluri și folosiți o descărcare de tensiune ori de câte ori este posibil.
ru_ru: Кроме того, частой причиной отключения робота являются проблемы с проводкой. Более подробную информацию см. в разделе :doc:`Проводка </docs/power-and-electronics/wiring>`; вкратце, убедитесь, что вы планируете заранее и оставляете место для проводов, и используйте разгрузку от натяжения, когда это возможно.

source: All these tips combined will help your robot become more reliable, a key characteristic of all world-level robots.
es_mx: Todos estos consejos combinados ayudarán a que su robot sea más fiable, una característica clave de todos los robots de nivel mundial.
fr_ca: Tous ces conseils combinés aideront votre robot à devenir plus fiable, une caractéristique clé de tous les robots de niveau mondial.
ro_ro: Toate aceste sfaturi combinate vor ajuta robotul dumneavoastră să devină mai fiabil, o caracteristică cheie a tuturor roboților de nivel mondial.
ru_ru: Все эти советы в совокупности помогут вашему роботу стать более надежным, что является ключевой характеристикой всех роботов мирового уровня.

source: Fretting about Design |rarr| Focusing on Execution
es_mx: Preocupándose por el diseño |rarr| Enfocándose en la ejecución
fr_ca: Se Préoccuper de la Conception |rarr| Se Concentrer sur l'Exécution
ru_ru: Беспокоиться о Дизайне |rarr| Сосредоточиться на Выполнении

source: A good execution of a bad design will beat a bad execution of good design.
es_mx: Una buena ejecución de un mal diseño vencerá a una mala ejecución de un buen diseño.
fr_ca: Une bonne exécution d'une mauvaise conception l'emporte sur une mauvaise exécution d'une bonne conception.
ro_ro: O execuție bună a unui proiect prost va învinge o execuție proastă a unui proiect bun.
ru_ru: Хорошее исполнение плохого дизайна победит плохое исполнение хорошего дизайна.

source: FTC\ |reg| is all about how well you execute in both the mechanical aspect and the driver aspect. If your goal is winning, then how mechanically beautiful your robot is doesn't matter. Your goal is less of impressing the judges but performing the best you possibly can on the field.
es_mx: En FTC todo gira en torno a lo bien que se ejecuta, tanto en el aspecto mecánico como en el del conductor. Si tu objetivo es ganar, no importa lo bonito que sea tu robot desde el punto de vista mecánico. Tu objetivo no es tanto impresionar a los jueces como rendir al máximo en el campo de juego.
fr_ca: FTC\ |reg| est une question de qualité d'exécution, tant sur le plan mécanique que sur le plan de la conduite. Si votre objectif est de gagner, la beauté mécanique de votre robot n'a pas d'importance. Votre objectif est moins d'impressionner les juges que de donner le meilleur de vous-même sur le terrain.
ru_ru: В FTC\ |reg| все зависит от того, насколько хорошо вы выполняете как механическую часть, так и работу оператора. Если ваша цель - победа, то неважно, насколько механически красив ваш робот. Ваша цель - не столько произвести впечатление на экспертов, сколько выступить на поле как можно лучше.

source: It is very possible to take a bad design, execute it well, and still be competitive at a high level. Even though not many teams are able to do so, it still goes to show that the method of implementation is very important. When brainstorming designs, try not to get hung up on small details if possible.
es_mx: Es muy posible tomar un mal diseño, ejecutarlo bien y seguir siendo competitivo a alto nivel. Aunque no muchos equipos lo consiguen, esto demuestra que el método de ejecución es muy importante. En la medida de lo posible, no te obsesiones con los pequeños detalles.
fr_ca: Il est tout à fait possible de prendre une mauvaise conception, de bien l'exécuter et de rester compétitif à un haut niveau. Même si peu d'équipes y parviennent, cela prouve que la méthode de mise en œuvre est très importante. Lors du brainstorming, essayez de ne pas vous attarder sur les petits détails, dans la mesure du possible.
ro_ro: Este foarte posibil să adopți un design prost, să îl execuți bine și să fii totuși competitiv la un nivel înalt. Chiar dacă nu multe echipe reușesc să facă acest lucru, acest lucru demonstrează că metoda de implementare este foarte importantă. Atunci când faceți brainstorming cu privire la proiecte, încercați să nu vă blocați pe cât posibil pe detalii mici.
ru_ru: Вполне возможно взять плохой дизайн, хорошо его реализовать и при этом быть конкурентоспособным на высоком уровне. И хотя не многим командам это удается, это все равно говорит о том, что метод реализации очень важен. Во время мозгового штурма старайтесь не зацикливаться на мелких деталях, если это возможно.
