Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/design-strategy.po
Languages: es_mx, fr_ca, ro_ro, ru_ru

source: **However, it is not advisable for rookie teams to play defense** due to the specific rules surrounding this strategy. If a team wishes to execute a defensive strategy, be sure to read all the rules as defense can easily incur penalties/cards if done improperly.
es_mx: **Sin embargo, no es aconsejable que los equipos novatos jueguen a la defensiva** debido a las reglas específicas que rodean a esta estrategia. Si un equipo desea ejecutar una estrategia defensiva, asegúrese de leer todas las reglas, ya que la defensa puede incurrir fácilmente en penalizaciones/tarjetas si se hace de forma incorrecta.
fr_ca: **Cependant, il n'est pas conseillé aux équipes débutantes de jouer en défense** en raison des règles spécifiques qui entourent cette stratégie. Si une équipe souhaite exécuter une stratégie défensive, assurez-vous de lire toutes les règles, car la défense peut facilement entraîner des pénalités/cartes si elle n'est pas effectuée correctement.
ru_ru: **Однако командам-новичкам не рекомендуется играть от обороны (defense)** из-за особых правил, связанных с этой стратегией. Если команда хочет использовать оборонительную стратегию (defense), обязательно прочитайте все правила, так как при неправильной игре оборона (defense) может повлечь за собой штрафы/наказания.

source: Term
es_mx: Término
fr_ca: Définition
ru_ru: Понятие

source: Defense
es_mx: Defensa
fr_ca: Défense
ru_ru: Оборона (Defense)

source: Defense is a strategy employed with the goal of preventing the opposing alliance from scoring points, or at least significantly slowing the opposition's scoring.
es_mx: La defensa es una estrategia empleada con el objetivo de impedir que la alianza contraria anote puntos, o al menos desacelerar significativamente la anotación del contrario.
fr_ca: La défense est une stratégie employée dans le but d'empêcher l'alliance adverse de marquer des points, ou au moins de ralentir considérablement le score de l'opposition.
ru_ru: Оборона (Defense) - это стратегия, цель которой - не дать сопернику набрать очки или, по крайней мере, значительно замедлить их начисление.

source: This strategy can backfire if drivers illegally play defense and incur penalties and/or cards for their alliance. Defense is usually played by obstructing the opposing alliance, either by strategically positioning the robot to obstruct access or pushing another team's robot into a disadvantageous position.
es_mx: Esta estrategia puede ser contraproducente si los conductores juegan ilegalmente a la defensiva e incurren en penalizaciones y/o tarjetas para su alianza. La defensa suele consistir en obstaculizar a la alianza contraria, ya sea colocando estratégicamente el robot para obstruir el acceso o empujando al robot de otro equipo a una posición desventajosa.
fr_ca: Cette stratégie peut se retourner contre les pilotes s'ils jouent illégalement la défense et encourent des pénalités et/ou des cartes pour leur alliance. La défense consiste généralement à gêner l'alliance adverse, soit en positionnant stratégiquement le robot pour en bloquer l'accès, soit en poussant le robot d'une autre équipe dans une position désavantageuse.
ru_ru: Эта стратегия может не сработать, если операторы будут нарушать правила и получат штрафы и/или карточки для своего альянса. Оборона (Defense) обычно заключается в создании препятствий альянсу соперников, либо путем стратегического расположения робота так, чтобы затруднить доступ, либо путем вытеснения робота другой команды в невыгодное положение.

source: Fully driver-controlled driving |rarr| Partially automated tasks
es_mx: Conducción totalmente controlada por el conductor |rarr| Tareas parcialmente automatizadas
fr_ca: Conduite entièrement contrôlée par le pilote |rarr| Tâches partiellement automatisées
ru_ru: Полностью контролируемое оператором управление |rarr| Частично автоматизированные задачи

source: Autonomous should not be limited to only the autonomous mode. Automating simple tasks can be a real time-saver and efficiency boost to teams.
es_mx: La autonomía no debe limitarse únicamente al modo autónomo. Automatizar tareas sencillas puede suponer un auténtico ahorro de tiempo y un aumento de la eficiencia para los equipos.
fr_ca: L'autonomie ne doit pas se limiter au seul mode autonome. L'automatisation de tâches simples peut être un véritable gain de temps et d'efficacité pour les équipes.
ru_ru: Автономность не должна ограничиваться только автономным периодом. Автоматизация простых задач может реально сэкономить время и повысить эффективность работы команды.

source: Automating tasks can save time and reduce the need for driver multi-tasking. Drivers should always be controlling the robot with as few button presses as possible. For example, automatically stopping the intake mechanism when game elements have been collected saves a button press.
es_mx: La automatización de tareas puede ahorrar tiempo y reducir la necesidad de que el conductor realice varias tareas a la vez. Los conductores deben controlar siempre el robot pulsando el menor número de botones posible. Por ejemplo, detener automáticamente el mecanismo de admisión cuando se han recogido los elementos del juego ahorra pulsar un botón.
fr_ca: L'automatisation des tâches permet de gagner du temps et de réduire la nécessité pour le conducteur d'effectuer plusieurs tâches à la fois. Les conducteurs doivent toujours contrôler le robot en appuyant sur le moins de boutons possible. Par exemple, l'arrêt automatique du mécanisme d'admission lorsque les éléments de jeu ont été collectés permet d'économiser une pression sur un bouton.
ru_ru: Автоматизация задач позволяет сэкономить время и снизить необходимость в многозадачности оператора. Операторы всегда должны управлять роботом, нажимая как можно меньше кнопок. Например, автоматическая остановка захвата после попадания в него игрового элемента позволяет сэкономить одно нажатие кнопки.

source: Autonomously operating some mechanisms has the advantage of eliminating driver error and relieves stress. For example, if a lift has to extend to exactly 30 inches, a motor with an :term:`encoder <Encoder>` can complete that with 100% accuracy at full speed, compared to a human driver's minor error.
es_mx: El funcionamiento autónomo de algunos mecanismos tiene la ventaja de eliminar los errores del conductor y alivia el estrés. Por ejemplo, si un ascensor tiene que extenderse exactamente 30 pulgadas, un motor con un :term:`encoder <Encoder>` puede completarlo con una precisión del 100% a toda velocidad, comparado al pequeño error de un conductor humano.
fr_ca: Le fonctionnement autonome de certains mécanismes présente l'avantage d'éliminer les erreurs du conducteur et de réduire le stress. Par exemple, si un élévateur doit s'étendre exactement sur 30 pouces, un moteur équipé d'un :term:`encoder <Encoder>` peut le faire avec une précision de 100 % à pleine vitesse, alors qu'un conducteur humain ne commettrait qu'une erreur mineure.
ru_ru: Преимущество автономного управления некоторыми механизмами заключается в том, что оно исключает ошибки оператора и снимает стресс. Например, если лифт должен выдвинуться ровно на 30 дюймов, мотор с :term:`encoder <Encoder>` может сделать это со 100% точностью на полной скорости, по сравнению с незначительной ошибкой оператора.

source: Autonomous functions should be able to be overridden by manual input in case something goes wrong (e.g. encoder is unplugged, a part breaks, etc.) to prevent damage to the robot and to be compliant with game rules.
es_mx: Las funciones autónomas deben poder anularse mediante una entrada manual en caso de que algo vaya mal (por ejemplo, se desconecta el codificador, se rompe una pieza, etc.) para evitar daños al robot y cumplir las reglas del juego.
fr_ca: Les fonctions autonomes doivent pouvoir être annulées par une intervention manuelle en cas de problème (par exemple, si le codeur est débranché, si une pièce est cassée, etc).
ru_ru: Автономные функции должны иметь возможность переопределяться ручным управлением на случай возникновения неисправностей (например, отсоединение энкодера, поломка детали и т.д.) — это предотвратит повреждение робота и обеспечит соответствие игровым правилам.

source: Doing Everything At Once to → Perfecting One Objective First
ro_ro: De la a face totul deodată la → Perfecționarea unui obiectiv mai întâi

source: Overcomplex → Simple
ro_ro: Supracomplex → Simplu

source: Score-first Designing → Designing for Consistency
ro_ro: Proiectarea bazată pe punctaj → Proiectarea pentru consistență

source: Building haphazardly → Building for reliability
ro_ro: Construirea la întâmplare → Construirea pentru fiabilitate

source: Fretting about Design → Focusing on Execution
ro_ro: Frământări legate de design → Concentrarea pe execuție

source: Neglecting driver practice → Constant driver training
ro_ro: Neglijarea antrenamentului driverilor → Instruirea constantă a driverilor

source: No game strategy → Strategic driving
ro_ro: Fără strategie de joc → Conducere strategică
