Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/design-skills/engineering-design-process.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: Engineering Design Process
es_mx: Proceso de Diseño de Ingeniería
fr_ca: Processus de conception d'ingénierie
ru_ru: Процесс Инженерной Разработки
zh_cn: 工程设计流程

source: *Note: The exact process will vary from team to team, so the graphic is not meant to be a hard and fast rule.*
es_mx: *Nota: El proceso exacto variará de equipo a equipo, por lo que el gráfico no pretende ser una regla estricta*
fr_ca: *Remarque : le processus exact varie d'une équipe à l'autre, et le graphique n'est donc pas une règle absolue.
ru_ru: *Примечание: конкретный процесс зависит от команды, поэтому схема не является четким правилом.*
zh_cn: 注意：确切的过程因团队而异，因此下述内容并不意味着是一个硬性规则。

source: Components of the Engineering Design Process
es_mx: Componentes del Proceso de Diseño de Ingeniería
fr_ca: Composantes du processus de conception d'ingénierie
ru_ru: Этапы Процесса Инженерной Разработки
zh_cn: 工程设计过程的组成部分

source: In general, the design process contains these steps; however, every team will modify the process to their needs and limitations.
es_mx: En general, el proceso de diseño contiene estos pasos; sin embargo, cada equipo modificará el proceso según sus necesidades y limitaciones.
fr_ca: En général, le processus de conception comprend ces étapes ; cependant, chaque équipe modifiera le processus en fonction de ses besoins et de ses limites.
ru_ru: В целом, процесс разработки включает в себя эти шаги, однако каждая команда будет модифицировать процесс в соответствии со своими потребностями и ограничениями.
zh_cn: 通常，设计过程包含以下这些步骤； 但是，每个团队都会根据自己的需要和限制修改流程。

source: Define the problem: What are you trying to solve? What is the timeline?
es_mx: Define el problema: ¿Qué estás tratando de resolver? ¿Cuál es el cronograma?
fr_ca: Définir le problème : Qu'essayez-vous de résoudre ? Quel est le calendrier ?
ru_ru: Определите проблему: Что вы пытаетесь решить? Каковы временные рамки?
zh_cn: 定义问题：你想解决什么？时间轴是什么？

source: Specify requirements: What are the necessities for your proposed solution?
es_mx: Especifique los requisitos: ¿Cuáles son las necesidades para su solución propuesta?
fr_ca: Préciser les besoins : Quelles sont les nécessités de la solution que vous proposez ?
ru_ru: Уточните требования: Что необходимо для предлагаемого вами решения?
zh_cn: 指定需求：您提出的解决方案的必要性是什么？

source: Brainstorm/CAD Design: Draw or sketch a prototype on paper or in CAD.
es_mx: Lluvia de ideas/Diseño en CAD: Dibuja o esboza un prototipo en papel o en CAD.
fr_ca: Brainstorming/Conception CAO : Dessiner ou esquisser un prototype sur papier ou en CAO.
ru_ru: Мозговой штурм/Моделирование: Нарисуйте прототип на бумаге или в САПР.
zh_cn: 头脑风暴/CAD设计：在纸上或CAD中绘制或绘制原型。

source: Prototype/Experiment: Put a first design together using physical materials.
es_mx: Prototipo/Experimentar: Armar un primer diseño utilizando materiales físicos.
fr_ca: Prototype/Expérimentation : Réaliser un premier projet en utilisant des matériaux physiques.
ru_ru: Прототип/эксперимент: Создайте первую конструкцию, используя физические материалы.
zh_cn: 原型/实验:使用物理材料搭建第一个设计。

source: Test: Ensure you thoroughly test every part of your prototype to detect flaws.
es_mx: Asegúrate de probar minuciosamente cada parte de tu prototipo para detectar fallas.
fr_ca: Test : Veillez à tester minutieusement chaque partie de votre prototype afin d'en détecter les défauts.
ru_ru: Тестирование: Убедитесь, что вы тщательно тестируете каждую часть вашего прототипа, чтобы выявить недостатки.
zh_cn: 测试：确保彻底测试原型的每个部分以检测缺陷。

source: Analyze results: Examine what you learned from your tests to iterate successively.
es_mx: Analizar resultados: Examina lo que aprendiste de tus pruebas para iterar sucesivamente.
fr_ca: Analyser les résultats : Examinez ce que vous avez appris de vos tests pour procéder à des itérations successives.
ru_ru: Анализируйте результаты: Проанализируйте, что вы узнали из своих тестов, чтобы в дальнейшем дорабатывать.
zh_cn: 分析结果：分析您从测试中学到的内容，以便连续迭代。

source: Final implementation: Polish and solidify a final design that won't change.
es_mx: Implementación final: Pulir y solidificar un diseño final que no cambiará.
fr_ca: Mise en œuvre finale : Polir et consolider une conception finale qui ne changera pas.
ru_ru: Окончательная реализация: Доделайте и зафиксируйте окончательный дизайн, который не будет меняться.
zh_cn: 最终实施：抛光和固化不会改变的最终设计。

source: As an example, let's look at an imaginary team building a drivetrain for Rover Ruckus (RR2), which was 2018-2019's game. In RR2, there was a crater, which was about 3" tall, and could be traversed. In that year's game, there were two main options: traverse said crater, or not traverse it and instead reach over with an arm.
es_mx: Como ejemplo, veamos a un equipo imaginario construyendo un chasis para Rover Ruckus (RR2), que fue el juego de 2018-2019. En RR2, había un cráter de aproximadamente 3" (8cm) de altura que se podía atravesar. En el juego de ese año, había dos opciones principales: atravesar dicho cráter o no atravesarlo y en su lugar alcanzarlo con un brazo.
fr_ca: Prenons l'exemple d'une équipe imaginaire qui construirait un châssis pour Rover Ruckus (RR2), le jeu de l'année 2018-2019. Dans RR2, il y avait un cratère d'environ 3 pouces de haut qui pouvait être traversé. Dans le jeu de cette année-là, il y avait deux options principales : traverser le cratère ou ne pas le traverser et, à la place, tendre le bras.
ru_ru: В качестве примера рассмотрим воображаемую команду, создающую колесную базу для Rover Ruckus (RR2), сезон 2018-2019. В RR2 был Crater высотой около 3 дюймов, который можно было преодолеть. В игре того года было два основных варианта: пересечь Crater или не пересекать его и вместо этого дотянуться манипулятором.
zh_cn: 举个例子，让我们看一个想象中的团队为Rover Ruckus（RR2）建造动力传动系统，这是2018-2019年的游戏。在RR2中，有一个坑，大约3英寸高，可以穿过。在那一年的游戏中，有两个主要选择：穿过这个坑，或者不穿过它，而是用机械臂伸过去。

source: The team must first specify requirements for the drivetrain. One of the most important aspects of a drivetrain is maneuverability. Another requirement could be speed, traction, reliability, etc. From the team's specified requirements, they would now look at drivetrains that fit their requirements. If the team wanted to traverse the crater, then a 4WD or 6WD would be an optimal design. If they did not need to traverse the crater, many options are still on the table such as the holonomic drivetrains.
es_mx: El equipo primero debe especificar los requisitos para el chasis. Uno de los aspectos más importantes de un chasis es la maniobrabilidad. Otro requisito podría ser la velocidad, tracción, confiabilidad, etc. A partir de los requisitos especificados por el equipo, ahora buscarían chasises que se ajusten a sus requisitos. Si el equipo quisiera atravesar el cráter, entonces un diseño óptimo sería un 4WD o 6WD. Si no necesitaran atravesar el cráter, aún hay muchas opciones sobre la mesa, como los chasises holonómicos.
fr_ca: L'équipe doit d'abord spécifier les exigences relatives au châssis. L'un des aspects les plus importants du châssis est la maniabilité. Une autre exigence pourrait être la vitesse, la traction, la fiabilité, etc. À partir des exigences spécifiées par l'équipe, celle-ci doit rechercher des châssis qui répondent à ses besoins. Si l'équipe souhaite traverser le cratère, une transmission à 4 ou 6 roues motrices sera optimale. Si elle n'a pas besoin de traverser le cratère, de nombreuses options sont encore possibles, comme les transmissions holonomiques.
ru_ru: Сначала команда должна определить требования к колесной базе. Одним из наиболее важных аспектов колесной базы является маневренность. Другим требованием может быть скорость, проходимость, надежность и т. д. Определив требования команды, они теперь будут искать колесные базы, которые соответствуют их требованиям. Если команда хотела проехать по Crater'у, то оптимальным вариантом будет 4WD (4-Wheel Drive / Полный привод на 4 колеса) или 6WD (6-Wheel Drive / Полный привод на 6 колес). Если же им не нужно пересекать Crater, то остается множество вариантов, например, всенаправленные (holonomic) колесные базы.
zh_cn: 团队必须首先指定动力传动系统的要求。动力传动系统最重要的方面之一是机动性。另一个要求可能是速度、牵引力、可靠性等。从团队指定的要求来看，他们现在将考虑符合他们要求的动力传动系统。如果团队想要穿过坑，那么4WD或6WD将是最佳设计。如果他们不需要穿过坑，许多选项仍然可供选择，例如完整的动力传动系统。

source: The next step would be to brainstorm actual designs. It would be prudent to have more than one student to design one drivetrain prototype, so that the team could test more than one drivetrain.
es_mx: El siguiente paso sería generar ideas para diseños reales. Sería prudente contar con más de un estudiante para diseñar un prototipo de chasis, de manera que el equipo pueda probar más de un chasis.
fr_ca: L'étape suivante consisterait à réfléchir à des modèles concrets. Il serait prudent de confier à plusieurs élèves la conception d'un prototype de transmission, afin que l'équipe puisse tester plusieurs transmissions.
ru_ru: Следующим шагом станет мозговой штурм для генерации конкретных проектных решений. Целесообразно поручить нескольким участникам разработать прототипы колесных баз— например, чтобы команда могла протестировать различные варианты колесных баз.
zh_cn: 下一步将是头脑风暴出一个实际设计。谨慎的做法是让多个学生设计一个动力传动系统原型，这样团队就可以测试多个动力传动系统。

source: From there, a team could begin the prototyping and testing process. This could involve tests of the time taken to cross the crater, time from crater to lander, top speed, maneuverability, etc. Simple tests may be conducted instead of complicated ones. For example, if the robot is projected to weigh 30 pounds, a dumbbell placed on top of the drivetrain simulates the extra weight well to see if the drivetrain can get over the crater easily and reliably, so the robot will not get stuck on the crater edge.
es_mx: Desde ahí, un equipo podría comenzar el proceso de prototipado y pruebas. Esto podría implicar pruebas del tiempo que se tarda en cruzar el cráter, tiempo desde el cráter hasta el aterrizador, velocidad máxima, maniobrabilidad, etc. En lugar de pruebas complicadas, se pueden realizar pruebas simples. Por ejemplo, si se proyecta que el robot pesará 30 libras, colocar una mancuerna encima del chasis que simule bien el peso adicional para ver si el chasis puede pasar fácil y confiablemente por encima del cráter, de modo que el robot no quede atascado en el borde del cráter.
fr_ca: À partir de là, une équipe pourrait entamer le processus de prototypage et de test. Il peut s'agir de tests portant sur le temps nécessaire pour traverser le cratère, le temps écoulé entre le cratère et l'atterrisseur, la vitesse maximale, la manœuvrabilité, etc. Des tests simples peuvent être effectués plutôt que des tests compliqués. Par exemple, si le robot doit peser 30 livres, un haltère placé sur le châssis simule bien le poids supplémentaire pour voir si le châssis peut franchir le cratère facilement et de manière fiable, de sorte que le robot ne reste pas coincé sur le bord du cratère.
ru_ru: После этого команда может начать процесс создания прототипов и тестирования. Это могут быть тесты времени, затрачиваемого на пересечение кратера, времени от Crater'а до Lander'а, максимальной скорости, маневренности и т. д. Вместо сложных тестов можно проводить простые. Например, если предполагается, что робот будет весить 30 фунтов, то гантель, положенная на колесную базу, хорошо имитирует дополнительный вес, чтобы проверить, сможет ли колесная база легко и надежно преодолеть Crater, и не застрянет ли робот на краю Crater'а.
zh_cn: 自此，一个团队可以开始原型设计和测试的过程。这可能包括测试穿过坑所需的时间、从坑到着陆器的时间、最高速度、可操作性等。可以进行简单的测试，而不是复杂的测试。例如，如果机器人预计重30磅，放置在动力传动系统顶部的哑铃可以模拟额外的重量，看看动力传动系统是否可以轻松可靠地越过坑，这样机器人就不会卡在坑边缘。

source: Next, analyze results and iterate. If, for example, there was too little clearance, and the drivetrain got stuck on the crater part of the time, then it would be necessary to raise the drivebase in order to remediate this problem. However, don't change too many things at once - **you want to change ONLY ONE variable at a time**, or else you won't know what may cause a further problem should it arise. Always try to change one variable at a time.
es_mx: A continuación, analiza los resultados e itera. Si, por ejemplo, hubo muy poco espacio libre y el chasis se atascó en el cráter parte del tiempo, entonces sería necesario elevar la base de conducción para remediar este problema. Sin embargo, no cambies demasiadas cosas a la vez: **quieres cambiar SOLO UNA variable a la vez**, o de lo contrario no sabrás qué podría causar un problema adicional en caso de que surja. Siempre intenta cambiar una variable a la vez.
fr_ca: Ensuite, il faut analyser les résultats et procéder par itération. Si, par exemple, l'espace libre est insuffisant et que le châssis reste bloqué sur le cratère une partie du temps, il sera nécessaire de relever la base du châssis afin de remédier à ce problème. Cependant, ne changez pas trop de choses à la fois - **il faut changer UNE SEULE variable à la fois**, sinon vous ne saurez pas ce qui pourrait causer un autre problème s'il survenait. Essayez toujours de modifier une variable à la fois.
ru_ru: Затем проанализируйте результаты и проведите доработку. Например, если клиренс был слишком мал, и колесная база часть времени застревала на Crater'е, то для устранения этой проблемы необходимо увеличить клиренс. Однако не меняйте слишком много вещей сразу - **лучше менять ТОЛЬКО ОДНУ вещь за раз**, иначе вы не будете знать, что может вызвать дальнейшую проблему, если она возникнет. Всегда старайтесь менять одну вещь за раз.
zh_cn: 接下来，分析结果并迭代。例如，如果间隙太小，动力传动系统在部分时间卡在坑上，那么就有必要提高动力基础来修复这个问题。然而，不要一次改变太多的东西——你一次只想改变一个变量，否则，你将不知道什么可能导致进一步的问题出现。总是坚持一次改变一个变量。

source: **It often takes multiple iterations to get things right, so don't be discouraged if your second or even third attempt doesn't perform as well as you think it will**. Many teams have 10+ iterations of intake designs in order to refine and hone down their design to be optimally efficient. While that many tries isn't recommended for new teams, don't be afraid to modify *one factor* at a time to isolate and solve problems.
es_mx: **A menudo se requieren múltiples iteraciones para hacer las cosas bien, así que no te desanimes si tu segundo o incluso tercer intento no funciona tan bien como crees que lo hará**. Muchos equipos tienen más de 10 iteraciones de diseños de intake para refinar y afinar su diseño para que sea óptimamente eficiente. Si bien no se recomienda tantos intentos para los equipos nuevos, no tengas miedo de modificar *un factor* a la vez para aislar y resolver problemas.
fr_ca: **Ne vous découragez pas si votre deuxième ou même votre troisième tentative n'est pas aussi performante que vous le pensez**. De nombreuses équipes effectuent plus de 10 itérations de concept de ramasseur afin d'affiner et de peaufiner leur conception pour qu'elle soit la plus efficace possible. Bien qu'un tel nombre d'essais ne soit pas recommandé pour les nouvelles équipes, n'ayez pas peur de modifier *un facteur* à la fois pour isoler et résoudre les problèmes.
ru_ru: **Часто требуется несколько итераций, чтобы добиться нужного результата, поэтому не отчаивайтесь, если ваша вторая или даже третья версия окажется не столь удачной, как вы думаете**. Многие команды проводят более 10 итераций дизайна активных захватов, чтобы доработать и отточить свою конструкцию до оптимальной эффективности. Хотя такое количество версий не рекомендуется для новых команд, не бойтесь изменять *одну вещь* за раз, чтобы выявить и решить проблемы.
zh_cn: 通常需要多次迭代才能把事情做好，所以如果你的第二次甚至第三次尝试没有你想象的那么好，不要气馁。许多团队有10多次迭代的进气设计，以便改进和磨练他们的设计，使其达到最佳效率。虽然不建议新团队尝试这么多次，但不要害怕一次修改一个因素来隔离和解决问题。

source: Your final implementation could be just an upgraded prototype, or, if you had used subpar/scrap materials for a prototype, you could change them out for durable ones.
es_mx: Tu implementación final podría ser solo un prototipo mejorado, o, si has utilizado materiales de baja calidad para un prototipo, podrías cambiarlos por unos duraderos.
fr_ca: Votre réalisation finale peut être un prototype amélioré ou, si vous avez utilisé des matériaux de mauvaise qualité pour un prototype, vous pouvez les remplacer par des matériaux durables.
ru_ru: Ваша конечная версия может быть просто модернизированным прототипом, или, если вы использовали некачественные/ломаные материалы для прототипа, вы можете заменить их на долговечные.
zh_cn: 您的最终实现可能只是一个升级的原型，或者，如果您在原型中使用了低于标准/废弃的材料，您可以将它们换成耐用的材料。
