Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/appendix/license.po
Languages: es_mx, fr_ca, zh_cn

source: License
es_mx: Licencia
zh_cn: 许可协议

source: Game Manual 0 is licensed under the `Creative Commons Attribution-NonCommercial 2.0 Generic (CC BY-NC 2.0) license <https://github.com/gamemanual0/gm0/blob/main/LICENSE>`_.
es_mx: Game Manual 0 está bajo licencia `Creative Commons Attribution-NonCommercial 2.0 Generic (CC BY-NC 2.0) license <https://github.com/gamemanual0/gm0/blob/main/LICENSE>`_.
fr_ca: Game Manual 0 est placé sous la licence `Creative Commons Attribution-NonCommercial 2.0 Generic (CC BY-NC 2.0) <https://github.com/gamemanual0/gm0/blob/main/LICENSE>`_.
zh_cn: Game Manual 0 采用 “创作共用署名-非商业性 2.0 通用（CC BY-NC 2.0）”许可 <https://github.com/gamemanual0/gm0/blob/main/LICENSE>`_。

source: License Summary
es_mx: Resumen de la licencia
fr_ca: Résumé de la licence
zh_cn: 许可证摘要

source: You are free to:
es_mx: Es usted libre de hacerlo siguiente:
fr_ca: Vous êtes libre de :
zh_cn: 您可以自由地：

source: Share - copy and redistribute the material in any medium or format
es_mx: Compartir: copiar y redistribuir el material en cualquier medio o formato.
fr_ca: Partager - copier et redistribuer le matériel sur n'importe quel support ou dans n'importe quel format
zh_cn: 共享——以任何媒介或形式复制和重新分发资料

source: Adapt - remix, transform, and build upon the material
es_mx: Adaptar: mezclar, transformar y construir a partir del material.
fr_ca: Adapter - remixer, transformer et construire à partir du matériel
zh_cn: 改编——在教材的基础上进行再创造、再改造和再发展

source: The licensor cannot revoke these freedoms as long as you follow the license terms.
es_mx: El licenciante no puede revocar estas libertades mientras usted respete los términos de la licencia.
fr_ca: Le concédant ne peut pas révoquer ces libertés tant que vous respectez les conditions de la licence.
zh_cn: 只要您遵守许可条款，许可人就不能取消这些自由。

source: Under the following terms:
es_mx: En los siguientes términos:
fr_ca: Dans les conditions suivantes :
zh_cn: 根据以下条款：

source: Attribution - You must give `appropriate credit <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-appropriate-credit>`_, provide a link to the license, and `indicate if changes were made <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-indicate-changes>`_. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
es_mx: Atribución - Debe dar el `crédito apropiado <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-appropriate-credit>`_, proporcionar un enlace a la licencia e `indicar si se han realizado cambios <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-indicate-changes>`_. Puede hacerlo de cualquier manera razonable, pero no de forma que sugiera que el licenciante le respalda a usted o a su uso.
fr_ca: Attribution - Vous devez donner le "crédit approprié" <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-appropriate-credit>`_, fournir un lien vers la licence et "indiquer si des modifications ont été apportées" <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-indicate-changes>`_. Vous pouvez le faire de toute manière raisonnable, mais pas d'une manière qui suggérerait que le donneur de licence vous approuve ou approuve votre utilisation.
zh_cn: 署名 - 您必须 `appropriate credit <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-appropriate-credit>`_ , 提供指向许可证的链接，并 `indicate if changes were made <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-indicate-changes>`_ 进行修改。您可以任何合理的方式这样做，但不得以任何方式暗示许可人认可您或您的使用。

source: NonCommercial - You may not use the material for `commercial purposes <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-commercial-purposes>`_.
es_mx: No comercial - No puede utilizar el material para `fines comerciales <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-commercial-purposes>`_.
fr_ca: Non commercial - Vous ne pouvez pas utiliser le matériel à des "fins commerciales" <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-commercial-purposes>`_.
zh_cn: 非商业性 - 您不得将材料用于 `commercial purposes <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-commercial-purposes>`_ 。

source: No additional restrictions - You may not apply legal terms or `technological measures <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-technological-measures>`_ that legally restrict others from doing anything the license permits.
es_mx: Sin restricciones adicionales - No puede aplicar términos legales o `medidas tecnológicas <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-technological-measures>`_ que restrinjan legalmente a otros hacer cualquier cosa que la licencia permita.
fr_ca: Pas de restrictions supplémentaires - Vous ne pouvez pas appliquer de termes juridiques ou de "mesures techniques" <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-technological-measures>`_ qui empêchent légalement d'autres personnes de faire tout ce que la licence autorise.
zh_cn: 无附加限制 - 您不得使用法律条款或 `technological measures <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-technological-measures>`_ ，在法律上限制他人从事许可所允许的任何行为。

source: Notices:
es_mx: Avisos:
fr_ca: Avis :
zh_cn: 通知：

source: You do not have to comply with the license for elements of the material in the public domain or where your use is permitted by an applicable `exception or limitation <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-exception-or-limitation>`_.
es_mx: Usted no tiene que cumplir con la licencia para los elementos del material en el dominio público o cuando su uso está permitido por una `excepción o limitación aplicable <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-exception-or-limitation>`_.
fr_ca: Vous n'êtes pas tenu de respecter la licence pour les éléments du matériel relevant du domaine public ou lorsque votre utilisation est autorisée par une "exception ou limitation" applicable <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-exception-or-limitation>`_.
zh_cn: 对于公共领域中的材料元素，或在适当的 `exception or limitation <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-exception-or-limitation>`_ 允许使用的情况下，您不必遵守许可条款。

source: No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as `publicity, privacy, or moral rights <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-publicity-privacy-or-moral-rights>`_ may limit how you use the material.
es_mx: No se ofrece ninguna garantía. Es posible que la licencia no le conceda todos los permisos necesarios para el uso que pretende hacer del material. Por ejemplo, otros derechos como `publicidad, privacidad o derechos morales <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-publicity-privacy-or-moral-rights>`_ pueden limitar el uso que haga del material.
fr_ca: Aucune garantie n'est donnée. La licence peut ne pas vous donner toutes les autorisations nécessaires à l'utilisation que vous souhaitez en faire. Par exemple, d'autres droits tels que les droits de publicité, de confidentialité ou les droits moraux <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-publicity-privacy-or-moral-rights>`_ peuvent limiter la façon dont vous utilisez le matériel.
zh_cn: 不提供担保。许可证可能不会为您的预期用途提供所有必要的许可。例如，其他权利，如 `publicity, privacy, or moral rights <https://creativecommons.org/licenses/by-nc/2.0/deed.en#ref-publicity-privacy-or-moral-rights>`_ 可能会限制您使用材料的方式。

source: Legal Disclaimers
es_mx: Aviso legal
fr_ca: Mentions légales
zh_cn: 法律免责声明

source: *FIRST*\ |reg|\ *, FIRST*\ |reg| *Robotics Competition, and FIRST*\ |reg| *Tech Challenge, are registered trademarks of FIRST*\ |reg| *\(*\ |firstinspires.org|_\ *) which is not overseeing, involved with, or responsible for this activity, product, or service.*
es_mx: *FIRST*\ |reg|\ *, FIRST*\ |reg| *Robotics Competition, and FIRST*\ |reg| *Tech Challenge, son marcas registradas de FIRST*\ |reg| *\(*\ |firstinspires.org|_\ *) que no supervisa, participa ni se responsabiliza de esta actividad, producto o servicio.*
fr_ca: *FIRST*\\N-, FIRST*\N-, compétition de robotique, et FIRST*\ |reg| *Défi Techno FIRST, sont des marques déposées deFIRST*\ |reg| *\(*\ |firstinspires.org|_\ *) , qui ne supervise pas, n'est pas impliqué ou responsable de cette activité, de ce produit ou de ce service.*
zh_cn: *FIRST*\ |reg|\ *、FIRST*\ |reg| *Robotics Competition 和 FIRST*\ |reg| *Tech Challenge 是 FIRST*\ |reg| *\(*\ |firstinspires.org|_\ *) 的注册商标，FIRST*\ |reg| *\ 并不监督、参与或负责此活动、产品或服务。

source: *FIRST*\ |reg| LEGO\ |reg| League is a jointly held trademark of *FIRST*\ |reg| *\(*\ |firstinspires.org|_\ *) and* the LEGO Group, *neither of which is overseeing, involved with, or responsible for this activity, product, or service.*
es_mx: *FIRST*\ |reg| LEGO\ |reg| League es una marca comercial conjunta de *FIRST*\ |reg| *\(*\ |firstinspires.org|_\ *) y* the LEGO Group, *ninguno de los cuales supervisa, participa o es responsable de esta actividad, producto o servicio.*
fr_ca: *La *FIRST*\N- LEGO\N- League est une marque déposée conjointement par *FIRST*\N- LEGO\N- (*\N- Firstinspires.org|_\N-) et* le groupe LEGO, *qui ne supervise pas, n'est pas impliqué dans, ou n'est pas responsable de cette activité, de ce produit ou de ce service.*
zh_cn: *FIRST*\ |reg| LEGO\ |reg| League 是 *FIRST*\ |reg| *\(*\|firstinspires.org|_\*)和* LEGO Group 联合持有的商标，*两者均不监督、参与或负责此活动、产品或服务。

source: LEGO\ |reg|, *the* LEGO\ |reg| *logo*, MINDSTORMS\ |reg|, *the* MINDSTORMS\ |reg| *NXT logo, the Minifigure, and the Brick and Knob configurations are trademarks of* the LEGO Group *which is not overseeing, involved with, or responsible for this activity, product, or service.*
es_mx: LEGO, el logotipo de LEGO, el logotipo de MINDSTORMS, el logotipo de NXT, la minifigura y las configuraciones de Brick y Knob son marcas comerciales de LEGO Group, que no supervisa, participa ni es responsable de esta actividad, producto o servicio.
fr_ca: LEGO, *le* logo LEGO, *le* logo MINDSTORMS, *le* logo MINDSTORMS, *le* logo NXT, la Minifigure et les configurations Brick and Knob sont des marques déposées du* groupe LEGO *qui ne supervise pas, n'est pas impliqué ou responsable de cette activité, de ce produit ou de ce service*.
zh_cn: LEGO\ |reg|、 *the* LEGO\ |reg| *logo*、MINDSTORMS\ |reg|、*the* MINDSTORMS\ |reg| *NXT 徽标、Minifigure 以及 Brick 和 Knob 配置均为*乐高集团的商标，*乐高集团（* the LEGO Group *）并不监督、参与或负责此活动、产品或服务。
