Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/appendix/vendor-guide.po
Languages: es_mx, fr_ca

source: Vendor Guide
es_mx: Guía del Proveedor
fr_ca: Guide du vendeur

source: Vendor Identification
es_mx: Identificación del Proveedor
fr_ca: Identification du fournisseur

source: When you read some Bill of Materials (BOMs) or part numbers that are references in this guide, it might be confusing to find what vendor the part you need comes from. The obvious thing to do is Google the part number, and generally it can identify what you want and where it comes from. But if that fails, here are some quick tips to identify the vendor selling what you need.
es_mx: Cuando leas algunas Listas de Materiales (BOMs) o números de parte que se mencionan en esta guía, puede resultar confuso encontrar de qué proveedor proviene la pieza que necesitas. Lo obvio es buscar el número de parte en Google, y generalmente puede identificar lo que deseas y de dónde proviene. Pero si eso falla, aquí hay algunos consejos rápidos para identificar al proveedor que vende lo que necesitas.
fr_ca: Lorsque vous lisez certaines nomenclatures ou certains numéros de pièces mentionnés dans ce guide, il peut être difficile de savoir de quel fournisseur provient la pièce dont vous avez besoin. La chose la plus évidente à faire est de rechercher le numéro de la pièce sur Google, ce qui permet généralement d'identifier ce que vous voulez et d'où il provient. En cas d'échec, voici quelques conseils rapides pour identifier le fournisseur qui vend la pièce dont vous avez besoin.

source: Prefix Identification
es_mx: Identificación de Prefijo
fr_ca: Identification du préfixe

source: AM- signifies AndyMark (i.e. AM-0447)
es_mx: AM- significa AndyMark (es decir, AM-0447)
fr_ca: AM- signifie AndyMark (i.e. AM-0447)

source: REV- signifies REV Robotics (i.e. REV-31-1155)
es_mx: REV- significa REV Robotics (es decir, REV-31-1155)
fr_ca: REV- signifie REV Robotics (i.e. REV-31-1155)

source: WCP- signifies West Coast Products (i.e. WCP-0117)
es_mx: WCP- significa West Coast Products (es decir, WCP-0117)
fr_ca: WCP- signifie West Coast Products (i.e. WCP-0117)

source: SKU Identification
es_mx: Identificación de SKU (Unidad de mantenimiento de existencias)
fr_ca: Identification SKU

source: Actuonix: 3-4 digit SKU, alphanumeric, in the form of XX00 or X00 (i.e. PQ12)
es_mx: Actuonix: SKU de 3-4 dígitos, alfanumérico, en forma de XX00 o X00 (es decir, PQ12)
fr_ca: Actuonix : UGS de 3-4 chiffres, alphanumérique, sous la forme XX00 ou X00 (c'est-à-dire PQ12).

source: goBILDA: 12 digit SKU, numerical, in the form of 0000-0000-0000 (i.e. 3213-3606-0001)
es_mx: goBILDA: SKU de 12 dígitos, numérico, en el formato de 0000-0000-0000 (es decir, 3213-3606-0001)
fr_ca: goBILDA : UGS à 12 chiffres, numérique, sous la forme 0000-0000-0000 (c'est-à-dire 3213-3606-0001).

source: Pitsco/Tetrix: 6 digit SKU, W + 5 numbers, in the form of W00000 (i.e. W44260)
es_mx: Pitsco/Tetrix: SKU de 6 dígitos, W + 5 números, en la forma de W00000 (es decir, W44260)
fr_ca: Pitsco/Tetrix : UGS à 6 chiffres, W + 5 chiffres, sous la forme W00000 (c'est-à-dire W44260).

source: Servocity/Actobotics: 6 digit SKU, numerical, in the form of 000000 (i.e. 615190)
es_mx: Servocity/Actobotics: SKU de 6 dígitos, numérico, en la forma de 000000 (es decir, 615190)
fr_ca: Servocity/Actobotics : UGS à 6 chiffres, numérique, sous la forme de 000000 (c'est-à-dire 615190)

source: Where can I get ...?
es_mx: ¿Dónde puedo conseguir ...?
fr_ca: Où puis-je me procurer ... ?

source: Motors and Gearboxes
es_mx: Motores y Cajas de Engranajes
fr_ca: Moteurs et réducteurs

source: Spur Gear Motors
es_mx: Motores de Engranajes Rectos
fr_ca: Moteurs à engrenages droits

source: goBILDA 5201 Spur Gear
es_mx: goBILDA 5201 Engranaje Recto
fr_ca: goBILDA 5201 Engrenage droit

source: Planetary Gearbox Motors (recommended)
es_mx: Planetary Gearbox Motors (recomendado)
fr_ca: Moteurs à réducteur planétaire (recommandé)

source: :term:`goBILDA 5202/5203 Yellow Jacket Planetary <Yellow Jacket Motor>`
es_mx: goBILDA 5202/5203 Yellow Jacket Planetary <Yellow Jacket Motor>

source: (*italicized* = customizable gearbox ratio)
es_mx: (*italicas* = relación de transmisión personalizable)
fr_ca: (*en italique* = rapport de boîte de vitesses personnalisable)

source: HiTec (from ServoCity); 24 tooth spline
es_mx: HiTec (de ServoCity); 24 dientes estriados
fr_ca: HiTec (de ServoCity) ; 24 dents cannelées

source: REV Smart Robot Servo; 25 tooth spline
es_mx: REV Smart Robot Servo; 25 dientes estriados
fr_ca: REV Smart Robot Servo ; 25 dents cannelées

source: Axon Mini & Max; 25 tooth spline
es_mx: Axon Mini & Max; 25 dientes estriados
fr_ca: Axon Mini & Max ; 25 dents cannelées

source: goBILDA Dual Mode Servo; 25 tooth spline
es_mx: goBILDA Dual Mode Servo; 25 dientes estriados
fr_ca: goBILDA Dual Mode Servo ; 25 dents cannelées

source: Futaba (Futaba servos are widely used in RC and hobby aircraft); 25 tooth spline
es_mx: Futaba (Los servos de Futaba son ampliamente utilizados en aviones RC y de hobby); 25 dientes estriados
fr_ca: Futaba (les servos Futaba sont largement utilisés dans les avions RC et de loisir) ; 25 dents cannelées

source: Savox heavy-duty servos; 25 tooth spline
es_mx: Savox servos de servicio pesado; 25 dientes estriados
fr_ca: Servos Savox à usage intensif ; 25 dents cannelées

source: Actuonix (linear actuators)
es_mx: Actuonix (actuadores lineales)
fr_ca: Actuonix (actionneurs linéaires)

source: Sensors
es_mx: Sensores
fr_ca: Capteurs

source: Hardware & Raw Materials
es_mx: Hardware y Materias Primas
fr_ca: Matériel et matières premières

source: Local hardware store
es_mx: Tienda de ferretería local
fr_ca: Magasins locaux

source: Aluminum Components
es_mx: Componentes de aluminio
fr_ca: Composants en aluminium

source: Actobotics :term:`channel <Channel>`, mini :term:`channel <Channel>`, X-rail :term:`extrusion <Extrusion>`
es_mx: Actobotics canal<Channel>, mini canal<Channel>, X-rail extrusión<Extrusion>
fr_ca: Actobotics :term:`profilé <Channel>`, mini :term:`profilé <Channel>`, X-rail :term:`extrusion <Extrusion>`

source: REV extrusion, C :term:`channel <Channel>`, U :term:`channel <Channel>`
es_mx: REV extrusión, C :term:`canal <Channel>`, U :term:`canal <Channel>`
fr_ca: REV extrusion, :term:`profilé en C <Channel>`, :term:`profilé en U <Channel>`

source: goBILDA :term:`channel <Channel>`, goRAIL :term:`extrusion <Extrusion>`
es_mx: goBILDA canal<Channel>, goRAIL extrusión<Extrusion>
fr_ca: goBILDA :term:`profilé <Channel>`, goRAIL :term:`extrusion <Extrusion>`

source: TETRIX :term:`channel <Channel>`
es_mx: TETRIX canal<Channel>
fr_ca: TETRIX :term:`profilé <Channel>`

source: MiSUMI :term:`extrusion <Extrusion>`
es_mx: MiSUMI extrusión<Extrusion>

source: Gears/Sprockets/Pulleys
es_mx: Engranajes/Piñones/Poleas
fr_ca: Engrenages/pignons/poulies

source: REV :term:`gears <Gear>`, :term:`sprockets <Sprocket>`, pulleys
es_mx: REV engranajes<Gear>, piñones<Sprocket>, poleas
fr_ca: REV :term:`engrenages <Gear>`, :term:`pignons <Sprocket>`, :term:`poulies

source: Actobotics :term:`gears <Gear>`, :term:`sprockets <Sprocket>`, pulleys
es_mx: Actobotics engranajes<Gear>, piñones<Sprocket>, poleas
fr_ca: Actobotics :term:`engrenages <Gear>`, :term:`pignons <Sprocket>`, poulies

source: goBILDA :term:`gears <Gear>`, :term:`sprockets <Sprocket>`, pulleys
es_mx: goBILDA engranajes<Gear>, piñones<Sprocket>, poleas
fr_ca: goBILDA :term:`engrenages <Gear>`, :term:`pignons <Sprocket>`, poulies

source: TETRIX :term:`gears <Gear>` and pulleys
es_mx: TETRIX engranajes<Gear> y poleas
fr_ca: TETRIX :term:`engrenages <Gear>` et poulies

source: AndyMark :term:`gears <Gear>` and pulleys
es_mx: AndyMark engranajes<Gear> y poleas
fr_ca: AndyMark :term:`engrenages <Gear>` and poulies

source: Wheels
es_mx: Ruedas
fr_ca: Roues

source: AndyMark traction, :term:`compliant <Compliant Wheel>`, :term:`mecanum wheel <Mecanum Wheel>`
es_mx: AndyMark tracción, :term:`compatible <Compliant Wheel>`, :term:` ruedas mecanum<Mecanum Wheel>`
fr_ca: AndyMark traction, :term:`compliant <Compliant Wheel>`, :term:`roue mecanum<Mecanum Wheel>`

source: REV grip, traction, :term:`omni <Omni Wheel>`, :term:`mecanum wheel <Mecanum Wheel>`
es_mx: REV agarre, tracción, :term:`omni <Omni Wheel>`, :term:`ruedas mecanum <Mecanum Wheel>`
fr_ca: REV grip, traction, :term:`omni <Omni Wheel>`, :term:` roue mecanum <Mecanum Wheel>`

source: ServoCity traction, :term:`omni wheel <Omni Wheel>`
es_mx: ServoCity tracción, :term:`rueda omnidireccional <Omni Wheel>`
fr_ca: ServoCity traction, :term:`roue omni <Omni Wheel>`

source: goBILDA traction, :term:`omni <Omni Wheel>`, :term:`mecanum wheel <Mecanum Wheel>`
es_mx: goBILDA tracción, :term:`omni <Omni Wheel>`, :term:`ruedas mecanum <Mecanum Wheel>`
fr_ca: goBILDA traction, :term:`omni <Omni Wheel>`, :term:`roue mecanum <Mecanum Wheel>`

source: TETRIX traction, :term:`omni <Omni Wheel>`, :term:`mecanum wheel <Mecanum Wheel>`
es_mx: TETRIX tracción, :term:`omni <Omni Wheel>`, :term:`ruedas mecanum <Mecanum Wheel>`
fr_ca: TETRIX traction, :term:`omni <Omni Wheel>`, :term:`roue mecanum <Mecanum Wheel>`

source: Nexus :term:`mecanum wheel <Mecanum Wheel>`
es_mx: Nexus rueda mecanum<Mecanum Wheel>
fr_ca: Nexus :term:`roue mecanum<Mecanum Wheel>`

source: Linear Slide Kits
es_mx: Kits de deslizamiento lineal
fr_ca: Kits de glissières linéaires

source: REV 15 mm :term:`extrusion <Extrusion>` slide kit
es_mx: REV 15 mm kit de deslizamiento de :term:`extrusión <Extrusion>
fr_ca: REV 15 mm :term:`extrusion <Extrusion>` kit de glissières

source: Actobotics linear slide kit
es_mx: Actobotics kit de deslizamiento lineal
fr_ca: Kit de glissière linéaire Actobotics

source: goBILDA linear slide kit
es_mx: goBILDA kit de deslizamiento lineal
fr_ca: Kit de diapositives linéaires goBILDA

source: Drawer Slides
es_mx: Rieles para cajones
fr_ca: Glissières de tiroir

source: MiSUMI SAR2 or SAR3 aluminum slide
es_mx: MiSUMI SAR2 o SAR3 deslizador de aluminio
fr_ca: glissière en aluminium, MiSUMI SAR2 ou SAR3

source: Long Robotics Slides
es_mx: Long Robotics rieles
fr_ca: Glissières Long Robotics

source: Hafele cabinet slide
es_mx: Hafele rieles de gabinete
fr_ca: Glissière d'armoire Hafele

source: Steel-rolled drawer slide
es_mx: Deslizador de cajón enrollado en acero
fr_ca: Glissière de tiroir roulée en acier

source: Servos
fr_ca: Servomoteurs

source: OnlineMetals
fr_ca: Métaux en ligne
