Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/appendix/vendor-list.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Vendor List
es_mx: Lista de proveedores
fr_ca: Liste des fournisseurs
ro_ro: Lista de Vânzători
zh_cn: 供应商列表

source: Actuonix sells linear actuators and linear motion components. Expensive, but robust. Teams can apply for a *FIRST*\ |reg| sponsorship.
es_mx: Actuonix vende actuadores lineales y componentes de movimiento lineal. Costosos, pero robustos. Los equipos pueden solicitar un patrocinio de *FIRST*\ |reg|.
fr_ca: Actuonix vend des actionneurs linéaires et des composants de mouvement linéaire. Ils sont chers, mais robustes. Les équipes peuvent demander un parrainage *FIRST*\ |reg|.
ro_ro: Actuonix vinde sisteme de acționare liniară și componente de mișcare liniară. Scump, însă solid. Echipele pot aplica pentru o sponsorizare *FIRST*\ |reg|.
zh_cn: Actuonix销售电动线性执行器（linear actuators）和直线运动组件（linear motion components）。虽然价格昂贵，但坚固耐用。团队可以申请*FIRST*\ |reg|赞助。

source: AndyMark sells the official game field and game sets, as well as individual game parts and the SoftTiles foam tiles.
es_mx: AndyMark vende el campo de juego oficial y los conjuntos de juego, así como las piezas individuales del juego y las baldosas de espuma SoftTiles.
fr_ca: AndyMark vend le terrain de jeu officiel et les sets de jeu, ainsi que des pièces de jeu individuelles et les tuiles en mousse SoftTiles.
ro_ro: AndyMark vinde terenul de joc oficial și seturile de joc, precum și piesele de joc individuale și plăcile de spumă SoftTiles.
zh_cn: AndyMark销售官方比赛场地和比赛套装，以及单个比赛场地部件和SoftTiles泡沫地垫。

source: AndyMark also sells NeveRest and NeveRest Sport motors, TileRunner, compliant, stealth, and mecanum wheels, as well as many other items.
es_mx: AndyMark también vende motores NeveRest y NeveRest Sport, ruedas TileRunner, compliant/compatible, stealth y mecanum, así como muchos otros artículos.
fr_ca: AndyMark vend également des moteurs NeveRest et NeveRest Sport, des roues TileRunner, compliant, stealth et mecanum, ainsi que de nombreux autres articles.
ro_ro: AndyMark vinde, de asemenea, motoare NeveRest și NeveRest Sport, TileRunner, roți conforme, stealth și mecanum, precum și multe alte articole.
zh_cn: AndyMark还销售NeveRest和NeveRest Sport电机、TileRunner和麦卡纳姆轮，以及许多其他产品。

source: AndyMark sells the Robits build system, which uses non-metric components similar to the Tetrix build system.
es_mx: AndyMark vende el sistema de construcción Robits, que utiliza componentes no métricos similares al sistema de construcción Tetrix.
fr_ca: AndyMark vend le système de construction Robits, qui utilise des composants non métriques similaires au système de construction Tetrix.

source: Vendor for highly customizable servos, with software functionality for range increases to switch between positional mode and continuous rotation mode.
es_mx: Proveedor de servos altamente personalizables, con funcionalidad de software para aumentar el rango y cambiar entre el modo de posición y el modo de rotación continua.
fr_ca: Fournisseur de servos hautement personnalisables, avec une fonctionnalité logicielle permettant d'augmenter la portée et de basculer entre le mode positionnel et le mode rotation continue.
zh_cn: 提供可高度定制的舵机，具有软件功能，可增加范围以在位置模式和连续旋转模式之间切换。

source: Cheap vendor for fasteners/other hardware.
es_mx: Proveedor económico de sujetadores/otros hardwares.
fr_ca: Vendeur bon marché d'attaches et d'autres articles de quincaillerie.
zh_cn: 紧固件/其他硬件的廉价供应商。

source: Vendor for raw plastics, such as polycarbonate, acetal, HDPE, etc.
es_mx: Proveedor de plásticos en bruto, como policarbonato, acetal, HDPE, etc.
fr_ca: Vendeur de matières plastiques brutes, telles que le polycarbonate, l'acétal, le PEHD, etc.
ro_ro: Furnizor de materiale plastice brute, cum ar fi policarbonat, acetal, HDPE etc.
zh_cn: 原料塑料供应商，如聚碳酸酯、缩醛、HDPE等。

source: Vendor for raw plastics, including smoked polycarbonate.
es_mx: Proveedor de plásticos en bruto, incluyendo policarbonato ahumado.
fr_ca: Vendeur de matières plastiques brutes, y compris le polycarbonate fumé.
ro_ro: Furnizor de materiale plastice brute, inclusiv policarbonat afumat.
zh_cn: 原料塑料供应商，包括烟熏聚碳酸酯。

source: Mid-range vendor for fasteners/other hardware, including tools.
es_mx: Proveedor de nivel medio de sujetadores/otros hardware, incluyendo herramientas.
fr_ca: Fournisseur de milieu de gamme pour les fixations/autres matériels, y compris les outils.
zh_cn: 紧固件/其他硬件（包括工具）的中档供应商。

source: goBILDA sells its own build system, complete with Yellow Jacket motors, channel, motion components, and battery. Note that the cheapest batteries are found here, the MATRIX 12V Batteries are $39.99, with the team discount they are $29.99, nearly half the price of the $50 batteries sold elsewhere.
es_mx: goBILDA vende su propio sistema de construcción, completo con motores Yellow Jacket, canales, componentes de movimiento y batería. Tenga en cuenta que las baterías más baratas se encuentran aquí, las baterías MATRIX 12V cuestan $39.99 dólares, con el descuento del equipo cuestan $29.99 dólares, casi la mitad del precio de las baterías de $50 dólares que se venden en otros lugares.
fr_ca: goBILDA vend son propre système de construction, complet avec les moteurs Yellow Jacket, le canal, les composants de mouvement et la batterie. Notez que les batteries les moins chères se trouvent ici, les batteries MATRIX 12V sont à $39.99, avec la réduction de l'équipe elles sont à $29.99, presque la moitié du prix des batteries à $50 vendues ailleurs.
ro_ro: goBILDA își vinde propriul sistem de construcție, cu motoare "Yellow Jacket", profile din aluminiu, componente de mișcare și baterii. Rețineți că cele mai ieftine baterii se găsesc aici, bateriile "MATRIX 12V" costă 39,99 dolari / 190 RON, cu reducerea echipei sunt 29,99 dolari / 140 RON, aproape jumătate din prețul bateriilor de 50 de dolari / 235 RON vândute în altă parte.
zh_cn: goBILDA销售自己的搭建系统，包括小蜜蜂电机、套件C形梁、运动组件和电池。请注意，最便宜的电池可以在这里找到，MATRIX 12V电池是39.99美元，团队折扣是29.99美元，几乎是其他地方销售的50美元电池价格的一半。

source: Teams can get a 25% Team Discount from goBILDA.
es_mx: Los equipos pueden obtener un descuento del 25% Para Equipos de parte de goBILDA.
fr_ca: Les équipes peuvent bénéficier d'une réduction de 25 % auprès de goBILDA.
ro_ro: Echipele FTC pot beneficia de o reducere de 25% pentru echipe de la goBILDA.
zh_cn: 团队可以从goBILDA获得25%的团队折扣。

source: McMaster-Carr sells hardware and raw materials in bulk quantities. They stock nearly every type of bolt, screw, and nut possible, as well as washers, bearings, springs, etc. Purchase from them for bulk quantities of hardware, as well as the times you need a very obscure part.
es_mx: McMaster-Carr vende hardware y materiales en bruto en cantidades al mayoreo. Tienen en stock casi todos los tipos de pernos, tornillos y tuercas posibles, así como arandelas, rodamientos, resortes, etc. Compra de ellos para cantidades al mayoreo de hardware, así como para las veces que necesites una pieza muy oscura.
fr_ca: McMaster-Carr vend de la quincaillerie et des matières premières en grandes quantités. On y trouve pratiquement tous les types de boulons, vis et écrous possibles, ainsi que des rondelles, des roulements, des ressorts, etc. Achetez chez eux des quantités importantes de quincaillerie, ainsi que des pièces très obscures.
ro_ro: Dedeman vinde produse hardware și materii prime în cantități mari. Aceștia au în stoc aproape toate tipurile de holșuruburi, șuruburi și piulițe, precum și șaibe, rulmenți, arcuri de tensiune etc. Cumpărați de la ei pentru cantități mari de piese hardware, precum și pentru momentele în care aveți nevoie de o piesă neobișnuită.
zh_cn: McMaster-Carr大量销售硬件和原材料。他们几乎储存了所有型号的螺丝、螺丝和螺母，以及垫圈、轴承、弹簧等。如果你需要大宗的五金配件，或者你需要一些非常冷门的零件，都可以从他们这里购买。

source: Don't be turned off by the hidden shipping. Generally, McMaster-Carr's shipping is around the same price as other vendors, and shipping is usually next-day.
es_mx: No te desanimes por el envío oculto. En general, el envío de McMaster-Carr tiene un precio similar al de otros proveedores y generalmente se realiza al día siguiente.
fr_ca: Ne vous laissez pas décourager par les frais de port cachés. En général, les frais de port de McMaster-Carr sont à peu près les mêmes que ceux des autres vendeurs, et l'expédition se fait généralement le lendemain.
ro_ro: În general, costurile de transport ale Dedeman sunt aproximativ la același preț ca și la alți furnizori din România, iar transportul se face de obicei a doua zi.
zh_cn: 不要被隐藏的运费吓到。一般来说，McMaster-Carr的运费与其他供应商的价格大致相同，而且通常是第二天发货。

source: MiSUMI is a Japanese company specializing in industrial and manufacturing components. They sell bulk 15mm anodized :term:`extrusion <Extrusion>` similar to the REV Robotics :term:`extrusion <Extrusion>`. The 15mm :term:`extrusion <Extrusion>` can be cut to length as well.
es_mx: MiSUMI es una empresa japonesa especializada en componentes industriales y de fabricación. Venden extrusión <Extrusion>anodizada a granel de 15 mm extrusión <Extrusion> similar a la de REV Robotics . La extrusión <Extrusion>de 15 mm también se puede cortar a medida.
fr_ca: MiSUMI est une société japonaise spécialisée dans les composants industriels et de fabrication. Elle vend des :term:`extrusion <Extrusion>` anodisés de 15 mm en vrac, similaires aux :term:`extrusion <Extrusion>` de REV Robotics. Le :term:`extrusion <Extrusion>` de 15 mm peut également être coupé à la longueur voulue.
ro_ro: MiSUMI este o companie japoneză specializată în fabricarea industrială a componentelor. Aceștia vând în cantități mari profile anodizate de 15mm similare cu profilele REV Robotics. Profilele de 15mm pot fi tăiate de asemenea.
zh_cn: MiSUMI是一家专门从事工业和制造部件的日本公司。他们销售类似于REV Robotics :term:`铝型材 <Extrusion>` 的散装15毫米阳极氧化 :term:`铝型材 <Extrusion>` 。这种15mm :term:`铝型材 <Extrusion>` 也可以根据需要剪裁成所需的长度。

source: MiSUMI also sells aluminum drawer slides that are popular for linear extensions. They are available in different lengths, but the most common is 400mm.
es_mx: MiSUMI también vende rieles de cajón de aluminio que son populares para extensiones lineales. Están disponibles en diferentes longitudes, pero la más común es de 400mm.
fr_ca: MiSUMI vend également des glissières de tiroir en aluminium qui sont populaires pour les extensions linéaires. Elles sont disponibles en différentes longueurs, mais la plus courante est de 400 mm.
ro_ro: MiSUMI vinde, de asemenea, glisiere de aluminiu pentru sertare, care sunt populare pentru extensii liniare. Acestea sunt disponibile în diferite lungimi, dar cea mai comună este de 400 mm (40 cm).
zh_cn: MiSUMI还销售流行于线性延伸的铝制抽屉滑轨。它们有不同的长度可供选择，但最常见的是400mm。

source: A common vendor for purchasing various raw metals.
es_mx: Un proveedor común para comprar varios metales en bruto.
fr_ca: Un fournisseur commun pour l'achat de divers métaux bruts.
ro_ro: Un vânzător comun pentru achizitionarea metalelor pentru fabricare.
zh_cn: 购买各种金属原料的普通供应商。

source: Pitsco sells the Tetrix kit with channels, TorqueNado motors, and their own motion system.
es_mx: Pitsco vende el kit Tetrix con canales, motores TorqueNado y su propio sistema de movimiento.
fr_ca: Pitsco vend le kit Tetrix avec des canaux, des moteurs TorqueNado et son propre système de mouvement.
ro_ro: Pitsco vinde kit-urile Tetrix cu canale, motoare TorqueNado, și propriul sistem de mișcare.
zh_cn: Pitsco销售带有槽道的Tetrix套件、TorqueNado电机和自己的运动系统的Tetrix套件。

source: REV Robotics sells the REV build system, which is an :term:`extrusion <Extrusion>`-based ecosystem complete with motors (HD Hex, HD Planetary, Core HEX), :term:`extrusion <Extrusion>`, :term:`servos <Servo>` (Smart Robot Servo), brackets, and battery.
es_mx: REV Robotics vende el sistema de construcción REV, que es un sistema basado en :term:`extrusión <Extrusion>`- con motores (HD Hex, HD Planetary, Core HEX), :term:`extrusion <Extrusion>`, :term:`servos <Servo>` (Smart Robot Servo), soportes y batería.
fr_ca: REV Robotics vend le système de construction REV, qui est un écosystème basé sur :term:`extrusion <Extrusion>` complet avec des moteurs (HD Hex, HD Planetary, Core HEX), :term:`extrusion <Extrusion>`, :term:`servos <Servo>` (Smart Robot Servo), des supports et une batterie.
ro_ro: REV Robotics vinde sistemul de construcție REV, care este un sistem bazat pe :term:`profile<Extrusion>` și motoare (HD Hex, HD Planetary, Core HEX), :term:`profile<Extrusion>`, :term:`servomotoare` (Smart Robot Servo / SRS), suporturi și baterii.
zh_cn: REV Robotics 销售 REV 构建系统，这是一个基于 :term:`铝型材 <Extrusion>` 的搭建体系系统，配有电机（HD Hex、HD Planetary、Core HEX）、 :term:`extrusion <Extrusion>`、 :term:`servos <Servo>`(Smart Robot Servo)、支架和电池。

source: REV also sells the control system for FTC\ |reg| (Expansion Hub and Control Hub).
es_mx: REV también vende el sistema de control para FTC\ |reg| (Expansion Hub y Control Hub).
fr_ca: REV vend également le système de contrôle pour FTC (Expansion Hub et Control Hub).
zh_cn: REV 还销售FTC\ |reg| 的控制系统（Expansion Hub和Control Hub）。

source: REV offers various sensors (Magnetic Limit Switch, Color Sensor, Touch Sensor, Distance Sensor, Potentiometer, etc.)
es_mx: REV ofrece varios sensores (Interruptor de Límite Magnético, Sensor de Color, Sensor Táctil, Sensor de Distancia, Potenciómetro, etc.)
fr_ca: REV propose différents capteurs (interrupteur de fin de course magnétique, capteur de couleur, capteur tactile, capteur de distance, potentiomètre, etc.)
ro_ro: REV vinde diverși senzori (Senzori de Limită Magnetici, Senzori de Culoare, Senzor de Atingere, Senzor de Distanță, Potențiometru, etc.)
zh_cn: REV提供各种传感器（磁限位开关、颜色传感器、触摸传感器、距离传感器、电位器等）

source: Additionally, electronic components such as the Servo Power Module, SPARKmini, or Blinkin may be purchased.
es_mx: Además, se pueden adquirir componentes electrónicos como el Módulo de Potencia del Servo/Servo Power Module, SPARKmini o Blinkin.
fr_ca: En outre, des composants électroniques tels que le Servo Power Module, SPARKmini ou Blinkin peuvent être achetés.
ro_ro: În plus, componente electronice precum Servo Power Module, SPARKmini, sau Blinkin pot fi achiționate.
zh_cn: 此外，还可以购买Servo Power Module、SPARKmini或Blinkin等电子元件。

source: Servocity sells a wide range of :term:`servos <Servo>`, from Hitec to Futaba, at all price points.
es_mx: Servocity vende una amplia gama de :term:`servos <Servo>`, desde Hitec hasta Futaba, en todos los rangos de precios.
fr_ca: Servocity vend une large gamme de :term:`servos <Servo>`, de Hitec à Futaba, à tous les prix.
ro_ro: Servocity vinde o gamă largă de :term:`servomotoare`, de la Hitec la Futaba, la prețuri accesibile.
zh_cn: Servocity销售范围广泛的 :term:`servos <Servo>`，从Hitec到Futaba，各种价位的都有。

source: Teams can get a 25% team discount from Servocity
es_mx: Los equipos pueden obtener un descuento del 25% para equipos de parte de Servocity.
fr_ca: Les équipes peuvent bénéficier d'une réduction de 25 % auprès de Servocity.
ro_ro: Echipele FTC pot primi o reducere de 25% de la Servocity
zh_cn: 团队可以从Servocity获得25%的团队折扣

source: Studica sells the Studica build system, which has hole patterns compatible with most systems.
es_mx: Studica vende el sistema de construcción Studica, que tiene patrones de agujeros compatibles con la mayoría de los sistemas.
fr_ca: Studica vend le système de construction Studica, dont les schémas de perçage sont compatibles avec la plupart des systèmes.

source: Additionally Studica owns and sells the navX product, a higher-end IMU than what is provided in the Control Hub.
es_mx: Además, Studica posee y vende el producto navX, un IMU de gama superior a la que se suministra en el Control Hub.
fr_ca: En outre, Studica possède et vend le produit navX, un IMU plus haut de gamme que celui fourni par le Control Hub.

source: Also known as WCP, West Coast Products sells products exclusively aimed toward FRC\ |reg| use. However many of their parts can be used in FTC, especially in custom robots.
es_mx: También conocido como WCP, West Coast Products vende productos exclusivamente dirigidos al uso de FRC\ |reg|. Sin embargo, muchas de sus piezas se pueden utilizar en FTC, especialmente en robots personalizados.
fr_ca: Également connu sous le nom de WCP, West Coast Products vend des produits exclusivement destinés à être utilisés dans le cadre du programme FRC. Cependant, beaucoup de leurs pièces peuvent être utilisées en FTC, en particulier dans les robots personnalisés.
zh_cn: West Coast Products 也被称为WCP，专门销售用于FRC的产品。不过，他们的许多部件都可用于FTC，尤其是用于定制机器人中。

source: `McMaster-Carr <https://www.mcmaster.com>`_
ro_ro: `Dedeman <https://www.dedeman.ro/>`_

source: REV also sells the control system for FTC (Expansion Hub and Control Hub).
ro_ro: REV de asemenea vinde și sistemul de control pentru FTC (Control Hub și Expansion Hub).

source: Servocity sells the channel-based Actobotics build system with robust motion and structure. They also offer the Servoblock, a highly recommended part.
ro_ro: Servocity vinde sistemul de construcție Actobotics bazat pe canale cu mișcare și structură solidă. Aceștia vând și Servoblock, o componentă destul de folositoare.

source: Servocity sells X-rail :term:`extrusion <Extrusion>`, lead screw actuator kits, and linear extension kits.
ro_ro: Servocity vinde :term:`profile<Extrusion>` X-rail, sisteme de acționare cu șurub, și kit-uri de extensie liniară.

source: VEXPro sells parts angled toward FRC\ |reg| use, but many of their parts, such as :term:`Thunderhex`, can be made compatible with FTC robots.
ro_ro: VEXPro vinde piese pentru FRC\ |reg|, însă multe din componetele lor, precum :term:`Thunderhex`, pot fi compatibile cu roboții FTC.

source: VEX sells the 393 Motor, as well as the Motor Controller 29 in order for it to adapt to the Expansion Hub.
ro_ro: VEX vinde motorul 393 și controllerul de motoare "Motor Controller 29" pentru a-l adapta la Expansion Hub.

source: VEX offers the VersaPlanetary motor which allows teams to customize a specific gear ratio for their needs.
ro_ro: VEX vinde motorul VersaPlanetary care le permite echipelor să personalizeze un raport specific pentru nevoile lor.

source: Also known as WCP, West Coast Products sells products exclusively aimed toward FRC use. However, much like VEXPro, many of their parts can be used in FTC, especially in custom robots. In fact, VEXPro and West Coast Products sell many of the same parts.
ro_ro: De asemenea cunoscut ca WCP, West Coast Products vinde produse exclusiv pentru FRC, însă, precum VEXPro, multe din componentele lor pot fi folosite în FTC, în special în roboții personalizați. De asemenea, VEXPro și WCP vând multe componente identice.
