Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/bulk-reads.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Bulk Reads
es_mx: Lecturas masivas
zh_cn: 批量读取

source: Bulk reads are a LynxCommand that reads all sensor values (except I2C) on a hub at once. This takes the same amount of time to execute as any other LynxCommand, and can therefore save a lot of time in the execution loop; with a bulk read, reading ten sensors takes as much time as reading one sensor (if they are not I2C and are on the same hub).
es_mx: Las lecturas masivas son un LynxCommand que lee todos los valores de los sensores (excepto I2C) en un hub a la vez. Esto toma la misma cantidad de tiempo para ejecutarse como cualquier otro LynxCommand, y por lo tanto puede ahorrar mucho tiempo en el bucle de ejecución; con una lectura masiva, la lectura de diez sensores toma tanto tiempo como la lectura de un sensor (si no son I2C y están en el mismo hub).
fr_ca: Les "Bulk reads" sont une LynxCommand qui lit toutes les valeurs des capteurs (sauf I2C) sur un hub en une seule fois. Cela prend le même temps d'exécution que n'importe quelle autre LynxCommand, et peut donc sauver beaucoup de temps dans la boucle d'exécution ; avec une lecture en bloc, la lecture de dix capteurs prend autant de temps que la lecture d'un seul capteur (s'ils ne sont pas I2C et se trouvent sur le même hub).
ro_ro: Bulk reads sunt o comandă Lynx care citește toate valorile senzorilor (cu excepția I2C) de pe un hub dintr-o dată. Aceasta necesită același timp de execuție ca orice altă comandă Lynx și, prin urmare, poate economisi mult timp în ciclul de execuție; cu un bulk read, citirea a zece senzori durează la fel de mult ca și citirea unui singur senzor (dacă nu sunt de tipul I2C și se află pe același hub).
zh_cn: 批量读取是一次性读取集线器上所有传感器值（I2C 除外）的 LynxCommand。这与其他 LynxCommand 的执行时间相同，因此可以在执行循环中节省大量时间；批量读取时，读取十个传感器的时间与读取一个传感器的时间相同（如果它们不是 I2C 且在同一个集线器上）。

source: This became much simpler to do with SDK versions 5.4 and above, with a built-in way to easily access it. Here is `the official example <https://github.com/first-tech-challenge/FtcRobotController/blob/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples/ConceptMotorBulkRead.java>`_ on how to use bulk reads.
es_mx: Esto se hizo mucho más sencillo de hacer con las versiones 5.4 y superiores del SDK, con una forma incorporada para acceder fácilmente a ella. Aquí está `el ejemplo oficial <https://github.com/first-tech-challenge/FtcRobotController/blob/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples/ConceptMotorBulkRead.java>`_ sobre cómo utilizar las lecturas masivas.
fr_ca: Cela est devenu beaucoup plus simple à faire avec les versions 5.4 et supérieures du SDK, avec un moyen intégré d'y accéder facilement. Voici l'exemple officiel <https://github.com/first-tech-challenge/FtcRobotController/blob/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples/ConceptMotorBulkRead.java>`_ sur la façon d'utiliser les Bulk reads.
ro_ro: Acest lucru a devenit mult mai simplu de realizat cu versiunile SDK 5.4 și superioare, cu o modalitate integrată de accesare ușoară a acesteia. Iată `exemplul oficial <https://github.com/first-tech-challenge/FtcRobotController/blob/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples/ConceptMotorBulkRead.java>`_ despre cum se utilizează citirile bulk.
zh_cn: 在 5.4 及以上版本的 SDK 中，这一操作变得简单多了，内置的方法可以轻松访问它。下面是如何使用批量读取的 `官方示例 <https://github.com/first-tech-challenge/FtcRobotController/blob/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples/ConceptMotorBulkRead.java>`_ 。

source: Off Mode
es_mx: Modo apagado
ro_ro: Modul Off
zh_cn: 关闭模式（Off Mode）

source: This is the default, and the most boring; it means bulk reads are not used by the SDK when calling normal hardware-access methods.
es_mx: Esta es la opción por defecto, y la más aburrida; significa que las lecturas masivas no son utilizadas por el SDK al llamar a los métodos normales de acceso al hardware.
fr_ca: C'est la valeur par défaut, et la plus ennuyeuse ; elle signifie que les Bulk reads ne sont pas utilisées par le SDK lors de l'appel des méthodes normales d'accès au matériel.
ro_ro: Aceasta este opțiunea implicită, cea mai plictisitoare; înseamnă că citirile bulk nu sunt utilizate de SDK atunci când se apelează metodele normale de acces la hardware.
zh_cn: 这是默认设置，也是最无聊的设置；它意味着 SDK 在调用正常硬件访问方法时不会使用批量读取。

source: Bulk reads can still be accessed by calling the ``LynxModule.getBulkInputData()`` method, however if one wishes to use bulk reads (which we highly recommend) using ``AUTO`` or ``MANUAL`` modes is simpler.
es_mx: Todavía se puede acceder a las lecturas masivas llamando al método ``LynxModule.getBulkInputData()``, sin embargo si se desea utilizar lecturas masivas (lo cual recomendamos encarecidamente) es más sencillo utilizar los modos ``AUTO`` o ``MANUAL``.
fr_ca: Les Bulk reads sont toujours accessibles en appelant la méthode ``LynxModule.getBulkInputData()``, cependant si l'on souhaite utiliser les Bulk reads (ce que nous recommandons fortement) il est plus simple d'utiliser les modes ``AUTO`` ou ``MANUAL``.
ro_ro: Citirile bulk pot fi în continuare accesate prin apelarea metodei ``LynxModule.getBulkInputData()``, însă dacă se dorește utilizarea citirilor bulk (lucru pe care îl recomandăm cu tărie), este mai simplu să utilizeze modurile ``AUTO`` sau ``MANUAL``.
zh_cn: 批量读取仍可通过调用 ``LynxModule.getBulkInputData()`` 方法进行，但如果希望使用批量读取（我们强烈推荐），使用 ``AUTO`` 或 ``MANUAL`` 模式更为简单。

source: To manually set ``OFF`` mode, you need to run ::
es_mx: Para configurar manualmente el modo ``OFF``, debe ejecutar ::
fr_ca: Pour activer manuellement le mode ``OFF``, vous devez lancer : :
ro_ro: Pentru a seta manual modul ``OFF``, trebuie să rulați ::
zh_cn: 要手动设置 ``OFF·` 模式，需要运行:：

source: Auto Mode
es_mx: Modo automático
fr_ca: Mode Auto
ro_ro: Modul Auto
zh_cn: 自动模式（Auto Mode）

source: This is the simplest mode to use that utilizes bulk reads; a new bulk read is done when a hardware read is repeated. As an example of this ::
es_mx: Este es el modo más sencillo de utilizar que utiliza lecturas masivas; se realiza una nueva lectura masiva cuando se repite una lectura de hardware. Como ejemplo de esto ::
fr_ca: C'est le mode le plus simple à utiliser pour les Bulk reads ; une nouvelle Bulk reads est effectuée lorsqu'une lecture matérielle est répétée. En voici un exemple : :
ro_ro: Acesta este cel mai simplu mod de utilizare care utilizează bulk reads; o nouă citire bulk este efectuată atunci când se repetă o citire hardware. Un exemplu în acest sens este ::
zh_cn: 这是最简单的批量读取模式；当硬件读取重复时，会进行新的批量读取。例如::

source: However, this can be problematic, if the same hardware read is called more than once in a given loop; an example of this ::
es_mx: Sin embargo, esto puede ser problemático, si la misma lectura de hardware se llama más de una vez en un bucle dado; un ejemplo de esto ::
fr_ca: Cependant, cela peut être problématique si la même lecture matérielle est appelée plus d'une fois dans une boucle donnée ; un exemple de ceci : :
ro_ro: Totuși, pot fi întâmpinate probleme dacă aceeași citire hardware este apelată de mai multe ori într-un anumit ciclu; un exemplu în acest sens :
zh_cn: 但是，如果在一个给定的循环中多次调用同一个硬件读取，就会出现问题，例如 ::

source: Overall, this is recommended, as it is very unlikely to mess anything up and can give significant performance improvements for little effort. On the user side, one does not need to manually flush the bulk read cache; however, this means you lose some control.
es_mx: En general, esto es recomendable, ya que es muy poco probable que estropee nada y puede dar mejoras significativas de rendimiento por poco esfuerzo. Por parte del usuario, no es necesario vaciar manualmente la caché de lectura masiva; sin embargo, esto significa que se pierde algo de control.
fr_ca: En général, cette méthode est recommandée, car il est très peu probable qu'elle provoque des problèmes et qu'elle permette d'améliorer considérablement les performances pour un effort minime. Du côté de l'utilisateur, il n'est pas nécessaire de vider manuellement le cache de Bulk reads ; cependant, cela signifie que vous perdez un certain contrôle.
ro_ro: Luând tot în considerare, acest lucru este recomandat, deoarece este foarte puțin probabil să dea greș și poate aduce îmbunătățiri semnificative ale performanței cu un efort minim. În ceea ce privește utilizatorul, nu este necesar să se golească manual memoria cache de citire bulk; cu toate acestea, acest lucru înseamnă că pierdeți o parte din control.
zh_cn: 总的来说，这是推荐的，因为它不太可能搞砸任何事情，并且可以不费吹灰之力就显著提高性能。在用户方面，不需要手动刷新批量读取缓存；但是，这意味着你失去了一些控制权。

source: Manual Mode
es_mx: Modo manual
fr_ca: Mode manuel
ro_ro: Modul Manual
zh_cn: 手动模式（Manual Mode）

source: In manual mode the cache for bulk reads is only reset once manually reset. This can be useful, as it is the way to absolutely minimize extraneous reads, however if the cache is not reset, stale values will be returned. That being said, here's a proper implementation of ``MANUAL`` mode ::
es_mx: En el modo manual, la caché para las lecturas masivas sólo se restablece una vez restablecida manualmente. Esto puede ser útil, ya que es la forma de minimizar absolutamente las lecturas extrañas, sin embargo, si la caché no se restablece, se devolverán valores obsoletos. Dicho esto, aquí hay una implementación adecuada del modo ``MANUAL`` ::
fr_ca: En mode manuel, le cache des Bulk reads n’est réinitialisé que lorsqu’on le fait manuellement. Cela peut être utile, car c’est la méthode la plus efficace pour minimiser les lectures superflues. Toutefois, si le cache n’est pas réinitialisé, des valeurs obsolètes seront renvoyées. Ceci étant dit, voici une implémentation correcte du mode ``MANUEL`` : :
ro_ro: În modul manual, memoria cache pentru citirile bulk este resetată numai după o resetare manuală. Acest lucru poate fi util, deoarece este modalitatea de a minimiza în mod absolut citirile străine, însă dacă memoria cache nu este resetată, vor fi returnate valori vechi. Acestea fiind spuse, iată o implementare corectă a modului ``MANUAL`` ::
zh_cn: 在手动模式下，批量读取的缓存只有在手动重置后才会重置。这可能很有用，因为它是绝对减少无关读取的方法，但如果不重置缓存，就会返回陈旧的值。下面是 ``手动`` 模式的正确实现 ::

source: When in ``MANUAL`` mode, if the cache is not cleared appropriately, stale values will be returned. For that reason, if you are not quite sure what you are doing, we recommend ``AUTO`` mode; while ``MANUAL`` mode can have some performance improvements if ``AUTO`` mode is not used optimally, it has less room for catastrophic error.
es_mx: En modo ``MANUAL``, si la caché no se limpia adecuadamente, se devolverán valores obsoletos. Por esa razón, si no está muy seguro de lo que está haciendo, le recomendamos el modo ``AUTO``; aunque el modo ``MANUAL`` puede tener algunas mejoras de rendimiento si el modo ``AUTO`` no se utiliza de forma óptima, tiene menos margen para errores catastróficos.
fr_ca: En mode ``MANUEL'', si le cache n'est pas vidé de façon appropriée, des Valeurs obsolètes seront retournées. Pour cette raison, si vous n'êtes pas tout à fait sûr de ce que vous faites, nous recommandons le mode ``AUTO`` ; bien que le mode ``MANUEL`` puisse améliorer les performances si le mode ``AUTO`` n'est pas utilisé de manière optimale, il y a moins de place pour des erreurs catastrophiques.
ro_ro: În modul ``MANUAL``, în cazul în care memoria cache nu este golită corespunzător, vor fi returnate valori vechi. Din acest motiv, dacă nu sunteți foarte sigur de ceea ce faceți, vă recomandăm modul ``AUTO``; deși modul ``MANUAL`` poate avea unele îmbunătățiri de performanță, dacă modul ``AUTO`` nu este utilizat în mod optim, acesta are mai puține șanse să realizeze erori catastrofale.
zh_cn: 在 ``MANUAL`` 模式下，如果没有适当地清除缓存，就会返回过时的值。因此，如果你不太确定自己在做什么，我们建议你使用 ``AUTO`` 模式；如果没有最佳地使用 ``AUTO`` 模式，虽然 ``MANUAL`` 模式可以在一定程度上提高性能，但它发生灾难性错误的可能性较小。

source: Bulk reads are issued per hub, so you don't necessarily need to bulk read both hubs at the same time or every loop.
es_mx: Las lecturas masivas se emiten por hub, por lo que no es necesario realizar una lectura masiva de ambos hubs al mismo tiempo o en cada bucle.
fr_ca: Les Bulk reads sont effectuées par hub, vous n'avez donc pas nécessairement besoin de lire en bloc les deux hub en même temps ou à chaque boucle.
ro_ro: Citirile bulk sunt emise pentru fiecare hub, astfel încât nu trebuie neapărat să citiți bulk ambele hub-uri în același timp sau la fiecare ciclu.
zh_cn: 批量读取是针对每个集线器发出的，因此不一定需要同时或每次循环批量读取两个集线器。
