Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/encoders.po
Languages: es_mx, fr_ca, zh_cn

source: Encoders
es_mx: Codificadores
fr_ca: Encodeurs
zh_cn: 编码器

source: What Are Encoders?
es_mx: ¿Qué son los codificadores?
fr_ca: Qu'est-ce qu'un encodeur?
zh_cn: 什么是编码器（Encoder）？

source: Very commonly in FTC\ |reg|, you want to know where something is. Whether that is how many times your drivetrain wheel has rotated, what angle your arm is at, or how far your string slides have gone, rotational encoders can help you. In FTC, an encoder refers to any sensor that tracks the rotational angle of a mechanism.
es_mx: Muy a menudo, en FTC |reg|, quieres saber dónde está algo. Ya sea cuántas veces ha girado la rueda motriz, en qué ángulo se encuentra el brazo o hasta dónde han llegado las correderas de las cuerdas, los codificadores rotacionales pueden ayudarte. En FTC, un codificador es un sensor que registra el ángulo de rotación de un mecanismo.
fr_ca: Très souvent, en FTCC\ |reg|, vous voulez savoir où se trouve quelque chose. Qu'il s'agisse du nombre de rotations de votre roue motrice, de l'angle de votre bras ou de la distance parcourue par vos cordes, les encodeurs rotatifs peuvent vous aider. En FTC, un encodeur désigne tout capteur qui suit l'angle de rotation d'un mécanisme.
zh_cn: 在FTC\ |reg|中很常见的是，你想知道某物在哪个方位。无论是传动轮旋转了多少次，机械臂处于什么角度，还是滑轨走了多远，旋转编码器都可以帮助你。在FTC中，编码器是指跟踪机械旋转角度的任何传感器。

source: There are two types of encoders commonly used in FTC, relative and absolute encoders. Relative encoders are the ones covered here as they are the more common type.
es_mx: Existen dos tipos de encóderes utilizados habitualmente en FTC, los relativos y los absolutos. Los encóderes relativos son los que se tratan aquí, ya que son los más comunes.
fr_ca: Deux types d'encodeurs sont couramment utilisés en FTC : les encodeurs relatifs et les encodeurs absolus. Les encodeurs relatifs sont ceux dont il est question ici, car ils sont les plus courants.
zh_cn: FTC中常用的编码器有两种，相对编码器和绝对编码器。相对编码器是这里介绍的，因为它们是更常见的类型。

source: Relative Encoders
es_mx: Codificadores relativos
fr_ca: Enodeurs relatifs
zh_cn: 相对编码器

source: Ranging from the built in encoder in every FTC legal motor to common external encoders like the REV Through Bore encoder, these encoders track the relative position of the shaft or mechanism they are attached to. **What this means is that the position output is relative to the initial position at robot power on, meaning position information is lost between power cycles**.
es_mx: Estos codificadores, que van desde el codificador integrado en todos los motores homologados por FTC hasta codificadores externos comunes como el codificador REV Through Bore, registran la posición relativa del eje o mecanismo al que están conectados. **Lo que esto significa es que la posición de salida es relativa a la posición inicial en el encendido del robot, lo que significa que la información de posición se pierde entre los ciclos de alimentación**.
fr_ca: Qu'il s'agisse d'un encodeur intégré dans chaque moteur autorisé en FTC ou des encodeurs externes courants tels que l'encodeur REV Through Bore, ces encodeurs suivent la position relative de l'arbre ou du mécanisme auquel ils sont attachés. **Cela signifie que la sortie de position est relative à la position initiale lors de la mise sous tension du robot, ce qui signifie que l'information sur la position est perdue entre les cycles d'alimentation**.
zh_cn: 从每个FTC电机中的内置编码器到常见的外部编码器，如REV通孔编码器，这些编码器记录它们所连接的轴或机构的相对位置。**这意味着编码器的位置输出是相对于机器人通电时的初始位置来计算的，这也意味着编码器的位置信息会在不通电时丢失。**

source: Relative encoders don't reset to zero at the beginning of OpModes! You can use STOP_AND_RESET_ENCODERS to ensure that your encoders are always at zero at the beginning of an OpMode (see below).
es_mx: Los encoders relativos no se ponen a cero al principio de los OpModes. Puedes utilizar STOP_AND_RESET_ENCODERS para asegurarte de que tus encoders están siempre a cero al principio de un OpMode (ver más abajo).
fr_ca: Les encodeurs relatifs ne se remettent pas à zéro au début des OpModes ! Vous pouvez utiliser STOP_AND_RESET_ENCODERS pour vous assurer que vos encodeurs sont toujours à zéro au début d'un OpMode (voir ci-dessous).
zh_cn: 相对编码器不会在OpMode开始时重置为零！你可以使用STOP_AND_RESET_ENCODERS来确保编码器在OpMode开始时始终为零（见下文）。

source: All relative encoders in FTC use the "quadrature" protocol to send position information to the expansion hub. As a result, relative encoders must be plugged into the encoder ports located near the motor ports in order to function.
es_mx: Todos los encoders relativos del FTC utilizan el protocolo "cuadratura" para enviar información de posición al expansion hub. Como resultado, los encoders relativos deben conectarse a los puertos de encoder situados cerca de los puertos de motor para poder funcionar.
fr_ca: Tous les encodeurs relatifs de FTC utilisent le protocole "quadrature" pour envoyer des informations de position au expansion hub. Par conséquent, les encodeurs relatifs doivent être branchés dans les ports d'encodeur situés près des ports de moteur pour fonctionner.
zh_cn: FTC中的所有相对编码器都使用“正交（quadrature）”协议向扩展集线器发送位置信息。因此，相对编码器必须插入位于电机端口附近的编码器端口才能运行。

source: Terminology
es_mx: Terminología
fr_ca: Terminologie
zh_cn: 相关术语

source: **Count**: A "count" (sometimes referred to as a "tick") refers to one increment of the encoder's position. Relative encoders report their position as a number equal to the number of "ticks" or "counts" the encoder has moved from its starting angle.
es_mx: **Recuento**: Un "recuento" (a veces denominado "tic") se refiere a un incremento de la posición del encoder. Los encoders relativos informan de su posición como un número igual al número de "ticks" o "recuentos" que el encoder se ha movido desde su ángulo inicial.
fr_ca: **Compte** : Un "compte" (parfois appelé "tick") correspond à un incrément de la position de l'encodeur. Les encodeurs relatifs indiquent leur position sous la forme d'un nombre égal au nombre de "ticks" ou de "comptes" que l'encodeur s'est déplacé par rapport à son angle de départ.
zh_cn: **计数（count）**：一个“count”（有时称为一个“tick”）是指编码器位置的一个增量。相对编码器将其位置输出为一个数字，该数字等于编码器从其起始角度移动的“ticks”或“counts”的数量。

source: **Counts Per Revolution**: The number of "counts" that an encoder reports after it has gone exactly one revolution. This value is commonly used to convert encoder "counts" into degrees or revolutions.
es_mx: **Recuentos por revolución**: El número de "conteos" que reporta un encoder después de haber dado exactamente una revolución. Este valor se utiliza habitualmente para convertir los "recuentos" del encoder en grados o revoluciones.
fr_ca: **Comptes par révolution** : Le nombre de "comptes" qu'un encodeur indique après avoir effectué exactement un tour. Cette valeur est couramment utilisée pour convertir les "comptes" d'un encodeur en degrés ou en révolutions.
zh_cn: **每转计数（counts per revolution）**：编码器恰好转了一圈后输出的“counts”数。此值通常用于将编码器“counts”转换为度或转数。

source: Quadrature terminology can get very confusing! Some encoders may report "pulses per revolution." One pulse can either equal 1 or 4 counts. Other encoders may report "cycles per revolution", which confusingly have the same acronym as counts per revolution. The best way to check is to plug the encoder into the REV Hub and turn it 1 full revolution, then check what it reports.
es_mx: La terminología de cuadratura puede ser muy confusa. Algunos encoderes pueden informar de "pulsos por revolución". Un pulso puede equivaler a 1 ó 4 recuentos. Otros encoders pueden informar de "ciclos por revolución", que confusamente tienen el mismo acrónimo que cuentas por revolución. La mejor manera de comprobarlo es enchufar el encoder al REV Hub y girarlo 1 revolución completa, luego comprobar lo que informa.
fr_ca: La terminologie de la quadrature peut prêter à confusion ! Certains encodeurs peuvent indiquer des "impulsions par tour". Une impulsion peut correspondre à 1 ou 4 comptes. D'autres encodeurs peuvent indiquer des "cycles par révolution", dont l'acronyme est le même que celui des comptes par révolution, ce qui peut prêter à confusion. La meilleure façon de vérifier est de brancher l'encodeur sur le moyeu REV et de le faire tourner d'un tour complet, puis de vérifier ce qu'il indique.
zh_cn: 正交术语（Quadrature terminology）可能会变得非常混乱！一些编码器可能会报告“每转脉冲（pulses per revolution）”。一个脉冲可以等于1或4个计数。其他编码器可能会报告“每转周期（cycles per revolution）”，这与每转计数具有相同的首字母缩写词。最好的检查方法是将编码器插入REV集线器并将其转1个完整转，然后检查它报告的内容。

source: Programming Encoders
es_mx: Programación de codificadores
fr_ca: Programmation des encodeurs
zh_cn: 编程编码器

source: Reading Encoders
es_mx: Lectura de codificadores
fr_ca: Lecture des encodeurs
zh_cn: 阅读编码器

source: In FTC software, quadrature encoders and motors are accessed with the same motor object. What this means is that we can access an encoder's position like so:
es_mx: En el software FTC, se accede a los encoders de cuadratura y a los motores con el mismo objeto motor. Esto significa que podemos acceder a la posición de un codificador de la siguiente manera:
fr_ca: Dans le logiciel FTC, les encodeurs en quadrature et les moteurs sont accessibles avec le même objet moteur. Cela signifie que nous pouvons accéder à la position d'un encodeur de la manière suivante :
zh_cn: 在FTC软件中，正交编码器和电机使用相同的电机对象访问。这意味着我们可以像这样访问编码器的位置：

source: Blocks
fr_ca: Blocs
zh_cn: 图形化编程

source: While convenient if one uses the built-in motor encoder, this can easily become confusing if using external encoders. To use external encoders, you must use the motor object associated with the port. For example, if there is a motor in port 1 named "Arm Motor" and an external encoder plugged into encoder port 1, you must do the following to get the encoder's position:
es_mx: Aunque es conveniente si se utiliza el codificador del motor incorporado, esto puede llegar a ser confuso si se utilizan codificadores externos. Para utilizar encoders externos, debe utilizar el objeto motor asociado al puerto. Por ejemplo, si hay un motor en el puerto 1 llamado "Arm Motor" y un encoder externo conectado al puerto de encoder 1, debes hacer lo siguiente para obtener la posición del encoder:
fr_ca: Bien que cela soit pratique si l'on utilise l'encodeur de moteur intégré, cela peut facilement devenir déroutant si l'on utilise des encodeurs externes. Pour utiliser des encodeurs externes, vous devez utiliser l'objet moteur associé au port. Par exemple, s'il y a un moteur dans le port 1 nommé "Arm Motor" et un encodeur externe branché dans le port d'encodeur 1, vous devez faire ce qui suit pour obtenir la position de l'encodeur :
zh_cn: 使用内置电机编码器很方便，而使用外部编码器就很容易造成混乱。要使用外部编码器，必须使用与端口相关联的电机对象。例如，如果端口1中有一个名为“机械臂电机”的电机，编码器端口1中插入了一个外部编码器，则必须执行以下操作才能获得编码器的位置：

source: Great! We now have the relative position of our encoder, reported in the number of "counts" it is from what it considers to be zero. However, it is often convenient to have the encoder start at zero at the beginning of the OpMode. While it technically does not change anything, it can help with debugging and simplify future code. To do this, we can add a call to reset the encoders before we read them.
es_mx: ¡Estupendo! Ahora tenemos la posición relativa de nuestro encoder, informada en el número de "cuentas" que está desde lo que considera cero. Sin embargo, a menudo es conveniente que el codificador comience en cero al principio del OpMode. Aunque técnicamente no cambia nada, puede ayudar con la depuración y simplificar el código futuro. Para ello, podemos añadir una llamada para restablecer los codificadores antes de leerlos.
fr_ca: C'est parfait ! Nous avons maintenant la position relative de notre encodeur, indiquée en nombre de "comptes" par rapport à ce qu'il considère comme zéro. Cependant, il est souvent pratique de faire démarrer l'encodeur à zéro au début de l'OpMode. Bien que cela ne change techniquement rien, cela peut aider au débogage et simplifier le code futur. Pour ce faire, nous pouvons ajouter un appel pour réinitialiser les encodeurs avant de les lire.
zh_cn: 太好了！我们现在有了编码器的相对位置，它从相对的零始点开始，以“计数”的数量输出数值。然而，让编码器在OpMode的开头从零开始通常很方便。虽然从技术上讲它不会改变任何东西，但它可以帮助调试和简化未来的代码。为此，我们可以在读取编码器之前添加一个重置编码器的调用。

source: As a note, **RUN_WITHOUT_ENCODER does not disable the encoder. It instead tells the SDK not to use the motor encoder for built-in velocity control**. We will go over what this means in a later section, but for now, know that it turns the motor back on so we can use it after the encoder is reset.
es_mx: Como nota, **RUN_WITHOUT_ENCODER no desactiva el encoder. Le dice al SDK que no use el codificador del motor para el control de velocidad integrado**. Repasaremos lo que esto significa en una sección posterior, pero por ahora, sepa que enciende el motor de nuevo para que podamos usarlo después de que el codificador se restablezca.
fr_ca: Remarque : **RUN_WITHOUT_ENCODER ne désactive pas l'encodeur. Il indique au SDK de ne pas utiliser l'encodeur du moteur pour le contrôle intégré de la vitesse**. Nous verrons ce que cela signifie dans une section ultérieure, mais pour l'instant, sachez que cela remet le moteur en marche afin que nous puissions l'utiliser après la réinitialisation de l'encodeur.
zh_cn: 请注意，**RUN_WITHOUT_ENCODER不会禁用编码器。它只是会告诉SDK不要使用电机编码器进行内置速度控制。** 我们将在后面的部分讨论这意味着什么，但现在，知道它会重新打开电机，以便我们可以在编码器复位后使用它。

source: Now we have our position (in counts) relative to the starting angle of the encoder. We can make a quick program to see this in action. Here, we use a motor encoder plugged into a port named "Arm Motor" in the hardware configuration.
es_mx: Ahora tenemos nuestra posición (en cuentas) relativa al ángulo inicial del encoder. Podemos hacer un programa rápido para ver esto en acción. Aquí, usamos un codificador de motor conectado a un puerto llamado "Arm Motor" en la configuración de hardware.
fr_ca: Nous avons maintenant notre position (en nombre de comptes) par rapport à l'angle de départ de l'encodeur. Nous pouvons créer un programme rapide pour voir cela en action. Ici, nous utilisons un encodeur de moteur branché sur un port nommé "Arm Motor" dans la configuration.
zh_cn: 现在我们有了相对于编码器起始角度的位置（以计数为单位）。我们可以制作一个快速程序来查看这一点的运行情况。在这里，我们使用插入硬件配置中名为“Arm Motor”的端口的电机编码器。

source: If you run the above OpMode and turn the encoder, you should see the values change as you move. If you rotate the shaft back to where it started, you will see the number return to (very close to) zero. As an exercise, rotate the shaft one full revolution (360) degrees and note down the number.
es_mx: Si ejecuta el OpMode anterior y gira el codificador, debería ver que los valores cambian a medida que se mueve. Si gira el eje de vuelta a donde comenzó, verá que el número vuelve a (muy cerca de) cero. Como ejercicio, gire el eje una vuelta completa (360) grados y anote el número.
fr_ca: Si vous exécutez l'OpMode ci-dessus et tournez l'encodeur, vous devriez voir les valeurs changer au fur et à mesure que vous vous déplacez. Si vous faites tourner l'arbre jusqu'à son point de départ, vous verrez le nombre revenir à (très près de) zéro. À titre d'exercice, faites tourner l'arbre d'un tour complet (360) degrés et notez le nombre.
zh_cn: 如果你运行上述OpMode并转动编码器，你应该会看到值在你移动时发生变化。如果你将轴旋转回起始位置，你将看到数字返回（非常接近）零。作为练习，将轴旋转一周（360）度并记下数字。

source: There is one more thing we can do with encoders. While knowing the number of counts something moved is useful, oftentimes one will need a different number, like the number of revolutions the encoder has turned or the angle it is at. To determine these, we need a constant, the encoders Counts Per Revolution or CPR. For external encoders, this number is often provided in a datasheet. For motors, it will generally be on the product page, although some motors (most notably the Rev Ultraplanetary Gearbox) do not provide it plainly.
es_mx: Hay algo más que podemos hacer con los encoders. Aunque saber el número de cuentas que se ha movido algo es útil, a menudo necesitaremos un número diferente, como el número de revoluciones que ha girado el encoder o el ángulo en el que se encuentra. Para determinarlos, necesitamos una constante, los contadores por revolución del encoder o CPR. En el caso de los encoders externos, este número suele aparecer en la hoja de datos. En el caso de los motores, suele aparecer en la página del producto, aunque algunos motores (sobre todo el Rev Ultraplanetary Gearbox) no lo indican claramente.
fr_ca: Il y a une autre chose que l'on peut faire avec les encodeurs. Bien qu'il soit utile de connaître le nombre de comptes que quelque chose s'est déplacé, on a souvent besoin d'un autre nombre, comme le nombre de tours que l'encodeur a fait ou l'angle qu'il a pris. Pour déterminer ces chiffres, nous avons besoin d'une constante, le nombre de tours de l'encodeur ou CPR (Comptes par revolution). Pour les encodeurs externes, ce nombre est souvent indiqué dans une fiche technique. Pour les moteurs, il figure généralement sur la page du produit, bien que certains moteurs (notamment le réducteur ultraplanétaire Rev) ne l'indiquent pas clairement.
zh_cn: 我们还可以用编码器做一件事。虽然知道移动的计数很有用，但通常需要一个不同的数字，比如编码器转动的转数或角度。为了确定这些，我们需要一个常数，编码器每转计数或CPR。对于外部编码器，这个数字通常在数据表中提供。对于电机，它通常会出现在产品页面上，尽管一些电机（最明显的是Rev Ultraplanetary Gearbox）没有明确提供。

source: You can calculate a motor's Counts Per Revolution by taking the base motor's Counts Per Revolution and multiplying it by the gearbox ratio. Be careful to use the actual gearbox ratio when doing this! For example, a 5:1 Ultraplanetary motor would have a count per revolution of 28 * (5.23) = 146.44 because the base motor has 28 Counts Per Revolution and the 5:1 gearbox actually has a 5.23:1 gear ratio. Remember, when using two gearboxes on top of each other, you multiply the gear ratios together.
es_mx: Puedes calcular los contadores por revolución de un motor tomando los contadores por revolución del motor base y multiplicándolos por el ratio de la caja de engranajes. Tenga cuidado de utilizar la relación real de la caja de engranajes cuando haga esto. Por ejemplo, un motor Ultraplanetario 5:1 tendría una cuenta por revolución de 28 * (5.23) = 146.44 porque el motor base tiene 28 Cuentas Por Revolución y la caja de cambios 5:1 en realidad tiene una relación de engranaje 5.23:1. Recuerde, cuando se utilizan dos cajas de engranajes una encima de la otra, se multiplican las relaciones de transmisión entre sí.
fr_ca: Vous pouvez calculer le nombre de comptes d'un moteur en prenant le nombre de comptes du moteur de base et en le multipliant par le rapport de boîte de vitesses. Veillez à utiliser le rapport de boîte de vitesses réel lors de cette opération ! Par exemple, un moteur ultraplanétaire 5:1 aura un nombre de tours de 28 * (5,23) = 146,44 parce que le moteur de base a 28 tours et que le réducteur 5:1 a un rapport de 5,23:1. N'oubliez pas que lorsque vous utilisez deux réducteurs l'un sur l'autre, vous multipliez les rapports de vitesse ensemble.
zh_cn: 你可以通过获取基础电机的每转计数并将其乘以齿轮箱比来计算电机的每转计数。执行此操作时请注意使用实际齿轮箱比！例如，5:1的Ultraplanetary电机的每转计数为28*(5.23)=146.44，因为基础电机的每转计数为28，而5:1齿轮箱实际上具有5.23:1的齿轮比。请记住，当使用两个齿轮箱时，你需要将齿轮箱比相乘。

source: In the following example, we divide the encoder position by its counts per revolution to obtain the number of revolutions the encoder has rotated. You have to replace [Your Counts Per Revolution Here] with the counts per revolution of your motor, found on its product page or calculated using the above tip.
es_mx: En el siguiente ejemplo, dividimos la posición del encoder por sus cuentas por revolución para obtener el número de revoluciones que ha girado el encoder. Tienes que sustituir [Your Counts Per Revolution Here] por los recuentos por revolución de tu motor, encontrados en su página de producto o calculados usando el consejo anterior.
fr_ca: Dans l'exemple suivant, nous divisons la position de l'encodeur par ses comptes par tour pour obtenir le nombre de tours que l'encodeur a effectué. Vous devez remplacer [Vos comptes par tour ici] par les comptes par tour de votre moteur, que vous trouverez sur sa page produit ou que vous calculerez à l'aide de l'astuce ci-dessus.
zh_cn: 在下面的示例中，我们将编码器位置除以它的每转计数，以获得编码器旋转的转数。你必须将[Your Counts Per Revolution Here]替换为电机的每转计数，可在其产品页面上找到或使用上述提示计算。

source: There is one more number we can get: the angle of the shaft. Calculating this number is very simple. We can multiply the number of rotations by 360 (since there are 360 degrees in one revolution). You might notice that this number can go above 360 as the shaft rotates multiple times. As such, we introduce angleNormalized, which will always be between 0 and 360.
es_mx: Hay un número más que podemos obtener: el ángulo del eje. Calcular este número es muy sencillo. Podemos multiplicar el número de rotaciones por 360 (ya que hay 360 grados en una revolución). Puedes notar que este número puede ir por encima de 360 ya que el eje rota varias veces. Por ello, introducimos angleNormalized, que siempre estará entre 0 y 360.
fr_ca: Il y a un autre chiffre que nous pouvons obtenir : l'angle de l'arbre. Le calcul de ce nombre est très simple. Il suffit de multiplier le nombre de rotations par 360 (puisqu'il y a 360 degrés dans une révolution). Vous remarquerez que ce nombre peut dépasser 360 lorsque l'arbre effectue plusieurs rotations. C'est pourquoi nous introduisons l'angleNormalisé, qui sera toujours compris entre 0 et 360.
zh_cn: 我们还可以得到一个数字：轴的角度。计算这个数字非常简单。我们可以将旋转次数乘以360（因为一次旋转有360度）。你可能会注意到，当轴多次旋转时，这个数字可以超过360。因此，我们引入angleNormalized，它将始终介于0和360之间。

source: Putting it all together, we get the following testing program.
es_mx: Juntándolo todo, obtenemos el siguiente programa de pruebas.
fr_ca: Si l'on met tout cela bout à bout, on obtient le programme de test suivant.
zh_cn: 把它们放在一起，我们得到了以下测试程序。

source: :download:`Blocks file download <block-code/encoder-opmode.blk>`
es_mx: :download:` Archivo de blocks descarga <block-code/encoder-opmode.blk>`
zh_cn: :download:`下载图形化编程文件 <block-code/encoder-opmode.blk>`

source: Tracking Wheels and Spools
es_mx: Ruedas de seguimiento y carretes
fr_ca: Roues et bobines de suivi
zh_cn: 跟踪轮和线轴

source: Up to this point, we have mostly been working with motors rotating something. However, many mechanisms in FTC are linear, and it can be desirable to measure these in a linear unit as well. Fortunately, this is very straightforward. All we need to know is the diameter of the object we are measuring.
es_mx: Hasta ahora, hemos trabajado sobre todo con motores que hacen girar algo. Sin embargo, muchos mecanismos en FTC son lineales, y puede ser deseable medirlos también en una unidad lineal. Afortunadamente, esto es muy sencillo. Todo lo que necesitamos saber es el diámetro del objeto que estamos midiendo.
fr_ca: Jusqu'à présent, nous avons surtout travaillé avec des moteurs en rotation. Cependant, de nombreux mécanismes de la FTC sont linéaires, et il peut être souhaitable de les mesurer également dans une unité linéaire. Heureusement, c'est très simple. Tout ce dont nous avons besoin, c'est de connaître le diamètre de l'objet que nous mesurons.
zh_cn: 到目前为止，我们主要是使用电机旋转物体。然而，FTC中的许多机制都是线性的，也可以用线性单位来计量它们。幸运的是，这非常简单。我们只需要知道我们正在计量的物体的直径。
