Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/encoders.po
Languages: es_mx, fr_ca, zh_cn

source: Be careful when selecting your diameter. For wheels, it is the outer diameter of the wheel, but for spools, it is the inner diameter of the spool, where the string rests. For chain and belts, it is the "pitch diameter" of the sprocket or pulley.
es_mx: Tenga cuidado al seleccionar el diámetro. Para las ruedas, es el diámetro exterior de la rueda, pero para los carretes, es el diámetro interior del carrete, donde descansa la cuerda. Para cadenas y correas, es el "diámetro de paso" del piñón o la polea.
fr_ca: Faites attention lorsque vous choisissez votre diamètre. Pour les roues, il s'agit du diamètre extérieur de la roue, mais pour les bobines, il s'agit du diamètre intérieur de la bobine, où repose la corde. Pour les chaînes et les courroies, il s'agit du "diamètre primitif" du pignon ou de la poulie.
zh_cn: 选择直径时要小心。对于轮子来说，它是轮子的外径，但对于线轴来说，它是线轴的内径，也就是弦的位置。对于链条和皮带来说，它是链轮或皮带轮的“节距直径（pitch diameter）”。

source: From here, we can calculate the circumference (the length of the arc of the circle, or the distance the wheel/spool will travel in one rotation)
es_mx: A partir de aquí, podemos calcular la circunferencia (la longitud del arco del círculo, o la distancia que recorrerá la rueda/carrete en una rotación)
fr_ca: À partir de là, nous pouvons calculer la circonférence (la longueur de l'arc de cercle, ou la distance que la roue/la bobine parcourra en une rotation).
zh_cn: 从这里，我们可以计算周长（圆的弧长，或轮子/线轴在一次旋转中行驶的距离）

source: Units are very important when dealing with FTC programming, so make sure they are always consistent! Whatever units you use for the diameter are the units for your calculated distance. So if you measure your diameter in inches, the reported distance will also be in inches.
es_mx: Las unidades son muy importantes cuando se trata de programación FTC, así que asegúrate de que siempre sean coherentes. Cualesquiera que sean las unidades que utilice para el diámetro serán las unidades para la distancia calculada. Por lo tanto, si mide el diámetro en pulgadas, la distancia calculada también será en pulgadas.
fr_ca: Les unités sont très importantes lorsqu'il s'agit de programmation FTC, assurez-vous donc qu'elles sont toujours cohérentes ! Les unités utilisées pour le diamètre sont les mêmes que celles utilisées pour la distance calculée. Ainsi, si vous mesurez votre diamètre en pouces, la distance rapportée sera également exprimée en pouces.
zh_cn: 在处理FTC编程时单位非常重要，所以要确保它们始终一致！无论你用什么单位表示直径，都是你计算距离的单位。所以如果你以英寸为单位测量直径，输出显示的距离数据也将以英寸为单位。

source: Putting this all together with our previous testing program, we get
es_mx: Si juntamos todo esto con nuestro programa de pruebas anterior, obtenemos
fr_ca: En combinant tout cela avec notre programme d'essais précédent, nous obtenons
zh_cn: 将这些与我们之前的测试程序放在一起，我们得到了

source: :download:`Blocks file download <block-code/spool-encoder-opmode.blk>`
es_mx: :download:`Archivo de blocks descarga <block-code/spool-encoder-opmode.blk>`
zh_cn: :download:`下载图形化编程文件 <block-code/spool-encoder-opmode.blk>`

source: Running Motors With Encoders
es_mx: Funcionamiento de motores con encoderes
fr_ca: Faire tourner les moteurs avec des encodeurs
zh_cn: 带编码器的运行电机

source: We've learned how to read encoder values, but how do you set where you want to go and tell the motor to go there?
es_mx: Hemos aprendido a leer los valores del encoder, pero ¿cómo se fija a dónde se quiere ir y se le dice al motor que vaya allí?
fr_ca: Nous avons appris à lire les valeurs de l'encodeur, mais comment définir l'endroit où l'on veut aller et demander au moteur de s'y rendre ?
zh_cn: 我们已经学会了如何读取编码器值，但是如何设置要去的地方并告诉电机去那里？

source: Earlier, we learned about the RUN_WITHOUT_ENCODER mode for the motor. We can use another motor mode, RUN_TO_POSITION, to tell the motor to run to a specific position in ticks, like so:
es_mx: Anteriormente, aprendimos sobre el modo RUN_WITHOUT_ENCODER para el motor. Podemos usar otro modo de motor, RUN_TO_POSITION, para decirle al motor que corra a una posición específica en ticks, así:
fr_ca: Plus tôt, nous avons appris à connaître le mode RUN_WITHOUT_ENCODER pour le moteur. Nous pouvons utiliser un autre mode moteur, RUN_TO_POSITION, pour indiquer au moteur de fonctionner jusqu'à une position spécifique en ticks, comme suit :
zh_cn: 先前，我们了解了电机的RUN_WITHOUT_ENCODER模式。我们可以使用另一种电机模式，RUN_TO_POSITION，以tick告诉电机运行到特定位置，如下所示：

source: You can find out more about run modes at the `official REV Robotics Documentation page <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_
es_mx: Puedes encontrar más información sobre los modos de ejecución en la `página oficial de documentación de REV Robotics <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_
fr_ca: Vous pouvez en savoir plus sur les modes d'exécution sur la page de documentation officielle de REV Robotics <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_
zh_cn: 你可以在 `官方REV机器人文档页面 <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback>`_ 找到更多关于运行模式的信息。

source: However, before we tell the motor to go to a position, we have to tell the motor what position to run to. **Note that this value must be an integer**. Let's amend the above code to do that.
es_mx: Sin embargo, antes de decirle al motor que vaya a una posición, tenemos que decirle a qué posición debe ir. **Nótese que este valor debe ser un entero**. Vamos a modificar el código anterior para hacer eso.
fr_ca: Cependant, avant de demander au moteur de se rendre à une position, nous devons lui indiquer la position à laquelle il doit se rendre. **Notez que cette valeur doit être un nombre entier**. Modifions le code ci-dessus à cet effet.
zh_cn: 然而，在我们告诉电机去一个位置之前，我们必须告诉电机运行到什么位置。注意，**这个值必须是一个整数。** 让我们修改上面的代码来做到这一点。

source: Setting the motor to RUN_TO_POSITION mode before setting a target position will throw an error. Be careful not to do that!
es_mx: Poner el motor en modo RUN_TO_POSITION, antes de fijar una posición objetivo arrojará un error. Tenga cuidado de no hacerlo.
fr_ca: Mettre le moteur en mode RUN_TO_POSITION avant de définir une position cible génère une erreur. Veillez à ne pas faire cela !
zh_cn: 在设置目标位置之前将电机设置为RUN_TO_POSITION模式会提示错误。小心不要这样做！

source: This code tells the motor to move to 1000 ticks, using a PID loop to control the motor's position. You can read more about PID loops `here. <https://gm0.org/en/latest/docs/software/concepts/control-loops.html#pid>`_
es_mx: Este código le dice al motor que se mueva a 1000 ticks, usando un bucle PID para controlar la posición del motor. Puedes leer más sobre bucles PID `aquí. <https://gm0.org/en/latest/docs/software/concepts/control-loops.html#pid>`_
fr_ca: Ce code demande au moteur de se déplacer à 1000 ticks, en utilisant une boucle PID pour contrôler la position du moteur. Vous pouvez en savoir plus sur les boucles PID ici. <https://gm0.org/en/latest/docs/software/concepts/control-loops.html#pid>`_
zh_cn: 此代码告诉电机移动到1000tick，使用PID回路来控制电机的位置。你可以在 `此处 <https://gm0.org/en/latest/docs/software/concepts/control-loops.html#pid>`_ 阅读有关PID回路的更多信息。

source: We can cap the speed that the motor runs at using the following code:
es_mx: Podemos limitar la velocidad a la que funciona el motor utilizando el siguiente código:
fr_ca: Nous pouvons déterminer la vitesse de rotation du moteur à l'aide du code suivant :
zh_cn: 我们可以使用以下代码限制电机运行的速度：

source: Now, let's use this information to control an arm in an OpMode.
es_mx: Ahora, vamos a utilizar esta información para controlar un brazo en un OpMode.
fr_ca: Utilisons maintenant ces informations pour contrôler un bras dans un OpMode.
zh_cn: 现在，让我们使用此信息来控制OpMode中的机械臂。

source: :download:`Blocks file download <block-code/arm-opmode.blk>`
es_mx: :download:`Archive de blocks descarga <block-code/arm-opmode.blk>`
zh_cn: :download:`下载图形化编程文件 <block-code/arm-opmode.blk>`
