Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/gamepad.po
Languages: es_mx, fr_ca, zh_cn

source: Gamepad Usage
es_mx: Uso del Gamepad
fr_ca: Utilisation de la manette de jeu
zh_cn: 游戏手柄使用

source: Gamepad Layout
es_mx: Disposición del Gamepad
fr_ca: Disposition de la manette de jeu
zh_cn: 游戏手柄布局

source: Logitech F310 gamepad image layout.
es_mx: Diseño de imagen del gamepad de Logitech F310
fr_ca: Disposition des boutons de la manette Logitech F310.
zh_cn: 罗技 F310 游戏手柄布局示意图。

source: Xbox 360 gamepad image layout.
es_mx: Diseño de imagen del gamepad de Xbox 360.
fr_ca: Présentation de l'image de la manette de jeu Xbox 360.
zh_cn: Xbox 360 游戏手柄布局示意图。

source: PS4/Etpark gamepad image layout.
es_mx: Diseño de imagen del gamepad PS4/Etpark.
fr_ca: Présentation de l'image de la manette de jeu PS4/Etpark.
zh_cn: PS4/Etpark 游戏手柄布局示意图。

source: ``L1`` is ``left_bumper``, ``L2`` is ``left_trigger``, ``R1``/``R2`` are the right-hand equivalents.
es_mx: ``L1`` es ``bumper izquierdo``, ``L2`` es ``gatillo izquierdo``, ``R1``/`R2`` son los equivalentes de la derecha.
fr_ca: ``L1`` est ``left_bumper``, ``L2`` est ``left_trigger``, ``R1``/``R2`` sont les équivalents de droite.
zh_cn: ``L1`` 是 ``left_bumper`` ， ``L2`` 是 ``left_trigger`` ， ``R1``/``R2`` 表示右手侧的 ``bumper`` 和 ``trigger`` 按键。

source: Button Aliases
es_mx: Alias de los botones
fr_ca: Alias des boutons
zh_cn: 按钮别名

source: Since both PS4-style and Xbox-Style controllers are FTC\ |reg| legal, there are `aliases in the FTC SDK <https://github.com/OpenFTC/Extracted-RC/blob/c960dd7de34d49a66c00a345636175392f936b9e/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L892>`_ between PS4-style and Xbox-style button naming.
es_mx: Dado que tanto los mandos estilo PS4 como los estilo Xbox son legales según FTC, existen `aliases en el SDK de FTC <https://github.com/OpenFTC/Extracted-RC/blob/c960dd7de34d49a66c00a345636175392f936b9e/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L892>`_ entre la nomenclatura de botones estilo PS4 y estilo Xbox.
fr_ca: Étant donné que les manettes de type PS4 et Xbox sont toutes deux autorisées par FTC\ |reg|, il existe des "alias" dans le SDK de FTC <https://github.com/OpenFTC/Extracted-RC/blob/c960dd7de34d49a66c00a345636175392f936b9e/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L892>`_ entre le style PS4 et le style Xbox en ce qui concerne le nom des boutons.
zh_cn: 由于 PS4 风格和 Xbox 风格控制器都是合法的 FTC\ |reg| 控制器，因此在 `FTC SDK <https://github.com/OpenFTC/Extracted-RC/blob/c960dd7de34d49a66c00a345636175392f936b9e/RobotCore/src/main/java/com/qualcomm/robotcore/hardware/Gamepad.java#L892>`_ 中，PS4 风格和 Xbox 风格按钮命名之间存在别名映射关系。

source: ``circle``
es_mx: ``círculo``
fr_ca: ``cercle``

source: ``triangle``
es_mx: ``triángulo``

source: ``square``
es_mx: ``cuadrado``
fr_ca: ``carré``

source: ``share``
es_mx: ``compartir``
fr_ca: ``partage``

source: ``back``
es_mx: ``volver``
fr_ca: ``retour``

source: ``options``
es_mx: ``opciones``

source: ``start``
es_mx: ``iniciar``
fr_ca: ``début``

source: ``guide``
es_mx: ``guía``

source: Boolean Inputs
es_mx: Entradas booleanas/ Boolean Inputs
fr_ca: Entrées Booléennes
zh_cn: 布尔输入

source: TeleOp OpModes are generally written in iterative style, with a loop that contains code that is called over an over. Under this paradigm, a simple handling of user input could look like
es_mx: Los OpModes de TeleOp se escriben generalmente en estilo iterativo, con un bucle que contiene código que se llama una y otra vez. Bajo este paradigma, un manejo simple de la entrada del usuario podría tener el siguiente aspecto
fr_ca: Les OpModes TeleOp sont généralement écrits dans un style itératif, avec une boucle qui contient du code appelé à plusieurs reprises. Selon ce paradigme, un traitement simple de l'entrée de l'utilisateur pourrait ressembler à ce qui suit
zh_cn: TeleOp OpModes通常以迭代风格编写，其中包含通过over调用的代码的循环。在这种范式下，对用户输入的简单处理可能看起来像：

source: In this situation, this likely does what the driver wants: while the button is held, the motor's power is set to 1, and otherwise the power is set to 0. Since writing the same power to a motor multiple times has no effect on the motor's behavior, this works perfectly fine. However, issues arise when wanting to do something once when a button is pressed. For example, it is tempting to write something like this to get a press of a or b to adjust a servo.
es_mx: En esta situación, esto probablemente hace lo que el controlador quiere: mientras se mantiene pulsado el botón, la potencia del motor se establece en 1, y de lo contrario la potencia se establece en 0. Dado que escribir la misma potencia a un motor varias veces no tiene ningún efecto sobre el comportamiento del motor, esto funciona perfectamente bien. Sin embargo, surgen problemas cuando se quiere hacer algo una vez cuando se pulsa un botón. Por ejemplo, es tentador escribir algo como esto para obtener una pulsación de a o b para ajustar un servo.
fr_ca: Dans cette situation, le pilote fait ce qu'il veut : tant que le bouton est maintenu, la puissance du moteur est réglée sur 1, et sinon la puissance est réglée sur 0. Comme le fait d'écrire plusieurs fois la même puissance à un moteur n'a aucun effet sur le comportement du moteur, cela fonctionne parfaitement bien. Cependant, des problèmes se posent lorsque l'on veut faire quelque chose une seule fois lorsqu'on appuie sur un bouton. Par exemple, il est tentant d'écrire quelque chose comme ceci pour obtenir un appui sur a ou b pour ajuster un servo.
zh_cn: 在这种情况下，这可能会满足驾驶员的需求：当按钮被按住时，电机的功率设置为1，否则功率设置为0。由于多次向电机写入相同的功率对电机的行为没有影响，因此这完全可以正常工作。然而，当按下按钮时，想要做某事时就会出现问题。例如，写这样的东西来按下a或b来调整舵机是很有诱惑力的。

source: However, this will behave unpredictably, as each time the button is pressed, the ``setPosition`` method will be called multiple times as the loop frequency changes as does the button press length. There are a few techniques to avoid this, however they all require comparing the gamepad state to the gamepad state in the previous loop; therefore, it is necessary to store it.
es_mx: Sin embargo, esto se comportará de forma impredecible, ya que cada vez que se pulse el botón, el método ``setPosition`` será llamado varias veces, ya que la frecuencia del bucle cambia al igual que la duración de la pulsación del botón. Hay algunas técnicas para evitar esto, sin embargo, todas requieren comparar el estado del gamepad con el estado del gamepad en el bucle anterior; por lo tanto, es necesario almacenarlo.
fr_ca: Cependant, le comportement sera imprévisible, car à chaque fois que le bouton est pressé, la méthode ``setPosition`` sera appelée plusieurs fois, car la fréquence de la boucle change, tout comme la durée de la pression sur le bouton. Il existe quelques techniques pour éviter cela, mais elles nécessitent toutes de comparer l'état de la manette de jeu à l'état de la manette de jeu dans la boucle précédente ; il est donc nécessaire de le stocker.
zh_cn: 但是，这将表现出不可预测的行为，因为每次按下按钮时，随着循环频率的变化以及按钮按下长度的变化，将多次调用 ``setPosition`` 方法。有一些技术可以避免这种情况，但是它们都需要将游戏手柄状态与上一个循环中的游戏手柄状态进行比较；因此，有必要存储它。

source: Storing Gamepad State
es_mx: Almacenamiento del Estado del Gamepad
fr_ca: Stockage de l'état de la manette de jeu
zh_cn: 存储游戏手柄状态

source: While each gamepad input's previous state could be stored individually in a variable, e.g. ``boolean previousA``, this very quickly gets annoying. Luckily, the FTC SDK provides a way to copy gamepad states, with ``gamepad.copy(gamepadToCopy)``.
es_mx: Aunque el estado anterior de cada entrada del gamepad podría almacenarse individualmente en una variable, por ejemplo ``boolean previousA``, esto se vuelve molesto muy rápidamente. Por suerte, el SDK de FTC proporciona una forma de copiar los estados del gamepad, con ``gamepad.copy(gamepadToCopy)``.
fr_ca: Bien que l'état précédent de chaque entrée du gamepad puisse être stocké individuellement dans une variable, par exemple ``boolean previousA``, cela devient très vite ennuyeux. Heureusement, le SDK de FTC fournit un moyen de copier les états du gamepad, avec ``gamepad.copy(gamepadToCopy)``.
zh_cn: 虽然每个游戏手柄输入的先前状态可以单独存储在一个变量中，例如 ``boolean previousA`` ，但这很快就会变得烦人。幸运的是，FTC SDK提供了一种复制游戏手柄状态的方法，带有 ``gamepad.copy(gamepadToCopy)`` 。

source: In addition to storing the gamepad state for the previous iteration of the loop, the gamepad state for the current iteration of the loop is also stored. This is necessary because if the state of a button was always read from ``gamepad1``/``gamepad2``, it could change between reading the value and storing the previous value. This is because ``gamepad1``/``gamepad2`` update concurrently for ``LinearOpMode``, and so can change during a loop iteration.
es_mx: Además de almacenar el estado del gamepad para la iteración anterior del bucle, también se almacena el estado del gamepad para la iteración actual del bucle. Esto es necesario porque si el estado de un botón se leyera siempre de ``gamepad1``/``gamepad2``, podría cambiar entre la lectura del valor y el almacenamiento del valor anterior. Esto se debe a que ``gamepad1``/``gamepad2`` se actualizan concurrentemente para ``LinearOpMode``, y por tanto pueden cambiar durante una iteración del bucle.
fr_ca: En plus de stocker l'état de la manette de jeu pour l'itération précédente de la boucle, l'état de la manette de jeu pour l'itération actuelle de la boucle est également stocké. Ceci est nécessaire car si l'état d'un bouton était toujours lu depuis ``gamepad1``/``gamepad2``, il pourrait changer entre la lecture de la valeur et le stockage de la valeur précédente. C'est parce que ``gamepad1`/`gamepad2`` se mettent à jour simultanément pour ``LinearOpMode``, et peuvent donc changer pendant une itération de la boucle.
zh_cn: 除了存储循环前一次迭代的gamepad状态之外，还存储循环当前迭代的gamepad状态。这是必要的，因为如果按钮的状态总是从 ``gamepad1`` / ``gamepad2`` 读取，它可能会在读取值和存储前一次值之间改变。这是因为 ``gamepad1`` / ``gamepad2`` 同时更新 ``LinearOpMode`` ，因此可以在循环迭代期间改变。

source: In a ``LinearOpMode`` based TeleOp program, storing both current and previous gamepad state could look like:
es_mx: En un programa TeleOp basado en ``LinearOpMode``, almacenar tanto el estado actual como el anterior del gamepad podría tener este aspecto:
fr_ca: Dans un programme TeleOp basé sur le ``LinearOpMode``, le stockage de l'état actuel et de l'état précédent de la manette de jeu pourrait ressembler à ce qui suit :
zh_cn: 在基于 ``LinearOpMode`` 的TeleOp程序中，存储当前和以前的游戏手柄状态可能如下所示：

source: Rising Edge Detector
es_mx: Detector de Flanco Ascendente
fr_ca: Détecteur de front montant
zh_cn: 上升沿检测器

source: Why is it called a rising edge detector?
es_mx: ¿Por qué se llama detector de flanco ascendente?
fr_ca: Pourquoi l'appelle-t-on détecteur de front montant ?
zh_cn: 为什么叫上升沿检测器？

source: A signal edge is a transition in a digital signal. In this case, the digital signal is the gamepad input, which is low when not held and high when held. The rising edge is the transition from low to high, and the falling edge is the transition from high to low.
es_mx: Un flanco de señal es una transición en una señal digital. En este caso, la señal digital es la entrada del gamepad, que es baja cuando no se mantiene pulsada y alta cuando se mantiene pulsada. El flanco ascendente es la transición de bajo a alto, y el flanco descendente es la transición de alto a bajo.
fr_ca: Un front de signal est une transition dans un signal numérique. Dans ce cas, le signal numérique est l'entrée de la manette de jeu, qui est basse lorsqu'elle n'est pas maintenue et haute lorsqu'elle est maintenue. Le front montant est la transition de bas en haut, et le front descendant est la transition de haut en bas.
zh_cn: 信号沿是数字信号中的过渡，在这种情况下，数字信号是游戏手柄输入，不持有时为低，持有时为高。上升沿是从低到高的过渡，下降沿是从高到低的过渡。

source: A diagram of a rising/falling edge of a square wave
es_mx: Diagrama de un flanco de subida/bajada de una onda cuadrada
fr_ca: Diagramme d'un front montant/descendant d'une onde carrée
zh_cn: 方波上升沿/下降沿示意图

source: The most commonly used technique is a rising edge detector. It allows code to be run only once when the button is initially pressed, as opposed to every loop while it is held down. It works by checking that the button is currently pressed, but was not pressed in the previous loop. For example, inside of a TeleOp loop:
es_mx: La técnica más utilizada es un detector de flanco ascendente. Permite que el código se ejecute sólo una vez cuando se pulsa inicialmente el botón, en lugar de cada bucle mientras se mantiene pulsado. Funciona comprobando que el botón está pulsado en ese momento, pero no lo estaba en el bucle anterior. Por ejemplo, dentro de un bucle TeleOp:
fr_ca: La technique la plus couramment utilisée est un détecteur de front montant. Elle permet d'exécuter le code une seule fois lorsque le bouton est initialement enfoncé, plutôt que de le faire à chaque boucle pendant qu'il est maintenu enfoncé. Il vérifie que le bouton est actuellement enfoncé, mais qu'il ne l'a pas été dans la boucle précédente. Par exemple, à l'intérieur d'une boucle TeleOp :
zh_cn: 最常用的技术是上升沿检测器。它允许代码在最初按下按钮时只运行一次，而不是在按下按钮时运行每个循环。它的工作原理是检查按钮当前是否被按下，但在上一个循环中没有被按下。例如，在TeleOp循环内部：

source: This will increase the servo position by 0.1 exactly once per press of ``a``.
es_mx: Esto incrementará la posición del servo en 0.1 exactamente una vez por cada pulsación de ``a``.
fr_ca: Ceci augmentera la position du servo de 0.1 exactement une fois par pression sur ``a``.
zh_cn: 这将使每按 ``a`` 一次，舵机位置正好增加0.1。

source: Falling Edge Detector
es_mx: Detector de Flanco Descendente
fr_ca: Détecteur de front descendant
zh_cn: 下降沿检测器

source: A very similar technique is a falling edge detector. It allows code to be run only once when the button is released, as opposed to every loop while it is held down. It works by checking that the button is currently not pressed, but was pressed in the previous loop. For example, inside of a TeleOp loop:
es_mx: Una técnica muy similar es un detector de flanco descendente. Permite que el código se ejecute sólo una vez cuando se suelta el botón, en lugar de cada bucle mientras se mantiene pulsado. Funciona comprobando que el botón no está pulsado en ese momento, pero que sí lo estuvo en el bucle anterior. Por ejemplo, dentro de un bucle TeleOp:
fr_ca: Une technique très similaire est le détecteur de front descendant. Elle permet d'exécuter le code une seule fois lorsque le bouton est relâché, au lieu de le faire à chaque boucle lorsque le bouton est maintenu enfoncé. Il fonctionne en vérifiant que le bouton n'est actuellement pas enfoncé, mais qu'il l'a été dans la boucle précédente. Par exemple, à l'intérieur d'une boucle TeleOp :
zh_cn: 一种非常相似的技术是下降沿检测器。它允许代码在按钮释放时只运行一次，而不是在按下按钮时运行每个循环。它的工作原理是检查按钮当前是否未被按下，而是在前一个循环中被按下。例如，在TeleOp循环内部：

source: This will decrease the servo position by 0.1 exactly once per release of ``b``.
es_mx: Esto disminuirá la posición del servo en 0.1 exactamente una vez por cada liberación de ``b``.
fr_ca: Ceci diminuera la position du servo de 0.1 exactement une fois par relâchement de ``b``.
zh_cn: 这将减少舵机位置0.1正好每释放一次 ``b`` 。

source: One button can run different code on the rising and falling edge. This is mainly useful for fairly complex interactions and so is not demonstrated here.
es_mx: Un botón puede ejecutar código diferente en el flanco ascendente y descendente. Esto es útil principalmente para interacciones bastante complejas, por lo que no se demuestra aquí.
fr_ca: Un bouton peut exécuter un code différent sur le front montant et le front descendant. Cette fonction est principalement utile pour les interactions relativement complexes et n'est donc pas démontrée ici.
zh_cn: 一个按钮可以在上升沿和下降沿运行不同的代码。这主要适用于相当复杂的交互，因此此处不演示。

source: One common use case for rising edge detectors is to control toggles. Toggles can be used to have a button for the robot to switch between states; for example, turning an intake on and off. This can be done for any number of states but is most commonly done between two. To make a toggle between two states, a rising edge detector is used to set a boolean to its opposite and then that boolean is used to control an action.
es_mx: Un caso de uso común para los detectores de flanco ascendente es el control de toggles. Los toggles se pueden utilizar para que el robot cambie de un estado a otro; por ejemplo, para encender y apagar una toma de corriente. Esto se puede hacer para cualquier número de estados, pero más comúnmente se hace entre dos. Para hacer un toggle entre dos estados, se utiliza un detector de flanco ascendente para establecer un booleano a su opuesto y luego ese booleano se utiliza para controlar una acción.
fr_ca: Un cas d'utilisation courant des détecteurs de fronts montants est la commande de bascules. Les bascules peuvent être utilisées pour que le robot dispose d'un bouton lui permettant de passer d'un état à l'autre, par exemple pour allumer et éteindre une prise. Cela peut se faire pour n'importe quel nombre d'états, mais le plus souvent entre deux états. Pour réaliser un basculement entre deux états, un détecteur de front montant est utilisé pour placer un booléen à son opposé, puis ce booléen est utilisé pour contrôler une action.
zh_cn: 上升沿检测器的一个常见用例是控制切换。开关可以用来有一个按钮让机器人在状态之间切换；例如，启动和停止吸入拾取装置。这可以针对任意数量的状态进行，但最常见的是在两个状态之间进行。为了在两个状态之间进行切换，上升沿检测器用于将布尔值设置为相反的值，然后该布尔值用于控制动作。

source: Example
es_mx: Ejemplo
fr_ca: Exemple
zh_cn: 例子

source: Within the initialization code:
es_mx: Dentro del código de inicialización:
fr_ca: Dans le code d'initialisation :
zh_cn: 在初始化代码中：

source: Inside of the corresponding TeleOp loop:
es_mx: Dentro del bucle TeleOp correspondiente:
fr_ca: À l'intérieur de la boucle TeleOp correspondante :
zh_cn: 在相应的TeleOp循环内部：

source: This will turn on the intake when ``a`` is pressed, and leave it on until it is pressed again.
es_mx: Esto encenderá el intake cuando se pulse ``a``, y lo dejará encendido hasta que se vuelva a pulsar.
fr_ca: Cela activera la prise d'air lorsque ``a`` est pressé, et la laissera allumée jusqu'à ce que l'on appuie à nouveau sur cette touche.
zh_cn: 这将在按下 ``a`` 时启动吸入拾取装置，并保持运行状态，直到再次按下。

source: The less a driver has to keep in their head about the state of the robot the less they can screw up. Since toggles mean that a button does different things every time it is pressed, consider alternate solutions. This is especially true for toggles with more than two states.
es_mx: Cuanto menos tenga que pensar el conductor sobre el estado del robot, menos podrá meter la pata. Dado que los toggles implican que un botón hace cosas diferentes cada vez que se pulsa, hay que considerar soluciones alternativas. Esto es especialmente cierto para los toggles con más de dos estados.
fr_ca: Moins le pilote doit se préoccuper de l'état du robot, moins il risque de se tromper. Étant donné que les bascules signifient qu'un bouton fait des choses différentes à chaque fois qu'il est enfoncé, envisagez d'autres solutions. C'est particulièrement vrai pour les boutons à bascule ayant plus de deux états.
zh_cn: 驾驶员对机器人状态的了解越少，他们就越不可能搞砸。由于切换意味着每次按下按钮都会做不同的事情，请考虑替代解决方案。对于具有两个以上状态的切换尤其如此。

source: Gamepad Feedback
es_mx: Comentarios sobre el gamepad
fr_ca: Retour d'information sur la manette de jeu
zh_cn: 游戏手柄反馈

source: Gamepad feedback (i.e. rumble and LED control) can be a helpful way for robots to communicate status to a driver during a match. The degree to which the legal gamepads support this functionality varies:
es_mx: La retroalimentación del gamepad (es decir, el rumble y el control LED) puede ser una forma útil de que los robots comuniquen su estado a un conductor durante un partido. El grado en que los gamepads legales admiten esta funcionalidad varía:
fr_ca: Le retour d'information de la manette de jeu (c'est-à-dire le grondement et le contrôle des LED) peut être un moyen utile pour les robots de communiquer leur état à un pilote pendant un match. Le degré de prise en charge de cette fonctionnalité par les manettes de jeu légales varie :
zh_cn: 游戏手柄反馈（即震动和LED控制）是机器人在比赛中向驾驶员传达状态的有用方式。合法游戏手柄支持此功能的程度各不相同：

source: Rumble: none
es_mx: Rumble: ninguno
fr_ca: Tumulte : aucun
zh_cn: 震动：没有

source: LED Control: none
es_mx: Control LED: ninguno
fr_ca: Contrôle des LED : aucun
zh_cn: LED控制：无

source: Rumble: large (whomp whomp) and small (bzzz)
es_mx: Rumble: grande (whomp whomp) y pequeño (bzzz)
fr_ca: Rumble : grand (whomp whomp) et petit (bzzz)
zh_cn: 震动：大（whomp whomp）和小（bzzz）

source: LED Control: control of RGB lightbar (solid color or pattern)
es_mx: Control LED: control de la barra de luces RGB (color sólido o patrón)
fr_ca: Contrôle des LED : contrôle de la barre lumineuse RVB (couleur unie ou motif)
zh_cn: LED控制：控制RGB灯条（纯色或图案）

source: Rumble: contains both left and right rumble motors, but both seem to be only small weight (bzzz)
es_mx: Rumble: contiene los motores rumble izquierdo y derecho, pero ambos parecen tener poco peso (bzzz)
fr_ca: Rumble : contient les deux moteurs de rumble gauche et droit, mais les deux semblent n'avoir qu'un faible poids (bzzz).
zh_cn: 震动：包含左右震动马达，但两者似乎都只有很小的重量（bzzz）

source: LED Control: control of RGB LED (solid color or pattern). LED is fairly small and dim and may not be a good choice.
es_mx: Control LED: control de LED RGB (color sólido o patrón). LED es bastante pequeño y tenue y puede no ser una buena opción.
fr_ca: Contrôle des LED : contrôle des LED RVB (couleur unie ou motif). Les LED sont assez petites et peu lumineuses et peuvent ne pas être un bon choix.
zh_cn: LED控制：RGBLED（纯色或图案）的控制，LED相当小且暗淡，可能不是一个好的选择。

source: Gamepad feedback can be used to alert drivers of: start of endgame, intake loaded, automatic aligment complete, etc.
es_mx: La retroalimentación del gamepad puede usarse para alertar a los conductores de: inicio de final de partida, intake cargado, alineación automática completada, etc.
zh_cn: 游戏手柄反馈可用于提醒驾驶员：游戏结束开始、吸入拾取装置加载、自动结绳完成等。

source: The SDK provides both a simple and more complex API for controlling rumble according to the desired use case.
es_mx: El SDK ofrece una API sencilla y otra más compleja para controlar el ruido de fondo en función del caso de uso deseado.
fr_ca: Le SDK fournit une API simple ou plus complexe pour contrôler le bruit selon le cas d'utilisation souhaité.
zh_cn: SDK提供了一个简单和更复杂的API，用于根据所需的用例控制震动。

source: Rumble power is specified as a floating-point value in the range [0.0, 1.0].
es_mx: La potencia de vibración "rumble" se especifica como un valor de coma flotante en el intervalo [0,0, 1,0].
fr_ca: La puissance de vibration est spécifiée sous la forme d'une valeur à virgule flottante comprise entre [0,0 et 1,0].
zh_cn: 震动功率指定为[0.0,1.0]范围内的浮点值。

source: Rumble duration is specified in milliseconds as an integer. The constant ``Gamepad.RUMBLE_DURATION_CONTINUOUS`` may be used to indicate that the rumble should continue until another rumble action is commanded.
es_mx: La duración de la vibración "rumble" se especifica en milisegundos como un número entero. La constante ``Gamepad.RUMBLE_DURATION_CONTINUOUS`` se puede utilizar para indicar que el estruendo debe continuar hasta que se ordene otra acción de estruendo.
fr_ca: La durée du rumble est spécifiée en millisecondes sous la forme d'un entier. La constante ``Gamepad.RUMBLE_DURATION_CONTINUOUS`` peut être utilisée pour indiquer que le grondement doit continuer jusqu'à ce qu'une autre action de grondement soit commandée.
zh_cn: 震动持续时间以毫秒为单位指定为整数。常数 ``Gamepad.RUMBLE_DURATION_CONTINUOUS`` 可用于指示震动应继续，直到命令另一个震动动作。
