Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/gamepad.po
Languages: es_mx, fr_ca, zh_cn

source: All rumble actions are completed asynchronously; i.e. the function calls will return immediately. Any call to a rumble API will immediately displace any currently running rumble action. That is, if you command a gamepad to rumble for 750ms and then immediately command a rumble for 250ms, the gamepad will rumble for 250ms from the time the second command was issued.
es_mx: Todas las acciones de rumble se completan de forma asíncrona; es decir, las llamadas a la función regresarán inmediatamente. Cualquier llamada a una API de rumble desplazará inmediatamente cualquier acción de rumble que se esté ejecutando en ese momento. Es decir, si ordenas a un gamepad que ronronee durante 750 ms e inmediatamente después ordenas un ronroneo de 250 ms, el gamepad ronroneará durante 250 ms desde el momento en que se emitió la segunda orden.
fr_ca: Toutes les actions de vibration sont réalisées de manière asynchrone, c'est-à-dire que les appels de fonction sont renvoyés immédiatement. Tout appel à une API de vibration remplacera immédiatement toute action de vibration en cours. En d'autres termes, si vous ordonnez à une manette de jeu de vibrer pendant 750 ms, puis ordonnez immédiatement un vibrage pendant 250 ms, la manette de jeu vibrera pendant 250 ms à partir du moment où la seconde commande a été émise.
zh_cn: 所有震动动作都是异步完成的；即函数调用将立即返回。任何对震动API的调用都会立即替换任何当前正在运行的震动动作。也就是说，如果你命令游戏手柄震动作响750毫秒，然后立即命令震动作响250毫秒，则游戏手柄将从发出第二个命令时起震动作响250毫秒。

source: Simple API
es_mx: API simple
fr_ca: API simple
zh_cn: 简单API

source: The simplest way to command rumble: rumble motor 1 at 100% power for a specified duration:
es_mx: La forma más sencilla de ordenar rumble: rumble del motor 1 al 100% de potencia durante un tiempo determinado:
fr_ca: La façon la plus simple de commander le grondement est de faire gronder le moteur 1 à 100 % de sa puissance pendant une durée déterminée :
zh_cn: 命令震动的最简单方法：在指定持续时间内以100%功率震动电机1：

source: If control over both rumble motors and rumble intensity is desried:
es_mx: Si se desea controlar tanto los motores como la intensidad de la vibración:º
fr_ca: Si l’on souhaite contrôler à la fois les deux moteurs de vibration et l’intensité des vibrations:
zh_cn: 如果无法控制震动马达和震动强度：

source: To make a gamepad rumble for a certain number of "blips" (the notion of what a "blip" is being predefined by the SDK):
es_mx: Hacer que un gamepad retumbe durante un cierto número de "blips" (la noción de lo que es un "blip" está predefinida por el SDK):
fr_ca: Faire vibrer une manette de jeu pendant un certain nombre de "blips" (la notion de "blip" étant prédéfinie par le SDK) :
zh_cn: 让游戏手柄震动作响一定数量的“光点”（“光点”的概念由SDK预定义）：

source: Helper functions:
es_mx: Funciones auxiliares:
fr_ca: Fonctions d'assistance :
zh_cn: 辅助功能：

source: The ``public boolean isRumbling()`` function provides an educated guess about whether there is a rumble action ongoing on this gamepad. The Robot Controller does not know for sure whether a rumble action is ongoing or not, because once the command is sent to the Driver Station, the Driver Station handles running the gamepad effects and the Robot Controller is "hands off".
es_mx: La función ``public boolean isRumbling()`` proporciona una suposición educada sobre si hay una acción de rumble en curso en este gamepad. El Robot Controller no sabe con certeza si una acción de rumble está en curso o no, porque una vez que el comando se envía a la estación de control, la estación de control se encarga de ejecutar los efectos del gamepad y el Robot Controller no interviene.
fr_ca: La fonction ``public boolean isRumbling()`` permet de savoir si une action de vibration est en cours sur cette manette de jeu. Le contrôleur du robot ne sait pas avec certitude si une action de vibration est en cours ou non, car une fois que la commande est envoyée à la station de pilotage, celle-ci se charge d'exécuter les effets de la manette de jeu et le contrôleur du robot n'a plus rien à faire.
zh_cn: 这个 ``public boolean isRumbling()`` 函数提供了一个关于这个游戏手柄上是否有震动动作正在进行的有根据的猜测。机器人控制器不确定震动动作是否正在进行，因为一旦命令被发送到驱动站，驱动站就会处理运行游戏手柄效果，机器人控制器就会“放手”。

source: The ``public void stopRumble()`` function may be used to stop any ongoing rumble action for a gamepad (perhaps most useful in conjunction with a rumble of continuous duration).
es_mx: La función ``public void stopRumble()`` se puede utilizar para detener cualquier acción de rumble en curso para un gamepad (quizás más útil en conjunción con un rumble de duración continua).
fr_ca: La fonction ``public void stopRumble()`` peut être utilisée pour arrêter toute action de vibration en cours pour une manette de jeu (peut-être plus utile en conjonction avec une vibration de durée continue).
zh_cn: 可以使用 ``public void stopRumble()`` 函数来停止任何正在进行的游戏手柄的震动动作（也许与持续时间的震动一起最有用）。

source: Advanced API
es_mx: API avanzada
fr_ca: API avancée
zh_cn: 高级API

source: To create more advanced rumble behavior, a ``RumbleEffect`` may be created, which is composed of "Steps" which specify the power and duration each rumble motor should operate at. When a gamepad is commanded to run a ``RumbleEffect``, it will perform each of the "Steps" in series.
es_mx: Para crear un comportamiento de rumble más avanzado, se puede crear un ``RumbleEffect``, que se compone de "Pasos" que especifican la potencia y la duración de cada motor de rumble debe funcionar. Cuando se ordena a un gamepad que ejecute un ``RumbleEffect``, ejecutará cada uno de los "Pasos" en serie.
fr_ca: Pour créer un comportement de vibration plus avancé, un ``RumbleEffect`` peut être créé, qui est composé de "Steps" qui spécifient la puissance et la durée à laquelle chaque moteur de vibration doit fonctionner. Lorsqu'une manette de jeu est commandée pour exécuter un ``RumbleEffect``, elle exécute chaque "Pas" en série.
zh_cn: 为了创建更高级的震动行为，可以创建一个 ``RumbleEffect`` ，它由指定每个震动电机应运行的功率和持续时间的“步骤”组成。当游戏手柄被命令运行 ``RumbleEffect`` 时，它将连续执行每个“步骤”。

source: To create a ``RumbleEffect``, the ``RumbleEffect.Builder`` class must be used. The builder provides the ``addStep(double rumble1, double rumble2, int durationMs)`` function which is used to add a step to the sequence, and the ``build()`` function to create a ``RumbleEffect`` from the sequence of steps.
es_mx: Para crear un ``RumbleEffect``, se debe utilizar la clase ``RumbleEffect.Builder``. El constructor proporciona la función ``addStep(double rumble1, double rumble2, int durationMs)`` que se utiliza para añadir un paso a la secuencia, y la función ``build()`` para crear un ``RumbleEffect`` a partir de la secuencia de pasos.
fr_ca: Pour créer un ``RumbleEffect``, la classe ``RumbleEffect.Builder`` doit être utilisée. Le constructeur fournit la fonction ``addStep(double rumble1, double rumble2, int durationMs)`` qui est utilisée pour ajouter un pas à la séquence, et la fonction ``build()`` pour créer un ``RumbleEffect`` à partir de la séquence de pas.
zh_cn: 要创建 ``RumbleEffect`` ，必须使用RumbleEffect.Builder类。构建器提供 ``addStep（double rumble1, double rumble2, int durationMs）`` 函数用于向序列添加步骤，以及 ``build()`` 函数用于从步骤序列创建RumbleEffect。

source: Using an anonymous instance of the builder class is the cleanest way to construct a ``RumbleEffect``, for example:
es_mx: Utilizar una instancia anónima de la clase constructora es la forma más limpia de construir un ``RumbleEffect``, por ejemplo:
fr_ca: L'utilisation d'une instance anonyme de la classe builder est la façon la plus propre de construire un ``RumbleEffect``, par exemple :
zh_cn: 使用构建器类的匿名实例是构造 ``RumbleEffect`` 的最干净方法，例如：

source: Once a ``RumbleEffect`` has been created, it can be sent to a gamepad by calling:
es_mx: Una vez creado un ``RumbleEffect``, puede enviarse a un gamepad llamando a:
fr_ca: Une fois qu'un ``RumbleEffect`` a été créé, il peut être envoyé à une manette de jeu en appelant :
zh_cn: 一旦创建了 ``RumbleEffect`` ，它可以通过调用发送到游戏手柄：

source: LED Control
es_mx: Control LED
fr_ca: Contrôle des LED
zh_cn: LED控制

source: RGB LED component (i.e. red, green, blue) intensity is specified as a floating-point value in the range [0.0, 1.0].
es_mx: La intensidad del componente LED RGB (es decir, rojo, verde, azul) se especifica como un valor de punto flotante en el rango [0,0, 1,0].
fr_ca: L'intensité de la composante RVB des DEL (c'est-à-dire le rouge, le vert et le bleu) est spécifiée sous la forme d'une valeur à virgule flottante dans la plage [0,0, 1,0].
zh_cn: RGB LED分量（即红、绿、蓝）的强度被指定为[0.0,1.0]范围内的浮点值。

source: LED duration is specified in milliseconds as an integer. The constant ``Gamepad.LED_DURATION_CONTINUOUS`` may be used to indicate that the LED should remain the specified color until another command is issued.
es_mx: La duración del LED se especifica en milisegundos como un número entero. La constante ``Gamepad.LED_DURATION_CONTINUOUS`` puede utilizarse para indicar que el LED debe permanecer en el color especificado hasta que se emita otro comando.
fr_ca: La durée de la DEL est spécifiée en millisecondes sous la forme d'un entier. La constante ``Gamepad.LED_DURATION_CONTINUOUS`` peut être utilisée pour indiquer que la DEL doit rester dans la couleur spécifiée jusqu'à ce qu'une autre commande soit émise.
zh_cn: LED持续时间以毫秒为单位指定为整数。常量 ``Gamepad.LED_DURATION_CONTINUOUS`` 可用于指示LED应保持指定的颜色，直到发出另一个命令。

source: All LED actions are completed `asynchronously;` i.e. the function calls will return immediately. Any call to an LED API will immediately displace any currently running LED action. That is, if you command the LED green for 750ms and then immediately command purple for 250ms, the LED will light purple for 250ms from the time the second command was issued.
es_mx: Todas las acciones LED se completan `asíncronamente;` es decir, las llamadas a las funciones retornarán inmediatamente. Cualquier llamada a una API LED desplazará inmediatamente cualquier acción LED que se esté ejecutando en ese momento. Es decir, si usted ordena al LED verde por 750ms y luego inmediatamente ordena púrpura por 250ms, el LED se encenderá púrpura por 250ms desde el momento en que el segundo comando fue emitido.
fr_ca: Toutes les actions des DEL sont effectuées de manière "asynchrone", c'est-à-dire que les appels de fonction sont renvoyés immédiatement. Tout appel à une API de DEL remplacera immédiatement toute action de DEL en cours. Ainsi, si vous commandez une DEL verte pendant 750 ms, puis immédiatement une DEL violette pendant 250 ms, la DEL s'allumera en violet pendant 250 ms à partir du moment où la seconde commande a été émise.
zh_cn: 所有 LED 操作都是 "异步 "完成的，即函数调用将立即返回。对 LED API 的任何调用都会立即取代当前运行的任何 LED 操作。也就是说，如果你对 LED 发出持续 750 毫秒的绿色命令，然后立即对其发出持续 250 毫秒的紫色命令，那么从发出第二条命令开始，LED 将在 250 毫秒内点亮紫色。

source: To set the LED color for a fixed duration:
es_mx: Para establecer el color del LED para una duración fija:
fr_ca: Pour définir la couleur de la LED pour une durée fixe :
zh_cn: 要设置固定持续时间的LED颜色：

source: To create more advanced LED behavior, an ``LedEffect`` may be created, which is composed of "Steps" which specify a color and the duration for which to maintain it. When a gamepad is commanded to run an ``LedEffect``, it will perform each of the "Steps" in series.
es_mx: Para crear un comportamiento más avanzado del LED, se puede crear un ``LedEffect``, que se compone de "Pasos" que especifican un color y la duración para mantenerlo. Cuando se ordena a un gamepad que ejecute un ``LedEffect``, ejecutará cada uno de los "Pasos" en serie.
fr_ca: Pour créer un comportement plus avancé des DELs, un ``LedEffect`` peut être créé, qui est composé de "Steps" qui spécifient une couleur et la durée pour laquelle elle doit être maintenue. Lorsqu'une manette de jeu est commandée pour exécuter un ``LedEffect``, elle exécute chaque "Pas" en série.
zh_cn: 要创建更高级的LED行为，可以创建一个 ``LedEffect`` ，它由指定颜色和维护颜色持续时间的“步骤”组成。当游戏手柄被命令运行 ``LedEffect`` 时，它将连续执行每个“步骤”。

source: To create an ``LedEffect``, the ``LedEffect.Builder`` class must be used. The builder provides the ``addStep(double r, double g, double b, int durationMs)`` function which is used to add a step to the sequence, and the ``build()`` function to create an ``LedEffect`` from the sequence of steps.
es_mx: Para crear un ``LedEffect``, se debe utilizar la clase ``LedEffect.Builder``. El constructor proporciona la función ``addStep(double r, double g, double b, int durationMs)`` que se utiliza para añadir un paso a la secuencia, y la función ``build()`` para crear un ``LedEffect`` a partir de la secuencia de pasos.
fr_ca: Pour créer un ``LedEffect``, la classe ``LedEffect.Builder`` doit être utilisée. Le constructeur fournit la fonction ``addStep(double r, double g, double b, int durationMs)`` qui est utilisée pour ajouter un pas à la séquence, et la fonction ``build()`` pour créer un ``LedEffect`` à partir de la séquence de pas.
zh_cn: 要创建 ``LedEffect`` ，必须使用 ``LedEffect.Builder`` 类。构建器提供了 ``addStep(double r, double g, double b, int durationMs)`` 函数，用于向序列添加步骤，以及 ``build()`` 函数，用于从步骤序列创建 ``LedEffect`` 。

source: Using an anonymous instance of the builder class is the cleanest way to construct an ``LedEffect``, for example:
es_mx: Utilizar una instancia anónima de la clase constructora es la forma más limpia de construir un ``LedEffect``, por ejemplo:
fr_ca: L'utilisation d'une instance anonyme de la classe constructeur est la façon la plus propre de construire un ``LedEffect``, par exemple :
zh_cn: 使用构建器类的匿名实例是构建 ``LedEffect`` 的最干净方法，例如：

source: Once an ``LedEffect`` has been created, it can be sent to a gamepad by calling:
es_mx: Una vez creado un ``LedEffect``, puede enviarse a un gamepad llamando a:
fr_ca: Une fois qu'un ``LedEffect`` a été créé, il peut être envoyé à une manette de jeu en appelant :
zh_cn: 一旦创建了 ``LedEffect`` ，它可以通过调用发送到游戏手柄：

source: ``cross``
fr_ca: ``croix``

source: Toggles
fr_ca: Bascules
zh_cn: 切换

source: Gamepad feedback can be used to alert drivers of: start of endgame, intake loaded, automatic alignment complete, etc.
fr_ca: Le retour d'information de la manette de jeu peut être utilisé pour avertir les pilotes du début de la partie finale, du chargement du ramasseur, de la fin de l'alignement automatique, etc.

source: Rumble
fr_ca: Vibration
zh_cn: 震动
