Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/mecanum-drive.po
Languages: es_mx, fr_ca, zh_cn

source: Mecanum Physics
es_mx: Física del Mecanum
fr_ca: Physique de Mécanum
zh_cn: 麦克纳姆物理学

source: :term:`Mecanum drive <Mecanum Wheel>` is a very popular drivetrain type in FTC\ |reg|. Mecanum drivetrains enables holonomic movement. This means that the drivetrain is able to move in any direction while rotating: forwards, backwards, side to side, translating while rotating, etc. `Here is a neat video <https://www.youtube.com/watch?v=pP8ajNMx84k>`_ demonstrating such movement.
es_mx: :term:`Mecanum drive <Mecanum Wheel>` es un tipo de chasis muy popular en FTC\ |reg|. La transmisión Mecanum permite el movimiento holonómico. Esto significa que la transmisión es capaz de moverse en cualquier dirección mientras gira: hacia delante, hacia atrás, de lado a lado, trasladándose mientras gira, etc. Aquí hay un video <https://www.youtube.com/watch?v=pP8ajNMx84k>`_ que demuestra este movimiento.
fr_ca: Le :terme:` châssis Mecanum <Mecanum Wheel>` est un type de transmission très populaire en FTC. La transmission Mecanum permet un mouvement holonomique. Cela signifie que la transmission est capable de se déplacer dans n'importe quelle direction tout en tournant : vers l'avant, vers l'arrière, d'un côté à l'autre, en translation, tout en tournant, etc. Voici une vidéo intéressante <https://www.youtube.com/watch?v=pP8ajNMx84k>`_ démontrant ce type de mouvement.
zh_cn: :term:`麦克纳姆驱动 <Mecanum Wheel>` （以下简称麦轮）是FTC\ |reg| 中非常流行的驱动系统类型。麦轮传动系统支持完整运动。这意味着传动系统在旋转时能够向任何方向移动：向前、向后、左右、旋转时平移等。 `这里有一个简洁的视频 <https://www.youtube.com/watch?v=pP8ajNMx84k>`_ 演示了这种运动。

source: Some common COTS mecanum drivetrain kits are the `goBILDA Strafer Chassis Kit <https://www.gobilda.com/strafer-chassis-kit-v5/>`_ and the `REV Mecanum Drivetrain Kit <https://www.revrobotics.com/rev-45-2470/>`_.
es_mx: Algunos kits de chasis mecanumm COTS comunes son el `goBILDA Strafer Chassis Kit <https://www.gobilda.com/strafer-chassis-kit-v5/>`_ y el `REV Mecanum Drivetrain Kit <https://www.revrobotics.com/rev-45-2470/>`_.
fr_ca: Les kits de transmission Mecanum COTS les plus courants sont le `goBILDA Strafer Chassis Kit <https://www.gobilda.com/strafer-chassis-kit-v5/>`_ et le `REV Mecanum Drivetrain Kit <https://www.revrobotics.com/rev-45-2470/>`_.
zh_cn: 一些常见的COTS麦轮传动系统套件是 `goBILDA Strafer Chassis Kit <https://www.gobilda.com/strafer-chassis-kit-v5/>`_ 和 `REV Mecanum Drivetrain Kit <https://www.revrobotics.com/rev-45-2470/>`_。

source: :term:`Mecanum wheels <Mecanum Wheel>` have rollers at a 45\ |deg| angle to the rest of the wheel. Since these are in contact with the ground instead of something solid like in a :term:`traction wheel <Traction wheel>`, instead of the wheel creating a force parallel to the orientation of the wheel, it creates one 45\ |deg| from parallel. Depending on how the wheels are driven, X or Y components of the force vectors can cancel which allows movement in any direction.
es_mx: :term:`Ruedas Mecanum<Mecanum Wheel>` tienen rodillos con un ángulo de 45 grados respecto al resto de la rueda. Al estar en contacto con el suelo y no con algo sólido como en una rueda de tracción <Traction wheel>, en lugar de crear una fuerza paralela a la orientación de la rueda, crea una a 45 grados de la paralela. Dependiendo de cómo se accionen las ruedas, las componentes X o Y de los vectores de fuerza pueden anularse, lo que permite el movimiento en cualquier dirección.
fr_ca: Les :term:`Roues Mecanum <Mecanum Wheel>` ont des rouleaux à un angle de 45° par rapport au reste de la roue. Comme ils sont en contact avec le sol et non avec quelque chose de solide comme dans une :term:`roue de traction <Traction wheel>`, au lieu de créer une force parallèle à l'orientation de la roue, celle-ci en crée une à 45 degrés de la parallèle. Selon la façon dont les roues sont entraînées, les composantes X ou Y des vecteurs de force peuvent s'annuler, ce qui permet un mouvement dans n'importe quelle direction.
zh_cn: :term:`麦轮 <Mecanum Wheel>` 滚轮与轮子的其他部分成 45 度角。由于这些滚轮与地面接触，而不是像 :term:`牵引轮 <Traction wheel>` 那样与固体接触，因此车轮产生的力不是与车轮方向平行的力，而是与平行线成 45\ |deg| 角的力。根据车轮的驱动方式，力矢量的X或Y分量可以抵消，从而允许向任何方向运动。

source: Force diagram of a single mecanum wheel
es_mx: Diagrama de fuerzas de una rueda mecanum
fr_ca: Diagramme de force d'une roue mécanum simple
zh_cn: 单个麦轮的受力示意图

source: Using Vectoring to Create Omnidirectional Movement
es_mx: Vectorización para crear movimientos omnidireccionales
fr_ca: Utilisation du vecteur pour créer un mouvement omnidirectionnel
zh_cn: 使用矢量创建全方位运动

source: A standard mecanum drive configuration possesses 4 mecanum wheels oriented in an "X" shape. This means that the rollers are angled towards the center when looking at it from above. This configuration allows one to add up the force vectors generated by the offset rollers and derive movement in any direction. It is important to note that because of friction, perfect movement isn't possible in every direction, so a :term:`mecanum drivetrain <Mecanum Wheel>` will be able to drive slightly faster forwards/backwards than any other directions. Combining translation and rotation will also result in slower movement.
es_mx: Una configuración de accionamiento mecanum estándar posee 4 ruedas mecanum orientadas en forma de "X". Esto significa que los rodillos están inclinados hacia el centro cuando se mira desde arriba. Esta configuración permite sumar los vectores de fuerza generados por los rodillos desplazados y derivar el movimiento en cualquier dirección. Es importante tener en cuenta que, debido a la fricción, el movimiento perfecto no es posible en todas las direcciones, por lo que un :term:`chasis mecanum<Mecanum Wheel>` será capaz de conducir ligeramente más rápido hacia delante/atrás que en cualquier otra dirección. La combinación de traslación y rotación también dará como resultado un movimiento más lento.
fr_ca: Une configuration de chassis mécanum standard possède 4 roues mécanum orientées en forme de "X". Cela signifie que les rouleaux sont orientés vers le centre lorsqu'on les regarde d'en haut. Cette configuration permet d'additionner les vecteurs de force générés par les rouleaux décalés et d'obtenir un mouvement dans n'importe quelle direction. Il est important de noter qu'en raison du frottement, un mouvement parfait n'est pas possible dans toutes les directions, de sorte qu'un :term:`chassis mecanum <Mecanum Wheel>` pourra rouler légèrement plus vite en avant/en arrière que dans n'importe quelle autre direction. La combinaison de la translation et de la rotation entraînera également un mouvement plus lent.
zh_cn: 标准的麦轮驱动配置有4个以“X”形状定向的麦轮。这意味着当从上面看时，滚子是朝向中心的。这种配置允许人们将偏移滚子产生的力矢量相加，并推导出任何方向的运动。重要的是要注意，由于摩擦力，不可能在每个方向都进行完美的运动，因此 :term:`麦轮底盘 <Mecanum Wheel>` 比起其他方向可以更快地向前/向后移动。平移和旋转相结合也会导致运动变慢。

source: Force diagram of a complete mecanum drive
es_mx: Diagrama de fuerzas de un accionamiento mecanum completo
fr_ca: Diagramme de force d'un chassis mécanum complet
zh_cn: 完整麦轮传动装置的受力示意图

source: In the image above, vectors 1, 2, 3, and 4 are the force vectors created by the :term:`mecanum wheels <Mecanum Wheel>` when the chassis is instructed to drive towards the top of the image. All motors are driving forward. The blue and red lines are their X and Y components, respectively. Here are a few examples of how the wheels must be driven to achieve different movements:
es_mx: En la imagen anterior, los vectores 1, 2, 3 y 4 son los vectores de fuerza creados por las :term:`ruedas mecanum <Mecanum Wheel>` cuando se le ordena al chasis que se dirija hacia la parte superior de la imagen. Todos los motores van hacia delante. Las líneas azul y roja son sus componentes X e Y, respectivamente. Aquí hay algunos ejemplos de cómo las ruedas deben ser impulsadas para lograr diferentes movimientos:
fr_ca: Dans l'image ci-dessus, les vecteurs 1, 2, 3 et 4 sont les vecteurs de force créés par le :term:`roues mecanum <Mecanum Wheel>` lorsque le châssis reçoit l'instruction de se diriger vers le haut de l'image. Tous les moteurs sont en marche avant. Les lignes bleues et rouges représentent respectivement les composantes X et Y de ces vecteurs. Voici quelques exemples de la façon dont les roues doivent être actionnées pour réaliser différents mouvements :
zh_cn: 在上图中，向量1、2、3和4分别表示底盘向图像顶部行驶时由 :term:`麦轮 <Mecanum Wheel>` 创建的力向量。所有电机都在向前行驶。蓝线和红线分别是它们的X和Y分量。以下是车轮必须如何驱动以实现不同运动的几个示例：

source: Examples of ways to move the wheels on mecanum drive to move the robot in different directions
es_mx: Ejemplos de formas de mover las ruedas en accionamiento mecanum para mover el robot en diferentes direcciones
fr_ca: Exemples de façons de déplacer les roues de l'entraînement mécanum pour déplacer le robot dans différentes directions
zh_cn: 麦轮传动装置使机器人向不同方向移动的方法示例

source: It is strongly advised to not hardcode these movements in; there is a much better way described below that allows for true holonomic movement and is much more elegant.
es_mx: Se recomienda encarecidamente no codificar estos movimientos; hay una forma mucho mejor descrita a continuación que permite un verdadero movimiento holonómico y es mucho más elegante.
fr_ca: Il est fortement conseillé de ne pas coder en dur ces mouvements ; il existe une bien meilleure méthode, décrite ci-dessous, qui permet un véritable mouvement holonomique et qui est beaucoup plus élégante.
zh_cn: 强烈建议不要硬编码这些动作；下面描述了一种更好的方法，可以实现真正的完整运动，而且更加优雅。

source: Deriving Mecanum Control Equations
es_mx: Derivación de las ecuaciones de control de Mecanum
fr_ca: Calcul des équations de contrôle pour mécanum
zh_cn: 推导麦卡纳姆轮控制方程

source: Before thinking about mecanum, envision a scenario where you have a 2 motor tank drivetrain which you want to control using the left stick Y axis for forward/backward movement, and the right stick X axis for pivot turning. The motors are configured so that positive is clockwise for the right motor when the body is facing away from you, and the left motor is the opposite. To control only forward/backward movement, you simply need to set the motor powers to the Y stick value (flip the sign since Y is reversed):
es_mx: Antes de pensar en el mecanum, imagina un escenario en el que tienes una chasis de tanque de 2 motores que quieres controlar utilizando el eje Y del stick izquierdo para el movimiento hacia delante/atrás, y el eje X del stick derecho para el giro pivotante. Los motores están configurados para que el positivo sea en el sentido de las agujas del reloj para el motor derecho cuando el cuerpo está de espaldas a usted, y el motor izquierdo es lo contrario. Para controlar sólo el movimiento hacia delante/atrás, sólo tienes que ajustar las potencias del motor al valor del stick Y (invierte el signo ya que Y está invertido):
fr_ca: Avant de penser au mecanum, imaginez un scénario dans lequel vous avez un tank à 2 moteurs que vous voulez contrôler en utilisant l'axe Y du manche gauche pour les mouvements avant/arrière, et l'axe X du manche droit pour la rotation. Les moteurs sont configurés de façon à ce que le moteur droit soit positif dans le sens des aiguilles d'une montre lorsque le corps est tourné vers l'extérieur, et le moteur gauche dans le sens inverse. Pour contrôler uniquement les mouvements avant/arrière, il suffit de régler les puissances du moteur sur la valeur du manche Y (inverser le signe puisque Y est inversé) :
zh_cn: 在推导麦轮方程之前，设想一个场景，你有一个2电机坦克底盘，你想用左摇杆Y轴来控制它前进/后退，用右摇杆X轴来控制它自转转动。电机的配置是，当底盘背对着你时，右电机的正方向是顺时针，而左电机相反。要控制只前进/后退运动，你只需要将电机功率设置为Y摇杆值（翻转符号，因为Y是反转的）：

source: Blocks
fr_ca: Blocs
zh_cn: 图形化编程

source: Although at first adding rotation might seem like a difficult task, it's actually super simple. All you need to do is subtract the right X stick value from the right wheels, and add it to the left:
es_mx: Aunque al principio añadir la rotación pueda parecer una tarea difícil, en realidad es super sencillo. Todo lo que tienes que hacer es restar el valor del stick X derecho de las ruedas derechas, y sumarlo al izquierdo:
fr_ca: Bien que l'ajout d'une rotation puisse sembler difficile au premier abord, c'est en fait très simple. Tout ce que vous avez à faire est de soustraire la valeur du manche X de droite des roues de droite, et de l'ajouter à celle de gauche :
zh_cn: 虽然起初添加旋转似乎是一项艰巨的任务，但实际上非常简单。你需要做的就是从右轮功率值中减去右摇杆的X值，然后将其添加到左轮功率值中：

source: Here, if the left stick is pressed upwards, both of the motors will be fed a positive value, causing the robot to move forward. If it is pressed downwards, both of the motors will be fed a negative value, causing the robot to move backwards. A similar principle applies for rotation: if the right stick is pushed rightward, the left wheels will spin forward while the right spin backward, causing rotation. The opposite applies for pushing the stick left. If both sticks are pushed at the same time, say the left Y stick is at 1 and the right X stick is also at 1, the value of the left wheels will be :math:`1+1=2` (which gets clipped to 1 in the SDK) and the right wheels will be :math:`1-1=0`, which causes a rightward curve.
es_mx: Aquí, si el stick izquierdo se pulsa hacia arriba, ambos motores se alimentarán con un valor positivo, haciendo que el robot se mueva hacia delante. Si se pulsa hacia abajo, ambos motores recibirán un valor negativo, lo que hará que el robot retroceda. Un principio similar se aplica a la rotación: si se empuja el stick derecho hacia la derecha, las ruedas izquierdas girarán hacia delante y las derechas hacia atrás, provocando la rotación. Lo contrario ocurre al empujar el stick hacia la izquierda. Si ambos sticks son empujados al mismo tiempo, digamos que el stick Y izquierdo está en 1 y el stick X derecho también está en 1, el valor de las ruedas izquierdas será :math:`1+1=2` (que se recorta a 1 en el SDK) y las ruedas derechas serán :math:`1-1=0`, lo que provoca una curva hacia la derecha.
fr_ca: Ici, si le manche gauche est pressé vers le haut, les deux moteurs seront alimentés par une valeur positive, ce qui fera avancer le robot. S'il est poussé vers le bas, les deux moteurs recevront une valeur négative, ce qui fera reculer le robot. Un principe similaire s'applique à la rotation : si le manche droit est poussé vers la droite, les roues gauches tourneront vers l'avant tandis que les roues droites tourneront vers l'arrière, ce qui provoquera une rotation. L'inverse s'applique à la poussée du manche vers la gauche. Si les deux manche sont poussés en même temps, disons que le manche Y gauche est à 1 et que le manche X droit est également à 1, la valeur des roues gauches sera :math:`1+1=2` (qui est ramenée à 1 dans le SDK) et les roues droites seront :math:`1-1=0`, ce qui provoque une courbe vers la droite.
zh_cn: 在这里，如果向前按压左摇杆，两个电机都会被馈送一个正值，导致机器人向前移动。如果向后按压，两个电机都会被馈送一个负值，导致机器人向后移动。类似的原理也适用于旋转：如果向右推右摇杆，左车轮会向前旋转，而右车轮向后旋转，导致旋转。相反的情况适用于向左推摇杆。如果两个摇杆同时被推，假设左Y摇杆在1，右X摇杆也在1，左车轮的值将是 :math:`1+1=2` （在SDK中被裁剪成1），右车轮将是 :math:`1-1=0` ，这会导致向右转向。

source: Applying omnidirectional movement with :term:`mecanum wheels <Mecanum Wheel>` operates under the same principle as adding turning into the tank example. The left stick X values will be added or subtracted to each wheel depending on how that wheel needs to rotate to get the desired movement. The only difference from turning is that rather than wheels on the same side being the same sign, wheels diagonal to each other will be the same sign.
es_mx: La aplicación del movimiento omnidireccional con :term:`ruedas mecanum <Mecanum Wheel>` funciona según el mismo principio que la adición del giro en el ejemplo del tanque. Los valores X del stick izquierdo se sumarán o restarán a cada rueda dependiendo de cómo tenga que girar esa rueda para obtener el movimiento deseado. La única diferencia con el giro es que en lugar de que las ruedas del mismo lado tengan el mismo signo, las ruedas diagonales entre sí tendrán el mismo signo.
fr_ca: L'application d'un mouvement omnidirectionnel avec des :term:`roues mecanum <Mecanum Wheel>` fonctionne selon le même principe que l'ajout d'une rotation dans l'exemple d'un système de type tank. Les valeurs X du manche gauche seront ajoutées ou soustraites à chaque roue en fonction de la façon dont cette roue doit tourner pour obtenir le mouvement désiré. La seule différence avec le tournage est qu'au lieu que les roues du même côté soient du même signe, les roues en diagonale seront du même signe.
zh_cn: 使用 :term:`麦轮 <Mecanum Wheel>` 进行全向运动的原理与将转弯添加到坦克示例中的原理相同。根据车轮需要如何旋转以获得所需的运动，左摇杆的X值将被加减到每个车轮上。与转弯的唯一区别是，不是同一侧的车轮是相同的符号，而彼此对角线的车轮将是相同的符号。

source: We want a positive left stick X value to correlate to rightward strafing. If we refer back to the vectoring image, this means that the front left and back right need to rotate forward, while the back left and front right need to rotate backwards. So, we should add the x value to the front left and back right and subtract it from the back right and front left:
es_mx: Queremos un valor positivo de X en el stick izquierdo para correlacionarlo con un giro hacia la derecha. Si volvemos a la imagen de vectorización, esto significa que la parte delantera izquierda y trasera derecha necesitan rotar hacia delante, mientras que la parte trasera izquierda y delantera derecha necesitan rotar hacia atrás. Por lo tanto, debemos añadir el valor x a la parte delantera izquierda y trasera derecha y restarlo de la parte trasera derecha y delantera izquierda:
fr_ca: Nous voulons que la valeur X du manche gauche soit positive pour correspondre à un déplacement latéral vers la droite. Si nous nous référons à l'image de vectorisation, cela signifie que l'avant gauche et l'arrière droit doivent tourner vers l'avant, tandis que l'arrière gauche et l'avant droit doivent tourner vers l'arrière. Nous devons donc ajouter la valeur x à l'avant gauche et à l'arrière droit et la soustraire de l'arrière droit et de l'avant gauche :
zh_cn: 我们想要一个正的左摇杆X值与向右平移相关联。如果我们参考矢量图像，这意味着前左和后右需要向前旋转，而后左和前右需要向后旋转。因此，我们应该将X值添加到前左和后右，并从后右和前左减去它：

source: Most FTC motors spin counterclockwise when viewed from their face when given positive power by default, with the exception of NeveRests. If your drivetrain uses an even number of gears, this will reverse the direction the motors spin in.
es_mx: La mayoría de los motores FTC giran en sentido contrario a las agujas del reloj cuando se les da potencia positiva por defecto, con la excepción de los NeveRest. Si su chasis utiliza un número par de engranajes, esto invertirá la dirección de giro de los motores.
fr_ca: La plupart des moteurs FTC tournent dans le sens inverse des aiguilles d'une montre lorsqu'ils sont alimentés par défaut, à l'exception des NeveRest. Si votre transmission utilise un nombre pair d'engrenages, le sens de rotation des moteurs sera inversé.
zh_cn: 大多数FTC电机在默认情况下正功率时从它们的表面看是逆时针旋转的，但NeveRest除外。如果你的传动系统使用偶数个齿轮，这将逆转电机旋转的方向。

source: On most drivetrains, you will need to reverse the left side for positive power to move forwards with most motors, and reverse the right side with NeveRests. The presence of gearing between the motor gearbox and the wheel may swap this, which is the case for the goBILDA Strafer and the REV Mecanum Drivetrain Kit.
es_mx: En la mayoría de las chasises, tendrá que invertir el lado izquierdo para que la potencia positiva se mueva hacia adelante con la mayoría de los motores, e invertir el lado derecho con NeveRests. La presencia de engranajes entre la caja de engranajes del motor y la rueda puede cambiar esto, que es el caso para el goBILDA Strafer y el REV Mecanum Drivetrain Kit.
fr_ca: Sur la plupart des transmissions, vous devrez inverser le côté gauche pour obtenir une puissance positive afin d'avancer avec la plupart des moteurs, et inverser le côté droit avec les NeveRest. La présence d'un engrenage entre la boîte de vitesses du moteur et la roue peut modifier cette situation, ce qui est le cas pour le goBILDA Strafer et le REV Mecanum Drivetrain Kit.
zh_cn: 在大多数传动系统上，您需要反转左侧以获得正功率才能与大多数电机一起前进，并使用NeveRest反转右侧。电机变速箱和车轮之间的齿轮传动可能会交换这一点，goBILDA Strafer和REV Mecanum Drivetrain Kit就是这种情况。

source: This is the same as the tank example, except now with 4 motors and the strafing component added. Similarly to the tank example, the Y component is added to all wheels, and the right X (rx) is added to the left wheels and subtracted from the right. Now, we have added a left X component (x) that allows us to strafe rightward. In doing that, however, we have actually allowed for strafing in any direction. If you think about it, pressing the left joystick to the left will do the same thing in reverse, which is what is needed to strafe left. If it is pressed at 45 degrees, the x and y components of the joystick will be equal. This will cause two diagonal motors to cancel, allowing for diagonal movement. This same effect applies to every angle of the joystick.
es_mx: Esto es lo mismo que el ejemplo del tanque, excepto que ahora con 4 motores y el componente de ametrallamiento añadido. De forma similar al ejemplo del tanque, el componente Y se añade a todas las ruedas, y el X derecho (rx) se añade a las ruedas izquierdas y se resta de las derechas. Ahora, hemos añadido un componente X izquierdo (x) que nos permite ametrallar hacia la derecha. Al hacer esto, sin embargo, en realidad hemos permitido ametrallar en cualquier dirección. Si lo piensas, pulsar el joystick izquierdo hacia la izquierda hará lo mismo a la inversa, que es lo que se necesita para ametrallar hacia la izquierda. Si se pulsa a 45 grados, los componentes x e y del joystick serán iguales. Esto hará que dos motores diagonales se cancelen, permitiendo el movimiento diagonal. Este mismo efecto se aplica a todos los ángulos del joystick.
fr_ca: Il s'agit du même exemple que celui du système de type tank, mais avec 4 moteurs et l'ajout de la composante de déplacement latéral. Comme dans l'exemple du tank, la composante Y est ajoutée à toutes les roues, et la composante X droite (rx) est ajoutée aux roues gauches et soustraite aux roues droites. Nous avons maintenant ajouté une composante X gauche (x) qui nous permet de nous diriger vers la droite. Cependant, en faisant cela, nous avons en fait autorisé le déplacement latéral dans n'importe quelle direction. Si vous y réfléchissez, le fait d'appuyer sur le joystick gauche vers la gauche fera la même chose en sens inverse, ce qui est nécessaire pour virer à gauche. Si l'on appuie sur le joystick à 45 degrés, les composantes x et y du joystick sont égales. Les deux moteurs diagonaux s'annulent alors, ce qui permet de se déplacer en diagonale. Ce même effet s'applique à tous les angles du joystick.
zh_cn: 这与坦克底盘示例相同，只是现在添加了4个电机和平移组件。与坦克示例类似，Y分量被添加到所有车轮上，右侧X (rx)被添加到左侧车轮上并从右侧减去。现在，我们添加了一个左侧X分量(x)，允许我们向右平移。然而，在这样做的过程中，我们实际上允许向任何方向平移。如果你想想看，向左按压左侧操纵杆会反向做同样的事情，这就是向左平移所需要的。如果以45度按压，操纵杆的x和y分量将相等。这将导致两个对角线电机取消，允许对角线移动。同样的效果适用于操纵杆的每个角度。
