Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/mecanum-drive.po
Languages: es_mx, fr_ca, zh_cn

source: Now that we have a functioning mecanum driving program, there are a few things that can be done to clean it up. The first of these would be multiplying the left X value by something to counteract imperfect strafing. Doing this will make the drive feel more accurate on non axis aligned directions, and make field centric driving more accurate. In this tutorial, we will use 1.1, but it's really up to driver preference.
es_mx: Ahora que tenemos un programa de conducción mecanum que funciona, hay algunas cosas que se pueden hacer para limpiarlo. La primera de ellas sería multiplicar el valor X izquierdo por algo para contrarrestar el ametrallamiento imperfecto. Hacer esto hará que la conducción se sienta más precisa en direcciones no alineadas con el eje, y hará que la conducción centrada en el campo sea más precisa. En este tutorial, usaremos 1.1, pero depende de las preferencias del conductor.
fr_ca: Maintenant que nous avons un programme de conduite mécanum qui fonctionne, il y a plusieurs choses à faire pour l'améliorer. La première d'entre elles serait de multiplier la valeur X de gauche par quelque chose pour contrecarrer le déplacement latéral imparfait. Cela rendra la conduite plus précise sur les directions non alignées sur l'axe, et rendra la conduite centrée sur le champ plus précise. Dans ce tutoriel, nous utiliserons la version 1.1, mais c'est une question de préférence pour le pilote.
zh_cn: 现在我们有了一个正常运行的麦轮驱动程序，可以做一些事情来清理它。第一步是将左X值乘以某个值以抵消不完美的平移。这样做将使驱动器在非轴对齐方向上感觉更准确，并使以场为中心的驱动更准确。在本教程中，我们将使用1.1，但这实际上取决于驾驶偏好。

source: The other improvement we can make is scale the values into the range of -1 to 1.
es_mx: La otra mejora que podemos hacer es escalar los valores en el rango de -1 a 1.
fr_ca: L'autre amélioration que nous pouvons apporter est une mise à l'échelle des valeurs dans la plage de -1 à 1.
zh_cn: 我们可以做的另一个改进是将值缩放到-1到1的范围内。

source: Since the SDK simply clips (limits) the powers to that range, we can lose the ratio we are looking for unless we proactively put all the numbers back in that range while still maintaining our calculated ratio. For example, if we calculate values of 0.4, 0.1, 1.1, and 1.4, they will be clipped to 0.4, 0.1, 1.0, and 1.0, which is not the same ratio. Instead, we need to divide all of them by the largest power's absolute value when it exceeds 1:
es_mx: Dado que el SDK simplemente recorta (limita) las potencias a ese rango, podemos perder la relación que estamos buscando a menos que proactivamente pongamos todos los números de nuevo en ese rango mientras seguimos manteniendo nuestra relación calculada. Por ejemplo, si calculamos valores de 0,4, 0,1, 1,1 y 1,4, se recortarán a 0,4, 0,1, 1,0 y 1,0, que no es la misma relación. En lugar de eso, tenemos que dividirlos todos por el valor absoluto de la potencia mayor cuando supere 1:
fr_ca: Étant donné que le SDK se contente d'écrêter (limiter) les puissances à cette plage, nous pouvons perdre le rapport que nous recherchons à moins que nous ne ramenions de manière proactive tous les nombres dans cette plage tout en conservant notre rapport calculé. Par exemple, si nous calculons des valeurs de 0,4, 0,1, 1,1 et 1,4, elles seront ramenées à 0,4, 0,1, 1,0 et 1,0, ce qui ne correspond pas au même rapport. Au lieu de cela, nous devons les diviser par la valeur absolue de la plus grande puissance lorsqu'elle est supérieure à 1 :
zh_cn: 由于 SDK 只是会简单地将功率值剪切（限制）到该范围内，因此除非我们主动将所有数字放回该范围内，同时保持计算出的比率，否则就会导致丢失各个轮子功率值的比例关系。例如，如果我们计算出 0.4、0.1、1.1 和 1.4 的值，它们将被剪切为 0.4、0.1、1.0 和 1.0，这不是相同的比率。因此，当最大功率值的绝对值超过 1 时，我们需要将它们全部除以最大功率值的绝对值：

source: Make sure to set the powers on your motor and update this every loop in an opmode!
es_mx: ¡Asegúrate de configurar las potencias en tu motor y actualizar esto en cada bucle en un opmode!
fr_ca: Veillez à définir les puissances de votre moteur et à mettre à jour chaque boucle dans un mode opmode !
zh_cn: 确保在电机上设置功率，并在 opmode 模式的每个循环中更新功率！

source: Robot-Centric Final Sample Code
es_mx: Código de muestra final centrado en el robot
fr_ca: Exemple de Code Final Centré sur le Robot
zh_cn: 以机器人视角操控模式的最终示例代码

source: Field Centric
es_mx: Centrado en el Campo
fr_ca: Centré sur le terrain
zh_cn: 以场地坐标系的操控模式

source: With field centric mecanum drive, the translation joystick controls the direction of the robot relative to the field, as opposed to the robot frame. This is preferred by some drivers, and make some evasive action easier, as one can spin while translating in a given direction easier. To do this, the x/y components of the joysticks are rotated counter to the robot's angle, which is given by the IMU.
es_mx: Con el accionamiento mecanum centrado en el campo, el joystick de traslación controla la dirección del robot en relación con el campo, en contraposición a la estructura del robot. Esto es lo que prefieren algunos conductores, y facilita algunas acciones evasivas, ya que se puede girar mientras se traslada en una dirección determinada más fácilmente. Para ello, los componentes x/y de los joysticks se giran en sentido contrario al ángulo del robot, que viene dado por la IMU.
fr_ca: Dans le cas d'une conduite mécanique centrée sur le champ, le manche de translation contrôle la direction du robot par rapport au terrain, et non par rapport au châssis du robot. Certains conducteurs préfèrent cette solution, qui facilite certaines manœuvres d'évitement, car il est plus facile de tourner tout en se déplaçant dans une direction donnée. Pour ce faire, les composantes x/y des manches sont tournées dans le sens inverse de l'angle du robot, qui est donné par l'IMU.
zh_cn: 在以场地坐标系的麦轮驱动模式中，平移操纵杆控制的是机器人相对于场地的方向，而不是机器人自身参考系的方向。有些驾驶员更喜欢这种操作模式，这样可以使一些规避动作变得更容易，因为在向指定方向平移的同时可以更容易地旋转。为此，操纵杆的 x/y 分量会基于机器人的角度进行旋转，这里机器人的角度由 IMU 提供。

source: There is an IMU inside of Control Hubs (and older models of Expansion Hubs). Unlike most other hardware, it is recommended to do more than ``hardwareMap.get()`` to begin using it. Note, this is configured when creating a new configuration by default as ``imu``. See the `FTC doc page covering the IMU interface and its parameters <https://ftc-docs.firstinspires.org/programming_resources/imu/imu.html>`_ for more information. The way the IMU will be initialized here is:
es_mx: Hay una IMU dentro de los Control Hubs (y modelos antiguos de los Expansion Hubs). A diferencia de la mayoría del hardware, se recomienda hacer algo más que ``hardwareMap.get()`` para empezar a usarlo. Nota, esto se configura al crear una nueva configuración por defecto como ``imu``. Consulta la página `FTC doc page covering the IMU interface and its parameters <https://ftc-docs.firstinspires.org/programming_resources/imu/imu.html>`_ para más información. La forma en que la IMU se inicializará aquí es:
fr_ca: Les Control Hubs (et les anciens modèles d'Expansion Hubs) contiennent un IMU. Contrairement à la plupart des autres matériels, il est recommandé de faire plus que ``hardwareMap.get()`` pour commencer à l'utiliser. Notez que ceci est configuré lors de la création d'une nouvelle configuration par défaut en tant que ``imu``. Voir la page de la doc FTC couvrant l'interface IMU et ses paramètres <https://ftc-docs.firstinspires.org/programming_resources/imu/imu.html>`_ pour plus d'informations. La façon dont l'IMU sera initialisé ici est la suivante :
zh_cn: Control Hubs（以及旧型号的Expansion Hub）内部有一个IMU。与大多数其他硬件不同，建议使用 ``hardwareMap.get()`` 之外的操作来开始使用它。请注意，默认情况下，这是在创建新配置时配置为 ``imu`` 的。有关详细信息，请 `参阅FTC文档页面，其中涵盖了IMU接口及其参数 <https://ftc-docs.firstinspires.org/programming_resources/imu/imu.html>`_ 。此处初始化IMU的方式是：

source: The angle needs to be read every loop. In addition to this, while the IMU keeps a consistent zero position between OpModes (relevantly, including between autonomous and teleop), adding a bind to reset the angle is important to counteract drift and because the zero can change due to some types of disconnects.
es_mx: El ángulo necesita ser leído en cada bucle. Además de esto, mientras que la IMU mantiene una posición cero consistente entre OpModes (relevantemente, incluyendo entre autónomo y teleop), añadir un bind para reiniciar el ángulo es importante para contrarrestar la deriva y porque el cero puede cambiar debido a algunos tipos de desconexiones.
fr_ca: L'angle doit être lu à chaque boucle. En outre, bien que l'IMU conserve une position zéro cohérente entre les modes opératoires (notamment entre les modes autonome et téléopération), il est important d'ajouter une contrainte pour réinitialiser l'angle afin de contrecarrer la dérive et parce que le zéro peut changer en raison de certains types de déconnexions.
zh_cn: 每个循环都需要读取角度。除此之外，虽然IMU在OpModes之间保持一致的零位置（相关地，包括自主操作和远程操作之间），但添加绑定以重置角度对于抵消平移很重要，因为零可能会因某些类型的断开而改变。

source: ``BNO055`` objects will reset the IMU zero when ``initialize`` is called. The ``BNO055`` class is not recommended for new development. The ``IMU`` class does not have this behavior, and is the appropriate replacement as of SDK v8.1.
es_mx: Los objetos ``BNO055`` pondrán a cero la IMU cuando se llame a ``initialize``. La clase ``BNO055`` no se recomienda para nuevos desarrollos. La clase ``IMU`` no tiene este comportamiento, y es el reemplazo apropiado a partir de SDK v8.1.
fr_ca: Les objets ``BNO055`` remettent à zéro l'IMU lorsque ``initialize`` est appelé. La classe ``BNO055`` n'est pas recommandée pour les nouveaux développements. La classe ``IMU`` n'a pas ce comportement, et est le remplacement approprié à partir du SDK v8.1.
zh_cn: ``BNO055`` 对象将在调用 ``initialize`` 时重置IMU零。 ``BNO055`` 类不推荐用于新开发。 ``IMU`` 类没有此行为，并且是SDKv8.1的适当替换。

source: Then, the translation joystick values need to be counterrotated by the robot heading. The IMU returns heading, however we need to rotate the movement counter to the robot's rotation, so its negative is taken. The joystick values are a vector, and rotating a vector in 2D requires this formula (`proved here <https://matthew-brett.github.io/teaching/rotation_2d.html>`_), where :math:`x_1` and :math:`y_1` are the components of the original vector, :math:`\beta` is the angle to rotate by, and :math:`x_2` and :math:`y_2` are the components of the resultant vector.
es_mx: Entonces, los valores del joystick de traslación necesitan ser contrarrotados por el rumbo del robot. La IMU devuelve el rumbo, sin embargo necesitamos rotar el movimiento en sentido contrario a la rotación del robot, por lo que se toma su negativo. Los valores del joystick son un vector, y rotar un vector en 2D requiere esta fórmula (`proved here <https://matthew-brett.github.io/teaching/rotation_2d.html>`_), donde :math:`x_1` y :math:`y_1` son los componentes del vector original, :math:`\beta` es el ángulo de rotación, y :math:`x_2` y :math:`y_2` son los componentes del vector resultante.
fr_ca: Ensuite, les valeurs de translation du manche doivent être contrariées par le cap du robot. L'IMU renvoie le cap, mais nous devons faire tourner le mouvement dans le sens inverse de la rotation du robot, donc sa valeur négative est prise. Les valeurs du joystick sont un vecteur, et la rotation d'un vecteur en 2D nécessite cette formule (`proved here <https://matthew-brett.github.io/teaching/rotation_2d.html>`_), où :math:`x_1` et :math:`y_1` sont les composantes du vecteur original, :math:`\beta` est l'angle de rotation, et :math:`x_2` et :math:`y_2` sont les composantes du vecteur résultant.
zh_cn: 然后，平移操纵杆值需要被机器人航向反旋转。IMU返回航向，但是我们需要旋转与机器人旋转相反的运动，所以它的负数被取。操纵杆值是一个向量，在2D中旋转一个向量需要这个公式（ `在这里证明了 <https://matthew-brett.github.io/teaching/rotation_2d.html>`_ ），其中 :math:`x_1` 和 :math:`y_1` 是原始向量的分量， :math:`\beta` 是旋转的角度， :math:`x_2` 和 :math:`y_2` 是合成向量的分量。

source: x_2=x_1cos \beta - y_1sin \beta \\ y_2=x_1sin \beta + y_1cos \beta
fr_ca: x_2=x_1cos \beta - y_1sin \beta \beta y_2=x_1sin \beta + y_1cos \beta

source: Then, these rotated values can be put into the mecanum kinematics shown earlier.
es_mx: A continuación, estos valores rotados pueden introducirse en la cinemática mecanum mostrada anteriormente.
fr_ca: Ensuite, ces valeurs tournées peuvent être introduites dans la cinématique du mécanisme présentée plus haut.
zh_cn: 然后，这些旋转的值可以放入前面显示的麦轮运动学中。

source: Field-Centric Final Sample Code
es_mx: Código de Muestra Final Centrado en el Campo
fr_ca: Exemple de Code Final Centré sur le Terrain
zh_cn: 以场地为主体的最终示例代码

source: Mecanum TeleOp
zh_cn: 麦克纳姆 TeleOp

source: :download:`Blocks file download <block-code/mecanum-drive-sample.blk>`
es_mx: :download:`Blocks archivo de descarga <block-code/mecanum-drive-sample.blk>`
