Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/tutorials/vision.po
Languages: es_mx, fr_ca, zh_cn

source: Computer Vision
es_mx: Visión computarizada
fr_ca: Vision par Ordinateur
zh_cn: 计算机视觉

source: Computer vision is the process of using computers to understand digital images, such as photographs and videos. Computer vision offers object detection which is commonly needed in FTC\ |reg|.
es_mx: La visión computarizada es el proceso de utilizar ordenadores para comprender imágenes digitales, como fotografías y vídeos. La visión computarizada ofrece la detección de objetos que suele ser necesaria en FTC |reg|.
fr_ca: La vision par ordinateur est le processus qui consiste à utiliser des ordinateurs pour comprendre les images numériques, telles que les photographies et les vidéos. La vision par ordinateur permet de détecter des objets, ce qui est souvent nécessaire dans le cadre de FTC\ |reg|.
zh_cn: 计算机视觉是利用计算机理解照片和视频等数字图像的过程。计算机视觉可提供 FTC\ |reg| 中通常需要的物体检测功能。

source: Currently, there are 3 commonly used forms of computer vision: TensorFlow Lite, AprilTags, and OpenCV (via VisionPortal/EasyOpenCV).
es_mx: Actualmente, existen 3 formas de visión computarizada comúnmente utilizadas: TensorFlow Lite, AprilTags, y OpenCV (vía VisionPortal/EasyOpenCV).
fr_ca: Actuellement, il existe 3 formes de vision par ordinateur couramment utilisées : TensorFlow Lite, AprilTags et OpenCV (via VisionPortal/EasyOpenCV).
zh_cn: 目前，有 3 种常用的计算机视觉形式：TensorFlow Lite、AprilTags 和 OpenCV（通过 VisionPortal/EasyOpenCV）。

source: Officially Supported Solutions
es_mx: Soluciones con respaldo oficial
fr_ca: Solutions Officiellement Soutenues
zh_cn: 官方支持的解决方案

source: TensorFlow is Google's machine learning technology, which can be trained to detect objects. The FTC SDK uses TensorFlow Lite, which is a lightweight version of Google's TensorFlow designed to run on mobile devices. Along with Android Studio and OnBot support, TensorFlow has block support which makes it a good choice for most teams.
es_mx: TensorFlow es la tecnología de aprendizaje automático de Google, que puede entrenarse para detectar objetos. El SDK de FTC utiliza TensorFlow Lite, que es una versión ligera de TensorFlow de Google diseñada para ejecutarse en dispositivos móviles. Junto con la compatibilidad con Android Studio y OnBot, TensorFlow es compatible con bloques, lo que lo convierte en una buena opción para la mayoría de los equipos.
fr_ca: TensorFlow est la technologie d'apprentissage automatique de Google, qui peut être entraînée à détecter des objets. Le SDK FTC utilise TensorFlow Lite, qui est une version allégée de TensorFlow de Google conçue pour fonctionner sur des appareils mobiles. Outre la prise en charge d'Android Studio et d'OnBot, TensorFlow prend en charge les blocs, ce qui en fait un bon choix pour la plupart des équipes.
zh_cn: TensorFlow是谷歌的机器学习技术，可以通过训练来检测物体。FTC SDK使用TensorFlow Lite，这是谷歌TensorFlow的轻量级版本，提供在移动设备上使用与运行。除了支持Android Studio和OnBot之外，TensorFlow还支持图形化编程，这使得它成为大多数团队的不错选择。

source: Sample OpModes for TensorFlow being used for pixel detection (CENTERSTAGE) can be found `here <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Blocks-Sample-OpMode-for-TFOD>`__ (Blocks), and a Java example can be found `here <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Java-Sample-OpMode-for-TFOD>`__.
es_mx: Ejemplos de OpModes para TensorFlow que se utilizan para la detección de píxeles (CENTERSTAGE) se pueden encontrar `aquí <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Blocks-Sample-OpMode-for-TFOD>`__ (Bloques), y un ejemplo Java se puede encontrar `aquí <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Java-Sample-OpMode-for-TFOD>`__.
fr_ca: Des exemples d'OpModes pour TensorFlow utilisés pour la détection de pixels (CENTERSTAGE) peuvent être trouvés `here <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Blocks-Sample-OpMode-for-TFOD>`__ (Blocks), et un exemple Java peut être trouvé `here <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Java-Sample-OpMode-for-TFOD>`__.
zh_cn: 用于像素检测（CENTERSTAGE）的 TensorFlow OpModes 示例可在 `此处 <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Blocks-Sample-OpMode-for-TFOD>`__ （块）中找到，Java 示例可在 `此处 <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Java-Sample-OpMode-for-TFOD>`__ 中找到。

source: *FIRST*\ |reg| has released a tool called FTC-ML to train your own TensorFlow Lite model for detecting custom objects. Details about FTC-ML can be found `on FTC Docs <https://ftc-docs.firstinspires.org/projects/ftcdocs-archive/en/latest/ftc_ml/index.html>`_.
fr_ca: *FIRST*\ |reg| a publié un outil appelé FTC-ML pour entraîner votre propre modèle TensorFlow Lite pour la détection d'objets personnalisés. Les détails de FTC-ML peuvent être trouvés `sur FTC Docs <https://ftc-docs.firstinspires.org/projects/ftcdocs-archive/en/latest/ftc_ml/index.html>`_.

source: AprilTags detect specific low-resolution, black-and-white images that are placed on various parts of the field. AprilTags are a great way to detect specific parts of the fields at wide angles, distances, and in a variety of lighting conditions. AprilTags are supported in OnBot Java, Android Studio, and Blocks.
es_mx: Las AprilTags detectan imágenes específicas en blanco y negro de baja resolución que se colocan en diversas partes del campo. Los AprilTags son una gran manera de detectar partes específicas de los campos en ángulos amplios, distancias, y en una variedad de condiciones de iluminación. AprilTags es compatible con OnBot Java, Android Studio y Blocks.
fr_ca: Les AprilTags détectent des images noir et blanc spécifiques à faible résolution qui sont placées sur différentes parties du champ. Les AprilTags sont un excellent moyen de détecter des parties spécifiques des champs sous de grands angles, à de grandes distances et dans des conditions d'éclairage variées. Les AprilTags sont pris en charge par OnBot Java, Android Studio et Blocks.
zh_cn: AprilTags检测可以放置在自定义元素上的特定低分辨率黑白图像。Apriltags是在各种照明条件下检测自定义元素的好方法。由于AprilTags是EasyOpenCV的插件，因此团队必须已经在他们的机器人上安装了EasyOpenCV。AprilTags仅在Android Studio中受支持。

source: You can learn more about implementing AprilTags `on FTC Docs <https://ftc-docs.firstinspires.org/en/latest/apriltag/vision_portal/apriltag_intro/apriltag-intro.html>`__. Supported AprilTag images are available on this `PDF <https://ftc-docs.firstinspires.org/en/latest/_downloads/ba0d87cc0d392ad0bad054d4b81e9077/AprilTag_0-20_family36h11.pdf>`__.
fr_ca: Vous pouvez en savoir plus sur la mise en œuvre des AprilTags `sur FTC Docs <https://ftc-docs.firstinspires.org/en/latest/apriltag/vision_portal/apriltag_intro/apriltag-intro.html>`__. Les images AprilTag prises en charge sont disponibles sur ce `PDF <https://ftc-docs.firstinspires.org/en/latest/_downloads/ba0d87cc0d392ad0bad054d4b81e9077/AprilTag_0-20_family36h11.pdf>`__.

source: Introduced with FTC SDK v8.2, the VisionPortal API integrates the `EasyOpenCV <https://github.com/OpenFTC/EasyOpenCV>`__ project into the FTC SDK. With VisionPortal, you can attach multiple VisionProcessors to a single camera. VisionProcessors are an easy way to create OpenCV pipelines, which allows for custom manipulation and processing to be applied to each incoming frame. VisionPortal is the most powerful form of computer vision, but it is also the hardest to use. Therefore, we can only recommend it to more advanced teams.
es_mx: Introducida con FTC SDK v8.2, la API VisionPortal integra el proyecto `EasyOpenCV <https://github.com/OpenFTC/EasyOpenCV>`__ en FTC SDK. Con VisionPortal, puede adjuntar varios VisionProcessors a una sola cámara. Los VisionProcessors son una forma sencilla de crear pipelines OpenCV, que permiten aplicar manipulaciones y procesamientos personalizados a cada fotograma entrante. VisionPortal es la forma más potente de visión por computadora, pero también es la más difícil de usar. Por lo tanto, sólo podemos recomendarlo a los equipos más avanzados.
fr_ca: Introduite avec le FTC SDK v8.2, l'API VisionPortal intègre le projet `EasyOpenCV <https://github.com/OpenFTC/EasyOpenCV>`__ dans le FTC SDK. Avec VisionPortal, vous pouvez associer plusieurs VisionProcessors à une seule caméra. Les VisionProcessors sont un moyen simple de créer des pipelines OpenCV, qui permettent d'appliquer des manipulations et des traitements personnalisés à chaque image entrante. VisionPortal est la forme la plus puissante de vision par ordinateur, mais c'est aussi la plus difficile à utiliser. C'est pourquoi nous ne pouvons le recommander qu'aux équipes les plus avancées.
zh_cn: 随着 FTC SDK v8.2 的推出，VisionPortal API 将 `EasyOpenCV <https://github.com/OpenFTC/EasyOpenCV>`__ 项目集成到 FTC SDK 中。有了 VisionPortal，您可以将多个 VisionProcessor 附加到单个相机上。VisionProcessors 是创建 OpenCV 管道的简便方法，它允许对每个输入帧进行自定义操作和处理。VisionPortal 是计算机视觉功能最强大的形式，但也是最难使用的。因此，我们只能向更高级的团队推荐它。

source: Additional Vision Resources
es_mx: Recursos adicionales sobre la visión
fr_ca: Ressources Supplémentaires sur la Vision
zh_cn: 其他视觉资源

source: EasyOpenCV Simulator
es_mx: Simulador EasyOpenCV
fr_ca: EasyOpenCV Simulateur
zh_cn: EasyOpenCV模拟器

source: EasyOpenCV Simulator is a straightforward way to test your pipelines directly on your computer. It supports Windows, macOS, and Linux, and simulates a portion of the FTC SDK structure including the VisionPortal API, allowing you to copy and paste pipelines.
es_mx: EasyOpenCV Simulator es una forma sencilla de probar tus pipelines directamente en tu ordenador. Es compatible con Windows, macOS y Linux, y simula una parte de la estructura del SDK de FTC, incluida la API VisionPortal, lo que le permite copiar y pegar pipelines.
fr_ca: EasyOpenCV Simulateur est un moyen simple de tester vos pipelines directement sur votre ordinateur. Il est compatible avec Windows, macOS et Linux, et simule une partie de la structure du SDK FTC, y compris l'API VisionPortal, ce qui vous permet de copier et de coller des pipelines.
zh_cn: EasyOpenCV Simulator是直接在计算机上测试的直接方法，它支持Windows、macOS和Linux，并模拟FTC SDK结构的一部分，允许您复制和粘贴。

source: You can find EasyOpenCV Simulator `here <https://github.com/deltacv/EOCV-Sim>`__.
es_mx: Puede encontrar EasyOpenCV Simulator `aquí <https://github.com/deltacv/EOCV-Sim>`__.
fr_ca: Vous pouvez trouver EasyOpenCV Simulateur ici <https://github.com/deltacv/EOCV-Sim>`__.
zh_cn: 您可以在 `这里 <https://github.com/deltacv/EOCV-Sim>`__ 找到 EasyOpenCV 模拟器。

source: FTC\ |reg| Dashboard
fr_ca: Tableau de bord FTC\ |reg|

source: FTC Dashboard runs a dashboard webpage on the Control Hub that, among other things, streams a live preview of a connected camera. This is a very useful tool for testing and debugging vision applications.
es_mx: FTC Dashboard ejecuta una página web en el Control Hub que, entre otras cosas, transmite una vista previa en directo de una cámara conectada. Se trata de una herramienta muy útil para probar y depurar aplicaciones de visión.
fr_ca: FTC Dashboard exécute une page web de tableau de bord sur le Control Hub qui, entre autres, diffuse un aperçu en direct d'une caméra connectée. Il s'agit d'un outil très utile pour tester et déboguer les applications de vision.
zh_cn: FTC Dashboard 在控制集线器上运行一个仪表盘网页，除其他功能外，还可以流式传输所连接摄像头的实时预览。这是测试和调试视觉应用的一个非常有用的工具。

source: FTC Dashboard is not legal to run during matches, make sure it is disabled during a competition. More information can be found `here <https://acmerobotics.github.io/ftc-dashboard/competition>`__.
es_mx: FTC Dashboard no es legal para ejecutar durante los partidos, asegúrese de que está desactivado durante una competencia. Puedes encontrar más información `aquí <https://acmerobotics.github.io/ftc-dashboard/competition>`__.
fr_ca: Le tableau de bord FTC n'est pas autorisé à fonctionner pendant les matchs, assurez-vous qu'il est désactivé pendant une compétition. Vous trouverez plus d'informations ici <https://acmerobotics.github.io/ftc-dashboard/competition>`__.
zh_cn: 在比赛期间运行 FTC Dashboard 是不合法的，请确保在比赛期间禁用它。更多信息请 `参见 <https://acmerobotics.github.io/ftc-dashboard/competition>`__ 。

source: You can find FTC Dashboard `here <https://github.com/acmerobotics/ftc-dashboard>`__.
es_mx: Puede encontrar el FTC Dashboard `aquí <https://github.com/acmerobotics/ftc-dashboard>`__.
fr_ca: Vous pouvez trouver le tableau de bord de FTC ici <https://github.com/acmerobotics/ftc-dashboard>`__.
zh_cn: 您可以在 `这里 <https://github.com/acmerobotics/ftc-dashboard>`__ 找到 FTC Dashboard。

source: Scrcpy is an easy way to display and control Android devices connected over USB. It supports Linux, Windows, and macOS, offers low latency, requires low resources, and has great performance. It is extremely useful for debugging vision code on a Control Hub, as it will enable you to see the camera output in near real time. It can also be used with a robot controller phone, however the camera output can be seen on the phone's screen.
es_mx: Scrcpy es una forma sencilla de visualizar y controlar dispositivos Android conectados a través de USB. Es compatible con Linux, Windows y macOS, ofrece baja latencia, requiere pocos recursos y tiene un gran rendimiento. Es extremadamente útil para depurar código de visión en un Control Hub, ya que te permitirá ver la salida de la cámara casi en tiempo real. También se puede utilizar con un teléfono controlador de robot, sin embargo, la salida de la cámara se puede ver en la pantalla del teléfono.
fr_ca: Scrcpy est un moyen simple d'afficher et de contrôler les appareils Android connectés en USB. Il prend en charge Linux, Windows et macOS, offre une faible latence, nécessite peu de ressources et offre d'excellentes performances. Il est extrêmement utile pour déboguer le code de vision sur un Hub de contrôle, car il vous permettra de voir la sortie de la caméra presque en temps réel. Il peut également être utilisé avec un téléphone contrôleur de robot, mais la sortie de la caméra peut être vue sur l'écran du téléphone.
zh_cn: Scrcpy 是显示和控制通过 USB 连接的安卓设备的简便方法。它支持 Linux、Windows 和 macOS，具有低延迟、低资源需求和高性能的特点。它对调试控制集线器上的视觉代码非常有用，因为它能让你近乎实时地看到摄像头的输出。它还可以与机器人控制器手机一起使用，不过摄像头输出可以在手机屏幕上看到。

source: You can find scrcpy `here <https://github.com/Genymobile/scrcpy>`__.
es_mx: Puedes encontrar scrcpy `aquí <https://github.com/Genymobile/scrcpy>`__.
fr_ca: Vous pouvez trouver scrcpy `ici <https://github.com/Genymobile/scrcpy>`__.
zh_cn: 您可以在 `这里 <https://github.com/Genymobile/scrcpy>`__ 找到 scrcpy。

source: *FIRST*\ |reg| has released a tool called FTC-ML to train your own TensorFlow Lite model for detecting custom objects. Details about FTC-ML can be found `on FTC Docs <https://ftc-docs.firstinspires.org/ftc_ml/index.html>`_.
es_mx: *FIRST* |reg| ha lanzado una herramienta llamada FTC-ML para entrenar tu propio modelo TensorFlow Lite para detectar objetos personalizados. Los detalles sobre FTC-ML se pueden encontrar `en FTC Docs <https://ftc-docs.firstinspires.org/ftc_ml/index.html>`_.
zh_cn: *FIRST*\ |reg| 发布了一款名为 FTC-ML 的工具，用于训练自己的 TensorFlow Lite 模型，以检测自定义对象。有关 FTC-ML 的详细信息，请访问 `FTC 文档 <https://ftc-docs.firstinspires.org/ftc_ml/index.html>`_。

source: You can learn more about implementing AprilTags `on FTC Docs <https://ftc-docs.firstinspires.org/en/latest/apriltag/vision_portal/apriltag_intro/apriltag-intro.html>`__. Supported AprilTag images are available on this `pdf <https://www.dotproduct3d.com/uploads/8/5/1/1/85115558/apriltags1-20.pdf>`__.
es_mx: Puede obtener más información sobre la implementación de AprilTags `en FTC Docs <https://ftc-docs.firstinspires.org/en/latest/apriltag/vision_portal/apriltag_intro/apriltag-intro.html>`__. Las imágenes AprilTag compatibles están disponibles en este `pdf <https://www.dotproduct3d.com/uploads/8/5/1/1/85115558/apriltags1-20.pdf>`__.
zh_cn: 有关 AprilTag 的更多信息，请访问 `FTC 文档 <https://ftc-docs.firstinspires.org/en/latest/apriltag/vision_portal/apriltag_intro/apriltag-intro.html>`__。支持的 AprilTag 图像可在此 `pdf <https://www.dotproduct3d.com/uploads/8/5/1/1/85115558/apriltags1-20.pdf>`___ 上获取。
