Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/fastener-guide.po
Languages: es_mx, fr_ca

source: Fastener Guide
es_mx: Guía de sujetadores
fr_ca: Guide des fixations

source: If you want your robot to stay in one piece, you will need fasteners. Fasteners are any pieces of hardware that mechanically join parts. This guide will discuss common types of fasteners, and how to use them on your robot.
es_mx: Si quiere que su robot se mantenga en una sola pieza, necesitará sujetadores. Los sujetadores son piezas de ferretería que unen piezas mecánicamente. En esta guía se describen los tipos más comunes de sujetadores y cómo utilizarlos en su robot.
fr_ca: Si vous voulez que votre robot reste en un seul morceau, vous aurez besoin d'attaches. Les fixations sont des éléments de quincaillerie qui permettent d'assembler mécaniquement des pièces. Ce guide présente les types de fixations les plus courants et explique comment les utiliser sur votre robot.

source: Threaded Fasteners
es_mx: Sujetadores Roscados
fr_ca: Fixations filetées

source: Bolts, screws and nuts are all threaded fasteners -- meaning they use a helical thread to join parts.
es_mx: Los pernos, tornillos y tuercas son elementos de sujetación roscados, es decir, que utilizan una rosca helicoidal para unir las piezas.
fr_ca: Les boulons, les vis et les écrous sont tous des éléments de fixation filetés, c'est-à-dire qu'ils utilisent un filetage hélicoïdal pour assembler des pièces.

source: Thread Basics
es_mx: Conceptos básicos de roscas
fr_ca: Principes de base du fil

source: To understand threaded fasteners, you will need to know some basic terminology
es_mx: Para comprender los sujetadores enroscados, deberás conocer algunos términos básicos
fr_ca: Pour comprendre les fixations filetées, vous devez connaître quelques termes de base

source: Diagram displaying thread pitch and the difference between internal/external threads and major/minor diameters.
es_mx: Diagrama que muestra el paso de rosca y la diferencia entre roscas interiores/exteriores y diámetros mayores/menores.
fr_ca: Diagramme indiquant le pas de vis et la différence entre les filets intérieurs/extérieurs et les diamètres majeurs/mineurs.

source: External Thread
es_mx: Rosca exterior
fr_ca: Filetage extérieur

source: A thread on an outside surface. For example, bolts have external threads.
es_mx: Una rosca en una superficie exterior. Por ejemplo, los tornillos tienen rosca exterior.
fr_ca: Filetage sur une surface extérieure. Par exemple, les boulons ont un filetage extérieur.

source: Internal Thread
es_mx: Rosca interior
fr_ca: Filetage interne

source: A thread on an inside surface. For example, nuts have internal threads.
es_mx: Una rosca en una superficie interior. Por ejemplo, las tuercas tienen rosca interior.
fr_ca: Filetage sur une surface intérieure. Par exemple, les écrous ont un filetage intérieur.

source: Thread Pitch
es_mx: Paso de rosca
fr_ca: Pas de filetage

source: The distance from one thread to another, measured along the length of the thread. This can also be expressed as the number of threads per unit of length, for example threads per inch.
es_mx: La distancia de una rosca a otra, medida a lo largo de la longitud de la rosca. También puede expresarse como el número de roscas por unidad de longitud, por ejemplo, roscas por pulgada.
fr_ca: La distance d'un fil à l'autre, mesurée sur la longueur du fil. Elle peut également être exprimée en nombre de fils par unité de longueur, par exemple fils par pouce.

source: Major Diameter
es_mx: Diámetro mayor
fr_ca: Diamètre principal

source: The largest diameter of the thread profile.
es_mx: El diámetro mayor del perfil de la rosca.
fr_ca: Le plus grand diamètre du profil du filet.

source: Minor Diameter
es_mx: Diámetro menor
fr_ca: Diamètre mineur

source: The smallest diameter of the thread profile.
es_mx: El diámetro más pequeño del perfil de la rosca.
fr_ca: Le plus petit diamètre du profil du filet.

source: Thread Standards and Naming
es_mx: Normas y denominación de las roscas
fr_ca: Normes et dénomination des fils

source: There are two main systems of naming and sizing threads that you will encounter in FTC: UTS imperial sizing and ISO metric sizing.
es_mx: Existen dos sistemas principales para nombrar y clasificar las roscas que encontrará en FTC: El sistema imperial UTS y el sistema métrico ISO.
fr_ca: Il existe deux systèmes principaux de dénomination et de dimensionnement des fils que vous rencontrerez dans le cadre de FTC : les dimensions impériales UTS et les dimensions métriques ISO.

source: Imperial (UTS)
fr_ca: Impérial (UTS)

source: The universal thread standard (UTS) is based on the imperial system and commonly used to size threads in the US and Canada. A UTS thread is named by a number indicating the major diameter of the thread, followed by the thread's pitch measured in threads per inch.
es_mx: La norma de rosca universal (UTS) se basa en el sistema imperial y se utiliza habitualmente para medir las roscas en EE.UU. y Canadá. Una rosca UTS se denomina mediante un número que indica el diámetro mayor de la rosca, seguido del paso de la rosca medido en roscas por pulgada.
fr_ca: La norme universelle de filetage (UTS) est basée sur le système impérial et est couramment utilisée pour dimensionner les filetages aux États-Unis et au Canada. Un filet UTS est désigné par un nombre indiquant le diamètre principal du filet, suivi du pas du filet mesuré en filets par pouce.

source: For major diameters of |frac14|" or greater, first number is simply the major diameter in inches. For those smaller than |frac14|", the following code is used:
es_mx: Para diámetros mayores de |frac14|" o superiores, el primer número es simplemente el diámetro mayor en pulgadas. Para los menores de |frac14|", se utiliza el siguiente código:
fr_ca: Pour les diamètres majeurs de |frac14|" ou plus, le premier chiffre est simplement le diamètre majeur en pouces. Pour les diamètres inférieurs à |frac14|", le code suivant est utilisé :

source: Major Diameter (inches)
es_mx: Diámetro mayor (pulgadas)
fr_ca: Diamètre principal (en pouces)

source: Some common imperial thread sizes in FTC include |frac14|-20 (one quarter inch major diameter, 20 threads per inch) and #6-32 (0.138 inch major diameter, 32 threads per inch)
es_mx: Algunos tamaños comunes de rosca imperial en FTC incluyen |frac14|-20 (un cuarto de pulgada de diámetro mayor, 20 roscas por pulgada) y #6-32 (0,138 pulgadas de diámetro mayor, 32 roscas por pulgada).
fr_ca: Parmi les tailles de filets impériaux courantes en FTC, citons |frac14|-20 (diamètre principal d'un quart de pouce, 20 filets par pouce) et #6-32 (diamètre principal de 0,138 pouce, 32 filets par pouce).

source: Metric (ISO)
es_mx: Sistema métrico (ISO)
fr_ca: Métrique (ISO)

source: The ISO metric thread standard is commonly used worldwide, and for many products sold by FTC vendors.
es_mx: La norma de roscas métricas ISO es de uso común en todo el mundo, y para muchos productos vendidos por los proveedores de FTC.
fr_ca: La norme ISO sur les filetages métriques est couramment utilisée dans le monde entier et pour de nombreux produits vendus par les fournisseurs de FTC.

source: A metric thread is designated by the letter M followed by the outer diameter in millimeters, for example M4 for a 4 mm major diameter bolt. This is then followed by a "x" and the pitch, also in millimeters. For example, "M4X0.7" means a M4 thread with a 0.7 mm pitch.
es_mx: Una rosca métrica se designa con la letra M seguida del diámetro exterior en milímetros, por ejemplo M4 para un tornillo de 4 mm de diámetro mayor. A continuación, se añade una "x" y el paso, también en milímetros. Por ejemplo, "M4X0,7" significa una rosca M4 con un paso de 0,7 mm.
fr_ca: Un filet métrique est désigné par la lettre M suivie du diamètre extérieur en millimètres, par exemple M4 pour un boulon de 4 mm de diamètre. Il est ensuite suivi d'un "x" et du pas, également en millimètres. Par exemple, "M4X0,7" signifie un filet M4 avec un pas de 0,7 mm.

source: Bolts
es_mx: Pernos
fr_ca: Boulons

source: Bolts are the most commonly used fastener in FTC.
es_mx: Los pernos son los elementos de fijación más utilizados en FTC.
fr_ca: Les boulons sont les éléments de fixation les plus couramment utilisés dans la FTC.

source: There are several types of bolts you may encounter, such as:
es_mx: Hay varios tipos de pernos que puede encontrar, como:
fr_ca: Il existe plusieurs types de boulons que vous pouvez rencontrer, tels que

source: **Socket Head Bolts**
es_mx: **Tornillos de cabeza cilíndrica.**
fr_ca: **Boulons à tête creuse**

source: picture of a socket head bolt
es_mx: imagen de un tornillo de cabeza hueca
fr_ca: image d'un boulon à tête creuse

source: These bolts have a cylindrical head and are tightened and loosened with a hexagonal recess.
es_mx: Estos tornillos tienen una cabeza cilíndrica y se aprietan y aflojan con un rebaje hexagonal.
fr_ca: Ces boulons ont une tête cylindrique et se serrent ou se desserrent à l’aide d’une clé hexagonale ou Allen.

source: **Button Head Bolts**
es_mx: **Tornillos de cabeza de botón.**
fr_ca: **Boulons à tête ronde**

source: picture of a button head bolt
es_mx: imagen de un tornillo de cabeza de botón
fr_ca: image d'un boulon à tête ronde

source: These bolts have a domed head, in contrast to the flat top of a standard socket bolt.
es_mx: Estos tornillos tienen una cabeza abombada, en contraste con la parte superior plana de un tornillo de casquillo estándar.
fr_ca: Ces boulons ont une tête bombée, contrairement à la tête plate d'un boulon à douille standard.

source: **Countersunk Head Bolts**
es_mx: **Tornillos de cabeza avellanada**.
fr_ca: **Boulons à tête fraisée**

source: picture of a countersunk head bolt
es_mx: imagen de un tornillo de cabeza avellanada
fr_ca: image d'un boulon à tête fraisée

source: These bolts have a cone-shaped head, and can be used in countersunk (cone-shaped) holes to achieve a flush surface finish.
es_mx: Estos tornillos tienen una cabeza en forma de cono y pueden utilizarse en orificios avellanados (en forma de cono) para conseguir un acabado superficial enrasado.
fr_ca: Ces boulons ont une tête conique et peuvent être utilisés dans des trous fraisés (en forme de cône) pour obtenir une finition de surface affleurante.

source: **Grub Screws**
es_mx: **Tornillos Prisionero**
fr_ca: **vis sans tête**

source: picture of a grub screw
es_mx: imagen de un tornillo prisionero
fr_ca: image d'une vis sans tête

source: These bolts have no head, the recess is instead embedded within the threads. They are primarily used as set screws.
es_mx: Estos tornillos no tienen cabeza, sino que el rebaje está incrustado dentro de la rosca. Se utilizan principalmente como tornillos de fijación.
fr_ca: Ces boulons n'ont pas de tête, l'empreinte est encastrée dans le filetage. Ils sont principalement utilisés comme vis de réglage.

source: **Hex Bolts**
es_mx: **Pernos hexagonales.**
fr_ca: **Boulons à tête hexagonale**

source: picture of a hex head bolt
es_mx: imagen de un tornillo de cabeza hexagonal
fr_ca: photo d'un boulon à tête hexagonale

source: The bolts are tightened with an external hex-shaped head. When designing for these bolts, it is important to allow clearance on the side of the head for tightening.
es_mx: Los tornillos se aprietan con una cabeza hexagonal exterior. Al diseñar para estos pernos, es importante dejar espacio libre en el lado de la cabeza para el apriete.
fr_ca: Les boulons sont serrés à l'aide d'une tête extérieure en forme d'hexagone. Lors de la conception de ces boulons, il est important de prévoir un espace libre sur le côté de la tête pour le serrage.

source: Every bolt requires a "drive" -- meaning the geometry which is used to turn and install it. Each of the bolts listed above can have a variety of different types of drives:
es_mx: Cada tornillo requiere un "accionamiento", es decir, la geometría que se utiliza para girarlo e instalarlo. Cada uno de los tornillos mencionados anteriormente puede tener diferentes tipos de accionamiento:
fr_ca: Chaque boulon nécessite un "entraînement", c'est-à-dire la géométrie utilisée pour le tourner et l'installer. Chacun des boulons énumérés ci-dessus peut avoir différents types d'entraînement :

source: diagram showing thread terminology
es_mx: diagrama que muestra la terminología de la rosca
fr_ca: diagramme montrant la terminologie des fils

source: Nuts
es_mx: Tuercas
fr_ca: Écrous

source: A nut is a fastener with an internally threaded hole. Together with a bolt, they're used to join parts together.
es_mx: Una tuerca es un elemento de fijación con un orificio roscado interior. Junto con un tornillo, se utilizan para unir piezas.
fr_ca: Un écrou est un élément de fixation doté d'un trou fileté à l'intérieur. Avec un boulon, il est utilisé pour assembler des pièces.

source: Here are some types of nuts you may encounter in FTC:
es_mx: Estos son algunos tipos de tuercas que se pueden encontrar en FTC:
fr_ca: Voici quelques types d'écrous que vous pouvez rencontrer en FTC :

source: **Hex Nuts**
es_mx: *Tuercas Hexagonales**
fr_ca: **Écrous hexagonaux**

source: picture of a hex nut
es_mx: imagen de una tuerca hexagonal
fr_ca: image d'un écrou hexagonal

source: These most common type of nut. They can be tightened with a socket hex wrench.
es_mx: Son el tipo de tuerca más común. Se pueden apretar con una llave hexagonal.
fr_ca: Il s'agit du type d'écrou le plus courant. Ils peuvent être serrés à l'aide d'une clé hexagonale à douille.

source: **Square Nuts**
es_mx: **Tuercas cuadradas**
fr_ca: **Écrous carrés**

source: picture of a square nut
es_mx: imagen de una tuerca cuadrada
fr_ca: image d'un écrou carré

source: These are four-sided nuts. They work well in small spaces and can be easily inset into square pockets to keep from rotating.
es_mx: Son tuercas de cuatro caras. Funcionan bien en espacios pequeños y se pueden insertar fácilmente en bolsillos cuadrados para evitar que giren.
fr_ca: Il s'agit d'écrous à quatre faces. Ils conviennent bien aux petits espaces et peuvent être facilement insérés dans des poches carrées pour éviter qu'ils ne tournent.

source: **T-slot Nuts**
es_mx: **Tuercas de ranura en T**
fr_ca: **écrous à rainure en T**

source: picture of a T-slot nut
es_mx: imagen de una tuerca de ranura en T
fr_ca: photo d'un écrou pour rainure en T

source: These can be inserted into t-slot extrusion to tighten parts onto it.
es_mx: Se pueden insertar en la extrusión de ranura en T para apretar las piezas en ella.
fr_ca: Ils peuvent être insérés dans un profilé à rainure en T pour serrer des pièces sur celui-ci.

source: **Wing Nuts**
es_mx: *Tuercas mariposa**
fr_ca: **écrous à ailettes**

source: picture of a wing nut
es_mx: imagen de una tuerca de mariposa
fr_ca: image d'un écrou à oreilles

source: These nuts can be easily tightened without a wrench.
es_mx: Estas tuercas pueden apretarse fácilmente sin llave.
fr_ca: Ces écrous peuvent être facilement serrés sans clé.

source: **Nyloc Nuts**
es_mx: **Tuercas Nyloc**
fr_ca: **Écrous anti-vibration**

source: picture of a nyloc nut
es_mx: imagen de una tuerca nyloc
fr_ca: photo d'un écrou autofreinant

source: These nuts contain a nylon ring which prevents loosening by increasing friction on the bolt thread. We recommend using these wherever possible.
es_mx: Estas tuercas contienen un anillo de nailon que impide que se aflojen al aumentar la fricción en la rosca del tornillo. Recomendamos utilizarlas siempre que sea posible.
fr_ca: Ces écrous contiennent une bague en nylon qui empêche le desserrage en augmentant la friction sur le filetage du boulon. Nous recommandons de les utiliser dans la mesure du possible.

source: Making Threads
es_mx: Creación de roscas
fr_ca: La fabrication de fils

source: Sometimes, you will want to create new threads. This process is called threading. To create internal threads, you can use a cutting tool called a tap -- essentially a sharper version of a screw.
es_mx: A veces, querrá crear nuevas roscas. Este proceso se denomina roscado. Para crear roscas internas, puede utilizar una herramienta de corte llamada macho de roscar, que es básicamente una versión más afilada de un tornillo.
fr_ca: Il arrive que vous souhaitiez créer de nouveaux fils. Ce processus s'appelle le filetage. Pour créer des filetages intérieurs, vous pouvez utiliser un outil de coupe appelé "taraud"-- qui est en fait une version plus pointue d'une vis.

source: To create external threads, you use a tool called a die.
es_mx: Para crear roscas externas, se utiliza una herramienta llamada matriz.
fr_ca: Pour créer des filets externes, vous utilisez un outil appelé filière.

source: diagram showing a tap and die
es_mx: diagrama de un macho de roscar
fr_ca: diagramme montrant un Taraud et une filière

source: Threadlocker
es_mx: Fijador de roscas
fr_ca: Frein à filets

source: Bolts on your robot may loosen over time, especially if there are heavy vibrations. To prevent this you may use locking nuts or lock washers, which mechanically press against the thread. Another solution is to use a threadlocker, which is an adhesive compound that -- as it's name suggests -- locks threads in place.
es_mx: Los tornillos de su robot pueden aflojarse con el tiempo, especialmente si hay fuertes vibraciones. Para evitarlo, puede utilizar contratuercas o arandelas de seguridad, que presionan mecánicamente la rosca. Otra solución es utilizar un fijador de roscas, que es un compuesto adhesivo que, como su nombre indica, fija las roscas en su sitio.
fr_ca: Les boulons de votre robot peuvent se desserrer avec le temps, surtout s'ils sont soumis à de fortes vibrations. Pour éviter cela, vous pouvez utiliser des écrous de blocage ou des rondelles de blocage, qui appuient mécaniquement sur le filetage. Une autre solution consiste à utiliser un frein-filet, qui est un composé adhésif qui, comme son nom l'indique, bloque les filets en place.

source: The most popular threadlocker among FTC teams is loctite. There are two types of Loctite: blue, which is removable, and red, which is permanent (and we mean it). To use loctite, apply it to the thread of the bolts.
es_mx: El fijador de roscas más popular entre los equipos de FTC es Loctite. Hay dos tipos de Loctite: azul, que es removible, y rojo, que es permanente (y lo decimos en serio). Para usar loctite, aplícalo a la rosca de los tornillos.
fr_ca: Le frein-filet le plus populaire parmi les équipes de FTC est le Loctite. Il existe deux types de Loctite : le bleu, qui est amovible, et le rouge, qui est permanent (et nous le pensons vraiment). Pour utiliser la Loctite, appliquez-la sur le filetage des boulons.

source: It is highly recommended that teams use Loctite on all motor and :term:`servo <Servo>` mounts, as well as any mechanism prone to vibration.
es_mx: Se recomienda encarecidamente que los equipos utilicen Loctite en todos los soportes de motor y :term:`servo <Servo>`, así como en cualquier mecanismo propenso a vibraciones.
fr_ca: Il est fortement recommandé aux équipes d'utiliser de la Loctite sur tous les supports de moteur et de :term:`servo <Servo>`, ainsi que sur tout mécanisme sujet aux vibrations.

source: Blue or red Loctite should not be used with brittle plastics such as polycarbonate. This is known to cause the plastic to crack. Instead, either use a `cyanoacrolate based glue <https://www.loctiteproducts.com/products/central-pdp.html/loctite-super-pro-gel/SAP_0201DGL029Z5.html>`_ or use a `screw with a nylon patch <https://www.mcmaster.com/products/screws/socket-head-screws~/18-8-stainless-steel-thread-locking-socket-head-screws/>`_ as this will not damage the plastic.
es_mx: El Loctite azul o rojo no debe utilizarse con plásticos quebradizos como el policarbonato. Se sabe que esto hace que el plástico se agriete. En su lugar, utilice un `pegamento a base de cianoacrolato <https://www.loctiteproducts.com/products/central-pdp.html/loctite-super-pro-gel/SAP_0201DGL029Z5.html>`_ o utilice un `tornillo con un parche de nailon <https://www.mcmaster.com/products/screws/socket-head-screws~/18-8-stainless-steel-thread-locking-socket-head-screws/>`_ ya que no dañará el plástico.
fr_ca: Le Loctite bleu ou rouge ne doit pas être utilisé avec des plastiques fragiles tels que le polycarbonate. On sait que cela peut provoquer des fissures dans le plastique. Utilisez plutôt une colle à base de cyanoacrolate <https://www.loctiteproducts.com/products/central-pdp.html/loctite-super-pro-gel/SAP_0201DGL029Z5.html>`_ ou utilisez une vis avec un patch en nylon <https://www.mcmaster.com/products/screws/socket-head-screws~/18-8-stainless-steel-thread-locking-socket-head-screws/>`_ qui n'endommagera pas le plastique.

source: Also note: **THE BOTTLE COLOR AND THE FLUID COLOR ARE REVERSED.** When we refer to the "color", we mean the fluid color. Blue loctite usually comes in a red bottle.
es_mx: Nota: ** EL COLOR DE LA BOTELLA Y EL COLOR DEL FLUIDO ESTÁN REVERTIDOS** Cuando nos referimos al "color", nos referimos al color del fluido. El loctite azul suele venir en una botella roja.
fr_ca: Notez également : **LA COULEUR DU FLACON ET LA COULEUR DU LIQUIDE SONT INVERSÉES.** Lorsque nous parlons de "couleur", nous parlons de la couleur du liquide. La loctite bleue est généralement livrée dans un flacon rouge.

source: A red bottle containing blue (removable) loctite, and a blue bottle containing red (permanent) loctite
fr_ca: Un flacon rouge contenant du loctite bleue (amovible) et un flacon bleu contenant du loctite rouge (permanent).

source: Blue Loctite (removable, in red tube), Red Loctite (permanent, in blue tube)
fr_ca: Loctite bleu (amovible, dans un tube rouge), Loctite rouge (permanent, dans un tube bleu)

source: A red bottle containing blue (removable) loctite, and a blue bottle containing red (permament) loctite
es_mx: Una botella roja que contiene loctite azul (removible), y una botella azul que contiene loctite rojo (permanente).

source: Blue Loctite (removable, in red tube), Red Loctite (permament, in blue tube)
es_mx: Loctite azul (removible, en tubo rojo), Loctite rojo (permanente, en tubo azul)
