Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/tips-and-tricks.po
Languages: es_mx, fr_ca, ru_ru, zh_cn

source: Tips and Tricks
es_mx: Trucos y consejos
fr_ca: Conseils et astuces
ru_ru: Советы и Рекомендации
zh_cn: 技巧和窍门

source: Below is a collection of tips and tricks on basic building. Some of them may seem obvious, but almost every FTC\ |reg| newbie made these mistakes at least once.
es_mx: A continuación encontrarás una recopilación de consejos y trucos sobre construcción básica. Algunos de ellos pueden parecer obvios, pero casi todos los novatos FTC\ |reg| cometieron estos errores al menos una vez.
fr_ca: Vous trouverez ci-dessous un ensemble de conseils et d'astuces sur la construction de base. Certains d'entre eux peuvent sembler évidents, mais presque tous les débutants de FTC\ |reg| ont commis ces erreurs au moins une fois.
ru_ru: Ниже собраны советы и рекомендации по базовой сборке. Некоторые из них могут показаться очевидными, но почти каждый новичок FTC\ |reg| хотя бы раз совершал эти ошибки.
zh_cn: 下面收集了一些关于基本建设的技巧和窍门。其中有些可能看似显而易见，但几乎每个 FTC\ |reg| 新手都至少犯过一次这些错误。

source: **Color code your tools**. If you are using several different sizes of hex drivers (e.g. 2.5 mm and 3 mm used in goBILDA), color code them, using different color electric tape for different sizes.
es_mx: **Codifique por colores sus herramientas**. Si utiliza varios tamaños diferentes de destornilladores hexagonales (por ejemplo, los de 2,5 mm y 3 mm utilizados en goBILDA), codifíquelos por colores, utilizando cinta aislante de distinto color para los diferentes tamaños.
fr_ca: **Code couleur pour vos outils**. Si vous utilisez plusieurs tailles différentes de tournevis hexagonaux (par exemple, 2,5 mm et 3 mm utilisés dans goBILDA), codez-les par couleur, en utilisant du ruban électrique de couleur différente pour les différentes tailles.
ru_ru: **Пометьте инструменты цветовой маркировкой**. Если вы используете несколько шестигранников разных размеров (например, 2,5 мм и 3 мм, используемые в goBILDA), промаркируйте их, используя изоленту разного цвета для разных размеров.
zh_cn: **对工具进行颜色编码**。如果您使用几种不同尺寸的六角起子（例如 goBILDA 中使用的 2.5 毫米和 3 毫米），请对它们进行颜色编码，不同尺寸使用不同颜色的电工胶带。

source: **Avoid set screws**. :term:`Set screws <Set Screw>` easily come loose, causing the hub to slip. In addition, :term:`set screws <Set Screw>` damage the :term:`axle <Shaft>`, sometimes making it very hard to remove the hub later. For these reasons, whenever possible, use :term:`clamping hubs <Clamping Hub>` and collars instead of :term:`set screw <Set Screw>` ones. If you must use set screw hubs, use a non-permanent threadlocker such as `Loctite blue <https://www.loctiteproducts.com/en/products/specialty-products/specialty/loctite_threadlockerblue242.html>`_ to prevent them from loosening.
es_mx: **Evite los tornillos de fijación**. :term:`Tornillos de fijación <Set Screw>` se aflojan con facilidad, haciendo que el buje patine. Además, los :term:`tornillos de fijación <Set Screw>` dañan el :term:`eje <Shaft>`, haciendo a veces muy difícil desmontar el buje posteriormente. Por estas razones, siempre que sea posible, utilice :term:`ejes de apriete <Clamping Hub>` y collarines en lugar de :term:`tornillos de fijación <Set Screw>`. Si no tiene más remedio que utilizar bujes con tornillos de fijación, utilice un fijador de roscas no permanente como `Loctite blue <https://www.loctiteproducts.com/en/products/specialty-products/specialty/loctite_threadlockerblue242.html>`_ para evitar que se aflojen.
fr_ca: **Éviter les vis d'assemblage**. :term:`vis de réglage <Set Screw>` se détachent facilement, entraînant le glissement du moyeu. En outre, les :term:`vis de réglage <Set Screw>` endommagent l' :term:`axe <Shaft>`, rendant parfois très difficile le démontage ultérieur du moyeu. Pour ces raisons, utilisez autant que possible des :term:`moyens de serrage <Clamping Hub>` et des colliers plutôt que des :term:`vis de réglage <Set Screw>`. Si vous devez utiliser des moyeux à vis de blocage, utilisez un frein-filet non permanent tel que `Loctite blue <https://www.loctiteproducts.com/en/products/specialty-products/specialty/loctite_threadlockerblue242.html>`_ pour éviter qu'ils ne se desserrent.
ru_ru: **Избегайте прижимных винтов**. Прижимные винты <Set Screw> легко ослабевают от вибрации, что приводит к проскальзыванию муфты на оси. Кроме того, :term:`прижимные винты <Set Screw>` повреждают :term:`ось <Shaft>`, деформируя ее, и иногда из-за этого муфту практически невозможно снять. По этим причинам всегда, когда это возможно, используйте :term:`зажимные муфты <Clamping Hub>` и стопорные муфты вместо :term:`прижимных винтов <Set Screw>`. Если вам всё же приходится использовать муфты с прижимными винтами, применяйте синий фиксатор резьбы, такой как `Loctite blue <https://www.loctiteproducts.com/en/products/specialty-products/specialty/loctite_threadlockerblue242.html>`_, чтобы предотвратить их отвинчивание.
zh_cn: **避免使用固定螺丝**。 :term:`固定螺丝 <Set Screw>` 容易松动，导致 hub 打滑。此外， :term:`固定螺丝 <Set Screw>` 会损坏 :term:`车轴 <Shaft>` ，有时会导致以后很难拆卸 hub 。因此，尽可能使用 :term:`夹 hub <Clamping Hub>` 和轴环，而不是 :term:`固定螺丝 <Set Screw>` 。如果您必须使用固定螺丝 hub ，请使用非永久性螺纹锁固剂，如 `Loctite blue <https://www.loctiteproducts.com/en/products/specialty-products/specialty/loctite_threadlockerblue242.html>`_ ，以防止其松动。

source: **Only use locknuts**. Never use regular nuts in your builds - they easily come loose under vibration. Kep nuts used in TETRIX are better, but they are still prone to loosening. For best results, always use :term:`nylon locknuts <Locknut>`.
es_mx: **Utilice sólo tuercas de seguridad**. Nunca utilice tuercas normales en sus construcciones - se aflojan fácilmente bajo vibración. Las tuercas Kep utilizadas en TETRIX son mejores, pero siguen siendo propensas a aflojarse. Para obtener los mejores resultados, utilice siempre :term:`tuercas de nylon <Locknut>`.
fr_ca: **N'utilisez que des contre-écrous**. N'utilisez jamais d'écrous ordinaires dans vos constructions - ils se détachent facilement sous l'effet des vibrations. Les écrous Kep utilisés dans le TETRIX sont meilleurs, mais ils sont toujours susceptibles de se desserrer. Pour de meilleurs résultats, utilisez toujours :term:`nylon locknuts <Locknut>`.
ru_ru: **Используйте только самоконтрящиеся гайки**. Никогда не используйте обычные гайки в своих сборках - они легко откручиваются при вибрации. Гайки с фланцем, используемые в TETRIX, лучше, но они все равно склонны к откручиванию. Для достижения наилучших результатов всегда используйте :term:`нейлоновые самоконтрящиеся гайки<Locknut>`.
zh_cn: **只使用防松螺母**。切勿在制造中使用普通螺母 - 它们在振动下很容易松动。TETRIX 中使用的 Kep 螺母较好，但仍容易松动。为获得最佳效果，请始终使用 :term:`尼龙防松螺母 <Locknut>` 。

source: **Do not use socket head screws on plastic**. Using socket head screws for attaching plastic parts (in particular, for attaching servos) damages the plastic. Use button head screws instead, or use socket head screws with washers.
es_mx: **No utilice tornillos de cabeza hueca en plástico**. El uso de tornillos de cabeza hueca para fijar piezas de plástico (en particular, para fijar servos) daña el plástico. Utilice en su lugar tornillos de cabeza de botón o tornillos de cabeza cilíndrica con arandelas.
fr_ca: **N'utilisez pas de vis à tête creuse sur du plastique**. L'utilisation de vis à tête cylindrique pour fixer des pièces en plastique (en particulier, pour fixer des servos) endommage le plastique. Utilisez plutôt des vis à tête cylindrique ou des vis à tête cylindrique avec des rondelles.
ru_ru: **Избегайте применения винтов с внутренним шестигранником для соединений с пластиком**. Такие винты создают чрезмерное точечное давление, деформируя и разрушая материал (что критично при фиксации сервоприводов). Используйте винты с полукруглой (button head) головкой для распределения нагрузки или обязательно применяйте шайбы под головку стандартных винтов.
zh_cn: **不要在塑料件上使用裸的内六角螺丝**。使用内六角螺丝固定塑料部件（尤其是固定舵机）会损坏塑料。请使用钮扣头螺丝，或使用带垫圈的内六角螺丝。

source: **Make sure screws are not hitting anything**. When you are attaching a part, make sure the screw you are using is not longer than the depth of the threaded hole - otherwise, the screw will hit the bottom of the hole and you will be unable to tighten it properly.
es_mx: **Asegúrese de que los tornillos no golpean nada**. Cuando fije una pieza, asegúrese de que el tornillo que utiliza no es más largo que la profundidad del orificio roscado; de lo contrario, el tornillo golpeará el fondo del orificio y no podrá apretarlo correctamente.
fr_ca: **Assurez-vous que les vis ne heurtent rien**. Lorsque vous fixez une pièce, assurez-vous que la vis que vous utilisez n'est pas plus longue que la profondeur du trou fileté - sinon, la vis heurtera le fond du trou et vous ne pourrez pas la serrer correctement.
ru_ru: **Контролируйте длину винтов относительно глубины отверстий**. При сборке убедитесь, что используемый винт короче глубины резьбового канала. Если винт длиннее, он упрётся торец в основание отверстия, что предотвратит правильную затяжку и может привести к срыву резьбы или деформации детали.
zh_cn: **确保螺丝不会撞到任何东西**。在安装部件时，确保使用的螺丝长度不超过螺纹孔的深度，否则螺丝会碰到孔底，无法正确拧紧。

source: This situation commonly happens when attaching parts to a :term:`t-slot extrusion <Extrusion>` (Misumi, REV, goBILDA's goRAIL) - if the screw is too long, it will hit the bottom of the slot, and no matter how hard you try, you won't get a tight connection. Another case when this situation arises is when using attachment blocks where two screw holes intersect - if you are not careful, you could have one screw hitting another.
es_mx: Esta situación suele producirse al fijar piezas a una extrusión con ranura en T <Extrusion>(Misumi, REV, goRAIL de goBILDA): si el tornillo es demasiado largo, golpeará la parte inferior de la ranura y, por mucho que lo intente, no conseguirá una unión firme. Otro caso en el que se da esta situación es cuando se utilizan bloques de fijación en los que se cruzan dos orificios para tornillos: si no se tiene cuidado, un tornillo puede chocar con otro.
fr_ca: Cette situation se produit souvent lorsque l'on attache des pièces à un :term:`t-slot extrusion <Extrusion>` (Misumi, REV, goBILDA's goRAIL) - si la vis est trop longue, elle frappera le fond de la fente, et vous aurez beau essayer, vous n'obtiendrez pas une connexion serrée. Un autre cas où cette situation se présente est l'utilisation de blocs d'attache où deux trous de vis se croisent - si vous ne faites pas attention, vous pouvez avoir une vis qui frappe l'autre.
ru_ru: Эта проблема часто возникает при креплении деталей к :term:`алюминиевому профилю с Т-образным пазом <Extrusion>` (такому как Misumi, REV, goBILDA goRAIL) — если винт слишком длинный, он упрётся в дно паза, и как бы вы ни старались, надёжного соединения не получится. Другой типичный случай — использование крепёжных блоков, в которых пересекаются два резьбовых отверстия: если не проявить внимательность, один винт может упираться в другой.
zh_cn: 这种情况通常发生在将部件连接到 :term:`T型铝型材螺丝 <Extrusion>` （Misumi、REV、goBILDA 的 goRAIL）时--如果螺丝太长，就会碰到槽底，无论如何努力都无法实现紧密连接。出现这种情况的另一种情况是在使用两个螺丝孔相交的连接块时--如果不小心，可能会出现一个螺丝撞到另一个螺丝的情况。

source: **Do not connect two components which both have threaded holes**. To get tight connection, the screw should go through an **unthreaded** hole in one component into a **threaded** hole in another, or through two unthreaded holes into a nut.
es_mx: **No conecte dos componentes que tengan agujeros roscados**. Para conseguir una conexión estanca, el tornillo debe pasar por un **agujero no roscado** de un componente a un **agujero roscado** de otro, o por dos agujeros no roscados a una tuerca.
fr_ca: **Ne connectez pas deux composants qui ont tous deux des trous filetés**. Pour obtenir une connexion étanche, la vis doit passer par un trou **non fileté** d'un composant dans un trou **fileté** d'un autre composant, ou par deux trous non filetés dans un écrou.
ru_ru: **Не соединяйте напрямую две детали, имеющие резьбовые отверстия**. Для получения надёжного соединения винт должен проходить через **нерезьбовое** отверстие в одной детали и вкручиваться в **резьбовое** отверстие в другой, либо проходить через два нерезьбовых отверстия и фиксироваться гайкой.
zh_cn: **不要连接两个都有螺纹孔的部件**。要实现紧密连接，螺丝应穿过一个部件上的 **无螺纹** 孔进入另一个部件上的 **有螺纹** 孔，或穿过两个无螺纹孔进入一个螺母。

source: **Removing stripped screws**. A common problem is removing a screw in which the hex socket head is damaged or worn out and thus the regular hex driver doesn't provide enough holding power to loosen the screw. Here are some ways to deal with the problem.
es_mx: **Extracción de tornillos desgastados**. Un problema común es extraer un tornillo en el que la cabeza hexagonal está dañada o desgastada y, por tanto, el destornillador hexagonal normal no proporciona suficiente fuerza de sujeción para aflojar el tornillo. He aquí algunas formas de solucionar el problema.
fr_ca: **Démontage de vis dénudées**. Un problème courant consiste à retirer une vis dont la tête hexagonale est endommagée ou usée, de sorte que le tournevis hexagonal ordinaire n'offre pas une force de maintien suffisante pour desserrer la vis. Voici quelques solutions pour résoudre ce problème.
ru_ru: **Извлечение сорванных винтов**. Распространенной проблемой является извлечение винта, в котором шестигранная головка повреждена или изношена, и поэтому обычный шестигранник не может обеспечить достаточное усилие для его откручивания. Вот несколько способов решения этой проблемы.
zh_cn: **拆卸剥落的螺丝**。常见的问题是在拆卸螺丝时，六角螺丝刀头已损坏或磨损，因此普通的六角螺丝刀无法提供足够的夹紧力来拧松螺丝。以下是解决这一问题的一些方法。

source: Get a better hex driver. Hex drivers can also be worn out, especially ball head hex drivers. Get a new hex driver (not ball head), which is not yet worn out, and it might give you more traction with stubborn screws.
es_mx: Consiga un destornillador hexagonal mejor. Los destornilladores hexagonales también pueden desgastarse, especialmente los de cabeza esférica. Consigue un destornillador hexagonal nuevo (no de cabeza esférica), que aún no esté desgastado, y puede que te dé más tracción con tornillos rebeldes.
fr_ca: Achetez un meilleur tournevis hexagonal. Les tournevis hexagonaux peuvent également être usés, en particulier les tournevis hexagonaux à tête sphérique. Procurez-vous un nouveau tournevis hexagonal (pas à tête sphérique), qui n'est pas encore usé, et vous aurez peut-être plus de prise sur les vis récalcitrantes.
ru_ru: Купите более качественный шестигранник. Шестигранники также могут изнашиваться, особенно шестигранники с шариковой головкой. Купите новый шестигранник (не с шариковой головкой), которая еще не износилась, и это позволит вам лучше справляться с неподатливыми винтами.
zh_cn: 换一个更好的六角螺丝刀。六角起子也会磨损，尤其是球头六角起子。买一个新的六角起子（非球头），它还没有磨损，在拧顽固螺丝时可能会有更大的牵引力。

source: Put a rubber band between the tip of the hex driver and the socket. This increases the traction.
es_mx: Coloque una goma elástica entre la punta del destornillador hexagonal y el casquillo. Esto aumenta la tracción.
fr_ca: Placez un élastique entre la pointe du tournevis hexagonal et la douille. Cela augmente la traction.
ru_ru: Положите резинку между кончиком шестигранника и шлицем винта. Это увеличивает сцепление.
zh_cn: 在六角起子的顶端和套筒之间套上橡皮筋。这样可以增加牵引力。

source: Use a hacksaw or a Dremel to cut a slot in the screw head, turning it into a slotted screw that can be removed using regular flat screwdriver.
es_mx: Utiliza una sierra para metales o una Dremel para cortar una ranura en la cabeza del tornillo, convirtiéndolo en un tornillo ranurado que pueda extraerse con un destornillador plano normal.
fr_ca: Utilisez une scie à métaux ou un Dremel pour découper une fente dans la tête de la vis, la transformant ainsi en une vis à fente qui peut être retirée à l'aide d'un tournevis plat ordinaire.
ru_ru: С помощью ножовки по металлу или Дремеля прорежьте шлиц в головке винта, превратив его в винт со шлицем, который можно извлечь с помощью обычной плоской отвертки.
zh_cn: 用钢锯或电磨在螺丝头上开一个槽，把它变成一个开槽螺丝，用普通的平头螺丝刀就可以取下。

source: Use a `screw extractor <https://www.amazon.com/dp/B07GZ17QD9/>`_
es_mx: Utilice un `extractor de tornillos <https://www.amazon.com/dp/B07GZ17QD9/>`_
fr_ca: Utiliser un "extracteur de vis" <https://www.amazon.com/dp/B07GZ17QD9/>`_
ru_ru: Используйте 'винтовой экстрактор <https://www.amazon.com/dp/B07GZ17QD9/>`_.
zh_cn: 使用 `螺丝取出器 <https://www.amazon.com/dp/B07GZ17QD9/>`_

source: If nothing works, drill it out.
es_mx: Si nada funciona, taládralo.
fr_ca: Si rien ne fonctionne, percer le trou.
ru_ru: Если ничего не помогает, высверлите его.
zh_cn: 如果没有效果，就把它钻出来。

source: If that doesn't work, remember that a screw is not a screw if it is liquid metal. This is obviously not a very good idea. :)
es_mx: Si eso no funciona, recuerda que un tornillo no es un tornillo si es metal líquido. Evidentemente, no es una buena idea :)
fr_ca: Si cela ne fonctionne pas, rappelez-vous qu'une vis n'est pas une vis si elle est en métal liquide. Ce n'est évidemment pas une très bonne idée :)
ru_ru: Если и это не сработает, помните, что винт - не винт, если он из жидкого металла. Это, очевидно, не очень хорошая идея. :)
zh_cn: 如果还不行，请记住，如果是液态金属，螺丝就不是螺丝了。这显然不是个好主意。 :)

source: Needless to say, once you removed the damaged screw, discard it immediately - do not put it back in the box with other screws.
es_mx: Ni se tiene que mencionar, una vez retirado el tornillo dañado, deséchelo inmediatamente; no lo vuelva a meter en la caja con otros tornillos.
fr_ca: Il va sans dire qu'une fois que vous avez retiré la vis endommagée, jetez-la immédiatement - ne la remettez pas dans la boîte avec d'autres vis.
ru_ru: Само собой разумеется, удалив поврежденный винт, сразу же выбросьте его - не кладите обратно в коробку с другими винтами.
zh_cn: 无需多说的是，一旦取下损坏的螺丝，就应立即丢弃，不要和其他螺丝一起放回盒子里。
