Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/hardware-components/tools-list.po
Languages: es_mx, fr_ca, ru_ru

source: Tools List
es_mx: Lista de herramientas
fr_ca: Liste des outils
ru_ru: Список Инструментов

source: Here are a selection of necessary and useful tools for your team. You'll obviously need to purchase the basics such as the right screwdriver, hex keys, and drill bits. For a bit more precision and the ability to dabble in custom, opt for a drill press and bandsaw. A router might be useful for teams interested in working with wood, a great material for prototyping (and also for final iterations!)
es_mx: Aquí tienes una selección de herramientas necesarias y útiles para tu equipo. Obviamente, tendrás que comprar lo básico, como el destornillador adecuado, llaves hexagonales y brocas. Para un poco más de precisión y la posibilidad de hacer trabajos a medida, opta por un taladro de columna y una sierra de cinta. Un enrutador puede ser útil para los equipos interesados en trabajar con madera, un material estupendo para la creación de prototipos (¡y también para las iteraciones finales!).
fr_ca: Voici une sélection d'outils nécessaires et utiles pour votre équipe. Vous devrez évidemment acheter les éléments de base tels que le bon tournevis, les clés hexagonales et les mèches. Pour un peu plus de précision et la possibilité de faire du sur-mesure, optez pour une perceuse à colonne et une scie à ruban. Une défonceuse peut être utile pour les équipes intéressées par le travail du bois, un matériau idéal pour le prototypage (et aussi pour les itérations finales !).
ru_ru: Вот подборка необходимых и полезных инструментов для вашей команды. Очевидно, что вам необходимо приобрести самые необходимые инструменты, такие как отвертки, шестигранные ключи и сверла. Для более точной работы и возможности создавать кастомные детали стоит обзавестись сверлильным станком и ленточной пилой. Фрезер может пригодиться командам, работающим с деревом — отличным материалом для прототипов (и даже для финальных версий!).

source: Necessary
es_mx: Necesario
fr_ca: Nécessaire
ru_ru: Необходимые

source: **Safety glasses. Wear them when you're using power tools. Seriously.**
es_mx: **Gafas de seguridad. Úsalas cuando utilices herramientas eléctricas. En serio.
fr_ca: **Lunettes de sécurité. Portez-les lorsque vous utilisez des outils électriques. Sérieusement.
ru_ru: **Защитные очки. Надевайте их, когда пользуетесь электроинструментами. Серьезно.**

source: Philips screwdrivers, assorted sizes
es_mx: Destornilladores Philips, tamaños surtidos
fr_ca: Tournevis , tailles assorties
ru_ru: Отвертки Philips разных размеров

source: Hex drivers and hex L-keys
es_mx: Destornilladores hexagonales y llaves hexagonales en L
fr_ca: Tournevis hexagonaux et clés L hexagonales
ru_ru: Шестигранные отвертки и Г-образные шестигранники

source: 7/64" hex (Actobotics and TETRIX)
es_mx: 7/64" hex (Actobotics y TETRIX)
fr_ca: Hexagone 7/64" (Actobotics et TETRIX)
ru_ru: 7/64" шестигранник (Actobotics и TETRIX)

source: 3/32", ball head for set screws is discouraged (TETRIX)
es_mx: 3/32", se desaconseja la cabeza esférica para tornillos de fijación (TETRIX)
fr_ca: 3/32", la tête à bille pour les vis de réglage est déconseillée (TETRIX)
ru_ru: Не рекомендуется использовать сферические головки 3/32" для установочных винтов (TETRIX)

source: 2.5/3mm hex (goBILDA)
es_mx: 2,5/3 mm hexagonal (goBILDA)
fr_ca: 2.5/3mm hexagonal (goBILDA)
ru_ru: Шестигранник 2,5/3 мм (goBILDA)

source: Nut drivers and wrenches
es_mx: Destornilladores y llaves
fr_ca: Tournevis et clés à molette
ru_ru: Отвертки и гаечные ключи

source: 5.5 mm hex nut driver/wrench (REV)
es_mx: Llave de tuercas hexagonales de 5,5 mm (REV)
fr_ca: Tournevis/clé à écrou hexagonal de 5,5 mm (REV)
ru_ru: Отвертка/гаечный ключ с шестигранной головкой 5,5 мм (REV)

source: 7 mm hex nut driver/wrench (goBILDA)
es_mx: Llave de tuercas hexagonal de 7 mm (goBILDA)
fr_ca: Tournevis/clé à écrous hexagonaux de 7 mm (goBILDA)
ru_ru: Гаечный ключ/отвертка с шестигранной головкой 7 мм (goBILDA)

source: Drill and drill bits
es_mx: Taladro y brocas
fr_ca: Perceuse et mèches
ru_ru: Дрель и свёрла

source: Pliers, needle-nose and locking
es_mx: Alicates de punta y de bloqueo
fr_ca: Pince à bec effilé et pince à bec effilé
ru_ru: Плоскогубцы: узкогубцы и струбцины

source: Metal file (sandpaper not recommended, you're not working with wood)
es_mx: Lima de metal (no se recomienda papel de lija, no estás trabajando con madera)
fr_ca: Lime à métaux (le papier de verre n'est pas recommandé, vous ne travaillez pas avec du bois)
ru_ru: Напильник по металлу (наждачная бумага не рекомендуется, вы же не с деревом работаете)

source: Quick lock clamps (2+) or vise
es_mx: Abrazaderas de cierre rápido (2+) o tornillo de banco
fr_ca: Pinces à verrouillage rapide (2+) ou étau
ru_ru: Быстрозажимные струбцины (2+) или тиски

source: Hammer and mallet
es_mx: Martillo y mazo
fr_ca: Marteau et maillet
ru_ru: Молоток и киянка

source: Centerpunch
fr_ca: Coup de poing central
ru_ru: Кернер

source: Hacksaw (cuts through steel shafts)
es_mx: Sierra de arco (corta ejes de acero)
fr_ca: Scie à métaux (coupe les arbres en acier)
ru_ru: Ножовка по металлу (для резки стальных осей)

source: Wire stripper/wire cutter
es_mx: Pelacables/cortador de cables
fr_ca: Pince à dénuder/coupe-fil
ru_ru: Стриппер/кусачки для проводов

source: Zip ties/Velcro ties
es_mx: Cinchos/Ataduras de velcro
fr_ca: Liens à glissière/liens velcro
ru_ru: Стяжки/Липучки

source: Electrical tape
es_mx: Cinta aislante
fr_ca: Ruban adhésif électrique
ru_ru: Изолента

source: Stainless steel ruler and rafter square
es_mx: Regla y escuadra de acero inoxidable
fr_ca: Règle et équerre à chevrons en acier inoxydable
ru_ru: Линейка из нержавеющей стали и строительный угольник

source: Sharp pencil or very fine permanent marker
es_mx: Lápiz afilado o rotulador permanente muy fino
fr_ca: Crayon bien taillé ou marqueur permanent très fin
ru_ru: Острый карандаш или очень тонкий перманентный маркер

source: Helpful
es_mx: De utilidad
fr_ca: Utile
ru_ru: Полезное

source: Bandsaw
es_mx: Sierra de cinta
fr_ca: Scie à ruban
ru_ru: Ленточная пила

source: A bandsaw **cannot** cut through steel :term:`shafts <Shaft>`!
es_mx: ¡Una sierra de cinta **no puede** cortar :término:`ejes <Shaft>` de acero!
fr_ca: Une scie à ruban **ne peut pas** couper des :terme:`arbres <Shaft>` en acier !
ru_ru: Ленточная пила **не может** резать стальные :term:`оси <Shaft>`!

source: Impact driver
es_mx: Destornillador de impacto
fr_ca: Conducteur à percussion
ru_ru: Ударный шуруповёрт

source: Drill press
es_mx: Taladradora
fr_ca: Perceuse à colonne
ru_ru: Сверлильный станок

source: Miter saw with non-ferrous metal cutting blade
es_mx: Sierra ingletadora con hoja de corte para metales no ferrosos
fr_ca: Scie à onglet avec lame de coupe en métal non ferreux
ru_ru: Торцовочная пила с диском для цветных металлов

source: Dremel (use sparingly; Dremel =/= bandsaw)
es_mx: Dremel (utilizar con moderación; Dremel =/= sierra de cinta)
fr_ca: Dremel (à utiliser avec parcimonie ; Dremel =/= scie à ruban)
ru_ru: Дремель (использовать для тонкой работы; Дремель =/= это не ленточная пила)

source: Grip tape
es_mx: Cinta de agarre
fr_ca: Ruban adhésif
ru_ru: Абразивная лента для сцепления

source: Caliper
es_mx: Calibrador
fr_ca: Etrier
ru_ru: Штангенциркуль

source: Soldering iron
es_mx: Soldador
fr_ca: Fer à souder
ru_ru: Паяльник

source: Heat gun
es_mx: Pistola de calor
fr_ca: Pistolet thermique
ru_ru: Термофен

source: Router or table saw
es_mx: Enrutador o sierra de mesa
fr_ca: Défonceuse ou scie à table
ru_ru: Фрезер или настольная циркулярная пила

source: Jigsaw
es_mx: Sierra de calar eléctrica
fr_ca: Scie sauteuse
ru_ru: Лобзик

source: Metal brake
es_mx: Freno metálico
fr_ca: Frein métallique
ru_ru: Листогиб

source: 3d printer
es_mx: Impresora 3d
fr_ca: Imprimante 3d
ru_ru: 3Д-принтер

source: A 3d printer, CNC machine, or laser cutter greatly increases your ability to create custom robot designs. For most teams, buying a CNC or laser cutter is way beyond their budget, but you might be able to get access to one through school, local college, or nearby makerspace.
es_mx: Una impresora 3D, una máquina CNC o una cortadora láser aumentan enormemente tu capacidad para crear diseños de robots personalizados. Para la mayoría de los equipos, comprar una CNC o una cortadora láser se sale de su presupuesto, pero es posible que puedas acceder a una a través de la escuela, la universidad local o un makerspace cercano.
fr_ca: Une imprimante 3D, une machine à commande numérique ou une découpeuse laser augmentent considérablement votre capacité à créer des robots personnalisés. Pour la plupart des équipes, l'achat d'une machine à commande numérique ou d'une découpeuse laser dépasse largement leur budget, mais vous pouvez peut-être y avoir accès par l'intermédiaire de votre école, d'un établissement d'enseignement supérieur local ou d'un makerspace proche.
ru_ru: Наличие 3Д-принтера, станка с ЧПУ или лазерного станка значительно расширяет возможности создания кастомных деталей для робота. Для большинства команд покупка ЧПУ или лазерного станка недоступна по бюджету, но доступ к такому оборудованию можно получить через школу, местный колледж или ближайший фаблаб / мейкерспейс.
