Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/index.po
Languages: es_mx, fr_ca, zh_cn

source: Contributor's Guide
es_mx: Guía del colaborador
fr_ca: Guide du contributeur
zh_cn: 贡献者指南

source: Introduction
es_mx: Introducción
zh_cn: 导言

source: Hello, and thank you for taking the time to consider contributing to |gm0|. Your knowledge and contributions will help many other teams, and improve |gm0| as a universal resource. This document is designed to give a basic overview of contributing to |gm0|.
es_mx: Hola, y gracias por tomarte el tiempo para considerar contribuir al |gm0|. Tu conocimiento y contribuciones ayudarán a muchos otros equipos y mejorarán |gm0| como un recurso universal. Este documento está diseñado para brindar una visión general básica de cómo contribuir a |gm0|.
fr_ca: Bonjour, et merci de prendre le temps de envisager de contribuer à |gm0|. Votre savoir et vos contributions aideront de nombreuses autres équipes et amélioreront |gm0| en tant que ressource universelle. Ce document est conçu pour fournir un aperçu de base sur la manière de contribuer à |gm0|.
zh_cn: 您好，感谢您花时间考虑为 |gm0| 做出贡献。您的知识和贡献将帮助许多其他团队，并使 |gm0| 成为一个通用资源。本文档旨在介绍为 |gm0| 做出贡献的基本概况。

source: Who can contribute?
es_mx: ¿Quién puede contribuir?
fr_ca: Qui peut contribuer?
zh_cn: 谁能做出贡献？

source: |gm0| welcomes contributions from basically anybody. The majority of this guide was written by accomplished students of FTC\ |reg| from a wide variety of teams, alongside mentors and alums. Our editorial control is based purely on content, as long as the content is good, it'll be added to |gm0|.
es_mx: |gm0| da la bienvenida a las contribuciones de prácticamente cualquier persona. La mayoría de esta guía fue escrita por estudiantes destacados de FTC\ |reg| de una amplia variedad de equipos, junto con mentores y exalumnos. Nuestro control editorial se basa puramente en el contenido, siempre y cuando el contenido sea bueno, se agregará a |gm0|.
fr_ca: |gm0| accueille les contributions de pratiquement tout le monde. La majorité de ce guide a été rédigée par des étudiants accomplis de FTC\ |reg| provenant de diverses équipes, ainsi que par des mentors et des anciens. Notre contrôle éditorial repose uniquement sur le contenu ; tant que celui-ci est de qualité, il sera ajouté à |gm0|.
zh_cn: |gm0| 欢迎任何人投稿。本指南的大部分内容都是由 FTC\ |reg| 来自不同团队的优秀学生与导师和校友共同撰写的。我们的编辑控制完全基于内容，只要内容好，就会被添加到 |gm0|。

source: Goals of |gm0|
es_mx: Metas de |gm0|
fr_ca: Les objectifs de |gm0|
zh_cn: |gm0| 的目标

source: Before writing, please take the time to familiarize yourself with the goals of |gm0|. The primary goals are:
es_mx: Antes de escribir, por favor tómate el tiempo para familiarizarte con los objetivos de |gm0|. Los objetivos principales son:
fr_ca: Avant d'écrire, veuillez prendre le temps de vous familiariser avec les objectifs de |gm0|. Les objectifs principaux sont :
zh_cn: 在撰写之前，请花点时间熟悉一下 |gm0| 的目标。主要目标是：

source: To inform and guide newer teams, participants, and coaches of the *FIRST*\ |reg| Tech Challenge and help them achieve their competitive goals.
es_mx: Informar y guiar a los equipos más nuevos, participantes y entrenadores del *FIRST*\ |reg| Tech Challenge y ayudarles a alcanzar sus objetivos competitivos.
fr_ca: Informer et guider les nouvelles équipes, participants et entraîneurs du Défi Techno *FIRST*\ |reg| et les aider à atteindre leurs objectifs compétitifs.
zh_cn: 向新团队、参赛者和教练介绍并指导 *FIRST*\ |reg| 科技挑战赛，帮助他们实现竞赛目标。

source: To act as a living reference for mechanisms, techniques, and community knowledge pertinent to *FIRST* Tech Challenge.
es_mx: Actuar como una referencia viva para los mecanismos, técnicas y conocimiento comunitario pertinentes a *FIRST* Tech Challenge.
fr_ca: Agir en tant que référence vivante pour les mécanismes, techniques et connaissances communautaires pertinentes pour le Défi Techo *FIRST*.
zh_cn: 作为与 *FIRST* 科技挑战赛相关的结构、技术和社区知识的活参考资料。

source: These goals may seem relatively self-explanatory, but they have several important takeaways.
es_mx: Estos objetivos pueden parecer relativamente autoexplicativos, pero tienen varios puntos importantes a tener en cuenta.
fr_ca: Ces objectifs peuvent sembler relativement évidents, mais ils comportent plusieurs points importants à retenir.
zh_cn: 这些目标看似不言自明，但却有几个重要的启示。

source: **These goals do not necessarily build upon each other.** For example, let's look at the :doc:`/docs/common-mechanisms/drivetrains/index` section. If we want to simply guide more rookie teams on a path to become successful, we would discuss the very popular drivetrains that teams may encounter (2WD, 4WD, 6WD, mecanum, X-Drive, and H-Drive) so that teams can quickly get up to speed and choose a competitive drivetrain. However, if the goal is to be a comprehensive reference, we would include every single possible drivetrain ever created for FTC, even if they aren't very competitive or realistic for newer teams to build (swerve, ball, octocanum, etc).
es_mx: **Estos objetivos no necesariamente se construyen uno sobre otro.** Por ejemplo, veamos la sección :doc:`/docs/mecanismos-comunes/chasis/índice`. Si queremos simplemente guiar a más equipos novatos en el camino hacia el éxito, discutiríamos los trenes de transmisión más populares que los equipos pueden encontrar (2WD, 4WD, 6WD, mecanum, X-Drive y H-Drive) para que los equipos puedan ponerse al día rápidamente y elegir un chasis competitivo. Sin embargo, si el objetivo es ser una referencia completa, incluiríamos todos los chasises posibles que se hayan creado para FTC, incluso si no son muy competitivos o realistas para que los equipos nuevos los construyan (swerve, ball, octocanum, etc).
fr_ca: **Ces objectifs ne se construisent pas nécessairement les uns sur les autres.** Par exemple, prenons la section :doc:/docs/common-mechanisms/drivetrains/index. Si l'objectif est simplement de guider les équipes débutantes sur la voie du succès, nous parlerions des drivetrains populaires que les équipes peuvent rencontrer (2RM, 4RM, 6WD, mecanum, X-Drive, et H-Drive) afin qu'elles puissent rapidement se mettre à niveau et choisir un châssis compétitif. Cependant, si l'objectif est d'être une référence complète, nous inclurions chaque châssis possible jamais créé pour FTC, même ceux qui ne sont pas très compétitifs ou réalistes pour les équipes plus récentes à construire (swerve, ball, octocanum, etc).
zh_cn: **这些目标并不一定相互依存。** 例如，让我们看看 :doc:`/docs/common-mechanisms/drivetrains/index` 部分。如果我们只是想引导更多菜鸟车队走向成功，我们就会讨论车队可能会遇到的非常流行的动力传动系统（2WD、4WD、6WD、mecanum、X-Drive 和 H-Drive），这样车队就可以快速上手并选择有竞争力的动力传动系统。但是，如果我们的目标是成为一个全面的参考资料，那么我们就会包括所有可能的 FTC 传动系统，即使这些传动系统对于新车队来说不是很有竞争力或不现实（swerve、ball、octocanum 等）。

source: We are seeking to accomplish both goals with a new structure: there will be a "For Rookies" page, that will link to a list of curated pages designed for rookies, while pages outside this list can act as more comprehensive references.
es_mx: Buscamos lograr ambos objetivos con una nueva estructura: habrá una página "Para principiantes" que enlazará a una lista de páginas seleccionadas diseñadas para principiantes, mientras que las páginas fuera de esta lista pueden actuar como referencias más completas.
fr_ca: Nous cherchons à accomplir les deux objectifs avec une nouvelle structure : il y aura une page "Pour les débutants", qui renverra à une liste de pages sélectionnées et conçues pour les débutants, tandis que les pages en dehors de cette liste pourront servir de références plus complètes.
zh_cn: 我们希望通过一种新的结构来实现这两个目标：将会有一个“面向新手”页面，它将链接到一个专为新手设计的页面列表，而这个列表之外的页面可以作为更全面的参考。

source: Keep the goal of the page and whether it is designed to be kept on the "For Rookies" page in mind while writing, and adjust the content accordingly.
es_mx: Mantén en mente el objetivo de la página y si está diseñada para ser mantenida en la página "Para principiantes" mientras escribes, y ajusta el contenido en consecuencia.
fr_ca: Gardez à l'esprit l'objectif de la page et si elle est conçue pour figurer sur la page "Pour les débutants" lors de l'écriture, et ajustez le contenu en conséquence.
zh_cn: 在撰写时要牢记页面的目标，以及是否要将其保留在“面向新手”页面上，并相应调整内容。

source: **Game Manual 0 is a guide from primarily a competitive standpoint.** In general our recommendations have the end goal of increasing the points scored by a team while working inside a team's limitations, and building good technical habits that will be useful in a future career.
es_mx: **El Game Manual 0 es una guía principalmente desde un punto de vista competitivo.** En general, nuestras recomendaciones tienen como objetivo final aumentar los puntos anotados por un equipo mientras se trabaja dentro de las limitaciones del equipo y se desarrollan buenos hábitos técnicos que serán útiles en una futura carrera.
fr_ca: **Game Manual 0 est un guide principalement du point de vue compétitif.** En général, nos recommandations ont pour objectif final d'augmenter le nombre de points marqués par une équipe tout en travaillant dans les limites de l'équipe, et de développer de bonnes habitudes techniques qui seront utiles dans une future carrière.
zh_cn: **Game Manual 0 主要是从竞技角度出发的指南。** 一般来说，我们建议的最终目标是在团队的限制范围内提高团队得分，并培养良好的技术习惯，这对未来的职业生涯非常有用。

source: **Game Manual 0 seeks to inform, not tell.** |gm0| does not wish to encourage one "meta" design or series of techniques, instead, the guide seeks to present teams with a variety of options, with a pros and cons list of each, and let teams make their own decisions for their own circumstances. If recommendations are given, they must be based on objective, repeatable reasoning. For more information on this, read the :doc:`style-guide`.
es_mx: **Game Manual 0 busca informar, no decir.** |gm0| no desea fomentar un diseño "meta" o una serie de técnicas, en cambio, la guía busca presentar a los equipos una variedad de opciones, con una lista de pros y contras de cada una, y permitir que los equipos tomen sus propias decisiones según sus propias circunstancias. Si se dan recomendaciones, deben basarse en un razonamiento objetivo y repetible. Para obtener más información al respecto, lee la :doc:`guía-de-estilo`.
fr_ca: **Game Manual 0 cherche à informer, pas à dicter.** |gm0| ne souhaite pas encourager un design ou une série de techniques "meta", mais plutôt présenter aux équipes une variété d'options, avec une liste des avantages et des inconvénients de chacune, et laisser les équipes prendre leurs propres décisions en fonction de leurs circonstances. Si des recommandations sont faites, elles doivent être basées sur un raisonnement objectif et reproductible. Pour plus d'informations à ce sujet, consultez le :doc:style-guide.
zh_cn: **Game Manual 0 旨在提供信息，而不是告诉别人。** Game Manual 0 并不希望鼓励一种“元”设计或一系列技术，相反，本指南旨在为团队提供多种选择，并列出每种选择的利弊，让团队根据自身情况做出决定。如果要提出建议，则必须基于客观、可重复的推理。有关这方面的更多信息，请阅读 :doc:`style-guide` 。

source: **Game Manual 0 is generally a high level concept guide.** This means that information is given in a way that is applicable to many situations, rather than a series of steps. However, when possible we link to external documentation to plug any knowledge gaps. For example: in the electronics sections, we do not discuss how to exactly wire the robot using the REV control system, instead we link to the REV documentation for exact wiring and discuss general wiring best practices.
es_mx: **El Game Manual 0 es generalmente una guía de conceptos de alto nivel.** Esto significa que la información se presenta de una manera aplicable a muchas situaciones, en lugar de una serie de pasos. Sin embargo, cuando sea posible, enlazamos a documentación externa para cubrir cualquier brecha de conocimiento. Por ejemplo: en las secciones de electrónica, no discutimos cómo cablear exactamente el robot utilizando el sistema de control REV, en su lugar, enlazamos a la documentación de REV para el cableado exacto y discutimos las mejores prácticas generales de cableado.
fr_ca: **Game Manual 0 est généralement un guide de concepts de haut niveau.** Cela signifie que l'information est présentée de manière à être applicable à de nombreuses situations, plutôt que sous forme de séries d'étapes. Cependant, lorsque cela est possible, nous fournissons des liens vers des documentations externes pour combler les lacunes de connaissances. Par exemple : dans les sections électroniques, nous ne discutons pas de la manière exacte de câbler le robot en utilisant le système de contrôle REV, mais nous renvoyons à la documentation REV pour le câblage précis et abordons les meilleures pratiques générales de câblage.
zh_cn: **Game Manual 0 通常是一个高水平的概念指南。** 这意味着所提供的信息适用于多种情况，而不是一系列步骤。不过，在可能的情况下，我们会链接到外部文档，以填补知识空白。例如：在电子部分，我们不讨论如何使用 REV 控制系统为机器人精确布线，而是链接到 REV 文档以了解精确布线，并讨论一般布线最佳实践。

source: Getting Started Contributing
es_mx: Comenzando a contribuir
fr_ca: Commencer À Contribuer
zh_cn: 开始投稿

source: Read through this document
es_mx: Lee este documento
fr_ca: Lisez ce document.
zh_cn: 通读本文件

source: Read through the :doc:`style-guide`
es_mx: Lee :doc:`guía-de-estilo`
fr_ca: Lisez le :doc:`style-guide`
zh_cn: 阅读 :doc:`style-guide` 手册

source: Review the `Project List <https://docs.google.com/document/d/1_o7SoUFs6OznR0U07-Mxr5CLdYmKN-NuU7TiQX8nL6A/edit>`_ and `GitHub issues <https://github.com/gamemanual0/gm0/issues>`_
es_mx: Revisa la `Lista de Proyectos <https://docs.google.com/document/d/1_o7SoUFs6OznR0U07-Mxr5CLdYmKN-NuU7TiQX8nL6A/edit>`_ y los `problemas de GitHub <https://github.com/gamemanual0/gm0/issues>`_
fr_ca: Examinez la `Liste de projets <https://docs.google.com/document/d/1_o7SoUFs6OznR0U07-Mxr5CLdYmKN-NuU7TiQX8nL6A/edit>`_ and `GitHub issues <https://github.com/gamemanual0/gm0/issues>`_
zh_cn: 查看 `项目列表 <https://docs.google.com/document/d/1_o7SoUFs6OznR0U07-Mxr5CLdYmKN-NuU7TiQX8nL6A/edit>`_ 和 `GitHub 问题 <https://github.com/gamemanual0/gm0/issues>`_。

source: Check out the :doc:`methods-of-contributing`
es_mx: Revisa los :doc:`métodos-de-contribución`
fr_ca: Consultez le :doc:`methods-of-contributing`
zh_cn: 查看 :doc:`methods-of-contributing` 文件
