Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/style-guide.po
Languages: es_mx, fr_ca, zh_cn

source: Style Guide
es_mx: Guía de estilo
fr_ca: Guide de style
zh_cn: 风格指南

source: Don't deal in absolutes.
es_mx: No trates con absolutos.
fr_ca: Ne vous contentez pas d'absolus.
zh_cn: 不要绝对化。

source: Only a Sith deals in absolutes
es_mx: Sólo un Sith trata con absolutos
fr_ca: Seul un Sith traite des absolus
zh_cn: 只有西斯才会绝对地交易

source: Use pros/cons lists to compare options
es_mx: Utilizar listas de pros y contras para comparar opciones
fr_ca: Utiliser des listes d'avantages et d'inconvénients pour comparer les options
zh_cn: 使用优点/缺点列表来比较各种选择

source: Explain **WHY** something is good or bad
es_mx: Explicar **POR QUÉ** algo es bueno o malo
fr_ca: Expliquer **POURQUOI** une chose est bonne ou mauvaise
zh_cn: 解释**为什么**某事是好的或坏的

source: For example, we all know Tetrix V2 Motors are bad. But don't just say they're bad, say: "Tetrix V2 motors are underpowered and often burn in a few seconds under stall, which is why they are not generally recommended. They also do not have built in encoders. We would highly recommend purchasing RS-550/RS-555 class motors being sold by goBILDA, REV, and AndyMark instead."
es_mx: Por ejemplo, todos sabemos que los motores Tetrix V2 son malos. Pero no se limiten a decir que son malos, digan: "Los motores Tetrix V2 no tienen potencia suficiente y suelen quemarse en pocos segundos al entrar en puesta, por lo que no suelen recomendarse. Tampoco tienen codificadores integrados. Recomendamos encarecidamente comprar motores de la clase RS-550/RS-555 vendidos por goBILDA, REV y AndyMark".
fr_ca: Par exemple, nous savons tous que les moteurs Tetrix V2 sont mauvais. Mais ne vous contentez pas de dire qu'ils sont mauvais, dites plutôt : "Les moteurs Tetrix V2 sont sous-puissants et brûlent souvent en quelques secondes en cas de décrochage, c'est pourquoi ils ne sont généralement pas recommandés. Ils n'ont pas non plus d'encodeurs intégrés. Nous recommandons fortement l'achat de moteurs de classe RS-550/RS-555 vendus par goBILDA, REV, et AndyMark."
zh_cn: 例如，我们都知道 Tetrix V2 电机很糟糕。但不要只说它们不好，应该说"Tetrix V2 电机功率不足，在失速情况下往往会在几秒钟内烧毁，因此一般不推荐使用。它们也没有内置编码器。我们强烈建议购买由 goBILDA、REV 和 AndyMark 出售的 RS-550/RS-555 级电机"。

source: Similarly, we know the goBILDA motors are generally good. But *explain* why they are good, e.g. "goBILDA Yellow Jacket Planetary motors are generally recommended if you need a 6mm D/8mm REX output shaft motor, and especially if you use goBILDA as your primary build system. These motors have a robust gearbox that generally can handle a decent amount of shock load (but they still must be supported in high torque situations) and conveniently face mount into goBILDA parts. Additionally, goBILDA motors do not require the use of a level shifter to use its encoders with the REV control system for flexibility. Please note that you will need to adapt the bullet connectors to the REV control system power cables, and the goBILDA motor power cables are not removable, unlike the REV Robotics motors."
es_mx: Del mismo modo, sabemos que los motores goBILDA son generalmente buenos. Pero *explique* por qué son buenos, por ejemplo: "Los motores planetarios Yellow Jacket de goBILDA se recomiendan generalmente si necesita un motor con eje de salida REX de 6 mm D/8 mm, y especialmente si utiliza goBILDA como sistema de construcción principal. Estos motores tienen una caja de engranajes robusta que por lo general puede manejar una cantidad decente de carga de choque (pero todavía debe ser apoyado en situaciones de alto torque) y convenientemente se monta frontalmente en piezas goBILDA. Además, los motores goBILDA no requieren el uso de un desplazador de nivel para utilizar sus codificadores con el sistema de control REV para mayor flexibilidad. Tenga en cuenta que tendrá que adaptar los conectores bullet a los cables de alimentación del sistema de control REV, y que los cables de alimentación de los motores goBILDA no son extraíbles, a diferencia de los motores REV Robotics."
fr_ca: De même, nous savons que les moteurs goBILDA sont généralement bons. Mais *expliquez* pourquoi ils sont bons, par exemple "Les moteurs planétaires goBILDA Yellow Jacket sont généralement recommandés si vous avez besoin d'un moteur à arbre de sortie 6mm D/8mm REX, et spécialement si vous utilisez goBILDA comme votre système de construction principal. Ces moteurs ont un réducteur robuste qui peut généralement supporter une quantité décente de chocs (mais ils doivent toujours être soutenus dans des situations de couple élevé) et se montent commodément dans les pièces goBILDA. De plus, les moteurs goBILDA ne nécessitent pas l'utilisation d'un correcteur de niveau pour utiliser ses encodeurs avec le système de contrôle REV pour plus de flexibilité. Veuillez noter que vous devrez adapter les connecteurs bullet aux câbles d'alimentation du système de contrôle REV, et que les câbles d'alimentation des moteurs goBILDA ne sont pas amovibles, contrairement aux moteurs REV Robotics".
zh_cn: 同样，我们知道 goBILDA 电机一般都不错。但请*解释*它们为什么好，例如："如果您需要 6mm D/8mm REX 输出轴电机，尤其是如果您将 goBILDA 作为您的主要构建系统，一般推荐使用 goBILDA Yellow Jacket 行星电机。这些电机有一个坚固的齿轮箱，通常可以承受相当大的冲击负荷（但在高扭矩情况下仍必须有支撑），而且可以方便地安装到 goBILDA 部件上。此外，goBILDA 电机在使用其编码器和 REV 控制系统时不需要使用水平移动器，因此灵活性很高。请注意，您需要将子弹头连接器改装成 REV 控制系统电源线，而且 goBILDA 电机电源线与 REV 机器人电机不同，是不可拆卸的。"

source: Still emphasize that teams are free to explore and innovate, but help set realistic expectations (see the following point)
es_mx: Siga insistiendo en que los equipos son libres de explorar e innovar, pero ayude a establecer expectativas realistas (véase el siguiente punto)
fr_ca: Insistez toujours sur le fait que les équipes sont libres d'explorer et d'innover, mais aidez-les à fixer des attentes réalistes (voir le point suivant).
zh_cn: 仍然强调团队可以自由探索和创新，但要帮助设定切合实际的期望值（见以下几点）

source: |gm0| is a guide **from a competitive standpoint**.
es_mx: |gm0| es una guía **desde un punto de vista competitivo**.
fr_ca: |gm0| est un guide **d'un point de vue concurrentiel**.
zh_cn: |gm0| 是一份 **从竞争性角度来看的** 指南。

source: Try to leave out stuff that doesn't work well and is unpopular; if it is popular it is worth explaining the disadvantages (see H-drive vs ball drive; explaining H-drive, as a relatively popular and simple drivetrain makes sense, but ball drive, a drivetrain that barely exists and is ridiculously complicated makes no sense to bring up)
es_mx: Intenta omitir las cosas que no funcionan bien y no son populares; si son populares, vale la pena explicar las desventajas (por ejemplo, chasis en H vs chasis por bolas; explicar el chasis en H, como un chasis relativamente popular y sencillo, tiene sentido, pero el chasis por bolas, un chasis que apenas existe y que es ridículamente complicado, no tiene sentido mencionarlo).
fr_ca: Essayez de laisser de côté les éléments qui ne fonctionnent pas bien et qui sont impopulaires ; s'ils sont populaires, cela vaut la peine d'en expliquer les inconvénients (voir la transmission en H par rapport à la transmission à billes ; expliquer la transmission en H, en tant que transmission relativement populaire et simple, a du sens, mais la transmission à billes, une transmission qui existe à peine et qui est ridiculement compliquée, n'a pas de sens).
zh_cn: 尽量不提那些不好用、不受欢迎的东西；如果是受欢迎的东西，就值得解释其缺点（如 H 驱动与滚珠驱动的对比；解释 H 驱动是一种相对受欢迎且简单的传动系统是有意义的，但滚珠驱动是一种几乎不存在且复杂得令人发指的传动系统，提出来毫无意义）。

source: Try to leave opinions out as much as possible. Do not speak authoritatively on stuff you do not have first-hand experience with whenever possible
es_mx: Intente dejar de lado las opiniones en la medida de lo posible. Siempre que sea posible, no hables con autoridad sobre temas en los que no tengas experiencia de primera mano.
fr_ca: Essayez de laisser les opinions de côté autant que possible. Dans la mesure du possible, ne vous prononcez pas de manière autoritaire sur des sujets dont vous n'avez pas une expérience directe
zh_cn: 尽量不发表意见。对于没有亲身经历的事情，尽可能不要发表权威性意见

source: **Keep in mind that FTC design trends are temporary and transient**
es_mx: **Tenga en cuenta que las tendencias de diseño de FTC son temporales y transitorias**
fr_ca: **Gardez à l'esprit que les tendances en matière de design de FTC sont temporaires et éphémères**.
zh_cn: **请记住，FTC的设计趋势一直在变动，一个趋势的寿命往往很短。**

source: Just because something is popular one season doesn't mean it's the end all be all. There was a time when 6-wheel drives and coaxial swerve drives were all the rage, but that doesn't mean that we should recommend them in |gm0|. Try your best to think about why something is popular, and what benefits in design, function, and execution they actually bring to the table.
es_mx: Sólo porque algo sea popular una temporada no significa que sea el fin de todo. Hubo un tiempo en el que las 6 ruedas motrices y los swerve drives coaxiales estaban de moda, pero eso no significa que debamos recomendarlos en |gm0|. Intenta pensar por qué algo es popular y qué ventajas de diseño, función y ejecución aportan.
fr_ca: Ce n'est pas parce qu'une chose est populaire pendant une saison qu'elle l'est pour toujours. Il fut un temps où les châssis à 6 roues motrices et les châssis à embardée coaxiale faisaient fureur, mais cela ne veut pas dire que nous devrions les recommander dans le |gm0|. Essayez de réfléchir aux raisons de la popularité d'un produit et aux avantages qu'il présente en termes de conception, de fonction et d'exécution.
zh_cn: 某一季流行的东西并不意味着它就是全部。曾几何时，6轮驱动和同轴转向驱动风靡一时，但这并不意味着我们应该在 |gm0| 中推荐它们。试着思考一下为什么某些东西会流行，它们在设计、功能和执行方面究竟能带来什么好处。

source: Consider that not all teams have the resources to purchase the most optimal parts for their design.
es_mx: Tenga en cuenta que no todos los equipos disponen de los recursos necesarios para adquirir las piezas más óptimas para su diseño.
fr_ca: Il faut tenir compte du fait que toutes les équipes n'ont pas les moyens d'acheter les pièces les plus optimales pour leur projet.
zh_cn: 考虑到并非所有团队都有足够的资源为自己的设计购买最合适的部件，

source: This means that we should give recommendations on how to mitigate issues with poor quality parts.
es_mx: Esto significa que debemos dar recomendaciones sobre cómo mitigar los problemas con piezas de mala calidad.
fr_ca: Cela signifie que nous devrions donner des recommandations sur la manière d'atténuer les problèmes liés à des pièces de mauvaise qualité.
zh_cn: 这意味着我们应该就如何减少劣质部件的问题提出建议。

source: For example: TETRIX structure has a bad reputation for bending at times, at least compared to other build systems compared to REV, goBILDA and Actobotics. Therefore, we recommend adding extra support when building in TETRIX compared to other systems (this means including extra crossbars and adding standoffs inside channel to increase rigidity).
es_mx: Por ejemplo: La estructura TETRIX tiene mala reputación por doblarse a veces, al menos comparada con otros sistemas de construcción como REV, goBILDA y Actobotics. Por lo tanto, recomendamos añadir soporte adicional cuando se construye en TETRIX en comparación con otros sistemas (esto significa incluir travesaños adicionales y añadir separadores dentro del canal para aumentar la rigidez).
fr_ca: Par exemple : La structure TETRIX a la mauvaise réputation de se plier parfois, du moins par rapport à d'autres systèmes de construction tels que REV, goBILDA et Actobotics. Par conséquent, nous recommandons d'ajouter un soutien supplémentaire lors de la construction en TETRIX par rapport à d'autres systèmes (cela signifie inclure des barres transversales supplémentaires et ajouter des entretoises à l'intérieur du canal pour augmenter la rigidité).
zh_cn: 例如：TETRIX 结构有时会弯曲，这一点名声不好，至少与 REV、goBILDA 和 Actobotics 等其他构建系统相比是这样。因此，与其他系统相比，我们建议在使用 TETRIX 构建时增加额外的支撑（这意味着包括额外的横梁和在通道内增加支座，以增加刚度）。

source: Include pictures/videos whenever possible.
es_mx: Incluya imágenes/vídeos siempre que sea posible.
fr_ca: Inclure des photos/vidéos dans la mesure du possible.
zh_cn: 尽可能附上图片/视频。

source: Adding examples of mechanisms really helps with knowledge transfer.
es_mx: Añadir ejemplos de mecanismos ayuda mucho a la transferencia de conocimientos.
fr_ca: L'ajout d'exemples de mécanismes contribue réellement au transfert de connaissances.
zh_cn: 添加机制实例确实有助于知识传播。

source: Credit the teams: Caption Format is: [Team Number] [Team Name], (Relevant Accomplishment), [Season], (description)
es_mx: Créditos a los equipos: El formato del pie de foto es: [Número del equipo] [Nombre del equipo], (logro relevante), [temporada], (descripción)
fr_ca: Créditer les équipes : Le format de la légende est le suivant : [Numéro de l'équipe] [Nom de l'équipe], (réalisation pertinente), [Saison], (description)
zh_cn: 记入各队名下：标题格式为[队号] [队名]，（相关成就），[赛季]，（说明）(译者注：由于有些时候图片标记使用了没有修饰词的专业术语，我们在翻译时会机上一些修饰词来使其通顺，原文中没有。如：“设计的……装置”)

source: []s mean all the time, ()s means when relevant
es_mx: []s significa todo el tiempo, ()s significa cuando es relevante
fr_ca: []s signifie tout le temps, ()s signifie lorsque c'est pertinent
zh_cn: [ ]表示所有时间，( )表示相关时间

source: If you have multiple pictures by the same part from the same team only credit them on the last one to avoid repetition.
es_mx: Si tiene varias fotos de la misma parte del mismo equipo, acredítelas sólo en la última para evitar repeticiones.
fr_ca: Si vous avez plusieurs photos de la même partie de la même équipe, ne les créditez que sur la dernière afin d'éviter les répétitions.
zh_cn: 如果您有来自同一团队的同一角色的多张照片，请只在最后一张上注明，以避免重复。

source: Examples
es_mx: Ejemplos
fr_ca: Exemples
zh_cn: 示例

source: 11115 Gluten Free, Finalist Alliance Captain (Detroit), Relic Recovery, springloaded
es_mx: 11115 Gluten Free, Capitán de la Alianza Finalista (Detroit), Relic Recovery, equipado con resortes
zh_cn: 11115 Gluten Free队伍，Finalist Alliance Captain (Detroit)，Relic Recovery，设计的弹簧加载装置

source: 8417 'Lectric Legends, Rover Ruckus, TPU intake flaps
es_mx: 8417 'Lectric Legends, Rover Ruckus, aletas de intake TPU
zh_cn: 8417 Lectric Legends, Rover Ruckus, TPU 设计的进气口挡板

source: 7236 Recharged Green, Rover Ruckus, Misumi SAR3
zh_cn: 7236 Recharged Green，Rover Ruckus，设计制造的Misumi SAR3

source: Adhere to brand standards when possible.
es_mx: Cumplir las normas de la marca siempre que sea posible.
fr_ca: Respecter les normes de la marque dans la mesure du possible.
zh_cn: 尽可能遵守品牌标准。

source: Abide by *FIRST*\ |reg| Trademark guidelines, available `here <https://www.firstinspires.org/sites/default/files/uploads/resource_library/UseofUSFIRSTandLEGOGroupTrademarksandCopyrightedMaterials.pdf>`_
es_mx: Respete las directrices sobre marcas comerciales, disponibles en <https://www.firstinspires.org/sites/default/files/uploads/resource_library/UseofUSFIRSTandLEGOGroupTrademarksandCopyrightedMaterials.pdf>.
fr_ca: Se conformer aux directives de *FIRST*\ |reg| sur les marques déposées, disponibles `ici <https://www.firstinspires.org/sites/default/files/uploads/resource_library/UseofUSFIRSTandLEGOGroupTrademarksandCopyrightedMaterials.pdf>`_
zh_cn: 遵守 *FIRST*\ |reg| 商标指南，可从这里获取 <https://www.firstinspires.org/sites/default/files/uploads/resource_library/UseofUSFIRSTandLEGOGroupTrademarksandCopyrightedMaterials.pdf>`_

source: The first instance of *FIRST* and FTC on a page should include |reg| (i.e, *FIRST*\ |reg|)
es_mx: La primera instancia de *FIRST* y FTC en una página debe incluir |reg| (es decir, *FIRST*\ |reg|)
fr_ca: La première occurrence de *FIRST* et FTC sur une page doit inclure |reg| (c'est-à-dire *FIRST*\ |reg|).
zh_cn: 页面上 *FIRST* 和 FTC 的第一个实例应包括 |reg|（即 *FIRST*\ |reg|）。

source: Always capitalize and italize the name *FIRST*
es_mx: Escriba siempre el nombre *FIRST* en mayúsculas y cursiva
fr_ca: Le nom doit toujours être écrit en majuscules et en italique *FIRST*.
zh_cn: 始终大写并斜体标注 *FIRST* 名称

source: Do NOT use a possessive on the *FIRST* name (e.g, *FIRST*'s)
es_mx: NO utilice un posesivo en el *FIRST* nombre (por ejemplo, *FIRST*'s)
fr_ca: N'utilisez PAS de possessif pour le nom *FIRST* (par exemple, *FIRST*'s).
zh_cn: 不要在 *FIRST* 名称上使用所有格（如 *FIRST*'s）

source: It's gm0 not GM0 damn it; look at the logo.
es_mx: Es gm0 no GM0 maldita sea; mira el logo.
fr_ca: C'est gm0 et non GM0, bon sang, regardez le logo.
zh_cn: 务必注意：这篇文档的名字是小写的gm0，不是大写的GM0！如果还不清楚，就看看标志。

source: This also applies to team names: spell them how they are officially spelled
es_mx: Esto también se aplica a los nombres de los equipos: escríbelos como se escriben oficialmente.
fr_ca: Il en va de même pour les noms des équipes : il convient de les orthographier comme ils le sont officiellement.
zh_cn: 这也适用于队名：按正式拼写方式拼写

source: Check `The Orange Alliance <https://theorangealliance.org/>`_ or `FTC Events <https://ftc-events.firstinspires.org/>`_ if you do not know how to spell a team's name.
es_mx: Consulte `The Orange Alliance <https://theorangealliance.org/>`_ o `FTC Events <https://ftc-events.firstinspires.org/>`_ si no sabe cómo se escribe el nombre de un equipo.
fr_ca: Vérifiez `The Orange Alliance <https://theorangealliance.org/>`_ ou `FTC Events <https://ftc-events.firstinspires.org/>`_ si vous ne savez pas comment épeler le nom d'une équipe.
zh_cn: 如果不知道团队名称的拼写，请查看 `The Orange Alliance <https://theorangealliance.org/>`_或 `FTC Events <https://ftc-events.firstinspires.org/>`_。

source: You can use "you" when writing, when it makes writing less awkward. However, try avoiding excessively using it.
es_mx: Puedes utilizar el "tú" al escribir, cuando haga que la redacción resulte menos incómoda. Sin embargo, intenta evitar utilizarlo en exceso.
fr_ca: Vous pouvez utiliser le "vous" lorsque vous écrivez, lorsque cela rend l'écriture moins gênante. Cependant, essayez d'éviter d'en faire un usage excessif.
zh_cn: 在写作时，可以使用 "你"，这样可以减少写作时的尴尬。但要尽量避免过度使用。
