Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/common-hardware-components.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: After instantiating a ``Servo``, there are two main functions that can be called: ``setPosition()`` and ``getPosition()``. ::
es_mx: Después de instanciar un ``Servo``, hay dos funciones principales que se pueden llamar: ``setPosition()`` y ``getPosition()``. ::
fr_ca: Après avoir instancié un ``Servo``, il y a deux fonctions principales qui peuvent être appelées : ``setPosition()`` et ``getPosition()``. : :
ro_ro: După instanțierea unui ``Servo``, există două funcții principale care pot fi apelate: ``setPosition()`` și ``getPosition()``. ::
zh_cn: 在实例化 ``Servo`` 后，可以调用两个主要函数：``setPosition()`` 和`getPosition()`` ::

source: ``setPosition()`` sets the position of the :term:`servo <Servo>`. The SDK will use a built-in control loop with the :term:`servo's <Servo>` potentiometer to drive the :term:`servo <Servo>` to that position and hold that position. ``setPosition()`` takes in a double between 0 and 1, where 0 is the :term:`servo's <Servo>` lower limit of rotation and 1 is the :term:`servo's <Servo>` upper limit of rotation. Everything between is directly proportional, so 0.5 is the middle, 0.75 is 3/4 the way up, etc.
es_mx: ``setPosition()`` establece la posición del :term:`servo <Servo>`. El SDK utilizará un bucle de control integrado con el potenciómetro del :term:`servo <Servo>` para conducir el :term:`servo <Servo>` a esa posición y mantener esa posición. ``setPosition()`` toma un doble entre 0 y 1, donde el 0 del :term:`servo <Servo>` es el límite inferior de rotación y el 1 del :term:`servo <Servo>` es el límite superior de rotación. Todo lo que está entre es directamente proporcional, por lo que 0.5 es el medio, 0.75 es 3/4 del camino, etc.
fr_ca: ``setPosition()`` définit la position du :term:`servo <Servo>`. Le SDK utilisera une boucle de contrôle intégrée avec le potentiomètre :term:`servo's <Servo>` pour conduire le :term:`servo <Servo>` à cette position et la maintenir. ``setPosition()`` prend un double entre 0 et 1, où 0 est la limite inférieure de rotation du :term:`servo <Servo>` et 1 est la limite supérieure de rotation du :term:`servo <Servo>`. Tout ce qui se trouve entre les deux est directement proportionnel, donc 0,5 est le milieu, 0,75 est les 3/4 du chemin vers le haut, etc.
zh_cn: ``setPosition()`` 设置 :term:`servo <Servo>` 的位置。SDK 将使用 :term:`servo's <Servo>` 电位器的内置控制循环，将 :term:`servo <Servo>` 驱动到该位置并保持该位置。`setPosition()`` 接收介于 0 和 1 之间的 double，其中 0 是 :term:`servo 的 <Servo>` 旋转下限，1 是 :term:`servo 的 <Servo>` 旋转上限。介于两者之间的是正比例，所以 0.5 是中间值，0.75 是 3/4 上限值，等等。

source: ``getPosition()`` does not return the :term:`servo's <Servo>` current position, rather its current target position. If a variable for the :term:`servo's <Servo>` current target position is stored properly, this function should never be needed.
es_mx: ``getPosition()`` no devuelve la posición actual del :term:`servo <Servo>`, sino su posición actual de destino. Si una variable para la posición actual del destino del :term:`servo<Servo>` se almacena correctamente, esta función no debería ser necesaria.
fr_ca: ``getPosition()`` ne renvoie pas la position actuelle du :term:`servo <Servo>`, mais plutôt sa position cible actuelle. Si une variable pour la position actuelle du :term:`servo <Servo>` est stockée correctement, cette fonction ne devrait jamais être nécessaire.
zh_cn: `getPosition()`` 返回的不是 :term:`servo 的 <Servo>` 当前位置，而是当前目标位置。如果 :term:`servo 的 <Servo>` 当前目标位置的变量存储得当，就不需要使用此函数。

source: Continuous Rotation Servo
es_mx: Servo de rotación continua
fr_ca: Servo à rotation continue
ro_ro: Servomotor cu Rotație Continuă
zh_cn: 连续旋转舵机

source: A CRServo has one main method; ``setPower()``. This works very similarly to ``DcMotor`` 's ``setPower()``, meaning that passing it 0 makes it stop, passing it 1 makes it go forward at full speed, passing it -1 makes it go backwards at full speed, and everything in between. ::
es_mx: Un CRServo tiene un método principal; ``setPower()``. Esto funciona de manera muy similar a ``DcMotor`` `` ``setPower()``, lo que significa que pasándole 0 hace que se detenga, pasándole 1 hace que avance a toda velocidad, pasándole -1 hace que retroceda a toda velocidad, y todo lo demás. ::
fr_ca: Un CRServo a une méthode principale, ``setPower()``. Son fonctionnement est très similaire à celui de ``setPower()`` de ``DcMotor``, ce qui signifie que lui passer 0 le fait s'arrêter, lui passer 1 le fait avancer à pleine vitesse, lui passer -1 le fait reculer à pleine vitesse, et tout ce qui se trouve entre les deux... : :
ro_ro: Un servomotor CR are o metodă principală: ``setPower()``. Aceasta funcționeaza foarte similar cu ``setPower()``-ul ``DcMotor``-ului, adică 0 îl face să se oprească, 1 îl face să se miște la viteză maximă, -1 îl face să se rotească în sens invers la viteză maximă, și restul între aceste valori.::
zh_cn: CRServo 有一个主要方法： ``setPower()`` 。其工作原理与 ``DcMotor`` 的 ``setPower()``非常相似，即传入 0 会使其停止，传入 1 会使其全速前进，传入 -1 会使其全速后退，以及介于两者之间的所有情况。::

source: Digital IO
es_mx: IO digital
ro_ro: IO Digital
zh_cn: 数字IO

source: A DigitalChannel has a couple main methods. ``setMode()`` is used to set the port as either an OUTPUT or INPUT port, ``getState()`` returns the current state of the port (only works in INPUT mode), and ``setState()`` sets the state of the port (only works in OUTPUT mode)
es_mx: Un DigitalChannel tiene un par de métodos principales. ``setMode()`` se utiliza para establecer el puerto como un puerto OUTPUT o INPUT, ``getState()`` devuelve el estado actual del puerto (sólo funciona en modo INPUT), y ``setState()`` establece el estado del puerto (sólo funciona en modo OUTPUT).
fr_ca: Un DigitalChannel possède quelques méthodes principales. ``setMode()`` est utilisée pour définir le port en tant que port OUTPUT ou INPUT, ``getState()` retourne l'état actuel du port (ne fonctionne qu'en mode INPUT), et ``setState()` définit l'état du port (ne fonctionne qu'en mode OUTPUT).
ro_ro: Un DigitalChannel are câteva metode principale. ``setMode()`` este folosit pentru a seta un port ca OUTPUT sau INPUT, ``getState()`` returnează starea curentă a port-ului (merge doar în modul INPUT), iar ``setState()`` setează starea port-ului (merge doar în modul OUTPUT).
zh_cn: 数字C形梁有几个主要方法。``setMode()`` 用于将端口设置为输出或输入端口，``getState()`` 返回端口的当前状态（仅在输入模式下有效），``setState()`` 设置端口的状态（仅在输出模式下有效）。

source: Digital ports start by default in INPUT mode
es_mx: Los puertos digitales se inician por defecto en modo ENTRADA "INPUT"
fr_ca: Les ports numériques démarrent par défaut en mode INPUT
ro_ro: Port-urile digitale încep implicit în modul INPUT
zh_cn: 数字端口默认以 INPUT 模式启动

source: Digital ports are pulled UP to prevent floating. This means that there is a resistor between the port and 3.3V so the port reads HIGH by default when nothing is connected. As a result digital devices MUST connect the digital pin to ground when closed, then leave it unconnected when open. For limit switches, this means connecting one lead to ground and the other to the digital port. **Connecting this wrong (connecting 3.3V to the digital port) may cause instability and can cause your expansion hub to crash**
es_mx: Los puertos digitales se ponen hacia ARRIBA para evitar que floten. Esto significa que hay una resistencia entre el puerto y 3.3V para que el puerto se lea ALTO por defecto cuando no hay nada conectado. Como resultado, los dispositivos digitales DEBEN conectar el pin digital a tierra cuando está cerrado, y dejarlo desconectado cuando está abierto. Para los finales de carrera, esto significa conectar un cable a tierra y el otro al puerto digital. **Conectar esto incorrectamente (conectando 3.3V al puerto digital) puede causar inestabilidad y puede hacer que tu expansion hub se bloquee**.
fr_ca: Les ports numériques sont tirés vers le haut pour éviter le flottement. Cela signifie qu'il y a une résistance entre le port et 3,3 V, de sorte que le port se lit HAUT par défaut lorsque rien n'est connecté. Par conséquent, les dispositifs numériques DOIVENT connecter la broche numérique à la terre lorsqu'elle est fermée, puis la laisser non connectée lorsqu'elle est ouverte. Pour les interrupteurs de fin de course, cela signifie qu'il faut connecter un fil à la terre et l'autre au port numérique. **Un mauvais branchement (connexion de 3,3 V au port numérique) peut provoquer une instabilité et faire planter votre concentrateur d'expansion**.
ro_ro: Porturile digitale sunt setate la valoarea HIGH implicit, prin legarea unui rezistor între port și 3.3V. Astfel, toate dispozitivele digitale trebuie să fie conectate la pin-ul digital de împământare când este închis, apoi să fie lasat deconectat când este deschis. Pentru senzori de limită, acest lucru înseamnă conectarea unui contact la împământare și al altui contact la portul digital. **Conectarea greșită (3.3V la portul digital) poate cauza instabilitate și să îți facă expansion hub-ul să dea crash.**
zh_cn: 数字端口上拉以防止信号抖动。这意味着在端口和 3.3V 电压之间有一个电阻，因此端口在未连接任何设备时默认为高电平。因此，数字设备在关闭时必须将数字引脚连接到地，而在打开时则保持未连接状态。对于限位开关而言，这意味着将一条引线连接至地线，另一条引线连接至数字端口。**连接错误（将 3.3V 电压连接到数字端口）可能导致不稳定，并可能导致 Expansion Hub 崩溃**。

source: Analog Input
es_mx: Entrada analógica
fr_ca: Entrée analogique
ro_ro: Input Analog
zh_cn: 模拟输入

source: An ``AnalogInput`` has one main method: ``getVoltage()`` which is used to get the current input voltage to the port.
es_mx: Una ``AnalogInput`` "Entrada analoga" tiene un método principal: ``getVoltage()`` que se utiliza para obtener el voltaje de entrada actual al puerto.
fr_ca: Une ``AnalogInput`` a une méthode principale : ``getVoltage()`` qui est utilisée pour obtenir la tension d'entrée actuelle sur le port.
ro_ro: ``AnalogInput`` are o metodă principală: ``getVoltage()`` care este folosit pentru a obține tensiunea curentă aplicată portului.
zh_cn: ``AnalogInput`` 有一个主要方法：``getVoltage()`` ，用于获取端口当前的输入电压。

source: Although ``getMaxVoltage()`` returns 3.3v, the expansion and control hub analog input ports can safely handle up to 5v.
es_mx: Aunque ``getMaxVoltage()`` devuelve 3.3v, los puertos de entrada analógica del control y expansion hub pueden manejar con seguridad hasta 5v.
fr_ca: Bien que ``getMaxVoltage()`` renvoie 3.3v, les ports d'entrée analogique des concentrateurs d'expansion et de contrôle peuvent en toute sécurité supporter jusqu'à 5v.
ro_ro: Deși ``getMaxVoltage()`` returnează 3.3v, porturile de intrare analog ale expansion și control hub-urilor pot face fața cu ușurintă până la 5v.
zh_cn: 虽然 ``getMaxVoltage()`` 返回 3.3v，但Expansion Hub 和 Control Hub模拟输入端口可以安全地处理高达 5v 的电压。

source: A Note on Hardware Call Speed
es_mx: Nota sobre la velocidad de llamada del hardware
fr_ca: Note sur la vitesse d'appel du matériel
ro_ro: De Reținut Despre Viteza de Apelare Hardware
zh_cn: 关于硬件调用速度的注意事项

source: Every hardware call you make, (whether it be setting the power for a motor, setting a :term:`servo <Servo>` position, reading an encoder value, etc.) will take approximately 3 milliseconds to execute, except for I2C calls which can take upwards of 7ms. This is because behind the scenes, the SDK may need to make multiple hardware calls in order to perform the I2C operation.
es_mx: Cada llamada de hardware que realices, (ya sea ajustar la potencia de un motor, ajustar una posición del :term:`servo <Servo>`, leer un valor de encoder, etc.) tardará aproximadamente 3 milisegundos en ejecutarse, excepto las llamadas I2C que pueden tardar más de 7ms. Esto se debe a que entre bastidores, el SDK puede necesitar hacer múltiples llamadas al hardware para realizar la operación I2C.
fr_ca: Chaque appel matériel que vous effectuez (qu'il s'agisse de régler la puissance d'un moteur, de définir une position :term:`servo <Servo>`, de lire une valeur d'encodeur, etc.) prendra environ 3 millisecondes pour être exécuté, à l'exception des appels I2C qui peuvent prendre jusqu'à 7 ms. Cela s'explique par le fait qu'en coulisses, le SDK peut avoir besoin de faire plusieurs appels au matériel pour effectuer l'opération I2C.
ro_ro: Orice apel hardware pe care îl faci (fie că este să setezi puterea unui motor, setarea poziției unui :term:`servomotor<Servo>`, citirea unui encoder, etc.) va lua aproximativ 3 millisecunde pentru a se executa, cu excepția apelurilor I2C, care pot lua până la 7ms. Acest lucru se întâmplă deoarece, în spate, SDK-ul trebuie să facă mai multe apeluri pentru a efectua o operație I2C.
zh_cn: 每次硬件调用（无论是设置电机功率、设置 :term:`servo <Servo>` 位置、读取编码器值等）的执行时间约为 3 毫秒，但 I2C 调用除外，它可能需要 7 毫秒以上。这是因为在幕后，SDK 可能需要进行多次硬件调用才能执行 I2C 操作。

source: When using a Control Hub, you may see considerably faster hardware call times because the Control Hub uses a direct UART connection to the Lynx board instead of going through USB and a middle-man FTDI as happens when using a phone.
es_mx: Cuando se utiliza un Control Hub, puede ver tiempos de llamada de hardware considerablemente más rápidos porque el Control Hub utiliza una conexión UART directa a la placa Lynx en lugar de ir a través de USB y un intermediario FTDI como sucede cuando se utiliza un teléfono.
fr_ca: Lorsque vous utilisez un concentrateur de contrôle, vous pouvez constater des temps d'appel matériel considérablement plus rapides car le concentrateur de contrôle utilise une connexion UART directe avec la carte Lynx au lieu de passer par USB et un intermédiaire FTDI comme c'est le cas lorsqu'on utilise un téléphone.
ro_ro: Când folosești un Control Hub, s-ar putea să vezi apeluri hardware mai rapide deoarece Control Hub-ul folosește o conexiune directă UART la placa Lynx în loc să treacă prin USB și un "om la mijloc" FTDI cum se întâmplă când folosești un telefon.
zh_cn: 使用 Control Hub 时，您可能会看到硬件调用时间大大缩短，因为 Control Hub 使用直接 UART 连接到 Lynx 板，而不是像使用手机作为RC时那样通过 USB 和中间的 FTDI。

source: These times may seem fast, but they add up quickly. Consider a control loop to drive forward for N encoder counts while maintaining heading using the IMU. This would require 5 normal hardware calls (4 set power + 1 read encoder) and an I2C call (IMU) which means that the loop cycle would take approximately 22ms to execute, and thus run at approximately 45Hz.
es_mx: Estos tiempos pueden parecer rápidos, pero se acumulan rápidamente. Considere un bucle de control para conducir hacia adelante para N recuentos del codificador mientras se mantiene el rumbo utilizando la IMU. Esto requeriría 5 llamadas normales de hardware (4 de ajuste de potencia + 1 de lectura del codificador) y una llamada I2C (IMU), lo que significa que el ciclo del bucle tardaría aproximadamente 22ms en ejecutarse, y por lo tanto se ejecutaría a aproximadamente 45Hz.
fr_ca: Ces temps peuvent sembler rapides, mais ils s'additionnent rapidement. Prenons l'exemple d'une boucle de contrôle permettant d'avancer pour N comptes codeur tout en maintenant le cap à l'aide de l'IMU. Cela nécessiterait 5 appels matériels normaux (4 réglages de puissance + 1 lecture de codeur) et un appel I2C (IMU), ce qui signifie que le cycle de la boucle prendrait environ 22 ms pour s'exécuter, et donc fonctionnerait à environ 45 Hz.
zh_cn: 这些时间看似很快，但累积起来也很快。考虑一个控制回路，在使用 IMU 保持航向的同时，向前驱动 N 个编码器计数。这需要 5 次普通硬件调用（4 次设置功率 + 1 次读取编码器）和 1 次 I2C 调用（IMU），这意味着执行循环周期大约需要 22 毫秒，因此运行频率大约为 45 赫兹。

source: This means that it is critical to minimize the amount of hardware calls you make in order to keep your control loops running fast. For instance, do not read a sensor more than once per loop. Instead, read it once and store the value to a variable if you need to use it again at other points in the same loop cycle.
es_mx: Esto significa que es fundamental minimizar la cantidad de llamadas al hardware para que los bucles de control funcionen con rapidez. Por ejemplo, no lea un sensor más de una vez por bucle. En su lugar, léalo una vez y almacene el valor en una variable por si necesita utilizarlo de nuevo en otros puntos del mismo ciclo de bucle.
fr_ca: Cela signifie qu'il est essentiel de minimiser le nombre d'appels au matériel que vous effectuez afin que vos boucles de contrôle fonctionnent rapidement. Par exemple, ne lisez pas un capteur plus d'une fois par boucle. Au contraire, lisez-le une fois et stockez la valeur dans une variable si vous avez besoin de l'utiliser à nouveau à d'autres moments du même cycle de boucle.
ro_ro: Asta înseamnă ca este important să menții un număr cât mai restrâns de apeluri hardware pentru a menține buclele de control rapide. De exemplu, nu citi un senzor de mai multe ori într-o buclă. În schimb, citește-o o dată și stocheaza valoarea într-o variabilă dacă ai nevoie să o folosești înca o data în alte puncte în aceeași bucla de control.
zh_cn: 这意味着必须尽量减少硬件调用次数，以保证控制回路快速运行。例如，不要在每个循环中多次读取传感器。相反，只需读取一次，然后将值存储到变量中，以便在同一循环周期的其他时间点再次使用。

source: Using a bulk read hardware call can help with this problem. A bulk read takes the same 3ms to execute as any other normal hardware call, but it returns far more data. In order to be able to use bulk reads, you must be running SDK v5.4 or higher. See :doc:`/docs/software/tutorials/bulk-reads` for more information
es_mx: El uso de una llamada de hardware de lectura masiva puede ayudar con este problema. Una lectura masiva tarda los mismos 3 ms en ejecutarse que cualquier otra llamada de hardware normal, pero devuelve muchos más datos. Para poder utilizar las lecturas masivas, debe estar ejecutando SDK v5.4 o superior. Consulte :doc:`/docs/tutoriales/software/lecturas-masivas` para más información.
fr_ca: L'utilisation d'un appel matériel de lecture en bloc peut résoudre ce problème. L'exécution d'une lecture en bloc prend les mêmes 3 ms que n'importe quel autre appel matériel normal, mais elle renvoie beaucoup plus de données. Pour pouvoir utiliser les lectures en bloc, vous devez utiliser le SDK v5.4 ou une version ultérieure. Voir :doc:`/docs/software/tutorials/bulk-reads` pour plus d'informations.
ro_ro: Folosind un apel hardware de citire bulk poate rezolva această problemă. O citire bulk ia 3ms să se execute ca orice alt apel hardware, însă returnează mai multe date. Ca să poți folosi citiri bulk, trebuie să folosești SDK v5.4 sau mai nou. Citește :doc:`/docs/software/tutorials/bulk-reads` pentru mai multe informații.
zh_cn: 使用批量读取硬件调用可以帮助解决这个问题。批量读取的执行时间与任何其他普通硬件调用一样，都是 3 毫秒，但它返回的数据要多得多。要使用批量读取，必须运行 SDK v5.4 或更高版本。更多信息请参见 :doc:`/docs/software/tutorials/bulk-reads` 。

source: When using the FTC SDK, there are a variety of built in hardware classes which can be used to communicate with hardware on the robot such as DC Motors, :term:`Servos <Servo>`, and Sensors.
ro_ro: Când folosești FTC SDK, există multe varietăți de clase de hardware care pot fi folosite pentru a comunica cu hardware-ul de pe robot, precum motoare DC, :term:`servomotoare<Servo>`, și senzori.

source: There are both absolute and relative encoders. An absolute encoder will report at exactly what angle the shaft is compared to its absolute “zero”. A relative encoder will report how far the :term:`shaft <Shaft>` has rotated since it started tracking (for example, when autonomous starts). Relative encoders will have a quadrature output, whereas absolute encoders generally have analog or i2c outputs.
ro_ro: Există encodere absolute și relative. Un encoder absolut va raporta unghiul exact la care axul este îndreptat comparativ cu "zero absolut". Un encoder relativ va raporta cât de departe s-a rotit :term:`axul<Shaft>` de când a început să se rotească (de exemplu, când începe perioada autonomă). Encoderele relative au o ieșire cuadratulă, în timp ce encoderele absolute au în general o ieșire analogă sau de tip i2c.

source: ``setPosition()`` sets the position of the :term:`servo <Servo>`. The SDK will use a built-in control loop with the :term:`servo’s <Servo>` potentiometer to drive the :term:`servo <Servo>` to that position and hold that position. ``setPosition()`` takes in a double between 0 and 1, where 0 is the :term:`servo’s <Servo>` lower limit of rotation and 1 is the :term:`servo’s <Servo>` upper limit of rotation. Everything between is directly proportional, so 0.5 is the middle, 0.75 is 3/4 the way up, etc.
ro_ro: ``setPosition()`` setează poziția :term:`servomotorului<Servo>`. SDK-ul va folosi o buclă de control integrată cu potențiometrul :term:`sermotorului<Servo>` pentru a pune în mișcare :term:`servomotorul<Servo>` către acea poziție și să mențină acea poziție. ``setPosition()`` preia valori de tip double între 0 și 1, unde 0 este limita inferioară a rotației :term:`servomotorului<Servo>`, iar 1 este limita superioară a rotației :term:`servomotorului<Servo>`. Orice între aceste valori este direct proporțional, deci 0.5 este mijlocul, 0.75 este 3/4 din rotație, etc.

source: ``getPosition()`` does not return the :term:`servo’s <Servo>` current position, rather its current target position. If a variable for the :term:`servo’s <Servo>` current target position is stored properly, this function should never be needed.
ro_ro: ``getPosition()`` nu returnează poziția curentă a :term:`servomotorului<Servo>`, dar poziția sa țintă. Dacă o variabilă pentru poziția curentă țintă a :term:`servomotorului<Servo>` este stocată corect, această funcție nu ar trebui folosită niciodată.
