Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/common-hardware-components.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Reading and Writing to Hardware
es_mx: Lectura y Escritura al Hardware
fr_ca: Lire et écrire sur du matériel
ro_ro: Citirea și Scrierea Hardware
zh_cn: 硬件的读取与写入

source: When using the FTC\ |reg| SDK, there are a variety of built in hardware classes which can be used to communicate with hardware on the robot such as DC Motors, :term:`Servos <Servo>`, and Sensors.
es_mx: Cuando se utiliza el SDK de FTC |reg|, hay una variedad de clases de hardware incorporados que se pueden utilizar para comunicarse con el hardware del robot, tales como motores de corriente continua, :term:`servos <Servo>`, y sensores.
fr_ca: Lorsque vous utilisez le SDK FTC\ |reg|, il existe une variété de classes matérielles intégrées qui peuvent être utilisées pour communiquer avec le matériel du robot, comme les moteurs CC, :term:`Servos <Servo>`, et les capteurs.
zh_cn: 使用 FTC\ |reg| SDK 时，有多种内置硬件类可用于与机器人上的硬件，如直流电机、 :term:`舵机 <Servo>` 和传感器，进行通信。

source: Creating and Instantiating Hardware Objects
es_mx: Creación e Instanciación de Objetos Hardware
fr_ca: Création et instanciation d'objets matériels
ro_ro: Crearea și Instanțarea Obiectelor Hardware
zh_cn: 创建和实例化硬件对象

source: The first thing required to properly create an object is to import its class. In Android Studio, if the class is referenced without being imported Alt+Enter can be pressed to automatically import it. After it is imported, the next step is to create the object::
es_mx: Lo primero que se necesita para crear correctamente un objeto es importar su clase. En Android Studio, si se hace referencia a la clase sin haberla importado se puede pulsar Alt+Enter para importarla automáticamente. Una vez importada, el siguiente paso es crear el objeto:
fr_ca: La première chose à faire pour créer correctement un objet est d'importer sa classe. Dans Android Studio, si la classe est référencée sans être importée, il est possible d'appuyer sur Alt+Enter pour l'importer automatiquement. Une fois la classe importée, l'étape suivante consiste à créer l'objet: :
ro_ro: Primul lucru necesar pentru a crea corect un obiect este importarea clasei acestuia. În Android Studio, dacă clasa este menționată fără a fi importată poți apăsa Alt+Enter pentru a o importa automat. După ce este importată clasa, urmatorul pas este să creezi obiectul::
zh_cn: 要正确创建对象，首先需要导入对象的类。在 Android Studio 中，如果引用了类却没有导入，可以按 Alt+Enter 键自动导入。导入后，下一步就是创建对象：

source: After the object is created, it must be instantiated. Part of the ``OpMode`` superclass is something called ``hardwareMap``. ``hardwareMap`` is used in the FTC SDK to instantiate objects rather than calling a constructor.
es_mx: Después de crear el objeto, hay que instanciarlo. Parte de la superclase ``OpMode`` es algo llamado ``hardwareMap``. ``hardwareMap`` se utiliza en el FTC SDK para instanciar objetos en lugar de llamar a un constructor.
fr_ca: Une fois l'objet créé, il doit être instancié. Une partie de la superclasse ``OpMode`` est appelée ``hardwareMap``. ``hardwareMap`` est utilisé dans le SDK FTC pour instancier les objets plutôt que d'appeler un constructeur.
ro_ro: După ce obiectul este creat, acesta trebuie instanțat. Parte din superclasa ``OpMode`` este numită ``hardwareMap``. ``hardwareMap`` este folosit în FTC SDK pentru a instanța obiecte, decât să apelezi un constructor.
zh_cn: 创建对象后，必须对其进行实例化。``OpMode`` 超类的一部分称为 ``hardwareMap``。FTC SDK 使用 ``hardwareMap`` 来实例化对象，而不是调用构造函数。

source: It contains all of the information entered into the configuration on the Robot Controller, such as names of hardware and what port it is plugged into. Here is an example of instantiating the motor we created above::
es_mx: Contiene toda la información introducida en la configuración del Robot Controller, como los nombres del hardware y en qué puerto está conectado. He aquí un ejemplo de instanciación del motor que hemos creado anteriormente::
fr_ca: Il contient toutes les informations saisies dans la configuration du contrôleur de robot, telles que les noms du matériel et le port sur lequel il est branché. Voici un exemple d'instanciation du moteur que nous avons créé ci-dessus: :
ro_ro: Conține toate informațiile introduse în configurația Robot Controller-ului, precum numele hardware-ului și în ce port a fost introdus. Aici este un exemplu pentru instanțierea motorului pe care l-am creat mai sus::
zh_cn: 它包含输入到机器人控制器配置中的所有信息，例如硬件名称和插入的端口。下面是实例化我们上面创建的电机的示例::

source: Whatever sensor you are using, you will pass that class into the spot where ``DcMotor.class`` is. For example, if liftMotor was a Servo, ``Servo.class`` would be passed instead.
es_mx: Sea cual sea el sensor que estés utilizando, pasarás esa clase al lugar donde está ``DcMotor.class``. Por ejemplo, si el liftMotor fuera un Servo, se pasaría ``Servo.class`` en su lugar.
fr_ca: Quel que soit le capteur que vous utilisez, vous passerez cette classe à l'endroit où se trouve ``DcMotor.class``. Par exemple, si liftMotor était un Servo, ``Servo.class`` serait passé à la place.
ro_ro: Pentru orice senzor pe care Îl folosești, vei pasa acea clasă în locul unde este ``DcMotor.class``. De exemplu, dacă liftMotor era un servomotor, ``Servo.class`` ar fi fost pasat în schimb.
zh_cn: 无论使用什么传感器，都要将该类传入 ``DcMotor.class`` 所在的位置。例如，如果 liftMotor 是舵机，则应传递 ``Servo.class`` 代替。

source: For the second argument, you pass whatever the device is named in the Robot Controller configuration. ``hardwareMap`` will then go find what port the device with that name is plugged into, which allows the hardware to be accessed.
es_mx: Para el segundo argumento, pasas el nombre que tenga el dispositivo en la configuración del Robot Controller. Entonces ``hardwareMap`` irá a buscar en qué puerto está conectado el dispositivo con ese nombre, lo que permite acceder al hardware.
fr_ca: Pour le second argument, vous passez le nom du périphérique dans la configuration du contrôleur de robot. ``hardwareMap`` va alors chercher le port sur lequel le périphérique portant ce nom est branché, ce qui permet d'accéder au matériel.
ro_ro: Pentru al doilea argument, vei pasa orice nume pe care îl are dispozitivul î0n configurația din Robot Controller. ``hardwareMap`` va găsi pe ce port este conectat dispozitivul cu numele respectiv, care îți permite să accesezi hardware-ul.
zh_cn: 第二个参数是机器人控制器配置中设备的名称。然后， ``hardwareMap`` 将查找该设备所连接的端口，从而访问硬件。

source: Examples of Using Common Hardware Components
es_mx: Ejemplos de Uso de Componentes Comunes de Hardware
fr_ca: Exemples d'utilisation de composants matériels communs
ro_ro: Exemple Comune pentru Utilizarea Componentelor Hardware
zh_cn: 使用通用硬件组件的示例

source: DC Motor
fr_ca: Moteur à courant continu
ro_ro: Motorul DC
zh_cn: 直流电机

source: After a ``DcMotor`` is instantiated, there are a few variables you can set to affect how the DC Motor runs. The first of these is direction::
es_mx: Después de instanciar un ``DcMotor``, hay algunas variables que puede establecer para afectar a cómo funciona el motor DC. La primera de ellas es la dirección::
fr_ca: Après l'instanciation d'un ``DcMotor``, il y a quelques variables que vous pouvez définir pour affecter la façon dont le moteur DC fonctionne. La première d'entre elles est la direction: :
ro_ro: După ce un ``DcMotor`` este instanțat, există câteva variabile pe care trebuie să le setezi pentru a afecta felul în care un motor DC va rula. Primul din acestea este direcția::
zh_cn: 在 ``DcMotor`` 实例化之后，您可以设置一些变量来影响直流电机的运行方式。第一个变量是方向::

source: Changing the direction of the motor does exactly what should be expected, it changes the direction. If a power of 1 is applied to the motor while it is in forward mode, it will turn one direction. If it is in reverse, a power of 1 will spin it in the other direction. If you face the shaft of the motor towards you, forward is counterclockwise (with the exception of NeveRest motors).
es_mx: Cambiar la dirección del motor hace exactamente lo que debería esperarse, cambia la dirección. Si se aplica una potencia de 1 al motor mientras está en modo de avance, girará en una dirección. Si está en marcha atrás, una potencia de 1 lo hará girar en el otro sentido. Si miras el eje del motor hacia ti, hacia adelante es en el sentido contrario a las agujas del reloj (con la excepción de los motores NeveRest).
fr_ca: Le changement de direction du moteur fait exactement ce que l'on attend de lui : il change de direction. Si une puissance de 1 est appliquée au moteur lorsqu'il est en mode marche avant, il tournera dans un sens. S'il est en marche arrière, une puissance de 1 le fera tourner dans l'autre sens. Si vous faites face à l'arbre du moteur, la marche avant est dans le sens inverse des aiguilles d'une montre (à l'exception des moteurs NeveRest).
ro_ro: Schimbarea direcției unui motor face exact lucrul la care te aștepți, îi schimbă direcția. Dacă o putere de 1 este aplicată unui motor în timp ce este setat în modul forward, se va roti într-o sigură direcție. Dacă este în reverse, o putere de 1 îl va roti în cealaltă direcție. Dacă îndrepti axul motorului înspre tine, forward este în sensul invers al acului de ceasornic (cu excepția motoarelor NereRest).
zh_cn: 改变电机方向的作用与预期完全一致，即改变方向。如果在正转模式下对电机施加 1 的功率，它将朝一个方向转动。如果处于反转状态，1 的功率将使其向另一个方向旋转。如果将电机轴朝向自己，则正转是逆时针方向（NeveRest 电机除外）。

source: Next, there are two zero power behaviors that can be adjusted::
es_mx: A continuación, hay dos comportamientos de potencia cero que se pueden ajustar::
fr_ca: Ensuite, il y a deux comportements de puissance nulle qui peuvent être ajustés: :
ro_ro: Apoi, exită două comportamente de putere 0 care pot fi configurate::
zh_cn: 接下来，有两种零功率行为可以调整：

source: Changing this variable affects how the DC Motor behaves while a power of 0 is applied. ``BRAKE`` will cause the motor to try and slow itself down if it is moving (it will NOT cause the motor to hold its position if not already moving), while ``FLOAT`` causes the motor to glide to a stop, letting friction do all the work.
es_mx: Cambiar esta variable afecta a cómo se comporta el Motor DC mientras se aplica una potencia de 0. ``BRAKE`` hará que el motor intente frenarse a sí mismo si se está moviendo (NO hará que el motor mantenga su posición si no se está moviendo), mientras que ``FLOAT`` hace que el motor se deslice hasta detenerse, dejando que la fricción haga todo el trabajo.
fr_ca: La modification de cette variable affecte le comportement du moteur à courant continu lorsqu'une puissance de 0 est appliquée. ``BRAKE`` fera en sorte que le moteur essaie de se ralentir s'il est en mouvement (il ne fera PAS en sorte que le moteur maintienne sa position s'il n'est pas déjà en mouvement), tandis que ``FLOTTANT`` fera en sorte que le moteur glisse jusqu'à l'arrêt, laissant la friction faire tout le travail.
ro_ro: Schimbarea acestei variabile afectează felul în care se comportă motorul DC când o putere de 0 este aplicată. ``BRAKE`` va forța motorul să încetinească dacă este în mișcare (nu va face motorul să își mențină poziția dacă nu este deja în mișcare), în timp ce ``FLOAT`` permite motorului să culiseze până la o oprire completă, lăsând frecarea fizică să facă toată munca.
zh_cn: 更改该变量会影响直流电机在功率为 0 时的行为。如果电机正在运动，`BRAKE``会使电机减速（如果电机尚未运动，则不会使电机保持位置），而`FLOAT``会使电机滑行到停止位置，让摩擦力完成所有工作。

source: Finally, there are four different run modes that can be used with DC motors: ::
es_mx: Por último, existen cuatro modos de funcionamiento diferentes que pueden utilizarse con DC Motors:
fr_ca: Enfin, il existe quatre modes de fonctionnement différents qui peuvent être utilisés avec les moteurs à courant continu : : :
ro_ro: În final, există 4 tipuri diferite de rulare care pot fi folosite cu motoarele DC::
zh_cn: 最后，有四种不同的运行模式可用于直流电机::

source: It is important to note that encoder values can be read in any of these modes provided an encoder is properly plugged in. These modes just change how the motor reacts to these encoder values. `The REV Robotics documentation has an explanation of all four run modes <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback#choosing-a-motor-mode>`_.
es_mx: Es importante tener en cuenta que los valores del encoder se pueden leer en cualquiera de estos modos siempre que el encoder esté correctamente conectado. Estos modos sólo cambian la forma en que el motor reacciona a estos valores del codificador. `La documentación de REV Robotics tiene una explicación de los cuatro modos de ejecución <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback#choosing-a-motor-mode>`_.
fr_ca: Il est important de noter que les valeurs du codeur peuvent être lues dans n'importe lequel de ces modes, à condition qu'un codeur soit correctement branché. Ces modes modifient simplement la façon dont le moteur réagit à ces valeurs d'encodage. La documentation de REV Robotics contient une explication des quatre modes de fonctionnement <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback#choosing-a-motor-mode>`_.
ro_ro: Este important de reținut faptul ca valorile encoder-ului pot fi citite în oricare din aceste moduri, în cazul în care un encoder este conectat corect. Aceste moduri doar schimbă modul în care motorul reacționează la aceste valori ale encoder-ului. `Documentația REV Robotics are un tutorial pentru aceste moduri de rulare <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback#choosing-a-motor-mode>`_.
zh_cn: 需要注意的是，只要正确插入编码器，就可以在上述任何模式下读取编码器值。这些模式只是改变电机对这些编码器值的反应方式。 `REV Robotics 文档对所有四种运行模式都有解释 <https://docs.revrobotics.com/duo-control/programming/using-encoder-feedback#choosing-a-motor-mode>`_ 。

source: ``RUN_TO_POSITION`` can be a convenient way to control a single-motor mechanism, as it offloads all control work; however, since every motor is dealt with independently, it is inadvisable to use this on mechanisms with multiple motors, especially drivetrains.
es_mx: ``RUN_TO_POSITION`` puede ser una forma conveniente de controlar un mecanismo de un solo motor, ya que descarga todo el trabajo de control; sin embargo, dado que cada motor se trata de forma independiente, no es aconsejable utilizarlo en mecanismos con múltiples motores, especialmente en un chasis.
fr_ca: ``RUN_TO_POSITION`` peut être un moyen pratique de contrôler un mécanisme à un seul moteur, car il décharge tout le travail de contrôle ; cependant, comme chaque moteur est traité indépendamment, il est déconseillé de l'utiliser sur des mécanismes à plusieurs moteurs, en particulier sur les chaînes cinématiques.
ro_ro: ``RUN_TO_POSITION`` poate fi o metodă ușoară de a controla un mecanism bazat pe un singur motor, din moment ce ușurează toată munca controller-ului; însă, din moment ce fiecare motor este controlat independent, nu este recomandat să folosești această metodă pe mecanisme cu mai multe motoare, în special șasiuri.
zh_cn: ``RUN_TO_POSITION`` 是一种控制单电机机构的便捷方法，因为它卸载了所有控制工作；但是，由于每个电机都是独立处理的，因此不宜用于多电机机构，尤其是底盘驱动系统。

source: Encoders
fr_ca: Encodeurs
ro_ro: Encodere
zh_cn: 编码器

source: Term
es_mx: Término
fr_ca: Définition
ro_ro: Termen
zh_cn: 术语

source: Encoder
fr_ca: Encodeur
zh_cn: 编码器

source: An encoder refers to a device that tracks (generally) rotational movement around an axis.
es_mx: Un encoder es un dispositivo que sigue (generalmente) el movimiento de rotación alrededor de un eje.
fr_ca: Un encodeur est un dispositif qui suit (généralement) un mouvement de rotation autour d'un axe.
ro_ro: Un encoder se referă la un dispozitiv care urmăreste mișcarea rotațională în jurul unui ax.
zh_cn: 编码器是指记录（通常）围绕轴的旋转运动的设备。

source: There are both absolute and relative encoders. An absolute encoder will report at exactly what angle the shaft is compared to its absolute "zero". A relative encoder will report how far the :term:`shaft <Shaft>` has rotated since it started tracking (for example, when autonomous starts). Relative encoders will have a quadrature output, whereas absolute encoders generally have analog or i2c outputs.
es_mx: Existen encoders absolutos y relativos. Un encoder absoluto informará exactamente del ángulo en el que se encuentra el eje en comparación con su "cero" absoluto. Un encoder relativo informará de cuánto ha girado el :término: `eje <Shaft>` desde que comenzó el seguimiento (por ejemplo, cuando se inicia el autónomo). Los encoder relativos tendrán una salida en cuadratura, mientras que los encoders absolutos suelen tener salidas analógicas o i2c.
fr_ca: Il existe des encodeurs absolus et des codeurs relatifs. Un encodeur absolu indique exactement l'angle de rotation de l'arbre par rapport à son "zéro" absolu. Un encodeur relatif indique la distance à laquelle l'arbre :term:`shaft <Shaft>` a tourné depuis le début du suivi (par exemple, lorsque l'autonomie commence). Les encodeurs relatifs ont une sortie en quadrature, tandis que les encodeurs absolus ont généralement des sorties analogiques ou i2c.
zh_cn: 编码器分为绝对编码器和相对编码器。绝对编码器将准确报告轴与其绝对 "零点" 相比的角度。相对编码器将报告 :term:`shaft <Shaft>` 自开始跟踪以来（例如，自主启动时）旋转了多远。相对编码器通过正交信号输出，而绝对编码器通常通过模拟信号或 i2c 输出。

source: Encoders are used to help find the position of where the robot, or one of its mechanisms, is.
es_mx: Los encoders se utilizan para ayudar a encontrar la posición en la que se encuentra el robot, o uno de sus mecanismos.
fr_ca: Les encodeurs sont utilisés pour déterminer la position du robot ou de l'un de ses mécanismes.
ro_ro: Encoderele sunt folosite pentru a găsi poziția robotului, sau a unui mecanism.
zh_cn: 编码器用于帮助找到机器人或其部分机械结构的位置。

source: While all FTC legal motors contain built in relative quadrature encoders, they must be wired separately and are not required for use. External encoders may be used and plugged into an encoder port so long as they use the quadrature communication protocol.
es_mx: Aunque todos los motores legales FTC contienen codificadores de cuadratura relativa incorporados, deben cablearse por separado y no son necesarios para su uso. Se pueden utilizar encoders externos y conectarlos a un puerto de encoder siempre que utilicen el protocolo de comunicación de cuadratura.
fr_ca: Bien que tous les moteurs légaux de la FTC contiennent des encodeurs relatifs en quadrature intégrés, ils doivent être câblés séparément et ne sont pas nécessaires à leur utilisation. Des encodeurs externes peuvent être utilisés et branchés sur un port de codeur à condition qu'ils utilisent le protocole de communication en quadrature.
ro_ro: Deși toate motoarele legale FTC conțin encodere relative cuadratule, acestea trebuie conectate separat și nu sunt obligatorii. Encoderele externe pot fi folosite și conectate într-un port de encoder cât timp folosesc protocolul cuadratul de comunicare.
zh_cn: 虽然所有 FTC 合规电机都内置有相对正交编码器，但必须单独接线，且并非必须使用。只要使用正交通信协议，就可以使用外部编码器并将其插入编码器端口。

source: Accessing encoders requires calling one method on the DcMotor object, ``getCurrentPosition()``, which returns the current position of the encoder plugged into the port. This number may be arbitrary at the beginning of an opmode, and is not reset to 0 unless ``STOP_AND_RESET_ENCODERS`` is used or power is cycled to the expansion hub.
es_mx: Para acceder a los encoders es necesario llamar a un método del objeto DcMotor, ``getCurrentPosition()``, que devuelve la posición actual del encoder conectado al puerto. Este número puede ser arbitrario al principio de un opmode, y no se reinicia a 0 a menos que se use ``STOP_AND_RESET_ENCODERS`` o se desconecte y vuelva la alimentación al expansion hub.
fr_ca: L'accès aux encodeurs nécessite d'appeler une méthode sur l'objet DcMotor, ``getCurrentPosition()``, qui renvoie la position actuelle de l'encodeur branché sur le port. Ce nombre peut être arbitraire au début d'un mode op, et n'est pas remis à 0 à moins que ``STOP_AND_RESET_ENCODERS`` ne soit utilisé ou que l'alimentation du hub d'expansion ne soit cyclique.
ro_ro: Accesarea encoderelor necesită apelarea unei metode din obiectul DcMotor, ``getCurrentPosition()``, care returnează poziția curentă a encoderului conectat la port. Acest număr poate fi arbitrar la începutul unui opmode, și nu este resetat la 0 decât dacă ``STOP_AND_RESET_ENCODERS`` este folosit sau este restartat Expansion Hub-ul.
zh_cn: 访问编码器需要调用 DcMotor 对象上的一个方法 ``getCurrentPosition()``，该方法可返回插入端口的编码器的当前位置。该数字在 opmode 开始时可以是任意的，除非使用了 ``STOP_AND_RESET_ENCODERS`` 或对Expansion Hub进行了电源循环，否则不会重置为 0。

source: There is no real standardized terminology when dealing with quadrature encoders. The SDK uses "CPR" or Counts Per Revolution by default,. You may also see some datasheets list "PPR" or Pulses per Revolution. One pulse can be equivalent to anywhere from 1 to 4 SDK "counts". Be careful when reading datasheets!
es_mx: No existe una terminología estandarizada real cuando se trata de codificadores de cuadratura. El SDK utiliza "CPR" o recuentos por revolución, por defecto. También puede ver algunas hojas de datos lista "PPR" o pulsos por revolución. Un pulso puede ser equivalente a entre 1 y 4 "recuentos" SDK. Tenga cuidado al leer las hojas de datos.
fr_ca: Il n'existe pas vraiment de terminologie normalisée pour les encodeurs en quadrature. Le SDK utilise par défaut "CPR" ou "Counts Per Revolution". Certaines fiches techniques indiquent également "PPR" ou Impulsions par Révolution. Une impulsion peut être équivalente à 1 à 4 "comptes" du SDK. Soyez prudent lorsque vous lisez des fiches techniques !
ro_ro: Nu există o terminologie standard când utilizezi encodere cuadratule. SDK-ul folosește "CPR" sau Citiri Pe Revoluție implicit. S-ar putea să vezi și documente care menționează "PPR" sau Pulsuri Pe Revoluție. Un puls poate fi echivalentul a între 1 si 4 citiri ale SDK-ului. Ai grijă când citești documentațiile!
zh_cn: 处理正交编码器时没有真正的标准化术语。SDK 默认使用 "CPR"（每转计数）。您也可能看到一些数据表列出了 "PPR"（每转脉冲数）。一个脉冲相当于 1 到 4 个 SDK "计数"。阅读数据表时要小心！

source: Encoders with high numbers of Counts per Revolution, such as the REV Through Bore Encoder, can lose steps if plugged into ports 1 or 2. In addition, calls to ``getVelocity()`` on a DcMotorEx object may overflow with high counts per revolution encoders, due to the returned number only being a 16 bit signed integer.
es_mx: Los codificadores con altos números de conteos por revolución, como el REV Through Bore Encoder, pueden perder pasos si se conectan a los puertos 1 o 2. Además, las llamadas a ``getVelocity()`` en un objeto DcMotorEx pueden desbordarse con codificadores de recuentos altos por revolución, debido a que el número devuelto sólo es un entero con signo de 16 bits.
fr_ca: Les encodeurs ayant un nombre élevé de comptes par révolution, tels que le codeur à alésage traversant REV, peuvent perdre des pas s'ils sont branchés sur les ports 1 ou 2. De plus, les appels à ``getVelocity()`` sur un objet DcMotorEx peuvent déborder avec des encodeurs à grand nombre de comptes par révolution, car le nombre retourné n'est qu'un entier signé de 16 bits.
ro_ro: Encoderele cu CPR mare, precum REV Through Bore Encoder, poate pierde pași dacă sunt conectate la porturile 1 si 2. În plus, apelurile la ``getVelocity()`` pe un obiect DcMotorEx poate suprasolicita programul cu citiri excesive CPR, din cauza numărului returnat care este un număr întreg de 16 biți.
zh_cn: 每转计数较高的编码器（如 REV 通孔编码器）如果插入端口 1 或 2，可能会丢失步进。此外，调用 DcMotorEx 对象上的 ``getVelocity()``时，由于返回的数字仅为 16 位有符号整数，因此每转计数高的编码器可能会溢出。

source: Servo
ro_ro: Servomotoare
zh_cn: 舵机
