Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/common-issues.po
Languages: es_mx, fr_ca, zh_cn

source: Common Issues
es_mx: Problemas Comunes
fr_ca: Problèmes communs
zh_cn: 常见问题

source: Be careful what code you take as a reference from this page! Some of it is intentionally buggy to demonstrate potential easy-to-make errors.
es_mx: ¡Tenga cuidado con el código que toma como referencia de esta página! Parte de él es intencionadamente defectuoso para demostrar posibles errores fáciles de cometer.
fr_ca: Faites attention au code que vous prenez comme référence sur cette page ! Certains codes sont volontairement bogués afin de montrer les erreurs potentielles faciles à commettre.
zh_cn: 请小心参考本页中的代码！其中有些代码是故意写错的，以展示潜在的易错点。

source: Exceptions
es_mx: Excepciones
zh_cn: 异常处理

source: Exceptions are events that occur during the execution of a program, disrupting the normal flow of instructions, used in error events or problems that arise during runtime. A exception can be caught to avoid propagation, otherwise any exception that's not handled will cause the program flow to stop immediately.
es_mx: Las excepciones son eventos que ocurren durante la ejecución de un programa, interrumpiendo el flujo normal de instrucciones, utilizadas en eventos de error o problemas que surgen durante el tiempo de ejecución. Una excepción puede ser atrapada para evitar su propagación, de lo contrario cualquier excepción que no sea manejada causará que el flujo del programa se detenga inmediatamente.

source: Some common types of exceptions include:
es_mx: Algunos tipos comunes de excepciones son:
fr_ca: Les exceptions les plus courantes sont les suivantes
zh_cn: 常见的异常情况包括

source: **NullPointerException**
es_mx: **Excepción de puntero nulo/NullPointerException**
zh_cn: **无效指针异常**

source: It occurs when trying to call a method or getting a property of an object from a variable with a *null* value, which basically means that the variable doesn't hold a value *yet*, or the value doesn't exist.
es_mx: Ocurre cuando se intenta llamar a un método u obtener una propiedad de un objeto de una variable con un valor *nulo*, lo que básicamente significa que la variable no contiene un valor *todavía*, o el valor no existe.
fr_ca: Il se produit lorsqu'on essaie d'appeler une méthode ou d'obtenir une propriété d'un objet à partir d'une variable ayant une valeur *nulle*, ce qui signifie essentiellement que la variable ne contient pas encore de valeur ou que la valeur n'existe pas.
zh_cn: 当试图调用一个方法或从一个 *空值* 的变量获取一个对象的属性时，就会出现这种情况，这基本上意味着该变量* 还没有* 值，或者该值不存在。

source: This exception is one of the most common in FTC\ |reg|, below is an example that throws a NullPointerException:
es_mx: Esta excepción es una de las más comunes en FTC |reg|, a continuación se muestra un ejemplo que lanza una NullPointerException:
fr_ca: Cette exception est l'une des plus courantes en FTC\ |reg|, voici un exemple qui lance une NullPointerException :
zh_cn: 该异常是 FTC\ |reg| 中最常见的异常之一，下面是一个抛出 NullPointerException 的示例：

source: This can be fixed moving the "Servo" variable value definition to the init (or ``runOpMode()`` in LinearOpModes) method as follows:
es_mx: Esto se puede arreglar moviendo la definición del valor de la variable "Servo" al método init (o ``runOpMode()`` en LinearOpModes) de la siguiente manera:
fr_ca: Ceci peut être corrigé en déplaçant la définition de la valeur de la variable "Servo" dans la méthode init (ou ``runOpMode()`` dans les LinearOpModes) comme suit :
zh_cn: 可以将 "Servo"变量值定义移至 init（或 LinearOpModes 中的 `runOpMode()`）方法，如下所示：

source: **TargetPositionNotSetException**
es_mx: **Excepción de Posición del Objetivo No Establecido/ TargetPositionNotSetException**
zh_cn: **目标位置未设置异常**

source: This exception type is a custom one from the SDK. It means you changed the motor ``RunMode`` to RUN_TO_POSITION before setting a target position:
es_mx: Este tipo de excepción es uno personalizado del SDK. Significa que has cambiado el ``RunMode`` del motor a RUN_TO_POSITION antes de establecer una posición como objetivo:
fr_ca: Ce type d'exception est une exception personnalisée du SDK. Il signifie que vous avez changé le ``RunMode`` du moteur en RUN_TO_POSITION avant de définir une position cible :
zh_cn: 这种异常类型是 SDK 自定义的。这意味着您在设置目标位置前将电机的 ``RunMode`` 更改为 RUN_TO_POSITION：

source: It is fixed by simply switching the order of the statements; setting target position first, then changing the ``RunMode``:
es_mx: Se soluciona simplemente cambiando el orden de las oraciones; fijando primero la posición objetivo y luego cambiando el ``RunMode``:
fr_ca: Pour y remédier, il suffit d'intervertir l'ordre des instructions : définir d'abord la position de la cible, puis modifier le ``RunMode`` :
zh_cn: 要解决这个问题，只需转换语句的顺序；先设置目标位置，然后更改 ``RunMode`` 即可：

source: **ArithmeticException**
es_mx: **ExcepciónAritmética/ ArithmeticException**
fr_ca: **Exception arithmétique**
zh_cn: **算术异常**

source: Occurs when performing any illegal arithmetic operations such as dividing by zero:
es_mx: Ocurre al realizar cualquier operación aritmética ilegal, como dividir por cero:
fr_ca: Se produit lors de l'exécution d'opérations arithmétiques illégales telles que la division par zéro :
zh_cn: 在执行任何非法算术运算（如除以零）时出现：

source: It can be handled by enclosing the code likely to throw this type of exception with a `try catch block <https://www.w3schools.com/java/java_try_catch.asp>`_:
es_mx: Puede gestionarse encerrando el código susceptible a lanzar este tipo de excepción con un bloque `try catch <https://www.w3schools.com/java/java_try_catch.asp>`_:
fr_ca: Elle peut être gérée en entourant le code susceptible de lancer ce type d'exception d'un "bloc de capture d'essai" <https://www.w3schools.com/java/java_try_catch.asp>`_ :
zh_cn: 处理方法是用一个 `try catch 代码块 <https://www.w3schools.com/java/java_try_catch.asp>`_ ，将可能抛出此类异常的代码包围起来：

source: **InterruptedException**
es_mx: **ExcepciónDeInterrupción/ InterruptedException**
fr_ca: **Exception interrompue**
zh_cn: **中断异常**

source: It means that the SDK requested the OpMode to stop, and it's considered part of normal operation. An interrupt means that the current thread has been requested to end, so don't panic when you see a spam of those in :ref:`logcat <logcat>`!
es_mx: Significa que el SDK solicitó al OpMode que se detuviera, y se considera parte de la operación normal. ¡Una interrupción significa que el hilo actual ha sido solicitado para terminar, así que no te asustes cuando veas un spam de esos en :ref:`logcat <logcat>`!
fr_ca: Cela signifie que le SDK a demandé à l'OpMode de s'arrêter, et c'est considéré comme faisant partie du fonctionnement normal. Une interruption signifie qu'il a été demandé au thread en cours de se terminer, alors ne paniquez pas lorsque vous voyez un spam de ce type dans :ref:`logcat <logcat>` !
zh_cn: 这意味着 SDK 要求操作模式停止，并将其视为正常操作的一部分。中断意味着当前线程已被请求结束，所以当你在 :ref:`logcat <logcat>` 中看到大量中断时不要惊慌！

source: If you call a method that possibly throws an InterruptedException (such as ``Thread.sleep()``) it should be handled like this, with the try catch syntax mentioned before:
es_mx: Si llamas a un método que posiblemente lanza una InterruptedException (como ``Thread.sleep()``) debería ser manejado así, con la sintaxis try catch mencionada antes:
fr_ca: Si vous appelez une méthode qui peut lancer une exception InterruptedException (comme ``Thread.sleep()``), elle doit être traitée comme ceci, avec la syntaxe try catch mentionnée plus haut :
zh_cn: 如果调用可能抛出中断异常的方法（如 ``Thread.sleep()``），则应使用前面提到的 try catch 语法进行类似处理：

source: Note that LinearOpMode already contains a shorthand `sleep() <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/LinearOpMode.java#L96>`_ method that does this under the hood. (And you shouldn't be using sleeps in OpMode since they're more strictly controlled. Read next sections for further information)
es_mx: Tenga en cuenta que LinearOpMode ya contiene un método abreviado `sleep() <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/LinearOpMode.java#L96>`_ que hace esto bajo el capó. (Y no deberías usar sleeps en OpMode ya que están más estrictamente controlados. Lee las siguientes secciones para más información)
fr_ca: Notez que LinearOpMode contient déjà une méthode raccourcie `sleep() <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/LinearOpMode.java#L96>`_ qui fait cela sous le capot. (Et vous ne devriez pas utiliser les sleeps en OpMode puisqu'ils sont plus strictement contrôlés. Lisez les sections suivantes pour plus d'informations)
zh_cn: 请注意，LinearOpMode 已经包含了一个速记的 `sleep() <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/LinearOpMode.java#L96>`_ 方法，本质上就是调用了 ``Thread.sleep()``。(你不应该在 OpMode 中使用 sleep() ，因为它们受到更严格的控制。更多信息请阅读后续章节）

source: How the SDK handles exceptions
es_mx: Cómo gestiona el SDK las excepciones
fr_ca: Comment le SDK gère les exceptions
zh_cn: SDK 如何处理异常

source: Except for InterruptedExceptions and some other internal special cases, which simply cause the OpMode to end, the FTC SDK performs an "emergency stop" routine when an exception is thrown and not handled properly. This halts the OpMode and displays the full stacktrace on screen. The stacktrace can also be viewed through :ref:`logcat` when using Android Studio.
es_mx: Excepto para InterruptedExceptions y algunos otros casos especiales internos, que simplemente hacen que el OpMode termine, el FTC SDK realiza una rutina de "parada de emergencia" cuando se lanza una excepción y no se maneja correctamente. Esto detiene el OpMode y muestra el stacktrace completo en pantalla. El stacktrace también se puede ver a través de :ref:`logcat` cuando se utiliza Android Studio.
fr_ca: À l'exception des exceptions interrompues et de certains autres cas spéciaux internes, qui entraînent simplement la fin du mode Op, le SDK FTC exécute une routine d'"arrêt d'urgence" lorsqu'une exception est déclenchée et n'est pas traitée correctement. Cette routine arrête le mode OpMode et affiche l'intégralité de la trace de la pile à l'écran. La trace de la pile peut également être visualisée via :ref:`logcat` lorsque vous utilisez Android Studio.
zh_cn: 除了中断异常和其他一些内部特殊情况（这些情况只会导致运行模式结束）外，FTC SDK 会在异常抛出且处理不当时执行 "紧急停止 "例程。这会停止运行模式，并在屏幕上显示完整的堆栈跟踪。使用 Android Studio 时，也可通过 :ref:`logcat` 查看堆栈跟踪。

source: Before SDK 8.0, only the first line of the error would be displayed and selecting "Restart Robot" from the menu would be required before running an OpMode again.
es_mx: Antes del SDK 8.0, sólo se mostraba la primera línea del error y era necesario seleccionar "Reiniciar Robot" en el menú antes de volver a ejecutar un OpMode.
fr_ca: Avant le SDK 8.0, seule la première ligne de l'erreur s'affichait et il fallait sélectionner "Redémarrer le robot" dans le menu avant d'exécuter à nouveau un mode Op.
zh_cn: 在 SDK 8.0 之前，只会显示错误的第一行，并且需要从菜单中选择 "重新启动机器人 "才能再次运行 OpMode。

source: It's generally a good idea to debug all OpModes extensively before any official match, as these exceptions are disruptive.
es_mx: Por lo general, es una buena idea debugear/depurar ampliamente todos los OpModes antes de cualquier partido oficial, ya que estas excepciones son perjudiciales.
fr_ca: Il est généralement conseillé de déboguer tous les OpModes de manière approfondie avant tout match officiel, car ces exceptions sont perturbantes.
zh_cn: 一般来说，在正式比赛前最好对所有操作模式进行全面调试，因为这些异常会造成干扰。

source: Stuck in start, loop, stop...
es_mx: Atascado en start, loop, stop...
fr_ca: Coincé dans le démarrage, boucle, arrêt ...
zh_cn: 卡在启动、循环、停止...

source: OpModes are *strictly controlled programs*, in the sense that the SDK requires them to flow in a certain way with the methods ``init()``, ``loop()``, etc. If you take more than a specific time (`5 seconds, or 900 milliseconds in stop commands <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/OpMode.java#L189>`_) executing an action in any of these methods, the SDK will perform the "emergency stop" routine explained before, with the "stuck in ``action``" error message.
es_mx: Los OpModes son *programas estrictamente controlados*, en el sentido de que el SDK requiere que fluyan de una determinada manera con los métodos ``init()``, ``loop()``, etc. Si tardas más de un tiempo específico (`5 segundos, o 900 milisegundos en comandos de parada <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/OpMode.java#L189>`_) ejecutando una acción en cualquiera de estos métodos, el SDK realizará la rutina de "parada de emergencia" explicada antes, con el mensaje de error "atascado en ``acción``".
fr_ca: Les OpModes sont des programmes *strictement contrôlés*, dans le sens où le SDK exige qu'ils se déroulent d'une certaine manière avec les méthodes ``init()``, ``loop()``, etc. Si vous prenez plus d'un certain temps (`5 secondes, ou 900 millisecondes dans les commandes d'arrêt <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/OpMode.java#L189>`_) à exécuter une action dans l'une de ces méthodes, le SDK exécutera la routine d'"arrêt d'urgence" expliquée précédemment, avec le message d'erreur "stuck in ``action``" (bloqué dans l'action).
zh_cn: OpModes是 *严格控制的程序* ，SDK要求它们以一定的方式与 ``init()`` 、 ``loop()`` 等方法一起运行。如果您执行这些方法中的任何一个操作的时间超过了特定的时间（`5 秒，或停止命令中的 900 毫秒 <https://github.com/OpenFTC/Extracted-RC/blob/f47d6f15fa1b59faaf509a522e0ec04f223ec125/RobotCore/src/main/java/com/qualcomm/robotcore/eventloop/opmode/OpMode.java#L189>`_ ），SDK 就会执行之前解释过的 "紧急停止 "例程，并显示 "卡在`操作`中`"的错误信息。

source: If you need to run any sort of lengthy action in your OpMode, another option would be using a LinearOpMode instead.
es_mx: Si necesita ejecutar algún tipo de acción larga en su OpMode, otra opción sería utilizar un LinearOpMode en su lugar.

source: LinearOpModes are less strict since their single ``runOpMode()`` method can flow more freely, but they still need to be cooperative to stop requests. Take the following code as an example:
es_mx: Los LinearOpModes son menos estrictos ya que su único método ``runOpMode()`` puede fluir más libremente, pero aún necesitan ser cooperativos para detener peticiones. Tomemos el siguiente código como ejemplo:
fr_ca: Les LinearOpModes sont moins stricts puisque leur unique méthode ``runOpMode()`` peut circuler plus librement, mais ils ont toujours besoin d'être coopératifs pour arrêter les requêtes. Prenons l'exemple du code suivant :
zh_cn: LinearOpModes 没有那么严格，因为它们的单一 ``runOpMode()`` 方法可以更自由地流动，但它们仍然需要写点代码来配合停止请求。以下面的代码为例：

source: This code isn't cooperative to stop requests, since the ``while`` loop doesn't have an exit condition to cooperate with the OpMode stopping, therefore, this code will cause a "stuck in stop" error once it's stopped in the Driver Station.
es_mx: Este código no coopera con las peticiones de parada, ya que el bucle ``while`` no tiene una condición de salida para cooperar con la parada del OpMode, por lo tanto, este código causará un error de "atascado en parada" una vez que se detenga en la estación del conductor.
fr_ca: Ce code n'est pas coopératif avec les demandes d'arrêt, puisque la boucle ``while`` n'a pas de condition de sortie pour coopérer avec l'arrêt de l'OpMode, par conséquent, ce code provoquera une erreur "coincé dans l'arrêt" une fois qu'il sera arrêté dans la Driver Station.
zh_cn: 由于 ``while`` 循环没有退出条件来配合操作模式的停止，因此，一旦在驱动站中停止，这段代码就会导致 "卡在停止中 "的错误。

source: To cooperate with the stopping of the OpMode, an ``opModeIsActive()`` or ``!isStopRequested()`` condition is required to be added to all the blocking loops executed in the ``runOpMode()`` method. Consult the :doc:`linear-opmode-vs-opmode` page for more information about these methods.
es_mx: Para cooperar con la parada del OpMode, se requiere añadir una condición ``opModeIsActive()`` o ``!isStopRequested()`` a todos los bucles de bloqueo ejecutados en el método ``runOpMode()``. Consulta la página :doc:`linear-opmode-vs-opmode` para más información sobre estos métodos.
fr_ca: Pour coopérer avec l'arrêt de l'OpMode, une condition ``opModeIsActive()`` ou ``!isStopRequested()`` doit être ajoutée à toutes les boucles bloquantes exécutées dans la méthode ``runOpMode()`. Consultez la page :doc:`linear-opmode-vs-opmode` pour plus d'informations sur ces méthodes.
zh_cn: 为了配合 OpMode 的停止，需要在 ``runOpMode()`` 方法中执行的所有阻塞循环中添加 ``opModeIsActive()`` 或 ``!isStopRequested()`` 条件。有关这些方法的更多信息，请参阅 :doc:`linear-opmode-vs-opmode` 页面。

source: An example for a cooperative LinearOpMode would be as follows:
es_mx: Un ejemplo de LinearOpMode cooperativo sería el siguiente:
fr_ca: Voici un exemple de mode de coopération LinearOpMode :
zh_cn: 配合停止请求的 LinearOpMode 的示例如下：

source: Exceptions are events that occur during the execution of a program, disrupting the normal flow of instructions, used in error events or problems that arise during runtime. A exception can be catched to avoid propagation, otherwise any exception that's not handled will cause the program flow to stop immediately.
zh_cn: 异常是在程序执行过程中发生的事件，会扰乱正常的指令流程，用于错误事件或运行时出现的问题。异常可以被捕获以避免传播，否则任何未处理的异常都会导致程序流程立即停止。

source: If you need to run any sort of lenghty action in your OpMode, another option would be using a LinearOpMode instead.
zh_cn: 如果需要在 OpMode 中运行任何较长的操作，另一种方法是使用 LinearOpMode。
