Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/fundamental-concepts.po
Languages: es_mx, fr_ca, zh_cn

source: Fundamental Concepts of Programming
es_mx: Conceptos fundamentales de programación
fr_ca: Concepts fondamentaux de la programmation
zh_cn: 编程基本概念

source: For almost any programming language, whether it's Java, Python, or Blocks, there are concepts in coding that transfer across languages. These ideas are foundational when learning to program and should be applicable in FTC\ |reg| and beyond.
es_mx: Para casi cualquier lenguaje de programación, ya sea Java, Python o Blocks, hay conceptos de codificación que se transfieren entre lenguajes. Estas ideas son fundamentales cuando se aprende a programar y deberían ser aplicables en FTC\ |reg| y más allá.
fr_ca: Pour presque tous les langages de programmation, que ce soit Java, Python ou Blocks, il existe des concepts de codage qui sont transférables d'un langage à l'autre. Ces idées sont fondamentales lors de l'apprentissage de la programmation et devraient s'appliquer à FTC\ |reg| et au-delà.
zh_cn: 对于几乎任何编程语言，无论是Java、Python还是图形化编程，代码中都有跨语言迁移的概念。这些是学习编程时的基础，应该适用于FTC\ |reg| 及其他领域。

source: This section is primarily for people with limited Java experience. However, even if you are more experienced, it may still be helpful to skim through the section, as you might find concepts that have not yet been introduced to you.
es_mx: Esta sección está dirigida principalmente a personas con poca experiencia en Java. Sin embargo, incluso si usted tiene más experiencia, puede ser útil hojear la sección, ya que puede encontrar conceptos que aún no se han introducido a usted.
fr_ca: Cette section s'adresse principalement aux personnes ayant une expérience limitée de Java. Toutefois, même si vous êtes plus expérimenté, il peut être utile de parcourir cette section, car vous pourriez y trouver des concepts qui ne vous ont pas encore été présentés.
zh_cn: 本节主要面向Java经验有限的人。然而，即使你很有经验，浏览本节仍然可能有所帮助，因为你可能会发现你尚未知晓的概念。

source: Examples will mostly be in Java, where ``//`` indicates a comment which the program ignores and is used for people to read.
es_mx: Los ejemplos serán sobre todo en Java, donde ``//`` indica un comentario que el programa ignora y se utiliza para que la gente lo lea.
fr_ca: Les exemples seront principalement en Java, où ``//`` indique un commentaire que le programme ignore et qui est utilisé pour que les gens puissent le lire.
zh_cn: 示例主要使用Java编写，其中 ``//`` 表示被注释的程序，人们阅读注释来获取代码的说明。

source: Java-Specific Exploratory Questions
es_mx: Preguntas exploratorias específicas de Java
fr_ca: Questions exploratoires spécifiques à Java
zh_cn: Java特定的探索性问题

source: If I didn't set a value for number and then I printed it, what would it print?
es_mx: Si no estableciera un valor para número y luego lo imprimiera, ¿qué imprimiría?
fr_ca: Si je n'ai pas défini de valeur pour le nombre et que je l'imprime ensuite, qu'est-ce qui s'imprimerait ?
zh_cn: 如果我没有设置数字的值，然后我输出它，它会输出什么？

source: What other operations can I do with number and secondNumber?
es_mx: ¿Qué otras operaciones puedo hacer con number y secondNumber?
fr_ca: Quelles autres opérations puis-je effectuer avec number et secondNumber ?
zh_cn: 我还可以对 number 和 secondNumber 进行哪些操作？

source: Can I set a decimal to number? If not, what happens?
es_mx: ¿Puedo poner un decimal a un número? Si no, ¿qué ocurre?
fr_ca: Puis-je attribuer une décimale à un nombre ? Si ce n'est pas le cas, que se passe-t-il ?
zh_cn: 我可以给数字设置小数吗？如果没有，会发生什么？

source: What is ``System.out.println();``?
es_mx: ¿Qué es ``System.out.println();``?
fr_ca: Qu'est-ce que ``System.out.println();`` ?
zh_cn: 什么是 ``System.out.println();`` ？

source: Delete one character in the code. Remember the error (if any), and then undo it. Delete another part. How many different errors can you get?
es_mx: Borra un carácter del código. Recuerda el error (si lo hay) y deshazlo. Borra otra parte. ¿Cuántos errores diferentes puedes obtener?
fr_ca: Supprimez un caractère dans le code. Se souvenir de l'erreur (s'il y en a une), puis l'annuler. Supprimez une autre partie. Combien d'erreurs différentes pouvez-vous obtenir ?
zh_cn: 删除代码中的一个字符。记住错误（如果有），然后撤消它。删除另一部分。你可以得到多少不同的错误？

source: There are different types of variables
es_mx: Existen diferentes tipos de variables
fr_ca: Il existe différents types de variables
zh_cn: 不同类型的变量

source: Numbers (Integers, Floats, Doubles)
es_mx: Números (Integers, Floats, Doubles)
fr_ca: Nombres (entiers, flottants, doubles)
zh_cn: 数字（整数、浮点数、双精度）

source: Strings (Text) or characters
es_mx: Strings (texto) o caracteres
fr_ca: Chaînes (texte) ou caractères
zh_cn: 字符串（文本）或字符

source: And a lot more depending on the language (Ex: Arrays)
es_mx: Y mucho más dependiendo del lenguaje (Ej: Arrays)
fr_ca: Et bien d'autres choses encore en fonction du langage (ex : tableaux).
zh_cn: 更多取决于语言（例如：数组）

source: They help tell the program know the basis of what it should do with a variable.
es_mx: Ayudan a que el programa conozca la base de lo que debe hacer con una variable.
fr_ca: Ils permettent au programme de savoir ce qu'il doit faire avec une variable.
zh_cn: 它们有助于告诉程序如何处理变量。

source: Replace the text in ``coolName`` to something else. Your name, a phone number, your favorite anime. What about emotes and copypastas? What about characters in other languages?
es_mx: Reemplace el texto en ``coolName`` por algo más. Tu nombre, un número de teléfono, tu anime favorito. ¿Qué tal los emoticones y copypastas? ¿Y los caracteres en otros idiomas?
fr_ca: Remplacez le texte de ``coolName`` par quelque chose d'autre. Votre nom, un numéro de téléphone, votre anime préféré. Qu'en est-il des emotes et des copypastas ? Qu'en est-il des caractères dans d'autres langues ?
zh_cn: 将 ``coolName`` 中的文本替换为其他内容。你的名字、电话号码、你最喜欢的动漫。那表情符号和复制内容会怎么样呢？又或是其他语言的字母呢？

source: Try adding a number and a string, what happens?
es_mx: Prueba a sumar un número y una cadena, ¿qué ocurre?
fr_ca: Essayez d'ajouter un nombre et une chaîne de caractères, que se passe-t-il ?
zh_cn: 尝试添加一个数字和一个字符串，会发生什么？

source: Is it possible to add multiple strings and numbers together?
es_mx: ¿Es posible sumar varias cadenas y números?
fr_ca: Est-il possible d'additionner plusieurs chaînes de caractères et plusieurs nombres ?
zh_cn: 是否可以将多个字符串和数字添加在一起？

source: Important Control Structures
es_mx: Estructuras de control importantes
fr_ca: Structures de contrôle importantes
zh_cn: 重要控制结构

source: Be sure to familiarize yourself with basic control structures (if/else statements, for loops, while loops, and for-each loops). These control structures are by far the most commonly encountered, and thus, familiarizing yourself with these principles is extremely important (not just for FTC, but programming in general). However, there are a few control structures that are far less common that are extremely useful in FTC; namely :doc:`/docs/software/concepts/finite-state-machines`.
es_mx: Familiarícese con las estructuras de control básicas (sentencias if/else, bucles for, bucles while y bucles for-each). Estas estructuras de control son, con diferencia, las más comunes y, por lo tanto, familiarizarse con estos principios es extremadamente importante (no sólo para FTC, sino para la programación en general). Sin embargo, hay algunas estructuras de control mucho menos comunes que son extremadamente útiles en FTC; concretamente :doc:`/docs/software/concepts/finite-state-machines`.
fr_ca: Veillez à vous familiariser avec les structures de contrôle de base (instructions if/else, boucles for, boucles while et boucles for-each). Ces structures de contrôle sont de loin les plus couramment rencontrées, et il est donc extrêmement important de se familiariser avec ces principes (non seulement pour le FTC, mais aussi pour la programmation en général). Cependant, il existe quelques structures de contrôle beaucoup moins courantes qui sont extrêmement utiles en FTC, à savoir :doc:`/docs/software/concepts/finite-state-machines`.
zh_cn: 一定要熟悉基本的控制结构（if/else语句、for循环、while循环和for-each循环）。这些控制结构是最常见的，因此，熟悉这些结构非常重要（不仅仅是FTC，一般的编程亦是如此）。然而，有一些不太常见的控制结构在FTC中非常有用；即 :doc:`/docs/software/concepts/finite-state-machines`.。

source: Data Structures (Arrays)
es_mx: Estructuras de datos (matrices)
fr_ca: Structures de données (tableaux)
zh_cn: 数据结构（数组）

source: Data structures are a method of organizing and storing large amounts of data. There are a lot of different types of data structures that mostly differ in the relationships between data points, and we would recommend that you read into them. We will only go over a few here.
es_mx: Las estructuras de datos son un método para organizar y almacenar grandes cantidades de datos. Hay muchos tipos diferentes de estructuras de datos que difieren principalmente en las relaciones entre los puntos de datos, y le recomendamos que lea sobre ellos. Aquí sólo repasaremos algunas.
fr_ca: Les structures de données sont une méthode d'organisation et de stockage de grandes quantités de données. Il existe de nombreux types de structures de données qui diffèrent principalement par les relations entre les points de données, et nous vous recommandons de les étudier. Nous n'en aborderons que quelques-unes ici.
zh_cn: 数据结构是一种组织和存储大量数据的方法。有许多不同类型的数据结构，它们在数据点之间的关系上大多不同，我们建议你仔细阅读它们。我们在这里只介绍几个。

source: `Arrays <https://www.geeksforgeeks.org/arrays-in-java/>`_
zh_cn: `数组 <https://www.geeksforgeeks.org/arrays-in-java/>`_

source: Arrays are the most basic and simple data structure. When an array is initialized, its size must be set, and it cannot be changed.
es_mx: Las matrices son las estructuras de datos más básicas y sencillas. Cuando se inicializa un array, debe fijarse su tamaño, que no puede modificarse.
fr_ca: Les tableaux constituent la structure de données la plus simple et la plus élémentaire. Lorsqu'un tableau est initialisé, sa taille doit être définie et elle ne peut pas être modifiée.
zh_cn: 数组是最基本、最简单的数据结构，数组初始化时，必须设置其大小，不可更改。

source: If you wish to expand an array, a new one must be created and all of the old data copied over. Elements of an array are stored adjacent to each other in memory, so when they are accessed the number you want to access times the amount of bits in the object in the array is added to the starting address, and data is accessed from there.
es_mx: Si se desea ampliar una matriz, hay que crear una nueva y copiar todos los datos antiguos. Los elementos de una matriz se almacenan adyacentes en la memoria, de modo que cuando se accede a ellos, el número al que se quiere acceder multiplicado por la cantidad de bits del objeto de la matriz se suma a la dirección inicial, y desde ahí se accede a los datos.
fr_ca: Si vous souhaitez étendre un tableau, il faut en créer un nouveau et copier toutes les anciennes données. Les éléments d'un tableau sont stockés les uns à côté des autres dans la mémoire, de sorte que lorsqu'on y accède, le nombre auquel on veut accéder multiplié par le nombre de bits de l'objet dans le tableau est ajouté à l'adresse de départ, et c'est à partir de là que l'on accède aux données.
zh_cn: 如果你想扩展一个数组，必须创建一个新的数组，并复制所有旧数据。数组的元素彼此相邻地存储在内存中，因此当它们被访问时，你想访问的数字乘以数组中对象的位数被添加到起始地址，并从那里访问数据。

source: This means that arrays are incredibly efficient at reading data in a nonlinear order.
es_mx: Esto significa que las matrices son increíblemente eficientes en la lectura de datos en un orden no lineal.
fr_ca: Cela signifie que les tableaux sont incroyablement efficaces pour lire des données dans un ordre non linéaire.
zh_cn: 这意味着数组在以非线性顺序读取数据方面非常有效。

source: `ArrayList <https://www.geeksforgeeks.org/arraylist-in-java/>`_
zh_cn: `数组列表 <https://www.geeksforgeeks.org/arraylist-in-java/>`_

source: `Object Oriented Programming in Java <https://www.geeksforgeeks.org/classes-objects-java/>`_
es_mx: `Programación Orientada a Objetos en Java <https://www.geeksforgeeks.org/classes-objects-java/>`_
zh_cn: `Java中的面向对象编程 <https://www.geeksforgeeks.org/classes-objects-java/>`_
