Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/linear-opmode-vs-opmode.po
Languages: es_mx, fr_ca, zh_cn

source: LinearOpMode vs OpMode
fr_ca: Mode LinearOp vs Mode Op
zh_cn: LinearOpMode与OpMode

source: There are two OpMode classes within the FTC\ |reg| SDK: ``OpMode`` and ``LinearOpMode``. The one you use affects how you write the program. For examples of how to use OpMode and LinearOpMode, `refer to the example OpModes in the SDK <https://github.com/FIRST-Tech-Challenge/FtcRobotController/tree/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples>`_.
es_mx: Hay dos clases OpMode en el SDK de FTC: ``OpMode`` y ``LinearOpMode``. El que se utiliza afecta a la forma de escribir el programa. Para ver ejemplos de cómo utilizar OpMode y LinearOpMode, `refiérase a los OpModes de ejemplo en el SDK <https://github.com/FIRST-Tech-Challenge/FtcRobotController/tree/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples>`_.
fr_ca: Il existe deux classes OpMode dans le SDK de FTC : ``OpMode`` et ``LinearOpMode``. Celle que vous utilisez affecte la façon dont vous écrivez le programme. Pour des exemples d'utilisation d'OpMode et de LinearOpMode, ``référez-vous aux exemples d'OpModes dans le SDK <https://github.com/FIRST-Tech-Challenge/FtcRobotController/tree/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples>`_.
zh_cn: FTC\ |reg| SDK中有两个OpMode类： ``OpMode``和``LinearOpMode``。您使用的类会影响您编写程序的方式。有关如何使用OpMode和LinearOpMode的示例， `请参阅SDK中的示OpModes例 <https://github.com/FIRST-Tech-Challenge/FtcRobotController/tree/master/FtcRobotController/src/main/java/org/firstinspires/ftc/robotcontroller/external/samples>`_。

source: LinearOpMode Methods
es_mx: Métodos LinearOpMode
fr_ca: Méthodes LinearOpMode
zh_cn: LinearOpMode方法

source: ``runOpMode()``: Code inside this method will run exactly once after you press the INIT button. This is where you should put all code for the OpMode.
es_mx: ``runOpMode()``: El código dentro de este método se ejecutará exactamente una vez después de presionar el botón INIT. Aquí es donde usted debe poner todo el código para el OpMode.
fr_ca: ``runOpMode()`` : Le code contenu dans cette méthode sera exécuté exactement une fois après que vous aurez appuyé sur le bouton INIT. C'est ici que vous devez placer tout le code de l'OpMode.
zh_cn: ``runOpMode()``：按下INIT按钮后，此方法中的代码将只运行一次。这是您应该放置OpMode的所有代码的地方。

source: ``waitForStart()``: This method pauses the Op-Mode until you press the START button on the driver station.
es_mx: ``waitForStart()``: Este método pausa el Op-Mode hasta que se pulsa el botón START en estación del conductor.
fr_ca: ``waitForStart()`` : Cette méthode met en pause le mode Op jusqu'à ce que vous appuyiez sur le bouton START du poste de conduite.
zh_cn: ``waitForStart()``：此方法暂停操作模式，直到您按下驱动程序站上的START按钮。

source: ``isStarted()``: returns ``true`` if the START button has been pressed, otherwise it returns ``false``.
es_mx: ``isStarted()``: devuelve ``true`` si se ha pulsado el botón START, en caso contrario devuelve ``false``.
fr_ca: ``isStarted()`` : renvoie ``true`` si le bouton START a été pressé, sinon il renvoie ``false``.
zh_cn: ``isStarted()``：如果按下了START按钮，则返回 ``true``，否则返回 ``false``。

source: ``isStopRequested()``: returns ``true`` if the STOP button has been pressed, otherwise it returns ``false``.
es_mx: ``isStopRequested()``: devuelve ``true`` si se ha pulsado el botón STOP, en caso contrario devuelve ``false``.
fr_ca: ``isStopRequested()`` : renvoie ``true`` si le bouton STOP a été pressé, sinon il renvoie ``false``.
zh_cn: ``isStopRequest()``：如果按下了STOP按钮，则返回 ``true``，否则返回 ``false``。

source: ``idle()``: calls ``Thread.yield``, allowing other threads at the same priority level to run.
es_mx: ``idle()``: llama a ``Thread.yield``, permitiendo la ejecución de otras acciones con el mismo nivel de prioridad.
fr_ca: ``idle()`` : appelle ``Thread.yield``, permettant à d'autres threads ayant le même niveau de priorité de s'exécuter.
zh_cn: ``idle()``：调用 ``Thread.yield``，允许相同优先级的其他线程运行。

source: ``opModeIsActive()``: returns ``isStarted() && !isStopRequested()`` and calls ``idle()``.
es_mx: ``opModeIsActive()``: devuelve ``isStarted() &amp;&amp; !isStopRequested()`` y llama a ``idle()``.
fr_ca: ``opModeIsActive()`` : renvoie ``isStarted() && !isStopRequested()`` et appelle ``idle()``.
zh_cn: ``opModeIsActive()``：返回 ``isStarted() && ! isStopRequest()``并调用 ``idle()``。

source: ``opModeInInit()``: returns ``!isStarted() && !isStopRequested()`` and does not call ``idle()``.
es_mx: ``opModeInInInit()``: devuelve ``!isStarted() &amp;&amp; !isStopRequested()`` y no llama a ``idle()``.
fr_ca: ``opModeInInit()`` : renvoie ``!isStarted() && !isStopRequested()`` et n'appelle pas ``idle()``.
zh_cn: ``opModeInit()``：返回 ``!isStarted() && ! isStopRequest()``并且不调用 ``idle()``。

source: OpMode Methods
es_mx: Métodos OpMode
fr_ca: Méthodes OpMode
zh_cn: OpMode方法

source: ``init()``: Code inside this method will run exactly once after you press the INIT button on the driver station.
es_mx: ``init()``: El código dentro de este método se ejecutará exactamente una vez después de pulsar el botón INIT en la estación del conductor.
fr_ca: ``init()`` : Le code contenu dans cette méthode s'exécutera exactement une fois après que vous aurez appuyé sur le bouton INIT de la station de pilotage.
zh_cn: ``init()``：在您按下驱动程序站上的INIT按钮后，此方法中的代码将只运行一次。

source: ``init_loop()``: Once the code in ``init()`` has been run, code inside this method will run continuously until the START button is pressed on the driver station.
es_mx: ``init_loop()``: Una vez ejecutado el código en ``init()``, el código dentro de este método se ejecutará continuamente hasta que se pulse el botón START en la estación del conductor.
fr_ca: ``init_loop()`` : Une fois que le code de ``init()`` a été exécuté, le code contenu dans cette méthode s'exécutera en continu jusqu'à ce que le bouton START soit pressé sur le poste de conduite.
zh_cn: ``init_loop()``：运行 ``init()``中的代码后，此方法中的代码将持续运行，直到驱动程序站上按下START按钮。

source: ``start()``: Code inside this method will run exactly once after you press the START button on the driver station.
es_mx: ``start()``: El código dentro de este método se ejecutará exactamente una vez después de pulsar el botón START en la estación del conductor.
fr_ca: ``start()`` : Le code contenu dans cette méthode s'exécutera exactement une fois après que vous aurez appuyé sur le bouton START du poste de conduite.
zh_cn: ``start()``：此方法中的代码将在您按下驱动程序站上的START按钮后运行一次。

source: ``loop()``: Once the code in ``start()`` has been run, code inside this method will run continuously until the STOP button is pressed on the driver station.
es_mx: bucle()``: Una vez que se ha ejecutado el código en ``start()``, el código dentro de este método se ejecutará continuamente hasta que se pulse el botón STOP en la estación del conductor.
fr_ca: ``loop()`` : Une fois que le code de ``start()`` a été exécuté, le code à l'intérieur de cette méthode s'exécutera en continu jusqu'à ce que le bouton STOP soit pressé sur le poste de conduite.
zh_cn: ``loop()``：一旦运行 ``start()``中的代码，此方法中的代码将连续运行，直到驱动程序站上按下STOP按钮。

source: ``stop()``: Code inside this method will run exactly once after you press the STOP button on the driver station.
es_mx: ``stop()``: El código dentro de este método se ejecutará exactamente una vez después de pulsar el botón STOP en la estación del conductor.
fr_ca: ``stop()`` : Le code contenu dans cette méthode s'exécutera exactement une fois après que vous aurez appuyé sur le bouton STOP du poste de conduite.
zh_cn: ``stop()``：此方法中的代码将在您按下驱动程序站上的STOP按钮后运行一次。

source: As of SDK version 8.1, when executing ``OpMode``\ s there is a negligible delay of one millisecond between calls of ``loop()``. Previously, it had unpredictable delays, however since 8.1 it is similarly performant to ``LinearOpMode``.
es_mx: A partir de la versión 8.1 del SDK, cuando se ejecuta ``OpMode`` hay un retardo insignificante de un milisegundo entre llamadas a ``loop()``. Anteriormente, tenía retrasos impredecibles, sin embargo desde la versión 8.1 tiene un rendimiento similar a ``LinearOpMode``.
fr_ca: Depuis la version 8.1 du SDK, lors de l'exécution de ``OpMode``, il y a un délai négligeable d'une milliseconde entre les appels de ``loop()``. Auparavant, les délais étaient imprévisibles, mais depuis la version 8.1, les performances sont similaires à celles de ``LinearOpMode``.
zh_cn: 从SDK版本8.1开始，当执行 ``OpMode``时，调用 ``loop()``之间的延迟可以忽略不计。以前，它有不可预测的延迟，但是从8.1开始，它的性能类似于 ``LinearOpMode``。

source: Conclusion
es_mx: Conclusión
zh_cn: 结论

source: Overall, the use of ``LinearOpMode`` or ``OpMode`` is up to preference. |gm0| uses ``LinearOpMode`` everywhere for consistency.
es_mx: En general, el uso de ``LinearOpMode`` o ``OpMode`` depende de las preferencias. |gm0| utiliza ``LinearOpMode`` en todas partes por coherencia.
fr_ca: Globalement, l'utilisation de ``LinearOpMode`` ou de ``OpMode`` est une question de préférence. |La version française de Gm0 utilise ``LinearOpMode`` partout pour des raisons de cohérence.
zh_cn: 总的来说，使用 ``LinearOpMode``或 ``OpMode`` 取决于偏好。 |gm0|在任何地方都使用 ``LinearOpMode``以保持一致性。
