Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/options-for-programming.po
Languages: es_mx, fr_ca

source: Options for Programming
es_mx: Opciones de programación
fr_ca: Options de Programmation

source: There are three recommended options for teams to use when programming a robot to do various tasks: Blocks, OnBot Java, and Android Studio.
es_mx: Existen tres opciones recomendadas para que los equipos programen un robot para realizar diversas tareas: Blocks, OnBot Java y Android Studio.
fr_ca: Il existe trois options recommandées pour les équipes lorsqu'elles programment un robot pour accomplir diverses tâches : Blocs, OnBot Java et Android Studio.

source: Blocks
fr_ca: Blocs

source: The Blocks Programming Tool is a simple way to code simple actions for the robot. It has a colorful and lego-like design and includes sounds of block pieces of snapping together.
es_mx: La Herramienta de Programación de Blocks es una forma sencilla de codificar acciones simples para el robot. Tiene un diseño colorido y como lego e incluye sonidos de piezas de bloque de encaje juntos.
fr_ca: L'outil de programmation Blocs est un moyen simple de coder des actions simples pour le robot. Il possède une conception colorée et ressemble à des Legos, et inclut des sons de blocs qui s'emboîtent.

source: Using a device and a robot controller phone, connect your device to the phone's Wi-Fi by clicking the three dots in the top right of the :term:`RC <Robot Controller>` and select "Program & Manage". This will display the WiFi SSID and password for you to connect to. Go onto your browser (preferably Chrome, though other modern browser will likely work) and enter the address shown on the :term:`RC <Robot Controller>`.
es_mx: Utilizando un dispositivo y un teléfono controlador del robot, conecte su dispositivo al Wi-Fi del teléfono haciendo clic en los tres puntos de la parte superior derecha del :term:`RC <Robot Controller>` y seleccione "Programar y gestionar". Esto mostrará el SSID WiFi y la contraseña para que te conectes. Ve a tu navegador (preferiblemente Chrome, aunque es probable que otro navegador moderno funcione) e introduce la dirección que aparece en :term:`RC <Robot Controller>`.
fr_ca: À l'aide d'un appareil et d'un téléphone contrôleur de robot, connectez votre appareil au Wi-Fi du téléphone en cliquant sur les trois points en haut à droite du :term:`RC <Robot Controller>` et sélectionnez "Program & Manage". Cela affichera le SSID WiFi et le mot de passe pour que vous puissiez vous connecter. Allez dans votre navigateur (de préférence Chrome, bien qu'un autre navigateur moderne puisse fonctionner) et entrez l'adresse indiquée dans le :term:`RC <Robot Controller>`.

source: Advantages
es_mx: Ventajas
fr_ca: Avantages

source: Good for beginners: one of the easiest and simplest options to use.
es_mx: Bueno para principiantes: una de las opciones más fáciles y sencillas de usar.
fr_ca: Idéal pour les débutants : l'une des options les plus faciles et les plus simples à utiliser.

source: Easy to set up: requires a device (laptop, chromebook, tablet) and a phone in the Program & Manage screen
es_mx: Fácil de configurar: requiere un dispositivo (laptop, Chromebook, tableta) y un teléfono en la pantalla Programar y gestionar
fr_ca: Facile à mettre en place : nécessite un appareil (ordinateur portable, Chromebook, tablette) et un téléphone dans l'écran Programmer & Gérer

source: Programs can be saved directly to the phone
es_mx: Los programas se pueden guardar directamente en el teléfono
fr_ca: Les programmes peuvent être enregistrés directement sur le téléphone

source: Changes can be made quickly
es_mx: Los cambios pueden hacerse rápidamente
fr_ca: Les changements peuvent être effectués rapidement

source: Doesn't require an external Wi-Fi connection
es_mx: No requiere conexión Wi-Fi externa
fr_ca: Ne nécessite pas de connexion Wi-Fi externe

source: Disadvantages
es_mx: Desventajas
fr_ca: Désavantages

source: Not recommended if you're already familiar with some type of programming
es_mx: No se recomienda si ya estás familiarizado con algún tipo de programación
fr_ca: Non recommandé si vous êtes déjà familiarisé avec un certain type de programmation.

source: Primarily a teaching tool for people with no programming experience
es_mx: Principalmente una herramienta de enseñanza para personas sin experiencia en programación.
fr_ca: Il s'agit avant tout d'un outil pédagogique destiné aux personnes n'ayant aucune expérience en matière de programmation.

source: This will change your primary Wi-Fi network to the :term:`Robot Controller's <Robot Controller>` Direct Wi-Fi network, and as such, you will be unable to access the internet while connected to this particular network.
es_mx: Esto cambiará su red Wi-Fi principal a la red Wi-Fi directa de :term:`Robot Controller's <Robot Controller>`, y como tal, no podrá acceder a Internet mientras esté conectado a esta red en particular.
fr_ca: Cela changera votre réseau Wi-Fi principal en réseau Wi-Fi direct :term:`Robot Controller's <Robot Controller>` et vous ne pourrez donc pas accéder à Internet lorsque vous serez connecté à ce réseau particulier.

source: Teams can get around this by purchasing an external Wi-Fi module that allows computers to run 2 Wi-Fi networks at once.
es_mx: Los equipos pueden evitarlo comprando un módulo Wi-Fi externo que permita a los ordenadores ejecutar 2 redes Wi-Fi a la vez.
fr_ca: Les équipes peuvent contourner ce problème en achetant un module Wi-Fi externe qui permet aux ordinateurs de gérer 2 réseaux Wi-Fi à la fois.

source: Sacrifices flexibility and application for simplicity
es_mx: Sacrifica la flexibilidad y la aplicación por una simplicidad
fr_ca: Sacrifie la flexibilité et l'application à la simplicité

source: Don't ever use it on a phone, unless you're out of options. (Not phone-friendly)
es_mx: No lo uses nunca en un teléfono, a menos que te quedes sin opciones. (No apto para teléfonos)
fr_ca: Ne l'utilisez jamais sur un téléphone, sauf si vous êtes à court d'options. (Pas adapté aux téléphones)

source: You may make a bigger mess if you try to.
es_mx: Si lo intentas, el lío puede ser mayor.
fr_ca: Vous risquez de faire un plus grand gâchis si vous essayez de le faire.

source: OnBot Java uses a similar method of using a browser to code and save directly to the phone. The difference being that a programming language called Java is used instead.
es_mx: OnBot Java utiliza un método similar de usar un navegador para codificar y guardar directamente en el teléfono. La diferencia es que en su lugar se utiliza un lenguaje de programación llamado Java.
fr_ca: OnBot Java utilise une méthode similaire qui consiste à utiliser un navigateur pour coder et enregistrer directement sur le téléphone. La différence est que c'est un langage de programmation appelé Java qui est utilisé.

source: Recommended if you're learning or have learned some programming, even better if you know a little Java.
es_mx: Recomendado si estás aprendiendo o has aprendido algo de programación, incluso mejor si sabes un poco de Java.
fr_ca: Recommandé si vous apprenez ou avez appris à programmer, encore mieux si vous connaissez un peu Java.

source: Greater flexibility than Blocks
es_mx: Mayor flexibilidad que Blocks
fr_ca: Une plus grande flexibilité que les Blocs

source: There are a lot more resources available in case you need help
es_mx: Hay muchos más recursos disponibles en caso de que necesite ayuda
fr_ca: De nombreuses autres ressources sont disponibles si vous avez besoin d'aide.

source: More applicable to the real-world than Blocks
es_mx: Más aplicable al mundo real que a Blocks
fr_ca: Plus applicable au monde réel que les Blocs

source: Maintains most of the advantages of Blocks
es_mx: Mantiene la mayoría de las ventajas de Blocks
fr_ca: Maintient la plupart des avantages des Blocs

source: Connecting to the robot controller's Wi-Fi network will prevent you from using anything on the internet including video tutorials and online communication
es_mx: Si te conectas a la red Wi-Fi del controlador del robot preverá que utilices cualquier cosa del internet, incluidos los tutoriales en vídeo y la comunicación en línea.
fr_ca: La connexion au réseau Wi-Fi du contrôleur du robot vous empêchera d'utiliser tout ce qui se trouve sur Internet, y compris les didacticiels vidéo et les communications en ligne.

source: Using external libraries is difficult and borderline impossible
es_mx: El uso de bibliotecas externas es difícil y llegando a lo imposible.
fr_ca: L'utilisation de bibliothèques externes est difficile, voire impossible

source: Steeper learning curve than Blocks
es_mx: Curva de aprendizaje más pronunciada que la de Blocks
fr_ca: Courbe d'apprentissage plus raide que celle des Blocs

source: Android Studio is a comprehensive Integrated Development Environment (IDE) that uses Java to program the phones. Instead of using a browser to upload code, Android Studio will compile your Robot Controller code into a .apk file (an app installer), and install that on the phone.
es_mx: Android Studio es un completo Entorno de Desarrollo Integrado (IDE) que utiliza Java para programar los teléfonos. En lugar de utilizar un navegador para cargar código, Android Studio compilará el código de tu Robot Controller en un archivo .apk (un instalador de aplicaciones) y lo instalará en el teléfono.
fr_ca: Android Studio est un environnement de développement intégré (IDE) complet qui utilise Java pour programmer les téléphones. Au lieu d'utiliser un navigateur pour télécharger le code, Android Studio compilera le code de votre Robot Controller dans un fichier .apk (un programme d'installation d'application) et l'installera sur le téléphone.

source: Much greater flexibility than Blocks.
es_mx: Mucha más flexibilidad que Blocks.
fr_ca: Beaucoup plus de flexibilité que les Blocs.

source: Much easier to integrate libraries like `FTC Dashboard`_, `FTCLib`_, and `Road Runner`_.
es_mx: Mucho más fácil de integrar bibliotecas como `FTC Dashboard`_, `FTCLib`_, y `Road Runner`_.
fr_ca: Beaucoup plus facile d'intégrer des bibliothèques comme `FTC Dashboard`_, `FTCLib`_, et `Road Runner`_.

source: Can use either a USB connection to the :term:`RC <Robot Controller>` phone, or a wireless connection to upload code.
es_mx: Puede utilizar una conexión USB con el teléfono :term:`RC <Robot Controller>` o una conexión inalámbrica para cargar el código.
fr_ca: Il est possible d'utiliser une connexion USB au téléphone :term:`RC <Robot Controller>` ou une connexion sans fil pour télécharger le code.

source: Can debug in real-time
es_mx: Pueden depurarse en tiempo real
fr_ca: Débogage en temps réel

source: Many resources for Java, Android Studio, and IDEA
es_mx: Muchos recursos para Java, Android Studio e IDEA
fr_ca: Nombreuses ressources pour Java, Android Studio et IDEA

source: Can use other programming languages
es_mx: Puede utilizar otros lenguajes de programación
fr_ca: Peut utiliser d'autres langages de programmation

source: Connecting to the robot controller's Wi-Fi network will prevent you from using anything on the internet including video tutorials and online communication, unless you have a second Wifi adapter (cheap and easy)
es_mx: La conexión a la red Wi-Fi del controlador del robot le impedirá utilizar cualquier cosa en Internet, incluidos los tutoriales en vídeo y la comunicación en línea, a menos que tenga un segundo adaptador Wifi (barato y fácil).
fr_ca: La connexion au réseau Wi-Fi du contrôleur du robot vous empêchera d'utiliser tout ce qui se trouve sur Internet, y compris les tutoriels vidéo et la communication en ligne, à moins que vous ne disposiez d'un second adaptateur Wifi (facile et peu cher).

source: Relatively easy setup process, but time consuming and is a hefty install (3GB of files between Android Studio, FtcRobotController, and other libraries)
es_mx: El proceso de instalación es relativamente sencillo, pero requiere tiempo y es una instalación pesada (3 GB de archivos entre Android Studio, FtcRobotController y otras bibliotecas).
fr_ca: Processus d'installation relativement facile, mais long et lourd (3 Go de fichiers entre Android Studio, FtcRobotController et d'autres bibliothèques).

source: Issues can be difficult to diagnose and solve
es_mx: Los problemas pueden ser difíciles de diagnosticar y resolver
fr_ca: Les problèmes peuvent être difficiles à diagnostiquer et à résoudre

source: Other Programming Languages
es_mx: Otros Lenguajes de Programación
fr_ca: Autres langages de programmation

source: Kotlin is a relatively new and rapidly growing programming language from Jetbrains, the creator of the IntelliJ IDE, which Android Studio is based off. Kotlin was made to be completely compatible with Java but be easier to work with. Google recently announced it as an official Android language, then announced they are going "Kotlin first" but still keeping Java support.
es_mx: Kotlin es un lenguaje de programación relativamente nuevo y de rápido crecimiento de Jetbrains, el creador del IntelliJ IDE, en el que se basa Android Studio. Kotlin fue creado para ser completamente compatible con Java, pero más fácil de trabajar. Google lo anunció recientemente como lenguaje oficial de Android, y luego anunció que "Kotlin first", pero manteniendo la compatibilidad con Java.
fr_ca: Kotlin est un langage de programmation relativement nouveau et en pleine expansion, développé par Jetbrains, le créateur de l'IDE IntelliJ, sur lequel est basé Android Studio. Kotlin a été conçu pour être totalement compatible avec Java, tout en étant plus facile à utiliser. Google l'a récemment annoncé comme langage officiel d'Android, puis a annoncé qu'il allait passer à "Kotlin first" tout en conservant le support de Java.

source: Concise, readable, easy to edit code
es_mx: Código conciso, legible y fácil de editar
fr_ca: Code concis, lisible et facile à modifier

source: Easy to write as it takes much less code to do the same thing
es_mx: Fácil de escribir, ya que se necesita mucho menos código para hacer lo mismo.
fr_ca: Facile à écrire car il faut beaucoup moins de code pour faire la même chose.

source: Both optional type inference and a stronger type system than Java
es_mx: Inferencia de tipos opcional y un sistema de tipos más potente que Java
fr_ca: L'inférence de type optionnelle et un système de type plus fort que Java

source: Null safety
es_mx: Seguridad nula
fr_ca: Sécurité nulle

source: Thread safety
es_mx: Seguridad
fr_ca: Sécurité des fils

source: Functional programming
es_mx: Programación funcional
fr_ca: Programmation fonctionnelle

source: Seamless integration with Java code and libraries
es_mx: Integración perfecta con código y bibliotecas Java
fr_ca: Intégration transparente avec le code et les bibliothèques Java

source: Very easy to transition from Java
es_mx: Muy fácil pasar a Java
fr_ca: Transition très facile à partir de Java

source: Not widely used in FTC\ |reg| yet
es_mx: Todavía no se utiliza mucho en FTC\ |reg|.
fr_ca: Pas encore largement utilisé dans FTC\ |reg|

source: New and has fewer community resources for training
es_mx: Es nuevo y tiene menos recursos comunitarios para la formación
fr_ca: Nouveau et disposant de moins de ressources communautaires pour la formation

source: Not recommended for programmers who need large amounts of help from other teams
es_mx: No recomendado para programadores que necesitan mucha ayuda de otros equipos
fr_ca: Non recommandé pour les programmeurs qui ont besoin d'une aide importante de la part d'autres équipes.

source: C and C++
es_mx: C y C++
fr_ca: C et C++

source: C and C++ are native programming languages compatible with Android. Very few teams have used C++. This is typically used for only part of the code, with the majority being Java or Kotlin.
es_mx: C y C++ son lenguajes de programación nativos compatibles con Android. Muy pocos equipos han utilizado C++. Este suele utilizarse solo para una parte del código, siendo la mayor parte en Java o Kotlin.
fr_ca: C et C++ sont des langages de programmation natifs compatibles avec Android. Très peu d'équipes ont utilisé le C++. Il n'est généralement utilisé que pour une partie du code, la majeure partie étant composée de Java ou de Kotlin.

source: Fast execution for extremely resource-intensive applications.
es_mx: Ejecución rápida para aplicaciones que consumen muchos recursos.
fr_ca: Exécution rapide pour les applications très gourmandes en ressources.

source: Supports more libraries
es_mx: Admite más bibliotecas
fr_ca: Prise en charge d'un plus grand nombre de bibliothèques

source: Rarely needed
es_mx: Raramente necesario
fr_ca: Rarement nécessaire

source: Very difficult to set up
es_mx: Muy difícil de instalar
fr_ca: Très difficile à mettre en place

source: Difficult to debug code
es_mx: Código difícil de depurar
fr_ca: Code difficile à déboguer

source: Very few teams can help you
es_mx: Muy pocos equipos pueden ayudarte
fr_ca: Très peu d'équipes peuvent vous aider

source: Very few online resources
es_mx: Muy pocos recursos en línea
fr_ca: Très peu de ressources en ligne
