Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/using-android-studio.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Run :code:`adb usb` and then :code:`adb tcpip 5555`. You can then unplug the phone.
es_mx: Ejecute :code:`adb usb` y luego :code:`adb tcpip 5555`. A continuación, puede desenchufar el teléfono.
fr_ca: Exécutez :code:`adb usb` puis :code:`adb tcpip 5555`. Vous pouvez alors débrancher le téléphone.
ro_ro: Rulează :code:`adb usb`, apoi :code:`adb tcpip 5555`. Acum poți deconecta telefonul.
zh_cn: 运行 :code:`adb usb`，然后运行 :code:`adb tcpip 5555`。然后就可以拔掉电话线了。

source: Connect to the same WiFi network the device is either hosting or on. The WiFi direct network created by the phone should be called "TEAMNUMBER-RC" or some small derivation of that. It may include extra letters if you have multiple devices per team. Refer to RS01 in |gm1| for further details on the network naming scheme.
es_mx: Conéctese a la misma red WiFi que aloja o en la que se encuentra el dispositivo. La red WiFi directa creada por el teléfono debe llamarse "TEAMNUMBER-RC" o alguna pequeña derivación de eso. Puede incluir letras adicionales si tiene varios dispositivos por equipo. Consulte RS01 en |gm1| para más detalles sobre el esquema de nomenclatura de redes.
ro_ro: Conectează-te la aceeași rețea WiFi la care dispozitivul este conectat sau găzduiește. Rețeaua WiFi Direct creată de telefon ar trebui să se numească "TEAMNUMBER-RC" sau alte variante asemănătoare. Poate include și litere în plus dacă ai mai multe dispozitive pe echipe. Uită-te în acticolul RS01 din |gm1| pentru mai multe detalii în legatură cu standardul de numire al rețelelor.
zh_cn: 连接到设备托管或使用的同一 WiFi 网络。手机创建的 WiFi 直接网络应称为 "TEAMNUMBER-RC "或其派生词。如果每个团队有多个设备，则可能包含额外的字母。有关网络命名方案的更多详情，请参阅 |gm1| 中的 RS01。

source: Connect to the phone using :code:`adb connect 192.168.49.1:5555`. If this doesn't work, recheck the IP address of the phone and try again with that IP address if it is different.
es_mx: Conéctese al teléfono utilizando :code:`adb connect 192.168.49.1:5555`. Si esto no funciona, vuelva a comprobar la dirección IP del teléfono e inténtelo de nuevo con esa dirección IP si es diferente.
fr_ca: Connectez-vous au téléphone en utilisant :code:`adb connect 192.168.49.1:5555`. Si cela ne fonctionne pas, revérifiez l'adresse IP du téléphone et réessayez avec cette adresse IP si elle est différente.
ro_ro: Conectează-te la telefon prin comanda :code:`adb connect 192.168.49.1:5555`. Dacă aceasta nu merge, verifică adresa IP a telefonului și încearcă cu adresa IP respectivă dacă este diferită.
zh_cn: 使用 :code:`adb connect 192.168.49.1:5555` 连接手机。如果不起作用，请重新检查电话的 IP 地址，如果不同，请使用该 IP 地址再试一次。

source: Connecting to a Control Hub Wirelessly
es_mx: Conexión Inalámbrica a un Control Hub
fr_ca: Connexion Sans fil à un Control Hub
ro_ro: Conectarea Wireless la un Control Hub
zh_cn: 无线连接控制集线器

source: Connect to the WiFi hotspot hosted by the Control Hub. The hotspot should be called "TEAMNUMBER-RC" or some small derivation of that. It may include extra letters if you have multiple devices per team. Refer to RS01 in |gm1| for further details on the network naming scheme.
es_mx: Conéctese al punto de acceso WiFi alojado en el Control Hub. El hotspot debe llamarse "TEAMNUMBER-RC" o alguna pequeña derivación de eso. Puede incluir letras adicionales si tiene varios dispositivos por equipo. Consulte RS01 en |gm1| para más detalles sobre el esquema de nomenclatura de la red.
ro_ro: Conectează-te la hotspot-ul WiFi găzduit de Control Hub. Hotspot-ul ar trebui să fie numit "TEAMNUMBER-RC" sau asemănător. S-ar putea să includă și litere în plus dacă ai mai multe dispozitive în echipă. Citește |gm1| pentru mai multe detalii în legătură cu standardul de numire.
zh_cn: 连接到 Control Hub 托管的 WiFi 热点。热点名称应为 "TEAMNUMBER-RC "或由此衍生的一些小名称。如果每个团队有多个设备，则可以包含额外的字母。有关网络命名方案的更多详情，请参阅 |gm1| 中的 RS01。

source: Once you're connected to a Control Hub's network, you simply need to connect to it using :code:`adb connect 192.168.43.1:5555`.
es_mx: Una vez conectado a la red de un Control Hub, sólo tienes que conectarte a él utilizando :code:`adb connect 192.168.43.1:5555`.
fr_ca: Une fois que vous êtes connecté au réseau d'un Control Hub, il vous suffit de vous y connecter en utilisant :code:`adb connect 192.168.43.1:5555`.
ro_ro: Odată ce esti conectat la rețeaua Control Hub-ului, pur și simplu te conectezi la el prin comanda :code:`adb connect 192.168.43.1:5555`.
zh_cn: 连接到控制集线器的网络后，只需使用 :code:`adb connect 192.168.43.1:5555` 连接即可。

source: Once a connection is established, it should appear in the device dropdown in Android Studio.
es_mx: Una vez establecida la conexión, debería aparecer en el desplegable de dispositivos de Android Studio.
ro_ro: Odată ce o conexiune este stabilită, ar trebui să apară în lista de dispozitive în Android Studio.
zh_cn: 建立连接后，它就会出现在 Android Studio 的设备下拉菜单中。

source: Wireless Configuration
es_mx: Configuración Inalámbrica
fr_ca: Configuration sans fil
ro_ro: Configurare Wireless
zh_cn: 无线配置

source: You can set up a configuration on the Driver Station or Robot Controller like usual. However, you can also create a valid configuration XML file in :code:`TeamCode/src/main/res/xml`. You can find your configuration files in the :code:`/sdcard/FIRST` folder as an XML file with the same name as the configuration.
es_mx: Puede establecer una configuración en la estación del conductor o en el controlador del robot de la forma habitual. Sin embargo, también puedes crear un archivo XML de configuración válido en :code:`TeamCode/src/main/res/xml`. Puedes encontrar tus archivos de configuración en la carpeta :code:`/sdcard/FIRST` como un archivo XML con el mismo nombre que la configuración.
fr_ca: Vous pouvez établir une configuration sur la station de conduite ou le Control Hub comme d'habitude. Cependant, vous pouvez également créer un fichier XML de configuration valide dans :code:`TeamCode/src/main/res/xml`. Vous trouverez vos fichiers de configuration dans le dossier :code:`/sdcard/FIRST` sous la forme d'un fichier XML portant le même nom que la configuration.
ro_ro: Îți poți face o configurație în Driver Station sau Robot Controller în mod normal. Totuși, îți poți crea și o configurație validă printr-un fișier XML în :code:`TeamCode/src/main/res/xml`. Îți poți găsi fișierele de configurare în folder-ul :code:`/sdcard/FIRST` sub formă de fișier XML cu acelaș nume al configurației.
zh_cn: 您可以像往常一样在驱动站或机器人控制器上设置配置。不过，您也可以在 :code:`TeamCode/src/main/res/xml` 中创建有效的配置 XML 文件。您可以在 :code:`/sdcard/FIRST` 文件夹中找到与配置文件同名的 XML 文件。

source: To get these XML files wirelessly, you can use :code:`adb pull /sdcard/FIRST/config.xml /fully/qualified/path/res/xml`.
es_mx: Para obtener estos archivos XML de forma inalámbrica, puede utilizar :code:`adb pull /sdcard/FIRST/config.xml /fully/qualified/path/res/xml`.
fr_ca: Pour obtenir ces fichiers XML sans fil, vous pouvez utiliser :code:`adb pull /sdcard/FIRST/config.xml /fully/qualified/path/res/xml`.
ro_ro: Pentru a lua aceste fișiere XML wireless, poți folosi :code:`adb pull /sdcard/FIRST/config.xml /fully/qualified/path/res/xml`.
zh_cn: 要以无线方式获取这些 XML 文件，可以使用 :code:`adb pull /sdcard/FIRST/config.xml /fully/qualified/path/res/xml` 。

source: If a valid configuration XML file is in :code:`res/xml` it will show up as a configuration you can use for the robot when you push it to the Robot Controller or a Control Hub.
es_mx: Si hay un archivo XML de configuración válido en :code:`res/xml`, aparecerá como una configuración que puede utilizar para el robot cuando lo envíe al controlador del robot o a un Control Hub.
fr_ca: Si un fichier XML de configuration valide se trouve dans :code:`res/xml`, il apparaîtra comme une configuration que vous pouvez utiliser pour le robot lorsque vous l'envoyez au contrôleur de robot ou à un Control Hub.
ro_ro: Dacă o configurație validă dintr-un fișier XML este în :code:`res/xml`, aceasta va apărea în lista de configurații și o poți folosi pe robot când o încarci pe Robot Controller sau pe Control Hub.
zh_cn: 如果 :code:`res/xml` 中包含有效的配置 XML 文件，则在将机器人推送至机器人控制器（RC）或 Control Hub 时，该文件将显示为可用于机器人的配置。

source: SDK Manager
es_mx: Gestor de SDK
ro_ro: Administratorul SDK-ului
zh_cn: SDK 管理器

source: You can find the SDK manager in the top right corner of your Android Studio.
es_mx: Puedes encontrar el gestor de SDK en la esquina superior derecha de tu Android Studio.
ro_ro: Poți găsi administatorul SDK-ului (SDK manager) în meniul din colțul din dreapta-sus în Android Studio.
zh_cn: 您可以在 Android Studio 的右上角找到 SDK 管理器。

source: A box with a down-facing arrow
es_mx: Una caja con una flecha hacia abajo
ro_ro: Un meniu cu o sageată îndreptată în jos
zh_cn: 带向下箭头的方框

source: Accepting Licenses
es_mx: Aceptación de Licencias
ro_ro: Aceptarea Licențelor
zh_cn: 接受许可证

source: If you get a warning complaining about licenses not being accepted, follow these steps:
es_mx: Si recibes un aviso quejándote de que no se aceptan licencias, sigue estos pasos:
ro_ro: Dacă primești o eroare în legătură cu licențele ce nu pot fi aceptate, urmează acești pași:
zh_cn: 如果收到警告，抱怨许可证不被接受，请按照以下步骤操作：

source: Go to the SDK manager and under SDK Platforms.
es_mx: Vaya al gestor de SDK y en Plataformas SDK.
ro_ro: Du-te în "SDK manager" și în "SDK Platforms"
zh_cn: 进入 SDK 管理器，在 SDK 平台下。

source: Select the version with the API level specified by the warning.
es_mx: Seleccione la versión con el nivel de API especificado por la advertencia.
ro_ro: Selectează versiunea cu nivelul API specificat de eroare
zh_cn: 选择具有警告指定的 API 级别的版本。

source: Click "Apply" and wait for the components to install.
es_mx: Haga clic en "Aplicar" y espere a que se instalen los componentes.
ro_ro: Apasă pe "Apply" și asteaptă să se instaleze componentele.
zh_cn: 点击 "应用"，等待组件安装。

source: Once this finishes, press "Finish," then "Ok." Wait for Android Studio to index if it is.
es_mx: Una vez que esto termine, presione "Finalizar" y luego "Ok". Espera a que Android Studio indeque si es así.
ro_ro: Odată ce s-a terminat, apasă pe "Finish", apoi "Ok". Așteaptă ca Android Studio să indexeze dacă face acest lucru.
zh_cn: 完成后，按 "完成"，然后按 "好"。等待 Android Studio 索引。

source: Restart Android Studio.
es_mx: Reinicia Android Studio.
ro_ro: Restartează Android Studio.
zh_cn: 重新启动 Android Studio。

source: Installing SDK Tools
es_mx: Instalación de las herramientas del SDK
ro_ro: Instalarea Uneltelor SDK
zh_cn: 安装 SDK 工具

source: To install any SDK tools such as platform tools or build tools, open the SDK manager and go to SDK Tools. Select the tools you want to install and install them the same way you would for the SDK platforms.
es_mx: Para instalar cualquier herramienta del SDK, como herramientas de plataforma o herramientas de compilación, abra el gestor del SDK y vaya a Herramientas del SDK. Seleccione las herramientas que desee instalar e instálelas del mismo modo que lo haría para las plataformas SDK.
ro_ro: Pentru a instala uneltele SDK, precum uneltele pentru platformă sau pentru build, deschide SDK manager și du-te la SDK Tools. Selectează uneltele pe care vrei sa le instalezi și instalează-le în acelas fel în care ai instalat platformele SDK.
zh_cn: 要安装任何 SDK 工具（如平台工具或构建工具），请打开 SDK 管理器并转到 SDK 工具。选择要安装的工具，然后按照安装 SDK 平台的相同方法进行安装。

source: Version Control
es_mx: Control de Versiones
fr_ca: Contrôle des Versions
ro_ro: Version Control (Jurnal)
zh_cn: 版本控制

source: Version control is an extremely useful tool. It allows for looking at (and reverting to) previous versions of code, easy collaboration, having multiple versions of code that can be merged together, etc.
es_mx: El control de versiones es una herramienta extremadamente útil. Permite consultar (y revertir) versiones anteriores del código, facilitar la colaboración, disponer de varias versiones del código que pueden fusionarse, etc.
fr_ca: Le contrôle de version est un outil extrêmement utile. Il permet de consulter les versions précédentes du code (et d'y revenir), de faciliter la collaboration, d'avoir plusieurs versions du code qui peuvent être fusionnées, etc.
ro_ro: Version Control este o unealtă foarte folositoare. Îți permite să te uiti (și să revii) la versiuni anterioare ale codului, colaborare facilă, multiple versiuni ale codului care pot fi combinate împreună, etc.
zh_cn: 版本控制是一种非常有用的工具。它允许查看（和还原）以前版本的代码、方便协作、拥有可以合并在一起的多个版本的代码等。

source: As far as version control systems go, we strongly recommend git, especially when used with a GUI like Android Studio's built in VCS tools or Github Desktop. While a git tutorial is out of scope for |gm0|, here are some git resources:
es_mx: En cuanto a los sistemas de control de versiones, recomendamos encarecidamente git, especialmente cuando se utiliza con una interfaz gráfica de usuario como las herramientas VCS integradas en Android Studio o Github Desktop. Mientras que un tutorial de git está fuera del alcance de |gm0|, aquí hay algunos recursos de git:
fr_ca: En ce qui concerne les systèmes de contrôle de version, nous recommandons fortement git, en particulier lorsqu'il est utilisé avec une interface graphique comme les outils VCS intégrés à Android Studio ou Github Desktop. Bien qu'un tutoriel git soit hors de portée pour |gm0|, voici quelques ressources git :
ro_ro: Noi recomandăm git, în special când este folosit cu un meniu interactiv (GUI) precum uneltele VCS ale Android Studio sau GitHub Desktop. Deși un tutorial de git nu este documentat în |gm0|, aici sunt câteva resurse git:
zh_cn: 就版本控制系统而言，我们强烈推荐使用 git，尤其是与 Android Studio 内置的 VCS 工具或 Github Desktop 等图形用户界面配合使用时。虽然 git 教程不在 |gm0| 的范围之内，但这里有一些 git 资源：

source: `The official git tutorial <https://git-scm.com/docs/gittutorial>`_
es_mx: `El tutorial oficial de git <https://git-scm.com/docs/gittutorial>`_
fr_ca: `Le tutoriel officiel de git <https://git-scm.com/docs/gittutorial>`_
ro_ro: `Tutorialul oficial git <https://git-scm.com/docs/gittutorial>`_
zh_cn: `官方 git 教程 <https://git-scm.com/docs/gittutorial>`_

source: `GitHub's collection of git resources <https://docs.github.com/en/get-started/quickstart/set-up-git>`_
es_mx: `La colección de recursos git de GitHub <https://docs.github.com/en/get-started/quickstart/set-up-git>`_
ro_ro: `Colecția de resurse git de la GitHub <https://docs.github.com/en/get-started/quickstart/set-up-git>`_
zh_cn: `GitHub 的 git 资源集合 <https://docs.github.com/en/get-started/quickstart/set-up-git>`_

source: `GitHub's guide to installing git <https://github.com/git-guides/install-git>`_
es_mx: `Guía de GitHub para instalar git <https://github.com/git-guides/install-git>`_
fr_ca: `GitHub's guide to install git <https://github.com/git-guides/install-git>`_
ro_ro: `Ghidul GitHub pentru a instala git <https://github.com/git-guides/install-git>`_
zh_cn: `GitHub 的 git 安装指南 <https://github.com/git-guides/install-git>`_

source: `GitHub Desktop, a git GUI <https://desktop.github.com/>`_
es_mx: `GitHub Desktop, una interfaz gráfica de git <https://desktop.github.com/>`_
fr_ca: `GitHub Desktop, une interface graphique de git <https://desktop.github.com/>`_
ro_ro: `GitHub Desktop, un meniu interactiv git <https://desktop.github.com/>`_
zh_cn: `GitHub Desktop，一个 git GUI <https://desktop.github.com/>`_

source: `Android Studio's/IntelliJ's git integration documentation <https://www.jetbrains.com/help/idea/version-control-integration.html>`_
fr_ca: `Documentation d'intégration git d'Android Studio/IntelliJ <https://www.jetbrains.com/help/idea/version-control-integration.html>`_
ro_ro: `Documentatia Android Studio/IntelliJ pentru integrarea git <https://www.jetbrains.com/help/idea/version-control-integration.html>`_
zh_cn: `Android Studio/IntelliJ 的 git 集成文档 <https://www.jetbrains.com/help/idea/version-control-integration.html>`_

source: TeamCode > src > main > java > org.firstinspires.ftc.teamcode
es_mx: TeamCode &gt; src &gt; main &gt; java &gt; org.firstinspires.ftc.teamcode

source: New > Java Class
es_mx: Nuevo > Clase de Java

source: `Android Studio <https://developer.android.com/studio/intro>`_ is an integrated development environment (IDE) for Android app development based on IntelliJ. It compiles your code which is then installed onto the Robot Controller: either the Control Hub or a legal Android phone.
fr_ca: `Android Studio <https://developer.android.com/studio/intro>`_ est un environnement de développement intégré (IDE) pour le développement d'applications Android basé sur IntelliJ. Il compile votre code qui est ensuite installé sur le Robot Controller : soit le Control Hub, soit un téléphone Android légal.

source: If you've already downloaded Android Studio, you can move on to the next step, which is `setting up the SDK`_.
fr_ca: Si vous avez déjà téléchargé Android Studio, vous pouvez passer à l'étape suivante, qui est la "configuration du SDK".

source: Install the latest version of Android Studio from https://developer.android.com/studio/index.html
fr_ca: Installez la dernière version d'Android Studio à partir de https://developer.android.com/studio/index.html

source: Now that you have Android Studio installed, you're going to want to use the current season's FTC\ |reg| SDK (software development kit) where you will create your team's code.
fr_ca: Maintenant que vous avez installé Android Studio, vous allez vouloir utiliser le SDK (kit de développement logiciel) de la saison en cours pour créer le code de votre équipe.

source: The SDK is publicly released to a GitHub repository. The current SDK can be found in the `FtcRobotController <https://github.com/FIRST-Tech-Challenge/FtcRobotController>`_ repository.
fr_ca: Le SDK est diffusé publiquement dans un dépôt GitHub. Le SDK actuel se trouve dans le dépôt `FtcRobotController <https://github.com/FIRST-Tech-Challenge/FtcRobotController>`_.

source: Downloading and opening the SDK in Android Studio
fr_ca: Téléchargement et ouverture du SDK dans Android Studio

source: Open Android Studio. If you have another project open, close it (File -> Close Project). Make sure "Projects" is selected on the sidebar.
fr_ca: Ouvrez Android Studio. Si un autre projet est ouvert, fermez-le (Fichier -> Fermer le projet). Assurez-vous que l'option "Projets" est sélectionnée dans la barre latérale.

source: Click on the gear icon in the bottom left corner, and select "check for updates." If you do not have the latest version, download the updates.
fr_ca: Cliquez sur l'icône en forme d'engrenage dans le coin inférieur gauche et sélectionnez "vérifier les mises à jour". Si vous ne disposez pas de la dernière version, téléchargez les mises à jour.

source: Select "Get from VCS". Make sure "Repository URL" is selected on the sidebar, then put ``https://github.com/FIRST-Tech-Challenge/FtcRobotController.git`` into the URL text box. Finally, click the Clone button in the bottom right corner to download the SDK.
fr_ca: Sélectionnez "Get from VCS". Assurez-vous que "Repository URL" est sélectionné dans la barre latérale, puis mettez `https://github.com/FIRST-Tech-Challenge/FtcRobotController.git`` dans la zone de texte URL. Enfin, cliquez sur le bouton Clone dans le coin inférieur droit pour télécharger le SDK.

source: Consider also changing the name of the final folder in the Directory textbox from ``FtcRobotController`` to something that reflects your team and the season, e.g. team number 99999 might use ``99999-2025-26-code``.
fr_ca: Pensez également à changer le nom du dossier final dans la zone de texte Directory de ``FtcRobotController`` à quelque chose qui reflète votre équipe et la saison, par exemple l'équipe numéro 99999 pourrait utiliser ``99999-2025-26-code``.

source: TODO: alt text
fr_ca: TODO : texte alt

source: When asked if you want to trust and open the project, choose "Trust Project".
fr_ca: Lorsqu'il vous est demandé si vous voulez faire confiance au projet et l'ouvrir, choisissez "Faire confiance au projet".

source: Select the hammer icon in the icon group in the top right corner of the window. This will download any needed modules and build the project.
fr_ca: Sélectionnez l'icône du marteau dans le groupe d'icônes situé dans le coin supérieur droit de la fenêtre. Ceci téléchargera tous les modules nécessaires et construira le projet.

source: The first thing to note in the project view is the left panel with the project components. Expand the :code:`TeamCode` folder, then the :code:`java` folder, and you will see an :code:`org.firstinspires.ftc.teamcode` package.
fr_ca: La première chose à noter dans la vue du projet est le panneau de gauche avec les composants du projet. Développez le dossier :code:`TeamCode`, puis le dossier :code:`java`, et vous verrez un paquet :code:`org.firstinspires.ftc.teamcode`.

source: If you want to create a subfolder for organization purposes, you can select the "Package" option. Then, you can create classes in those packages.
fr_ca: Si vous souhaitez créer un sous-dossier à des fins d'organisation, vous pouvez sélectionner l'option "Package". Vous pouvez ensuite créer des classes dans ces paquets.

source: The :code:`readme.md` file in this directory contains useful documentation, including information on sample programs shipped with the SDK that you can use and modify. We highly recommend you read this information.
fr_ca: Le fichier :code:`readme.md` de ce répertoire contient de la documentation utile, notamment des informations sur les exemples de programmes livrés avec le SDK que vous pouvez utiliser et modifier. Nous vous recommandons vivement de lire ces informations.

source: To install your program onto the Robot Controller, you will use the play button located near the top middle of the application window.
fr_ca: Pour installer votre programme sur le contrôleur de robot, vous utiliserez le bouton de lecture situé en haut au milieu de la fenêtre de l'application.

source: Near it you will see a dropdown for devices. When you connect your Robot Controller to your computer, the device should appear in the dropdown after some time. Then, click the play button and your program will install onto the device.
fr_ca: Près de celui-ci, vous verrez un menu déroulant pour les appareils. Lorsque vous connectez votre contrôleur de robot à votre ordinateur, l'appareil devrait apparaître dans la liste déroulante au bout d'un certain temps. Cliquez ensuite sur le bouton de lecture et votre programme s'installera sur l'appareil.

source: If you're still stuck, you can ask for help in the `FTC Discord <https://discord.com/invite/ftc>`_.
fr_ca: Si vous êtes toujours bloqué, vous pouvez demander de l'aide sur le `Discord FTC <https://discord.com/invite/ftc>`_.

source: You can rebuild your project easily with the Build menu.
fr_ca: Vous pouvez facilement reconstruire votre projet à l'aide du menu Build.

source: The build menu at the top of the screen
fr_ca: Le menu de build en haut de l'écran

source: Note: On Windows and Linux, the menubar is accessed by clicking the hamburger menu icon at the top left of the window.
fr_ca: Remarque : sous Windows et Linux, la barre de menus est accessible en cliquant sur l'icône du menu hamburger en haut à gauche de la fenêtre.

source: To clean your project to allow you to rebuild your project from scratch, choose the ``clean project`` option. This removes old compiled files from your project. To then rebuild your project, choose the rebuild option.
fr_ca: Pour nettoyer votre projet et vous permettre de le reconstruire à partir de zéro, choisissez l'option ``clean project``. Cela supprime les anciens fichiers compilés de votre projet. Pour reconstruire votre projet, choisissez l'option de reconstruction.
