Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/using-android-studio.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: `Deploying Code Wirelessly <https://docs.revrobotics.com/duo-control/programming/android-studio-using-wireless-adb>`_
es_mx: Desplegando código de forma inalámbrica <https://docs.revrobotics.com/duo-control/programming/android-studio-using-wireless-adb>`_
fr_ca: `Déploiement de code sans fil <https://docs.revrobotics.com/duo-control/programming/android-studio-using-wireless-adb>`_
ro_ro: `Incărcarea Codului Wireless <https://docs.revrobotics.com/duo-control/programming/android-studio-using-wireless-adb>`_
zh_cn: `无线部署代码 <https://docs.revrobotics.com/duo-control/programming/android-studio-using-wireless-adb>`_

source: If you're still stuck you can ask for help in the `FTC\ |reg| Discord <https://discord.com/invite/first-tech-challenge>`_.
zh_cn: 如果你仍然卡住了，可以在 `FTC\ |reg| Discord <https://discord.com/invite/first-tech-challenge>`_ 寻求帮助。

source: Gradle is a build tool for software development. In the scope of FTC, it is used to build and manage dependencies for your project.
es_mx: Gradle es una herramienta de compilación para el desarrollo de software. En el ámbito de FTC, se utiliza para construir y gestionar las dependencias de su proyecto.
fr_ca: Gradle est un outil de construction pour le développement de logiciels. Dans le cadre de FTC, il est utilisé pour construire et gérer les dépendances de votre projet.
ro_ro: Gradle este o unealtă de construcție pentru dezvoltarea software-ului. În scopul FTC, este folosit pentru a construi și organiza dependențele (dependencies) proiectului tău.
zh_cn: Gradle 是一款用于软件开发的构建工具。在 FTC 中，它用于构建和管理项目的依赖关系。

source: When you update any of your Gradle files you will need to perform a Gradle sync, which syncs your project to the changes and rebuilds it. In your :code:`build.common.gradle`, you will find information for how your robot controller application is built.
es_mx: Cuando actualices cualquiera de tus archivos Gradle tendrás que realizar una sincronización Gradle, que sincroniza tu proyecto con los cambios y lo reconstruye. En tu :code:`build.common.gradle`, encontrarás información sobre cómo se construye tu aplicación de controlador de robot.
fr_ca: Lorsque vous mettez à jour l'un de vos fichiers Gradle, vous devez effectuer une synchronisation Gradle, qui synchronise votre projet avec les changements et le reconstruit. Dans votre :code:`build.common.gradle`, vous trouverez des informations sur la façon dont votre application de contrôleur de robot est construite.
ro_ro: Când îți actualizezi fișierele Gradle trebuie să faci o sincronizare Gradle, care îți sincronizeaza proiectul cu schimbările făcute și îl reconstruiește. În :code:`build.common.gradle`, vei găsi informații despre cum aplicația pentru Robot Controller este construită.
zh_cn: 当您更新任何 Gradle 文件时，都需要执行 Gradle 同步，将您的项目与更改同步并重建。在您的 :code:`build.common.gradle` 中，您可以找到关于如何构建机器人控制器应用程序的信息。

source: Rebuilding
es_mx: Reconstrucción
fr_ca: Reconstruction
ro_ro: Reconstruirea
zh_cn: 重建

source: You can rebuild your project easily with the build dropdown.
es_mx: Puedes reconstruir tu proyecto fácilmente con el desplegable de construcción.
ro_ro: Îți poți reconstrui proiectul cu ușurință în meniul "build".
zh_cn: 您可以使用 "Build" 下拉菜单轻松重建项目。

source: The build dropdown at the top of the screen
es_mx: El menú desplegable de construcción en la parte superior de la pantalla
ro_ro: Meniul "build" în partea superioară a ecranului
zh_cn: 屏幕顶部的 "Build" 下拉菜单

source: To rebuild from a clean project, press the clean project option. This removes old compiled files from your project so you can completely rebuild your project. It clears any production files, generated files, etc. This is useful for making sure old artifacts don't break anything when you build your code. When you next build your project, it will do so from scratch with no old compiled files to which it can refer. To rebuild your project, press the rebuild option.
es_mx: Para reconstruir a partir de un proyecto limpio, pulse la opción de proyecto limpio. Esto elimina los archivos compilados antiguos de su proyecto para que pueda reconstruirlo completamente. Borra cualquier archivo de producción, archivos generados, etc. Esto es útil para asegurarse de que los viejos artefactos no rompen nada cuando se construye el código. La próxima vez que reconstruya su proyecto, lo hará desde cero sin archivos compilados antiguos a los que pueda hacer referencia. Para reconstruir tu proyecto, pulsa la opción reconstruir.
ro_ro: Pentru a reconstrui de la un proiect "curat", selectează "clean project". Această opțiune îți șterge fișierele compilate din proiect pentru a-ți putea reconstrui complet proiectul. Îți curăță orice fișiere de producție, fișiere generate, etc. Această opțiune este folositoare pentru a te asigura că artefactele vechi nu îți strică proiectul atunci când îți construiești codul. Când îți construiesti următorul proiect, îl va face de la 0 fără fișiere compilate anterior de la care se poate "inspira". Pentru a-ți reconstrui proiectul, apasă pe opțiunea "rebuild".
zh_cn: 要从一个干净的项目中重建，请按下 "清除项目 "选项。这将删除项目中的旧编译文件，以便完全重建项目。它会清除任何生产文件、生成文件等。这对于确保在构建代码时不会破坏任何旧的工件非常有用。下一次构建项目时，项目将从头开始，不会再引用旧的编译文件。要重建项目，请按重建选项。

source: Invalidate and Restart
es_mx: Invalidar y reiniciar
fr_ca: Invalider et Redémarrer
ro_ro: Invalidează și Restartează
zh_cn: 失效和重启

source: Sometimes you can get errors after moving things around, refactoring, etc. The first step is to try cleaning the project and doing a rebuild. If this doesn't work, you might have confused Android Studio because it caches information about your project structure.
es_mx: A veces pueden aparecer errores después de mover cosas, refactorizar, etc. El primer paso es intentar limpiar el proyecto y hacer una reconstrucción. Si esto no funciona, es posible que hayas confundido Android Studio porque almacena en caché información sobre la estructura de tu proyecto.
ro_ro: Uneori poți să primești erori după ce muți lucrurile din loc, refactorizezi, etc. Primul pas este să încerci să îți cureți proiectul și să îl reconstruiești. Dacă această metodă nu merge, s-ar putea să fi pus Android Studio în "ceață" deoarece stochează informații despre structura proiectului tău.
zh_cn: 有时在移动、重构等操作后会出现错误。第一步是尝试清理项目并重建。如果还不行，可能是 Android Studio 混淆了项目结构，因为它缓存了项目结构信息。

source: The most common way to fix these errors is to do an invalidate and restart. In the file dropdown, there will be an option for this and then you will choose Invalidate and Restart. This clears the cache and restarts your Android Studio, which then should perform a Gradle rebuild.
es_mx: La forma más común de solucionar estos errores es invalidar y reiniciar. En el menú desplegable de archivos, habrá una opción para esto y luego elegirás Invalidar y Reiniciar. Esto limpia la caché y reinicia tu Android Studio, que entonces debería realizar una reconstrucción de Gradle.
ro_ro: Cea mai comună metodă de a rezolva aceste erori este de a invalida erorile și de a restarta aplicația. În meniul "file", ar trebui să fie o opțiunea "Invalidate and Restart". Această opțiune curață cache-ul și restartează Android Studio, care ar trebui să realizeze un Gradle rebuild.
zh_cn: 修复这些错误的最常见方法是失效并重启。在文件下拉菜单中会有一个选项，然后选择 "无效并重启"。这将清除缓存并重启 Android Studio，然后执行 Gradle 重建。

source: Adding Dependencies
es_mx: Añadir dependencias
fr_ca: Ajout de Dépendances
ro_ro: Adăugarea Dependențelor
zh_cn: 添加依赖项

source: If you want to add dependencies to your project, you can do so in the :code:`build.gradle` file in the TeamCode directory.
es_mx: Si quieres añadir dependencias a tu proyecto, puedes hacerlo en el archivo :code:`build.gradle` en el directorio TeamCode.
fr_ca: Si vous voulez ajouter des dépendances à votre projet, vous pouvez le faire dans le fichier :code:`build.gradle` dans le répertoire TeamCode.
ro_ro: Dacă vrei să adaugi dependențe proiectului tău, poți face acest lucru în fișierul :code:`build.gradle` din registrul TeamCode.
zh_cn: 如果您想在项目中添加依赖项，可以在 TeamCode 目录中的 :code:`build.gradle` 文件中添加。

source: There should be a dependencies block at the bottom of the file.
es_mx: Debería haber un bloque de dependencias al final del archivo.
fr_ca: Il devrait y avoir un bloc de dépendances au bas du fichier.
ro_ro: Ar trebui să fie un bloc de dependențe la sfârșitul fișierului.
zh_cn: 文件底部应该有一个依赖项块。

source: Some dependencies require changes to your other Gradle files. Make sure to read the installation instructions for whatever dependency you want to add.
es_mx: Algunas dependencias requieren cambios en otros archivos de Gradle. Asegúrate de leer las instrucciones de instalación de la dependencia que quieras añadir.
fr_ca: Certaines dépendances nécessitent des modifications de vos autres fichiers Gradle. Assurez-vous de lire les instructions d'installation de la dépendance que vous souhaitez ajouter.
ro_ro: Unele dependențe au nevoie de schimbări la alte fișiere Gradle. Asigură-te că ai citit instrucțiunile de instalare pentru orice dependențe pe care vrei să le adaugi proiectului.
zh_cn: 有些依赖项需要修改其他 Gradle 文件。请务必阅读要添加的依赖项的安装说明。

source: Next, you add a line in the dependencies block to implement the dependency. This is generally done with :code:`implementation 'com.package.name'`.
es_mx: A continuación, añada una línea en el bloque de dependencias para implementar la dependencia. Esto se hace generalmente con :code:`implementation 'com.package.name'.
ro_ro: Apoi, adaugi o linie de cod în blocul de dependențe pentru a implementa dependența. Acest lucru se face în general cu :code:`implementation 'com.package.name'`.
zh_cn: 然后，在依赖关系块中添加一行，以实现依赖关系。一般使用 :code:`implementation 'com.package.name'`。

source: Refer to the instructions of whatever library you are using for the correct package name and version.
es_mx: Consulte las instrucciones de la biblioteca que esté utilizando para conocer el nombre y la versión correcta del paquete.
fr_ca: Reportez-vous aux instructions de la bibliothèque que vous utilisez pour connaître le nom et la version du paquetage.
ro_ro: Citește instrucțiunile pentru orice librărie folosești pentru a adăuga numele și versiunea corectă a pachetului.
zh_cn: 有关正确的软件包名称和版本，请参阅您使用的任何库的说明。

source: Finally, perform a Gradle sync.
es_mx: Por último, realice una sincronización Gradle.
fr_ca: Enfin, effectuez une synchronisation Gradle.
ro_ro: În final, realizează o sincronizare Gradle.
zh_cn: 最后，执行 Gradle 同步。

source: Upgrading to Java 8
es_mx: Actualización a Java 8
ro_ro: Actualizarea la Java 8
zh_cn: 升级到 Java 8

source: By default, the SDK's version of Java is set to 7. Java 8 is also supported. You might want to upgrade your version of Java from 7 to 8 if you want to use features such as lambdas or generics. Some libraries may also require you to change your Java version.
es_mx: Por defecto, la versión de Java del SDK es la 7. Java 8 también es compatible. Es posible que desee actualizar su versión de Java de 7 a 8 si desea utilizar funciones como lambdas o genéricos. Algunas bibliotecas también pueden requerir que cambie su versión de Java.
ro_ro: Implicit, versiunea SDK-ului Java este setată la 7. Java 8 este de asemenea compatibilă. Probabil vei vrea să actualizezi versiunea Java de la 7 la 8 pentru a folosi funcții precum lambda sau generice. Unele librării de asemenea vor avea nevoie de o versiune Java actualizată.
zh_cn: 默认情况下，SDK 的 Java 版本设置为 7。也支持 Java 8。如果您想使用 lambdas 或泛型等功能，可能需要将 Java 版本从 7 升级到 8。某些库可能也要求您更改 Java 版本。

source: To upgrade to Java 8, navigate to your :code:`build.common.gradle` file. Scroll down until you find this block:
es_mx: Para actualizar a Java 8, vaya a su archivo :code:`build.common.gradle`. Desplácese hacia abajo hasta encontrar este bloque:
ro_ro: Pentru a actualiza la Java 8, navighează la fișierul :code:`build.common.gradle`, iar mai jos vei găsi acest bloc:
zh_cn: 要升级到 Java 8，请浏览您的 :code:`build.common.gradle` 文件。向下滚动，直到找到此块：

source: Change the :code:`7` to :code:`8`, like so:
es_mx: Cambia el :code:`7` por :code:`8`, así:
ro_ro: Schimbă :code:`7` în :code:`8`, așa:
zh_cn: 将 :code:`7` 改为 :code:`8`，就像这样：

source: Then, perform a Gradle sync.
es_mx: A continuación, realice una sincronización Gradle.
ro_ro: Apoi, realizează o sincronizare Gradle.
zh_cn: 然后，执行 Gradle 同步。

source: Android Debug Bridge
es_mx: Puente de Depuración Android
ro_ro: Depanarea Android (ADB / Android Debug Bridge)
zh_cn: 安卓调试桥接器

source: On macOS, Linux, or using PowerShell you will have to change any commands that start with :code:`adb` to start with :code:`./adb` if you are in the :code:`platform-tools` directory.
es_mx: En macOS, Linux o usando PowerShell tendrás que cambiar cualquier comando que empiece por :code:`adb` para que empiece por :code:`./adb` si estás en el directorio :code:`platform-tools`.
ro_ro: Pe macOS, Linux, sau Powershell Windows vei fi nevoit să schimbi orice comandă care începe cu :code:`adb` ca să înceapă cu :code:`./adb` dacă ești în registrul :code:`platform-tools`.
zh_cn: 在 macOS、Linux 或使用 PowerShell 时，如果您在 :code:`platform-tools` 目录中，则必须将以 :code:`adb` 开头的命令更改为以 :code:`./adb` 开头。

source: Logcat is extremely useful for debugging issues with your code at runtime or figuring out what went wrong. For example, if your app activity crashes and you pull up the log seeing 5000 lines of the same error, there is probably infinite recursion in your code!
es_mx: Logcat es extremadamente útil para depurar problemas con tu código en tiempo de ejecución o para averiguar qué ha ido mal. Por ejemplo, si la actividad de tu aplicación se bloquea y consultas el registro y ves 5000 líneas con el mismo error, ¡probablemente haya una recursividad infinita en tu código!
fr_ca: Logcat est extrêmement utile pour déboguer les problèmes de votre code au moment de l'exécution ou pour comprendre ce qui n'a pas fonctionné. Par exemple, si l'activité de votre application se bloque et que vous consultez le journal et voyez 5000 lignes de la même erreur, il y a probablement une récursivité infinie dans votre code !
zh_cn: Logcat 对于在运行时调试代码问题或找出出错原因非常有用。例如，如果您的应用程序活动崩溃，而您在日志中看到 5000 行相同的错误，那么您的代码中可能存在无限递归！

source: To use logcat, plug in your device (or connect via ADB). Then, select the app you want to view the logs for. Your window should look like this.
es_mx: Para utilizar logcat, conecta tu dispositivo (o conéctalo mediante ADB). A continuación, selecciona la aplicación de la que quieres ver los registros. La ventana debería tener este aspecto.
ro_ro: Pentru a folosi logcat, conectați-vă dispozitivul prin cablu (sau ADB). Apoi, selectează aplicația pentru care vrei să vizualizezi istoricul (log). Fereastra ta ar trebui să arate așa:
zh_cn: 要使用 logcat，请插入设备（或通过 ADB 连接）。然后，选择要查看日志的应用程序。您的窗口应该如下所示。

source: A selected device and app with the error messages
es_mx: Un dispositivo y una aplicación seleccionados con los mensajes de error
fr_ca: Un appareil et une application sélectionnés avec les messages d'erreur
ro_ro: Un dispozitiv selectat și aplicația cu mesajele de erori
zh_cn: 带有错误信息的选定设备和应用程序

source: If you have an issue you don't understand, you can take a screenshot of the log or select and copy the error and ask a question in the `FTC discord <https://discord.com/invite/first-tech-challenge>`_.
zh_cn: 如果您遇到不明白的问题，可以截取日志截图或选择并复制错误，然后在 `FTC discord <https://discord.com/invite/first-tech-challenge>`_ 提问。

source: Wireless Communication
es_mx: Comunicación Inalámbrica
fr_ca: Communication sans fil
ro_ro: Comunicare Wireless
zh_cn: 无线通信

source: Android Debug Bridge (ADB) is a command-line tool that allows for wireless communication between the robot controller (phone or Control Hub).
es_mx: Android Debug Bridge (ADB) es una herramienta de línea de comandos que permite la comunicación inalámbrica entre el controlador del robot (teléfono o Control Hub).
fr_ca: Android Debug Bridge (ADB) est un outil de ligne de commande qui permet une communication sans fil entre le contrôleur du robot (téléphone ou Control Hub).
ro_ro: Depanarea Android (ADB) este o unealtă prin terminalul de comandă care îți permite să comunici wireless cu Robot Controller-ul (telefon sau Control Hub).
zh_cn: 安卓调试桥接器（ADB）是一种命令行工具，可实现机器人控制器（手机或 Control Hub ）之间的无线通信。

source: ADB should come with the platform tools in Android Studio. Navigate to your :code:`local.properties` file in the root of your project and you should see a path to the Android SDK on your computer, such as :code:`C:\Users\Woodie\AppData\Local\Android\Sdk`. Then navigate to :code:`platform-tools` and an application called adb should be there. To use it, open CLI (like PowerShell or command prompt) and run either :code:`adb devices` or :code:`./adb devices`.
es_mx: ADB debería venir con las herramientas de plataforma en Android Studio. Navega a tu archivo :code:`local.properties` en la raíz de tu proyecto y deberías ver una ruta al SDK de Android en tu ordenador, como :code:`C:`Users\Woodie\AppData\Local\Android\Sdk`. A continuación, vaya a :code:`platform-tools` y una aplicación llamada adb debería estar allí. Para usarlo, abra CLI (como PowerShell o símbolo del sistema) y ejecute :code:`adb devices` o :code:`./adb devices`.
fr_ca: ADB devrait être fourni avec les outils de plateforme dans Android Studio. Naviguez vers votre fichier :code:`local.properties` à la racine de votre projet et vous devriez voir un chemin vers le SDK Android sur votre ordinateur, comme :code:`C:\NUsers\NWoodie\NAppData\NLocal\NAndroid\NSdk`. Naviguez ensuite vers :code:`platform-tools` et une application appelée adb devrait s'y trouver. Pour l'utiliser, ouvrez CLI (comme PowerShell ou une invite de commande) et exécutez :code:`adb devices` ou :code:`./adb devices`.
ro_ro: ADB ar trebui să vină implicit cu uneltele din Android Studio. Navighează în fișierul :code:`local.properties` în root-ul (fișierul de bază) proiectului tău și ar trebui să vezi un drum către Android SDK-ul instalat pe calculatorul tău, precum :code:`C:\Users\Woodie\AppData\Local\Android\Sdk`. Apoi navighează către :code:`platform-tools`, iar o aplicatie numită adb ar trebui să fie acolo. Pentru a o folosi, deschide CLI (precum Powershell sau terminalul de comandă) și rulează :code:`adb devices` sau :code:`./adb devices`.
zh_cn: ADB 应与 Android Studio 中的平台工具一起提供。导航到项目根目录下的 :code:`local.properties` 文件，你应该能看到电脑上 Android SDK 的路径，例如 :code:`C:\Users\Woodie\AppData\Local\Android\Sdk` 。然后导航到 :code:`platform-tools` ，一个名为 adb 的应用程序就会出现在那里。要使用它，请打开 CLI（如 PowerShell 或命令提示符）并运行 :code:`adb devices` 或 :code:`./adb devices` 。

source: For more information on ADB, you can look at the `developers page <https://developer.android.com/studio/command-line/adb>`_.
es_mx: Para más información sobre ADB, puede consultar la `página para desarrolladores <https://developer.android.com/studio/command-line/adb>`_.
ro_ro: Pentru mai multe informații despre ADB, te poți uita pe pagina pentru `dezvoltatori <https://developer.android.com/studio/command-line/adb>`_.
zh_cn: 有关 ADB 的更多信息，请访问 `开发者页面 <https://developer.android.com/studio/command-line/adb>`_ 。

source: Setting Up ADB
es_mx: Configuración de ADB
fr_ca: Configuration de l'ADB
ro_ro: Pregătirea ADB-ului
zh_cn: 设置 ADB

source: Ensure USB debugging is enabled on your device and it is in developer mode.
es_mx: Asegúrate de que la depuración USB está activada en tu dispositivo y de que está en modo desarrollador.
fr_ca: Assurez-vous que le débogage USB est activé sur votre appareil et qu'il est en mode développeur.
ro_ro: Asigură-te că depanarea USB este activată pe dispozitivul tău și este în modul de dezvoltator.
zh_cn: 确保设备已启用 USB 调试，并处于开发者模式。

source: Make sure you have ADB installed. If you do not, follow the instructions at `this link <https://www.xda-developers.com/install-adb-windows-macos-linux/>`_
es_mx: Asegúrate de que tienes ADB instalado. Si no lo tiene, siga las instrucciones de `este enlace <https://www.xda-developers.com/install-adb-windows-macos-linux/>`_
fr_ca: Assurez-vous d'avoir installé ADB. Si ce n'est pas le cas, suivez les instructions sur `ce lien <https://www.xda-developers.com/install-adb-windows-macos-linux/>`_
ro_ro: Asigură-te că ai ADB instalat. Dacă nu îl ai, urmează instructiunile la `acest link <https://www.xda-developers.com/install-adb-windows-macos-linux/>`_
zh_cn: 确保已安装 ADB。如果没有，请按照 `此链接 <https://www.xda-developers.com/install-adb-windows-macos-linux/>`_ 中的说明进行操作。

source: You can use logcat via ADB with the :code:`adb logcat` command. This is extremely useful for debugging as it allows you to look at the logs wirelessly which saves time. Remember, logcat is the *best* way to debug your software.
es_mx: Puede utilizar logcat a través de ADB con el comando :code:`adb logcat`. Esto es extremadamente útil para la depuración, ya que le permite ver los registros de forma inalámbrica, lo que ahorra tiempo. Recuerda, logcat es la *mejor* manera de depurar tu software.
fr_ca: Vous pouvez utiliser logcat via ADB avec la commande :code:`adb logcat`. C'est extrêmement utile pour le débogage car cela vous permet de regarder les logs sans fil, ce qui permet de gagner du temps. Rappelez-vous, logcat est la *meilleure* façon de déboguer votre logiciel.
ro_ro: Poți folosi logcat via ADB prin comanda :code:`adb logcat`. Această comandă este foarte folositoare pentru depanare deoarece îți permite să te uiți la istoric wireless, ceea ce salvează timp. Reține, logcat este cea mai *bună* metodă să îți depanezi software-ul.
zh_cn: 您可以使用 :code:`adb logcat` 命令通过 ADB 使用 logcat。这对调试非常有用，因为它允许你以无线方式查看日志，从而节省时间。请记住，logcat 是调试软件的*佳方法。

source: Add ADB To PATH
es_mx: Añadir ADB a PATH
fr_ca: Ajouter ADB au PATH
ro_ro: Adaugă ADB la PATH
zh_cn: 将 ADB 添加到 PATH

source: Adding variables to PATH:
es_mx: Añadir variables a PATH:
fr_ca: Ajout de variables à PATH :
ro_ro: Adăugarea variabilelor în PATH
zh_cn: 在 PATH 中添加变量:

source: If you want to use ADB from any directory, add it to PATH. Follow an online tutorial for adding to PATH and set the PATH to the :code:`platform-tools` directory. Once you do that, you can run ADB commands from anywhere on your system.
es_mx: Si quieres usar ADB desde cualquier directorio, añádelo a PATH. Sigue un tutorial online para añadirlo al PATH y establece el PATH al directorio :code:`platform-tools`. Una vez hecho esto, podrás ejecutar comandos ADB desde cualquier parte de tu sistema.
ro_ro: Dacă vrei să folosești ADB din orice registru, adaugă-l în PATH. Urmează un tutorial online pentru adăugarea în PATH și setează PATH la registrul :code:`platform-tools` . Odată ce faci asta, poți rula comenzi ADB de oriunde pe sistemul tău.
zh_cn: 如果要从任何目录使用 ADB，请将其添加到 PATH。按照在线教程添加到 PATH，并将 PATH 设为 :code:`platform-tools` 目录。这样，你就可以在系统的任何地方运行 ADB 命令了。

source: Connecting to a Phone Wirelessly
es_mx: Conexión Inalámbrica a un Teléfono
fr_ca: Connexion Sans fil à un Téléphone
ro_ro: Conectarea Wireless la un Telefon
zh_cn: 无线连接手机

source: Plug the robot controller phone into your computer.
es_mx: Conecta el teléfono controlador del robot al ordenador.
fr_ca: Branchez le téléphone contrôleur du robot sur votre ordinateur.
ro_ro: Conectează telefonul conectat la robot în calculator.
zh_cn: 将机器人控制器手机插入电脑。

source: Run the command :code:`adb devices` in the :code:`platform-tools` directory and see if the phone shows up.
es_mx: Ejecute el comando :code:`adb devices` en el directorio :code:`platform-tools` y compruebe si aparece el teléfono.
fr_ca: Exécutez la commande :code:`adb devices` dans le répertoire :code:`platform-tools` et voyez si le téléphone apparaît.
ro_ro: Rulează comanda :code:`adb devices` în registrul :code:`platform-tools` și vezi dacă îți apare telefonul.
zh_cn: 在 :code:`platform-tools` 目录下运行 :code:`adb devices` 命令，查看手机是否显示。
