Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/using-android-studio.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Using Android Studio
es_mx: Uso de Android Studio
fr_ca: Utilisation d'Android Studio
ro_ro: Utilizarea Android Studio
zh_cn: 使用 Android Studio

source: `Android Studio <https://developer.android.com/studio/intro>`_ is an integrated development environment (IDE) for Android app development based on IntelliJ. It compiles your code to an apk which is then installed onto the Robot Controller: either the Control Hub or a legal Android phone.
es_mx: `Android Studio <https://developer.android.com/studio/intro>`_ es un entorno de desarrollo integrado (IDE) para el desarrollo de aplicaciones Android basado en IntelliJ. Compila tu código en un apk que luego se instala en el Robot Controller: el Control Hub o un teléfono Android legal.
ro_ro: `Android Studio <https://developer.android.com/studio/intro>`_ este un mediu de dezvoltare (IDE) pentru dezvoltarea aplicațiilor Android, bazat pe IntelliJ. Acest program îți compilează codul, creând un program apk, care este instalat pe Robot Controller: fie pe Control Hub, fie pe un telefon Android legal.
zh_cn: `Android Studio <https://developer.android.com/studio/intro>`_ 是一个基于智能的安卓应用开发集成开发环境（IDE）。它将您的代码编译成一个apk，然后安装到机器人控制器上：Control Hub 或合规的安卓手机。

source: Downloading Android Studio
es_mx: Descarga de Android Studio
fr_ca: Téléchargement d'Android Studio
ro_ro: Descărcarea Android Studio
zh_cn: 下载 Android Studio

source: If you've already downloaded Android Studio, you can move on to the next step, which is `setting up the SDK <#setting-up-the-sdk>`_.
es_mx: Si ya has descargado Android Studio, puedes pasar al siguiente paso, que es `configurar el SDK <#setting-up-the-sdk>`_.
ro_ro: Dacă deja ai descărcat Android Studio, poți sări la următorul pas, care este `pregătirea SDK-ului <#setting-up-the-sdk>`_.
zh_cn: 如果您已经下载了Android Studio，则可以继续下一步，即设置 `设置 SDK <#setting-up-the-sdk>`_ 。

source: The steps to download and setup Android Studio are:
es_mx: Los pasos para descargar y configurar Android Studio son:
fr_ca: Les étapes pour télécharger et installer Android Studio sont les suivantes :
ro_ro: Pașii pentru descărcarea și pregătirea Android Studio sunt:
zh_cn: 下载和设置 Android Studio 的步骤如下：

source: Check to make sure your system meets the `necessary requirements <https://developer.android.com/studio#Requirements>`_
es_mx: Compruebe que su sistema cumple los `requisitos necesarios <https://developer.android.com/studio#Requirements>`_
fr_ca: Vérifiez que votre système répond aux `conditions requises <https://developer.android.com/studio#Requirements>`_
ro_ro: Verifică dacă sistemul tău este suficient de performant: `cerințe necesare <https://developer.android.com/studio#Requirements>`_
zh_cn: 检查确保您的系统满足 `必要要求 <https://developer.android.com/studio#Requirements>`_

source: Install the *latest* version of Android Studio from https://developer.android.com/studio/index.html
es_mx: Instala la *última* versión de Android Studio desde https://developer.android.com/studio/index.html
ro_ro: Instalează cea mai *recentă* versiune de Android Studio de la https://developer.android.com/studio/index.html
zh_cn: 从 https://developer.android.com/studio/index.html 安装 *最新* 版本的 Android Studio

source: Run the executable, follow the setup wizard, and use any and all recommended development kits
es_mx: Ejecute el programa, siga el asistente de instalación y utilice todos los kits de desarrollo recomendados.
fr_ca: Exécutez l'exécutable, suivez l'assistant d'installation et utilisez tous les kits de développement recommandés.
ro_ro: Rulează programul executabil, urmează pașii, și folosește orice sau toate kit-urile recomandate de dezvoltare.
zh_cn: 运行可执行文件，按照设置向导操作，并使用推荐的所有开发工具包

source: Setting up the SDK
es_mx: Configuración del SDK
fr_ca: Mise en place du SDK
ro_ro: Pregătirea SDK-ului
zh_cn: 设置SDK

source: Now that you have Android Studio installed, you're going to want to use the current season's SDK (software development kit) where you will create your team's code.
es_mx: Ahora que tienes instalado Android Studio, vas a querer utilizar el SDK (kit de desarrollo de software) de la temporada actual, donde crearás el código de tu equipo.
ro_ro: Acum că ai instalat Android Studio, trebuie să îti pregătesti SDK-ul (prescurtat de la software developement kit / kit-ul de dezvoltare software) al sezonului curent cu care îți vei scrie codul robotului.
zh_cn: 现在您已经安装了 Android Studio，您需要使用当前赛季的 SDK（软件开发工具包）来创建团队代码。

source: Downloading the SDK
es_mx: Descarga del SDK
fr_ca: Télécharger le SDK
ro_ro: Descărcarea SDK-ului
zh_cn: 下载 SDK

source: The SDK is publicly released to a GitHub repository every season. The current season's SDK can be found in the `FtcRobotController <https://github.com/FIRST-Tech-Challenge/FtcRobotController>`_ repository.
es_mx: El SDK se publica en un repositorio de GitHub cada temporada. El SDK de la temporada actual se encuentra en el repositorio `FtcRobotController <https://github.com/FIRST-Tech-Challenge/FtcRobotController>`_.
ro_ro: SDK-ul este publicat pe un repository (un loc unde este stocat online cod-ul) pe GitHub în fiecare sezon. SDK-ul sezonului curent poate fi găsit pe `FtcRobotController <https://github.com/FIRST-Tech-Challenge/FtcRobotController>`_.
zh_cn: SDK 每个赛季都会在 GitHub 存储库中公开发布。当前赛季的 SDK 可在 `FtcRobotController <https://github.com/FIRST-Tech-Challenge/FtcRobotController>`_ 存储库中找到。

source: Downloading the ZIP
es_mx: Descargar el archivo ZIP
ro_ro: Descărcarea ZIP-ului
zh_cn: 下载 ZIP

source: When you're at the repository, click the green "code" button. Then, select "Download ZIP."
es_mx: Cuando estés en el repositorio, haz clic en el botón verde "código". A continuación, selecciona "Descargar ZIP".
ro_ro: Când ești pe repository, apasă pe butonul verde numit "code", apoi selectează "Download ZIP".
zh_cn: 进入存储库后，点击绿色的 "代码 "按钮。然后选择 "下载 ZIP"。

source: Click the Download ZIP option
es_mx: Haga clic en la opción Descargar ZIP
ro_ro: Apasă pe opțiunea de "Download ZIP"
zh_cn: 点击下载 ZIP 选项

source: Then, save it to the desired location in your computer.
es_mx: A continuación, guárdelo en la ubicación deseada de su ordenador.
ro_ro: Apoi, salvează-l la locația dorită pe calculatorul tău.
zh_cn: 然后，将其保存到电脑中想要的位置。

source: The ZIP file should be called FtcRobotController-master
es_mx: El archivo ZIP debe llamarse FtcRobotController-master
ro_ro: Fișierul ZIP ar trebui să se numească FtcRobotController-master
zh_cn: ZIP 文件的名称应为 FtcRobotController-master

source: After it is saved, extract the contents of the ZIP and place them into whatever desired location. You should see the contents of the SDK inside of the folder location.
es_mx: Una vez guardado, extraiga el contenido del ZIP y colóquelo en la ubicación que desee. Debería ver el contenido del SDK dentro de la ubicación de la carpeta.
ro_ro: După ce s-a salvat, extrage conținutul ZIP-ului și pune-l în ce locație dorești. Ar trebui să vezi conținutul SDK-ului în locația folder-ului.
zh_cn: 保存后，解压缩 ZIP 中的内容并将其放置到所需位置。您应该能在文件夹中看到 SDK 的内容。

source: Using GitHub Desktop
es_mx: Uso de GitHub Desktop
ro_ro: Utilizarea GitHub Desktop
zh_cn: 使用 GitHub Desktop

source: `Install GitHub Desktop <https://docs.github.com/en/desktop/installing-and-configuring-github-desktop/installing-and-authenticating-to-github-desktop>`_
es_mx: `Instalar GitHub Desktop <https://docs.github.com/en/desktop/installing-and-configuring-github-desktop/installing-and-authenticating-to-github-desktop>`_
ro_ro: `Instalează GitHub Desktop <https://docs.github.com/en/desktop/installing-and-configuring-github-desktop/installing-and-authenticating-to-github-desktop>`_
zh_cn: `安装 GitHub Desktop <https://docs.github.com/en/desktop/installing-and-configuring-github-desktop/installing-and-authenticating-to-github-desktop>`_

source: Open the `SDK repository <https://github.com/FIRST-Tech-Challenge/FTCRobotController>`_ in a browser.
es_mx: Abra el repositorio `SDK <https://github.com/FIRST-Tech-Challenge/FTCRobotController>`_ en un navegador.
ro_ro: Deschide `repository-ul SDK-ului <https://github.com/FIRST-Tech-Challenge/FTCRobotController>`_ într-un browser.
zh_cn: 在浏览器中打开 `SDK 资源库 <https://github.com/FIRST-Tech-Challenge/FTCRobotController>`_ 。

source: Click the green "code" button, and then select "Open with GitHub Desktop."
es_mx: Haz clic en el botón verde "código" y selecciona "Abrir con GitHub Desktop".
ro_ro: Apasă butonul verde "code" și apoi selectează "Open with GitHub Desktop."
zh_cn: 点击绿色的 "代码 "按钮，然后选择 "用 GitHub Desktop打开"。

source: Click the Open with GitHub Desktop option
es_mx: Haz clic en la opción Abrir con GitHub Desktop
ro_ro: Apasă pe opțiunea Open with GitHub Desktop (Deschidere cu GitHub Desktop)
zh_cn: 点击 "用 GitHub Desktop打开" 选项

source: Clone the project.
es_mx: Clona el proyecto.
ro_ro: Clonează proiectul.
zh_cn: 克隆项目。

source: Clone the repository to your resource folder
es_mx: Clona el repositorio en tu carpeta de recursos
ro_ro: Clonează repository-ul în folder-ul tău de resurse
zh_cn: 将版本库克隆到资源文件夹中

source: From the Command Line
es_mx: Desde la Línea de Comandos
ro_ro: Din Terminalul de Comandă
zh_cn: 从命令行

source: `Install git <https://github.com/git-guides/install-git>`_
es_mx: `Instalar git <https://github.com/git-guides/install-git>`_
ro_ro: `Instalează git <https://github.com/git-guides/install-git>`_
zh_cn: `安装 git <https://github.com/git-guides/install-git>`_

source: Open the terminal (probably bash) in the desired resource location.
es_mx: Abra la terminal (probablemente bash) en la ubicación de recursos deseada.
ro_ro: Deschide terminalul (probabil bash) în locația dorită a resurselor.
zh_cn: 在所需的资源位置打开终端（可能是bash）。

source: Use :code:`$ git clone https://github.com/FIRST-Tech-Challenge/FtcRobotController.git`
es_mx: Usa :code:`$ git clone https://github.com/FIRST-Tech-Challenge/FtcRobotController.git``
ro_ro: Folosește :code:`$ git clone https://github.com/FIRST-Tech-Challenge/FtcRobotController.git`
zh_cn: 使用 :code:`$ git clone https://github.com/FIRST-Tech-Challenge/FtcRobotController.git`

source: Opening the SDK on Android Studio
es_mx: Abrir el SDK en Android Studio
ro_ro: Deschiderea SDK-ului în Android Studio
zh_cn: 在 Android Studio 上打开 SDK

source: Open Android Studio. If you have another project open, close it.
es_mx: Abre Android Studio. Si tienes otro proyecto abierto, ciérralo.
ro_ro: Deschide Android Studio. Dacă ai deja un alt proiect deshis, închide-l.
zh_cn: 打开 Android Studio。如果打开了另一个项目，请将其关闭。

source: A screen should appear with an option to configure settings and import a project
es_mx: Debería aparecer una pantalla con una opción para configurar los ajustes e importar un proyecto
fr_ca: Un écran devrait apparaître avec une option permettant de configurer les paramètres et d'importer un projet.
ro_ro: Un meniu ar trebui să apară cu o opțiune de a configura setări și importarea unui proiect.
zh_cn: 屏幕上应出现配置设置和导入项目的选项

source: Check for updates. Click on the "configure" dropdown and select "check for updates." If you do not have the latest version, download the updates.
es_mx: Buscar actualizaciones. Haz clic en el desplegable "configurar" y selecciona "buscar actualizaciones". Si no tienes la última versión, descarga las actualizaciones.
ro_ro: Verifică dacă există actualizări. Apasă pe meniul "configure" și selectează "check for updates". Dacă nu ai cea mai recentă versiune, descarcă actualizările.
zh_cn: 检查更新。单击“配置”下拉列表并选择“检查更新”。如果您没有最新版本，请下载更新。

source: If you have no new updates, it should say that you have the latest version installed
es_mx: Si no tiene nuevas actualizaciones, quiere decir que tiene instalada la última versión
ro_ro: Dacă nu există actualizări, ar trebui să scrie că ai cea mai recentă versiune instalată.
zh_cn: 如果没有新的更新，它就会显示您已安装了最新版本

source: Select "Import Project." Navigate to where you have the SDK saved on your computer. Choose the directory that has the Android logo.
es_mx: Seleccione "Importar proyecto". Navega hasta donde tengas el SDK guardado en tu ordenador. Elige el directorio que tiene el logo de Android.
ro_ro: Selectează "Import Project". Navighează unde ai salvat SDK-ul pe calculatorul tău. Selectează registrul care are logo-ul Android.
zh_cn: 选择 “Import Project.” 导航到您计算机上保存SDK的位置。选择具有Android徽标的目录。

source: Only select the folder with the Android logo
es_mx: Seleccione sólo la carpeta con el logotipo de Android
ro_ro: Doar selectează folder-ul cu logo-ul Android
zh_cn: 只选择带有 Android 徽标的文件夹

source: Change to project view. In the top left corner should be a dropdown that allows you to change the way you are looking at your project.
es_mx: Cambie a la vista del proyecto. En la esquina superior izquierda debe haber un menú desplegable que le permite cambiar la forma en que está viendo su proyecto.
ro_ro: Schimbă modul de vizualizare în "project view". În colțul din stânga sus ar trebui să fie un meniu care îți permite să schimbi modul în care te uiți la proiectul tău.
zh_cn: 更改为项目视图。左上角应该有一个下拉列表，允许您更改查看项目的方式。

source: Change to project view
es_mx: Cambiar a vista de proyecto
ro_ro: Schimbă modul de vizualizare în "project view"
zh_cn: 更改为项目视图

source: Wait for `Gradle`_ to complete the build. This indicator should be located at the bottom of the window by default.
es_mx: Espere a que `Gradle`_ complete la construcción. Este indicador debe estar situado en la parte inferior de la ventana por defecto.
fr_ca: Attendez que `Gradle`_ termine la construction. Cet indicateur devrait être situé en bas de la fenêtre par défaut.
ro_ro: Așteaptă ca `Gradle`_ să termine build-ul. Acest indicator ar trebui să fie localizat în partea de jos a ferestrei implicit.
zh_cn: 等待 `Gradle`_ 完成构建。默认情况下，该指示器应位于窗口底部。

source: An in-progress Gradle build
es_mx: Una compilación Gradle en curso
fr_ca: Une compilation Gradle en cours
ro_ro: Un build Gradle in desfășurare
zh_cn: 正在进行的 Gradle 构建

source: Layout
es_mx: Diseño
fr_ca: Mise en page
ro_ro: Aspect
zh_cn: 布局

source: Android Studio can look intimidating at first glance, but there are only a few features needed to use it properly.
es_mx: Android Studio puede parecer intimidante a primera vista, pero sólo se necesitan unas pocas funciones para utilizarlo correctamente.
fr_ca: Android Studio peut sembler intimidant à première vue, mais seules quelques fonctionnalités sont nécessaires pour l'utiliser correctement.
ro_ro: Android Studio poate arăta intimidant la prima vedere, însă sunt doar câteva caracteristici necesare pentru a-l folosi corect.
zh_cn: Android Studio 乍一看很吓人，但要正确使用它，只需具备几个功能。

source: Android Studio layout
es_mx: Diseño de Android Studio
fr_ca: Présentation d'Android Studio
ro_ro: Aspectul Android Studio
zh_cn: Android Studio 布局

source: Creating Classes
es_mx: Creación de clases
fr_ca: Création de classes
ro_ro: Crearea Claselor
zh_cn: 创建类

source: The first thing to note in the project view is the dropdown with the name of the project. If you drop that down, you will see all of the Gradle files and directories. Navigate to the TeamCode folder. In the teamcode folder you will see an :code:`org.firstinspires.ftc.teamcode` package.
es_mx: Lo primero que hay que observar en la vista del proyecto es el desplegable con el nombre del proyecto. Si lo despliegas, verás todos los archivos y directorios de Gradle. Navega hasta la carpeta TeamCode. En la carpeta teamcode verás un paquete :code:`org.firstinspires.ftc.teamcode`.
ro_ro: Primul lucru de reținut în "proiect view" este lista de elemente cu numele proiectului. Dacă apeși pe listă, vei vedea toate fișierele Gradle și registrele. Navighează la folder-ul TeamCode, unde vei vedea un pachet :code:`org.firstinspires.ftc.teamcode`.
zh_cn: 在项目视图中，首先要注意的是下拉菜单中的项目名称。下拉后，你会看到所有的 Gradle 文件和目录。导航到 TeamCode 文件夹。在 teamcode 文件夹中，你会看到一个 :code:`org.firstinspires.ftc.teamcode` 包。

source: This is where you will create your code for the robot. To create a new Java class, right click on the package, select New, and then choose "Java Class."
es_mx: Aquí es donde crearás tu código para el robot. Para crear una nueva clase Java, haga clic con el botón derecho del ratón en el paquete, seleccione Nuevo y, a continuación, elija "Clase Java".
fr_ca: C'est ici que vous créerez votre code pour le robot. Pour créer une nouvelle classe Java, cliquez avec le bouton droit de la souris sur le paquetage, sélectionnez Nouveau, puis choisissez "Classe Java".
ro_ro: Aici este locul unde vei crea cod pentru robot. Pentru a crea o clasă nouă Java, click-dreapta pe pachet, selectează New, și apoi alege "Java Class".
zh_cn: 这是您为机器人创建代码的地方。要创建一个新的Java类，右键单击包，选择新建，然后选择“Java Class.”

source: Alternatively, you can select the "Package" option if you want to create a subfolder for organization purposes. Then, you can create classes in those packages.
es_mx: Alternativamente, puede seleccionar la opción "Paquete" si desea crear una subcarpeta con fines de organización. A continuación, puede crear clases en esos paquetes.
ro_ro: Alternativ, poți selecta opțiunea "Package" dacă vrei să creezi un subfolder pentru scopuri organizaționale. Apoi, poți crea clase în acele pachete.
zh_cn: 或者，如果您想为组织目的创建子文件夹，您可以选择“Package”选项。然后，您可以在这些包中创建类。

source: Terminal and Logcat
es_mx: Terminal y Logcat
ro_ro: Terminalul și Logcat
zh_cn: 终端和 Logcat

source: Near the bottom left of the application, you will find tabs for the local terminal and logcat. These are useful tools for working with your program.
es_mx: Cerca de la parte inferior izquierda de la aplicación, encontrarás pestañas para el terminal local y logcat. Son herramientas útiles para trabajar con tu programa.
ro_ro: Aproape de colțul din stânga-jos al aplicației, vei găsi tab-uri pentru terminalul local și logcat-ul. Acestea sunt unelte folositoare pentru programul tău.
zh_cn: 在程序左下角附近，你会发现本地终端和 logcat 的标签。这些都是处理程序的有用工具。

source: Terminal and logcat tabs near the bottom left
es_mx: Pestañas terminal y logcat en la parte inferior izquierda
fr_ca: Onglets Terminal et Logcat en bas à gauche
ro_ro: Tab-ul terminalului și logcat-ul aproape de colțul din stânga-jos
zh_cn: 左下角附近的终端和 logcat 选项卡

source: Some useful information on using the logcat can be found `here <https://developer.android.com/studio/debug/am-logcat>`_.
es_mx: Puede encontrar información útil sobre el uso de logcat `aquí <https://developer.android.com/studio/debug/am-logcat>`_.
ro_ro: Niște informații folositoare în legătură cu folosirea logcat-ului pot fi găsite `aici <https://developer.android.com/studio/debug/am-logcat>`_.
zh_cn: 有关使用 logcat 的一些有用信息，请参见 `这里 <https://developer.android.com/studio/debug/am-logcat>`_ 。

source: You can build your program through the commandline via the local terminal. Click on the terminal tab and then input :code:`gradlew :TeamCode:clean :TeamCode:build`. This will delete the previously compiled files and build your TeamCode module.
es_mx: Puede construir su programa a través de la línea de comandos mediante el terminal local. Haga clic en la pestaña terminal y luego introduzca :code:`gradlew :TeamCode:clean :TeamCode:build`. Esto borrará los archivos previamente compilados y construirá su módulo TeamCode.
ro_ro: Îți poți construi (build) programul prin linia de comandă prin terminalul local. Apasă pe tab-ul terminalului și apoi scrie :code:`gradlew :TeamCode:clean :TeamCode:build`. Aceasta comandă va șterge fișierele compilate anterior și va construi un nou modul TeamCode.
zh_cn: 你可以通过本地终端的命令行来构建你的程序。点击终端标签，然后输入 :code:`gradlew :TeamCode:clean :TeamCode:build`。这将删除之前编译的文件并构建你的 TeamCode 模块。

source: Installing Your Program
es_mx: Instalación del programa
fr_ca: Installez Votre Programme
ro_ro: Instalarea Programului Tău
zh_cn: 安装程序

source: To install your program onto the Robot Controller, you will use the play button located near the top right of the application window.
es_mx: Para instalar su programa en el Robot Controller, utilice el botón de reproducción situado en la parte superior derecha de la ventana de la aplicación.
ro_ro: Pentru a-ți instala programul pe Robot Controller, va trebui să folosești butonul "play" localizat aproape de colțul din dreapta sus al ferestrei aplicației.
zh_cn: 要将程序安装到机器人控制器上，可使用应用程序窗口右上方的播放按钮。

source: Play button next to device dropdown
es_mx: Botón de reproducción junto al menú desplegable de dispositivos
fr_ca: Bouton de lecture à côté de la liste déroulante des appareils
ro_ro: Butonul "play" de lângă lista de device-uri
zh_cn: 设备下拉菜单旁的播放按钮

source: Next to it you will see a dropdown for devices. When you connect your Robot Controller to your computer (using the correct cable), the device should appear in the dropdown after some time. Then, click the play button and your program will install onto the device.
es_mx: Junto a él verás un desplegable de dispositivos. Cuando conectes tu Robot Controller al ordenador (utilizando el cable correcto), el dispositivo debería aparecer en el desplegable al cabo de un rato. A continuación, haz clic en el botón de reproducción y tu programa se instalará en el dispositivo.
ro_ro: Lângă acesta vei vedea o listă de dispozitive. Când îți conectezi Robot Controller-ul la calculator (prin cablul corect), device-ul ar trebui să apară în listă dupa ceva timp. Apoi, apasă pe butonul play iar programul tău se va instala pe dispozitiv.
zh_cn: 在其旁边，您会看到一个设备下拉菜单。将机器人控制器连接到电脑（使用正确的电缆）后，设备应该会在一段时间后出现在下拉菜单中。然后，点击播放按钮，程序就会安装到设备上。

source: Occasionally the app will fail to start on the robot controller, leaving the driver station in a disconnected state. If this occurs you can open the terminal and run
es_mx: Ocasionalmente, la aplicación no se iniciará en el controlador del robot, dejando la estación del conductor en un estado desconectado. Si esto ocurre puedes abrir el terminal y ejecutar
ro_ro: Ocazional, aplicația nu va reusi să pornească pe robot controller, lăsând driver station-ul într-o stare deconectată. Dacă acest lucru se întamplă, dechide terminalul și scrie comanda
zh_cn: 有时应用程序会无法在机器人控制器上启动，导致驱动站处于断开状态。如果出现这种情况，您可以打开终端并运行

source: to remotely start the Robot Controller app.
es_mx: para iniciar de forma remota la aplicación Robot Controller.
ro_ro: pentru a porni de la distanță aplicatia Robot Controller
zh_cn: 远程启动机器人控制器应用程序。

source: If you run into any problems with this process, refer to the official `REV documentation <https://docs.revrobotics.com/duo-control/>`_. Some useful pages from the REV site are:
es_mx: Si tiene algún problema con este proceso, consulte la documentación oficial de `REV <https://docs.revrobotics.com/duo-control/>`_. Algunas páginas útiles del sitio REV son:
fr_ca: Si vous rencontrez des problèmes avec ce processus, reportez-vous à la `documentation officielle de REV <https://docs.revrobotics.com/duo-control/>`_. Voici quelques pages utiles du site REV :
ro_ro: Dacă intervine orice problemă în acest proces, citește documentația oficială `REV b<https://docs.revrobotics.com/duo-control/>`_. Câteva pagini folositoare de pe site-ul REV sunt:
zh_cn: 如果在此过程中遇到任何问题，请参阅官方 `REV 文档 <https://docs.revrobotics.com/duo-control/>`_ 。REV 网站上的一些有用网页如下：

source: `Troubleshooting the Control System <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Android-Studio-Tutorial>`_
es_mx: `Solución de problemas del sistema de control <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Android-Studio-Tutorial>`_
fr_ca: Dépannage du système de contrôle <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Android-Studio-Tutorial>`_
ro_ro: `Depanarea Sistemului de Control <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Android-Studio-Tutorial>`_
zh_cn: `控制系统故障排除 <https://github.com/FIRST-Tech-Challenge/FtcRobotController/wiki/Android-Studio-Tutorial>`_
