Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/software/getting-started/using-android-studio.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Sometimes you can get errors after moving things around, refactoring, etc. The first step is to try cleaning the project and doing a rebuild. If this doesn't work, you may be able to fix these errors with ``invalidate and restart`` under the ``file`` dropdown. This clears any caches Android Studio has and restarts it.
fr_ca: Parfois, vous pouvez obtenir des erreurs après avoir déplacé des choses, refait le travail, etc. La première étape est d'essayer de nettoyer le projet et de le reconstruire. Si cela ne fonctionne pas, vous pouvez corriger ces erreurs avec ``invalider et redémarrer`` dans le menu déroulant ``fichier``. Cela efface tous les caches d'Android Studio et le redémarre.

source: Next, you add a line in the dependencies block to implement the dependency. This is generally done with :code:`implementation 'com.developer.package:name:version'`.
fr_ca: Ensuite, vous ajoutez une ligne dans le bloc des dépendances pour implémenter la dépendance. Cela se fait généralement avec :code:`implementation 'com.developer.package:name:version'`.

source: Android Debug Bridge (adb)
fr_ca: Pont de débogage Android (adb)

source: On macOS, Linux, or using PowerShell, you will have to change any commands that start with :code:`adb` to start with :code:`./adb` if you are in the :code:`platform-tools` directory.
fr_ca: Sur macOS, Linux, ou en utilisant PowerShell, vous devrez changer toutes les commandes qui commencent par :code:`adb` pour commencer par :code:`./adb` si vous êtes dans le répertoire :code:`platform-tools`.

source: For more information on ADB, you can look at the `ADB documentation <https://developer.android.com/tools/adb>`_.
fr_ca: Pour plus d'informations sur ADB, vous pouvez consulter la `documentation ADB <https://developer.android.com/tools/adb>`_.

source: If you want to use ADB from any directory, add it to PATH. Follow an online tutorial for adding to PATH and set the PATH to include the :code:`platform-tools` directory. Once you do that, you can run ADB commands from anywhere on your system.
fr_ca: Si vous souhaitez utiliser ADB à partir d'un répertoire quelconque, ajoutez-le à PATH. Suivez un tutoriel en ligne pour ajouter au PATH et configurez le PATH pour inclure le répertoire :code:`platform-tools`. Une fois que vous avez fait cela, vous pouvez exécuter des commandes ADB depuis n'importe quel endroit de votre système.

source: Connect to the Wi-Fi hotspot hosted by the Control Hub. The hotspot should be called "TEAMNUMBER-RC" or some small derivation of that. It may include extra letters if you have multiple devices per team. Refer to R707 in the |cm| for further details on the network naming scheme.
fr_ca: Connectez-vous au hotspot Wi-Fi hébergé par le Control Hub. Le hotspot doit s'appeler "NUMEROEQUIPE-RC" ou un autre nom dérivé. Il peut inclure des lettres supplémentaires si vous avez plusieurs appareils par équipe. Référez-vous à R707 dans le |cm| pour plus de détails sur le schéma de nommage du réseau.

source: Alternatively, if you have the `REV Hardware Client <https://docs.revrobotics.com/rev-hardware-client>`_ running, it will attempt to automatically connect ADB to any Control Hub connected via Wi-Fi. This option does not require manually setting up ADB, and is therefore preferred by many teams using supported computers.
fr_ca: Alternativement, si vous avez le `REV Hardware Client <https://docs.revrobotics.com/rev-hardware-client>`_ en cours d'exécution, il tentera de connecter automatiquement ADB à n'importe quel Control Hub connecté via Wi-Fi. Cette option ne nécessite pas la configuration manuelle d'ADB et est donc préférée par de nombreuses équipes utilisant des ordinateurs compatibles.

source: Connect to the same Wi-Fi network the device is either hosting or on. The Wi-Fi direct network created by the phone should be called "TEAMNUMBER-RC" or some small derivation of that. It may include extra letters if you have multiple devices per team. Refer to R707 in the |cm| for further details on the network naming scheme.
fr_ca: Connectez-vous au même réseau Wi-Fi que celui que l'appareil héberge ou sur lequel il se trouve. Le réseau Wi-Fi direct créé par le téléphone doit s'appeler "NUMEROEQUIPE-RC" ou un autre nom dérivé. Il peut comporter des lettres supplémentaires si vous avez plusieurs appareils par équipe. Reportez-vous à R707 dans le |cm| pour plus de détails sur le schéma de dénomination du réseau.

source: Once a connection is established to a Control Hub or phone, it should automatically appear in the device dropdown in Android Studio.
fr_ca: Une fois la connexion établie avec un Control Hub ou un téléphone, celui-ci devrait apparaître automatiquement dans le menu déroulant des appareils dans Android Studio.

source: To use logcat, plug in your device (or connect via ADB). Then, select the logcat button. Your window should look like this.
fr_ca: Pour utiliser logcat, branchez votre appareil (ou connectez-le via ADB). Sélectionnez ensuite le bouton logcat. Votre fenêtre devrait ressembler à ceci.

source: Some useful information on using logcat can be found `here <https://developer.android.com/studio/debug/logcat>`_.
fr_ca: Des informations utiles sur l'utilisation de logcat peuvent être trouvées `ici <https://developer.android.com/studio/debug/logcat>`_.

source: If you have an issue you don't understand, you can take a screenshot of the log or select and copy the error and ask a question in the `FTC discord <https://discord.com/invite/ftc>`_.
fr_ca: Si vous avez un problème que vous ne comprenez pas, vous pouvez faire une capture d'écran du journal ou sélectionner et copier l'erreur et poser une question dans le discord `FTC <https://discord.com/invite/ftc>`_.

source: `GitHub's collection of git resources <https://docs.github.com/en/get-started/git-basics/set-up-git>`_
fr_ca: `Collection de ressources gitHub <https://docs.github.com/en/get-started/git-basics/set-up-git>`_
