Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/transfers/transfer-design.po
Languages: es_mx, fr_ca, zh_cn

source: Transfer Design Fundamentals
es_mx: Fundamentos de Diseño de Transferencia
fr_ca: Transfert Fondamentaux de la Conception
zh_cn: 传输装置设计基础

source: There are a few fundamental aspects of the design of any transfer that must be considered. Generally, the most important considerations are:
es_mx: Hay algunos aspectos fundamentales del diseño de cualquier transferencia que deben considerarse. Generalmente, las consideraciones más importantes son:
fr_ca: Quelques aspects fondamentaux de la conception de tout transfert doivent être pris en compte. En général, les considérations les plus importantes sont les suivantes :
zh_cn: 任何传输装置的设计都必须考虑几个基本方面。一般来说，最重要的考虑因素是：

source: What will be transferred?
es_mx: ¿Qué se transferirá?
fr_ca: Qu'est-ce qui sera transféré ?
zh_cn: 什么将被传输？

source: Where will the item(s) be transferred?
es_mx: ¿Dónde se transferirán los artículos/el artículo?
fr_ca: Où le(s) objet(s) sera(ont) transféré(s) ?
zh_cn: 物品（们）将被传输到哪里？

source: How will the item(s) be transferred?
es_mx: ¿Cómo se transferirán los artículos/el artículo?
fr_ca: Comment le(s) objet(s) sera-t-il(ont) transféré(s) ?
zh_cn: 如何传输物品（们）？

source: Object Considerations
es_mx: Consideraciones del objeto
fr_ca: Considérations des objets
zh_cn: 物品考虑因素

source: One important thing to consider when designing a transfer is what object will be transferred by the mechanism. Any design must be able to physically hold the object being transferred, but it is also important to consider how many objects need to be held by the transfer or if different types of items need to be transferred.
es_mx: Una cosa importante a considerar al diseñar una transferencia es qué objeto será transferido por el mecanismo. Cualquier diseño debe ser capaz de sostener físicamente el objeto que se está transfiriendo, pero también es importante considerar cuántos objetos deben ser sostenidos por la transferencia o si se necesitan transferir diferentes tipos de elementos.
fr_ca: Un élément important à prendre en compte lors de la conception d'un transfert est l'objet qui sera transféré par le mécanisme. Toute conception doit pouvoir contenir physiquement l'objet transféré, mais il est également important de prendre en compte le nombre d'objets devant être maintenus par le transfert ou si différents types d'objets doivent être transférés.
zh_cn: 在设计传输装置时，需要考虑的一个重要问题是该装置将传输什么物品。任何设计都必须能够实际容纳被传输的物品，但同样重要的是要考虑传输装置需要容纳多少物品，或者是否需要传输不同类型的物品。

source: Location Considerations
es_mx: Consideraciones de ubicación
fr_ca: Considérations relatives à l'emplacement
zh_cn: 位置考虑因素

source: Another important consideration when designing a transfer is where the transfer will be moving items from and to. Moving objects in multiple axes is difficult and error-prone. When mechanisms are aligned, transfers only have to act in straight lines, avoiding unnecessary complexity. A very common use for a transfer mechanism is to move objects from the intake of the robot to a scoring mechanism. In this case, it can make sense to combine the transfer system with the intake system or scoring system, so only two mechanisms are needed.
es_mx: Otra consideración importante al diseñar una transferencia es de dónde y hacia dónde se moverán los objetos. Mover objetos en múltiples ejes es difícil y propenso a errores. Cuando los mecanismos están alineados, las transferencias solo tienen que actuar en líneas rectas, evitando complejidad innecesaria. Un uso muy común para un mecanismo de transferencia es mover objetos desde el intake del robot hacia un mecanismo de puntuación. En este caso, puede tener sentido combinar el sistema de transferencia con el sistema de intake o el sistema de puntuación, de manera que solo se necesiten dos mecanismos.
fr_ca: Un autre élément important à prendre en compte lors de la conception d'un transfert est l'endroit d'où et vers lequel les objets seront déplacés. Le déplacement d'objets sur plusieurs axes est difficile et source d'erreurs. Lorsque les mécanismes sont alignés, les transferts ne doivent agir qu'en ligne droite, ce qui évite toute complexité inutile. Une utilisation très courante d'un mécanisme de transfert consiste à déplacer des objets de l'entrée du robot vers un mécanisme permettant de marquer des points. Dans ce cas, il peut être judicieux de combiner le système de transfert avec le système d'admission ou le système qui permet de marquer, de sorte que seuls deux mécanismes sont nécessaires.
zh_cn: 在设计传输时，另一个重要的考虑因素是传输将从何处以及向何处传输物品。在多个轴上移动物品既困难又容易出错。当结构对齐时，传输装置只需直线移动，避免了不必要的复杂性。传输结构的一个非常常见的用途是将物体从机器人的拾取系统移至一个计分结构。在这种情况下，将传输系统与吸入拾取系统或计分系统结合在一起是非常合理的，因此只需要两个结构。

source: Generally, when designing transfers, you want to avoid as much mechanical complexity as possible. The less moving parts in a mechanism, the lower the chance something can fail.
es_mx: Generalmente, al diseñar transferencias, quieres evitar la mayor complejidad mecánica posible. Cuantas menos piezas móviles en un mecanismo, menor es la probabilidad de que algo falle.
fr_ca: En règle générale, lors de la conception de transferts, il convient d'éviter autant que possible la complexité mécanique. Moins il y a de pièces mobiles dans un mécanisme, moins il y a de risques de défaillance.
zh_cn: 一般来说，在设计传输装置时，要尽可能避免结构的复杂性。结构中的活动部件越少，出现故障的几率就越低。

source: Transfer Type Considerations
es_mx: Consideraciones sobre el tipo de transferencia
fr_ca: Considérations relatives au type de transfert
zh_cn: 传输类型考虑因素

source: There are several different types of transfers, ranging from linear to rotational transfers, and different ways of actually moving objects inside the transfer mechanism. When designing a transfer, a design that has lower mechanical complexity will be prone to less mechanical failures. See :doc:`transfer-types` for examples of common transfer types.
es_mx: Existen varios tipos diferentes de transferencias, que van desde transferencias lineales hasta transferencias rotacionales, y diferentes formas de mover objetos dentro del mecanismo de transferencia. Al diseñar una transferencia, un diseño con menor complejidad mecánica será propenso a menos fallas mecánicas. Ver :doc:`tipo-de-transferencia` para ejemplos de tipos comunes de transferencias.
fr_ca: Il existe plusieurs types de transferts, allant des transferts linéaires aux transferts rotatifs, et différentes manières de déplacer les objets à l'intérieur du mécanisme de transfert. Lors de la conception d'un transfert, une conception moins complexe sur le plan mécanique sera moins sujette aux défaillances mécaniques. Voir :doc:`transfer-types` pour des exemples de types de transferts courants.
zh_cn: 有几种不同类型的传输装置，从线性传输装置到旋转传输装置，以及在传输装置内实际移动物体的不同方式。在设计传输装置时，结构复杂度较低的设计会减少结构故障。请参阅 : doc:`transfer-types` 获取常见传输类型的示例。
