Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/transfers/transfer-types.po
Languages: es_mx, fr_ca, zh_cn

source: Hybrid conveyors use rollers with continuous objects such as belts and rubber bands between them. This solves the contact issues of roller conveyors while also having more grip then purely continuous conveyors. However, these conveyors have to be designed to allow both the roller and continuous materials to make contact with the item.
es_mx: Las transportadores híbridos utilizan rodillos con objetos continuos como cintas y bandas de goma entre ellos. Esto resuelve los problemas de contacto de las transportadores de rodillos, al mismo tiempo que proporciona un mayor agarre que las transportadoeas puramente continuos. Sin embargo, estos transportadores deben diseñarse para permitir que tanto el rodillo como los materiales continuos hagan contacto con el artículo.
fr_ca: Les convoyeurs hybrides utilisent des rouleaux entre lesquels sont intercalés des objets continus tels que des courroies et des bandes de caoutchouc. Cela permet de résoudre les problèmes de contact des convoyeurs à rouleaux tout en offrant une meilleure adhérence que les convoyeurs purement continus. Toutefois, ces convoyeurs doivent être conçus de manière à permettre aux rouleaux et aux matériaux continus d'entrer en contact avec l'article.
zh_cn: 混合式输送机在辊筒与皮带和橡胶带等连续物体之间使用辊筒。这解决了辊筒输送机的接触问题，同时也比纯连续输送机有更大的抓地力。不过，这些输送机的设计必须使辊筒和连续材料都能与物品接触。
