Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/common-mechanisms/transfers/transfer-types.po
Languages: es_mx, fr_ca, zh_cn

source: Types of Transfers
es_mx: Tipos de Transferencias
fr_ca: Types de transferts
zh_cn: 传送结构类型

source: There are a lot of different styles and types of transfers, but most are a form of Direct Transfer, Flip Up Transfer, Grate Transfer, or Conveyor Transfer.
es_mx: Hay muchos estilos y tipos diferentes de transferencias, pero la mayoría son una forma de Transferencia Directa, Transferencia de Volteo, Transferencia de Rejilla o Transferencia de Transportador.
fr_ca: Il existe de nombreux styles et types de transferts, mais la plupart d'entre eux sont des transferts directs, des transferts par retournement, des transferts par grille ou des transferts par convoyeur.
zh_cn: 传送结构的样式和类型多种多样，但大多数都是直接传送、翻转传送、篦式传送或传送带传送的一种形式。

source: Direct Transfer
es_mx: Transferencia Directa
fr_ca: Transfert direct
zh_cn: 直接传送

source: The simplest form of transfer is a direct transfer. This is the term for when the mechanism that an item is being moved to is simply placed directly behind whatever is gathering the item. The most common form of this is putting an arm or bucket directly behind the intake to collect the item as soon as it enters the intake. Since there is no mechanism between the intake and the outtake system, this is also referred to as a "transferless" system.
es_mx: La forma más simple de transferencia es una transferencia directa. Este es el término para cuando el mecanismo al que se está moviendo un objeto se coloca directamente detrás de lo que está recogiendo el objeto. La forma más común de esto es poner un brazo o una canasta directamente detrás del intake para recoger el objeto tan pronto como entra en el intake. Dado que no hay mecanismo entre el intake y el sistema del outtake, esto también se conoce como un sistema "sin transferencia".
fr_ca: La forme la plus simple de transfert est le transfert direct. Ce terme désigne le fait que le mécanisme vers lequel un objet est déplacé est simplement placé directement derrière ce qui recueille l'objet. La forme la plus courante consiste à placer un bras ou un seau directement derrière le ramasseur pour collecter l'objet dès qu'il entre dans le ramasseur. Étant donné qu'il n'y a pas de mécanisme entre le ramsseur et le système d'évacuation, on parle également de système "sans transfert".
zh_cn: 最简单的传送方式是直接传送。这是指将物品移动到的装置直接放置在收集物品的装置后面。最常见的形式是将一个机械臂或桶直接放在入口后面，以便在物品进入入口后立即将其收集起来。由于在入口和出口系统之间没有任何机构，这种系统也被称为 "无传送结构 "系统。

source: Advantages
es_mx: Ventajas
fr_ca: Avantages
zh_cn: 优势

source: Least mechanical complexity of any transfer system
es_mx: La menor complejidad mecánica de cualquier sistema de transferencia
fr_ca: La complexité mécanique la plus faible de tous les systèmes de transfert
zh_cn: 在所有传送系统中，机械复杂程度最低

source: Doesn't take up much space
es_mx: No ocupa mucho espacio.
fr_ca: Peu encombrant
zh_cn: 不占空间

source: Fastest transfer system
es_mx: Sistema de transferencia más rápido
fr_ca: Système de transfert le plus rapide
zh_cn: 最快的传输系统

source: Disadvantages
es_mx: Desventajas
fr_ca: Inconvénients
zh_cn: 劣势

source: Doesn't actually move the item internally
es_mx: No mueve realmente el elemento internamente.
fr_ca: Ne déplace pas réellement l'objet en interne
zh_cn: 实际上不会在内部移动物品

source: Requires the scoring mechanism to be able to go both behind the intake as well as into whatever position is needed for scoring
es_mx: Requiere que el mecanismo de puntuación pueda ir tanto detrás del intake como en cualquier posición necesaria para anotar puntos.
fr_ca: Le mécanisme de marquage doit pouvoir être placé à la fois derrière le ramasseur et dans n'importe quelle position nécessaire pour le marquage.
zh_cn: 要求得分装置既安装在物品入口后面，也安装在得分所需的位置上

source: A picture of a direct transfer intake from FTC\ |reg| 16461, where the collection bucket is behind the intake
es_mx: Una imagen de un intake de transferencia directa de FTC\ |reg| 16461, donde la canasta de recolección está detrás del intake
fr_ca: Photo d'une prise d'un ramasseur direct de FTC\ |reg| 16461, où le seau de collecte se trouve derrière le ramasseur.
zh_cn: 来自 FTC\ |reg| 16461 的直接传送进气口图片，其中收集装置位于吸入装置后面

source: 16461 Infinite Turtles, Freight Frenzy, Direct transfer intake, where the collection bucket is right behind the intake
es_mx: 16461 Infinite Turtles, Freight Frenzy, Intake de transferencia directa, donde la canasta de recolección está justo detrás del intake
fr_ca: 16461 Infinite Turtles, Freight Frenzy, ramasseur direct, où le seau de collecte se trouve juste derrière le ramasseur.
zh_cn: 16461 Infinite Turtles，在Freight Frenzy比赛中涉及的直接传送吸入装置，收集装置就在吸入装置后面

source: Flip Up Transfer
es_mx: Transferencia de Volteo
fr_ca: Transfert Flip Up
zh_cn: 翻转式传送装置

source: Flip up transfers are a form of transfer where the mechanism holding the item is rotated around a pivot point to align with a second mechanism that then collects the item. This mechanism is very commonly used on intakes to gain vertical height as well as some horizontal distance. In this use case, the intake can simply be mounted onto the transfer system, then spun in reverse to eject the item from the transfer mechanism into the scoring mechanism.
es_mx: Las transferencias de volteo son una forma de transferencia en la que el mecanismo que sostiene el artículo se gira alrededor de un punto de pivote para alinearse con un segundo mecanismo que luego recoge el artículo. Este mecanismo se utiliza muy comúnmente en los intakes para ganar altura vertical, así como cierta distancia horizontal. En este caso de uso, el intake simplemente se puede montar en el sistema de transferencia, luego girar en sentido contrario para expulsar el artículo del mecanismo de transferencia hacia el mecanismo de puntuación.
fr_ca: Les transferts par retournement sont une forme de transfert où le mécanisme qui tient l'objet est tourné autour d'un point de pivot pour s'aligner sur un second mécanisme qui recueille alors l'objet. Ce mécanisme est très souvent utilisé sur les ramasseurs pour gagner en hauteur et en distance horizontale. Dans ce cas d'utilisation, le ramasseur peut simplement être monté sur le système de transfert, puis tourner en sens inverse pour éjecter l'objet du mécanisme de transfert dans le mécanisme de marquage de point.
zh_cn: 翻转式传送是一种传送方式，它将承载物品的装置围绕一个支点旋转，与第二个装置对齐，然后将物品收集起来。这种装置通常用于入口，以增加垂直高度和水平距离。在这种使用情况下，可以简单地将吸入装置安装到传送系统上，然后反向旋转，将物品从传送装置中弹出，进入得分装置。

source: Intake can be run co-axially to the flip up system so the motor doesn't have to be moved with the mechanism
es_mx: El intake puede trabajar coaxialmente al sistema de volteo para que el motor no tenga que moverse con el mecanismo.
fr_ca: Le ramasseur peut être placé dans le même axe que le système de basculement, de sorte que le moteur n'a pas à être déplacé avec le mécanisme.
zh_cn: 吸入装置可与翻转系统同轴运行，这样电机就不必随机械装置一起移动

source: Allows intake to stick outside of the robot and start rotated up to fit inside the 18 inch sizing cube, enabling more flexibility
es_mx: Permite que el intake se mantenga fuera del robot y comience girado hacia arriba para ajustarse dentro del cubo de dimensiones de 18 pulgadas, lo que permite una mayor flexibilidad.
fr_ca: Permet au ramasseur de rester à l'extérieur du robot et de commencer à tourner vers le haut pour s'adapter au cube de taille de 18 pouces, ce qui permet une plus grande flexibilité.
zh_cn: 允许吸入口伸出机器人外部，并开始旋转以适应 18 英寸的尺寸限制立方体，从而实现更大的灵活性

source: Limited in horizontal and vertical movement
es_mx: Limitado en movimiento horizontal y vertical.
fr_ca: Limitation des mouvements horizontaux et verticaux
zh_cn: 水平和垂直移动受限

source: Care must be taken that mechanisms align properly to each other
es_mx: Debe tenerse cuidado de que los mecanismos se alineen correctamente entre sí.
fr_ca: Il faut veiller à ce que les mécanismes s'alignent correctement les uns par rapport aux autres.
zh_cn: 必须注意各机构之间的正确对齐

source: Slower form of transfer then grate or direct
es_mx: Forma más lenta de transferencia que la rejilla o directa
fr_ca: Forme de transfert plus lente que la grille ou le transfert direct
zh_cn: 传送速度比栅格式传送或直接传送慢

source: Mechanism can be hit by other robots when outside the robot frame
es_mx: El mecanismo puede ser golpeado por otros robots cuando está fuera del marco del robot.
fr_ca: Le mécanisme peut être heurté par d'autres robots lorsqu'il se trouve à l'extérieur du cadre du robot.
zh_cn: 在机器人框架外，机械装置可能会被其他机器人击中

source: 6165 extending and flip up intake
es_mx: 6165 intake de extensión y volteo
fr_ca: 6165 ramasseur extensible et rabattable
zh_cn: 6165 队伍设计的扩展和翻转式进气口

source: 6165 MSET Cuttlefish, Freight Frenzy, Flip up intake, mounted on linear slides for increased horizontal reach
es_mx: 6165 MSET Cuttlefish, Freight Frenzy, Intake de volteo, montado en deslizadores lineales para aumentar el alcance horizontal.
fr_ca: 6165 MSET Cuttlefish, Freight Frenzy, ramasseur monté sur glissières linéaires pour une plus grande portée horizontale
zh_cn: 6165 MSET Cuttlefish, 于Freight Frenzy比赛中设计的翻转式进气口，安装在线性滑轨上，增加了水平伸展范围

source: 7236 flip up intake
es_mx: 7236 intake de volteo
fr_ca: 7236 ramasseur flip up
zh_cn: 7236 队伍的翻转式吸入装置

source: 7236 Recharged Green, Rover Ruckus, Flip up intake
es_mx: 7236 Recharged Green, Rover Ruckus, Intake de volteo
fr_ca: 7236 Recharged Green, Rover Ruckus, ramasseur flip up
zh_cn: 7236 Recharged Green, Rover Ruckus, 翻转式吸入装置

source: Grate Transfer
es_mx: Transferencia de Rejilla
fr_ca: Transfert par grille
zh_cn: 栅格式传送

source: Grate transfer is a form of transfer where two sets of "forks" are used on both the transfer mechanism and the scoring mechanism, offset from each other. This means the forks can pass by each other without intersecting, allowing an item to seamlessly go from being supported by one set of forks to the other. This provides really fast transfer times, but also limits how the transfer can operate. Generally, this type of transfer is used with two sets of linear slides at an angle to each other, most commonly with one at a horizontal and one more vertical.
es_mx: La transferencia de rejilla es una forma de transferencia en la que se utilizan dos conjuntos de "tenedores" tanto en el mecanismo de transferencia como en el mecanismo de puntuación, desplazados entre sí. Esto significa que los tenedores pueden pasar uno junto al otro sin intersectarse, permitiendo que un objeto pase sin problemas de ser soportado por un conjunto de tenedores al otro. Esto proporciona tiempos de transferencia realmente rápidos, pero también limita cómo puede operar la transferencia. Por lo general, este tipo de transferencia se utiliza con dos conjuntos de deslizadores lineales en un ángulo entre sí, más comúnmente con uno en posición horizontal y otro más vertical.
fr_ca: Le transfert par grille est une forme de transfert dans laquelle deux jeux de "fourches" sont utilisés à la fois sur le mécanisme de transfert et sur le mécanisme de pointage, décalés l'un par rapport à l'autre. Cela signifie que les fourches peuvent passer l'une à côté de l'autre sans se croiser, ce qui permet à un article de passer sans heurt d'un jeu de fourches à l'autre. Cela permet d'obtenir des temps de transfert très rapides, mais limite également la manière dont le transfert peut fonctionner. En général, ce type de transfert est utilisé avec deux séries de glissières linéaires inclinées l'une par rapport à l'autre, le plus souvent l'une à l'horizontale et l'autre à la verticale.
zh_cn: 栅格式传送是一种传送方式，在传送机构和得分机构上使用两组 "叉子"，相互偏移。这意味着叉子可以相互通过而不相交，从而使物品可以从一组叉子的支撑无缝转到另一组叉子的支撑。这提供了非常快的传送时间，但也限制了传送的操作方式。一般来说，这种传送方式使用两组互成角度的线性滑轨，最常见的是一组水平，一组垂直。

source: Low mechanical complexity
es_mx: Baja complejidad mecánica
fr_ca: Faible complexité mécanique
zh_cn: 机械复杂性低

source: Second fastest transfer system (instantaneous)
es_mx: Segundo sistema de transferencia más rápido (instantáneo)
fr_ca: Deuxième système de transfert le plus rapide (instantané)
zh_cn: 第二快传输系统（瞬时）

source: Integrates well with linear mechanism (such as extending intakes and outtakes)
es_mx: Se integra bien con mecanismos lineales (como intakes y outtakes de extensión)
fr_ca: S'intègre bien au mécanisme linéaire (comme l'extension des ramasseurs et des mécanismes de sorties de pièces de jeu)
zh_cn: 与线性机构（如扩展吸入口和发射口）完美结合

source: More complex design, careful alignment needed to prevent the "forks" from colliding
es_mx: Diseño más complejo, se necesita una alineación cuidadosa para evitar que los "tenedores" colisionen.
fr_ca: Conception plus complexe, alignement minutieux nécessaire pour éviter que les "fourches" ne se heurtent.
zh_cn: 设计更加复杂，需要仔细校准以防止 "叉 "相撞

source: Doesn't integrate easily with rotational mechanisms
es_mx: No se integra fácilmente con mecanismos de rotación.
fr_ca: Ne s'intègre pas facilement aux mécanismes de rotation
zh_cn: 不易与旋转装置整合

source: Limiting in range of motion, mechanisms have to move in specific orders for the transfer to work correctly
es_mx: Limitado en el rango de movimiento, los mecanismos tienen que moverse en órdenes específicos para que la transferencia funcione correctamente.
fr_ca: Limitation de l'amplitude de mouvement, les mécanismes doivent être déplacés dans des ordres spécifiques pour que le transfert fonctionne correctement.
zh_cn: 运动范围受限，各机构必须按特定顺序运动，才能正常工作

source: Animated Grate Transfer Example (Click To Expand)
es_mx: Ejemplo de Transferencia de Rejilla Animada (Haz clic para expandir)
fr_ca: Exemple animé de transfert de grille (Cliquer pour agrandir)
zh_cn: 栅格式传送动画示例（点击展开）

source: 6929 grate transfer deposit, where the forks are visible
es_mx: 6929 depósito de transferencia de rejilla, donde los tenedores son visibles
fr_ca: 6929 dépôt de transfert de grilles, où les fourches sont visibles
zh_cn: 6929 栅格式传送，叉子清晰可见

source: 6929 Data Force, Rover Ruckus, Grate transfer deposit. Forks are visible on the bottom, which go between forks on the intake bucket.
es_mx: 6929 Data Force, Rover Ruckus, Depósito de transferencia de rejilla. Los tenedores son visibles en la parte inferior, los cuales van entre los tenedores de la canasta del intake.
fr_ca: 6929 Data Force, Rover Ruckus, dépôt de transfert de grille. Des fourches sont visibles sur le fond, qui passent entre les fourches du godet de prise d'eau.
zh_cn: 6929 Data Force，于Rover Ruckus比赛中设计的栅格式传送。底部可见叉子，叉子位于吸入装置的叉子之间。

source: Conveyor Transfers
es_mx: Transferencia de transportador
fr_ca: Transferts par convoyeur
zh_cn: 传送带传送

source: Conveyor transfer is a catch all term for transfer system that uses components to linearly move objects internally. Conveyors can use rollers, belts, surgical tubing, rubber bands, and other materials to move the items. These materials then form conveyors that seamlessly move the object linearly from one mechanism to another. Conveyors are generally either roller conveyors, where a series of rollers move parts, or continuous conveyors, where a continuous object moves the items. In addition, a hybrid conveyor can be used which is made up of both rollers and continuous objects in between.
es_mx: La transferencia de transportador es un término general para un sistema de transferencia que utiliza componentes para mover objetos linealmente internamente. Los transportadores pueden utilizar rodillos, correas, tubos quirúrgicos, bandas de goma y otros materiales para mover los artículos. Estos materiales luego forman transportadores que mueven sin problemas el objeto linealmente de un mecanismo a otro. Los transportadores son generalmente transportadores de rodillos, donde una serie de rodillos mueven las piezas, o transportadores continuos, donde un objeto continuo mueve los artículos. Además, se puede utilizar un transportador híbrido que está compuesto tanto por rodillos como por objetos continuos en el medio.
fr_ca: Le transfert par convoyeur est un terme générique désignant un système de transfert qui utilise des composants pour déplacer linéairement des objets en interne. Les convoyeurs peuvent utiliser des rouleaux, des courroies, des tubes chirurgicaux, des élastiques et d'autres matériaux pour déplacer les objets. Ces matériaux forment ensuite des convoyeurs qui déplacent linéairement l'objet d'un mécanisme à l'autre. Les convoyeurs sont généralement soit des convoyeurs à rouleaux, où une série de rouleaux déplace les pièces, soit des convoyeurs continus, où un objet continu déplace les pièces. Il est également possible d'utiliser un convoyeur hybride, composé à la fois de rouleaux et d'objets continus.
zh_cn: 传送带传送是传送带系统的总称，它使用组件在内部线性移动物体。输送机可以使用辊子、皮带、导管、橡皮筋和其他材料来移动物品。然后，这些材料组成传送带，将物体从一个装置无缝地线性移动到另一个装置。输送机一般都是辊子输送机，由一系列辊子移动部件或连续输送机，由一个连续的物体移动物品。此外，还可以使用混合式输送机，这种输送机由辊子和介于两者之间的连续物体组成。

source: Can create "buffers" where multiple items can be stored
es_mx: Puede crear "topes" donde se pueden almacenar varios elementos
fr_ca: Possibilité de créer des "tampons" où plusieurs éléments peuvent être stockés
zh_cn: 可创建可存储多个项目的 "缓冲区

source: Items can be moved across complex paths internally
es_mx: Los elementos pueden ser movidos a través de rutas complejas internamente.
fr_ca: Les objets peuvent être déplacés sur des chemins complexes en interne
zh_cn: 物品可在内部复杂路径上移动

source: Items can be continuously transferred instead of having discrete back and forth motions
es_mx: Los elementos pueden ser transferidos de manera continua en lugar de tener movimientos discretos de ida y vuelta.
fr_ca: Les articles peuvent être transférés en continu au lieu d'être soumis à des mouvements de va-et-vient discrets.
zh_cn: 物品可以连续传输，而不是不连续的来回移动

source: Items can jam on the entrance and exit of the conveyor, especially when multiple elements are entering at once.
es_mx: Los elementos pueden atascarse en la entrada y salida del transportador, especialmente cuando varios elementos ingresan al mismo tiempo.
fr_ca: Les articles peuvent se bloquer à l'entrée et à la sortie du convoyeur, en particulier lorsque plusieurs éléments entrent en même temps.
zh_cn: 物品可能会堵塞在传送带的入口和出口处，尤其是当多个物品同时进入时。

source: Significant mechanical complexity
es_mx: Complejidad mecánica significativa
fr_ca: Complexité mécanique importante
zh_cn: 相当复杂的机械结构

source: There are different types of conveyors that can be used.
es_mx: Existen diferentes tipos de transportadores que se pueden utilizar.
fr_ca: Il existe différents types de convoyeurs.
zh_cn: 可以使用不同类型的传送带。

source: Roller Conveyor
es_mx: Transportador de rodillos
fr_ca: Convoyeur à rouleaux
zh_cn: 辊子输送机

source: Roller conveyors use a series of rollers or wheels to move objects from the beginning of the conveyor to the end. These transfers allow for the use of compliant wheel for different or odd shaped items, but care must be taken that objects don't get stuck in between rollers. In addition, wheels tend to have better grip then many forms of continuous conveyors. Surgical tubing can also be used instead of rollers.
es_mx: Las transportadoras de rodillos utilizan una serie de rodillos o ruedas para mover objetos desde el principio del transportador hasta el final. Estas transferencias permiten el uso de ruedas compatibles para objetos de formas diferentes o extrañas, pero se debe tener cuidado de que los objetos no se queden atascados entre los rodillos. Además, las ruedas tienden a tener un mejor agarre que muchas formas de transportadoras continuas. También se puede utilizar tubos quirúrgicos en lugar de rodillos.
fr_ca: Les convoyeurs à rouleaux utilisent une série de rouleaux ou de roues pour déplacer les objets du début à la fin du convoyeur. Ces transferts permettent d'utiliser des roues conformes pour des objets de formes différentes ou bizarres, mais il faut veiller à ce que les objets ne restent pas coincés entre les rouleaux. En outre, les roues ont tendance à avoir une meilleure adhérence que de nombreuses formes de convoyeurs continus. Des tubes chirurgicaux peuvent également être utilisés à la place des rouleaux.
zh_cn: 辊筒式输送机使用一系列辊筒或滚轮将物品从输送机的起点运送到终点。这些传送装置允许使用符合要求的轮子来传送不同或奇形怪状的物品，但必须注意不要让物品卡在辊筒之间。此外，滚轮往往比许多形式的连续输送机具有更好的抓地力。也可以使用手术管道代替滚轮。

source: 7244 Roller Conveyor intake, where a series of omni wheels moves a game element vertical
es_mx: 7244 Intake de transportador de rodillos, donde una serie de ruedas omni mueve un elemento del juego verticalmente.
fr_ca: 7244 Ramasseur avec convoyeur à rouleaux, où une série de roues omnidirectionnelles déplace un élément de jeu verticalement.

source: 7244 OUT of the BOX Robotics, Ultimate Goal, Roller conveyor transfer intake, where a series of omni wheels moves the game element rings at a high vertical angle
es_mx: 7244 OUT of the BOX Robotics, Ultimate Goal, Intake de transferencia de transportador de rodillos, donde una serie de ruedas omni mueve los anillos de elementos del juego en un ángulo vertical alto
fr_ca: 7244 OUT of the BOX Robotics, Ultimate Goal, prise de transfert par convoyeur à rouleaux, où une série de roues omnidirectionnelles déplace les anneaux de l'élément de jeu à un angle vertical élevé.
zh_cn: 7244 OUT of the BOX Robotics，Ultimate Goal，辊筒输送机传送进料口，其中一系列全方位轮子以较高的垂直角度移动游戏元素环

source: Continuous Conveyor
es_mx: Transportador continuo
fr_ca: Convoyeur continu
zh_cn: 连续输送机

source: A continuous conveyor uses a continuous object, such as belts, surgical tubing, or rubber bands to move objects. These transfers generally have less compliance than roller intakes, but also continuously contact the object being moved. This can lead to fewer jamming problems. However, the common objects used, such as belts and rubber bands, don't have much grip, so they may slip when transferring objects.
es_mx: Un transportador continuo utiliza un objeto continuo, como cintas, tubos quirúrgicos o bandas de goma, para mover objetos. Estas transferencias generalmente tienen menos flexibilidad que las entradas de rodillos, pero también entran en contacto continuo con el objeto que se está moviendo. Esto puede llevar a menos problemas de atasco. Sin embargo, los objetos comúnmente utilizados, como cintas y bandas de goma, no tienen mucho agarre, por lo que pueden resbalar al transferir objetos.
fr_ca: Un convoyeur continu utilise un objet continu, tel que des courroies, des tubes chirurgicaux ou des bandes en caoutchouc, pour déplacer des objets. Ces transferts ont généralement moins de conformité que les entrées à rouleaux, mais ils sont en contact permanent avec l'objet déplacé. Cela peut entraîner moins de problèmes de blocage. Cependant, les objets couramment utilisés, tels que les courroies et les élastiques, n'ont pas beaucoup d'adhérence et peuvent donc glisser lors du transfert des objets.
zh_cn: 连续输送机使用皮带、导管或橡皮筋等连续物体来移动物体。与辊子进料口相比，这些传送装置的顺从性通常较低，但也能持续接触被传送的物体。这就减少了堵塞问题。不过，皮带和橡皮筋等常用物体的抓地力不强，因此在传送物体时可能会打滑。

source: 8644 Conveyor that uses o-ring belts to move rings internally
es_mx: 8644 Transportador que utiliza correas en forma de anillo para mover anillos internamente
fr_ca: 8644 Convoyeur utilisant des courroies à joints toriques pour déplacer les anneaux en interne
zh_cn: 8644 使用 O 形环传送带在内部移动环的传送带

source: 8644 Brainstormers, Ultimate Goal, Conveyors which moves rings using o-ring belts internally
es_mx: 8644 Brainstormers, Ultimate Goal, Transportador que mueve internamente anillos utilizando correas en forma de o
fr_ca: 8644 Brainstormers, Ultimate Goal, Convoyeurs qui déplacent des anneaux en utilisant des courroies à joints toriques en interne
zh_cn: 8644 Brainstormers，Ultimate Goal，利用内部 O 形环传送带移动环的传送带

source: 11115 Ball transfer using rubber bands
es_mx: 11115 Transferencia de bola usando ligas de hule
fr_ca: 11115 Transfert de balles à l'aide d'élastiques
zh_cn: 11115 使用橡皮筋转移球

source: 11115 Gluten Free, Ball transfer using rubber bands
es_mx: 11115 Gluten Free, Transferencia de bola usando ligas de hule
fr_ca: 11115 Gluten Free, Transfert de balles à l'aide d'élastiques
zh_cn: 11115 Gluten Free，使用橡皮筋转球

source: Hybrid Conveyor
es_mx: Transportador híbrido
fr_ca: Convoyeur hybride
zh_cn: 混合输送机
