Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/know-your-lingo.po
Languages: es_mx, fr_ca, ja_jp, ru_ru

source: Know Your Lingo
es_mx: Conoce tu jerga
fr_ca: Connaître votre vocabulaire
ja_jp: 専門用語を知る
ru_ru: Знайте ваш язык!

source: Many teams may be unfamiliar with the various terms and slang that are often thrown around at competitions and meets. Here we have compiled a guide of some commonly used terms to get you up to speed.
es_mx: Muchos equipos pueden no estar familiarizados con los diversos términos y jerga que a menudo se utilizan en competencias y encuentros. Aquí hemos compilado una guía de algunos términos comúnmente utilizados para ponerte al día.
fr_ca: De nombreuses équipes peuvent ne pas être familières avec les différents termes et expressions utilisés fréquemment lors des compétitions et des rencontres hors saison. Voici un guide que nous avons compilé avec certains termes couramment utilisés pour vous aider à vous familiariser.
ja_jp: 多くのチームは、FTCや大会で頻繁に飛び交うさまざまな用語やスラングに馴染みがないかもしれません。 ここでは、よく使用される用語のガイドをまとめました。
ru_ru: Многие команды могут быть незнакомы с различными терминами и сленгом, которые часто используются на соревнованиях и встречах. Мы составили справочник некоторых часто используемых терминов, чтобы ввести вас в курс дела.

source: Competitions
es_mx: Competencias
fr_ca: Compétitions
ja_jp: Competitions (競技会)
ru_ru: Соревнования

source: Program Delivery Partner (PDP)
es_mx: Socio de Entrega del Programa (SEP o PDP)
fr_ca: Partenaire d'exécution du programme (PDP)
ja_jp: Program Delivery Partner (PDP・プログラムデリバリーパートナー)
ru_ru: Партнер по реализации программы (PDP)

source: Director or directors for events and activities in a region. Used to be referred to as the Affiliate Partner (AP).
es_mx: Director o directores para eventos y actividades en una región. Solían ser referidos como el Socio Afiliado (SA o AP).
fr_ca: Directeur ou directeurs d'événements et d'activités dans une région. On l'appelait auparavant le partenaire affilié (PA).
ja_jp: 地域のイベント・大会や活動のディレクターまたはディレクター。以前はアフィリエイトパートナー (AP) と呼ばれていました。(地域の大会を開催している各地域の非営利団体などを指します)
ru_ru: Директор или директора по проведению мероприятий в регионе. Раньше его называли реферальным партнером (AP).

source: Qualifier
es_mx: Clasificatorias
fr_ca: Qualification
ja_jp: Qualifier (予選)
ru_ru: Отборочный турнир

source: Tournament with 5-6 qualifying matches and best-of-three alliance elimination matches. Judging included. Will advance to States/Regional level.
es_mx: Torneo con 5-6 partidos de clasificación y partidos de eliminación de alianzas al mejor de tres. Incluye evaluación. Avanzará al nivel Estatal/Regional.
fr_ca: Tournoi avec 5-6 matchs de qualification et des matchs d'élimination par alliance en ''best-of-three''. Les rencontres avec les juges sont inclus. Les équipes se qualifieront pour le niveau régional/étatique.
ja_jp: 5 ～ 6 試合の予選試合と 3 試合先取の同盟を組んで行う試合で構成されるトーナメント。各種賞の審査も含めて。 次は、州 / 地域レベルに進みます。
ru_ru: Турнир, состоящий из 5-6 отборочных матчей и трех матчей лучших на выбывание. Собеседования включены. Дает продвижение на уровень штата/региона.

source: League Meet
es_mx: Encuentro de Liga
fr_ca: Rencontre de ligue
ja_jp: League Meet (リーグ戦)
ru_ru: Встреча Лиги

source: Low-stress competition with matches counting towards league rank at a League Tournament. No judging.
es_mx: Competencia de bajo estrés con partidos que cuentan para la clasificación de la liga en un Torneo de la Liga. Sin ser juzgado, es decir sin evaluación.
fr_ca: Compétition peu stressante avec des matchs comptant pour le classement de la ligue lors d'un tournoi de ligue. Pas de jugement.
ja_jp: リーグ戦でリーグランクにカウントされる試合もあり、ストレスの少ない大会です。賞などの審査はありません。
ru_ru: Соревнование с низким уровнем стресса, матчи которого засчитываются в зачет рейтинга лиги на турнире лиги. Собеседований нет.

source: League Tournament
es_mx: Torneo de la Liga
fr_ca: Tournoi de la Ligue
ja_jp: League Tournament (リーグトーナメント)
ru_ru: Турнир лиги

source: Tournament with ranked matches and alliance elimination matches for teams participating in that League. Judging included. Will advance to States/Regional level. Sometimes called a "League Championship".
es_mx: Torneo con partidos de clasificación y partidos de eliminación por alianza para los equipos que participan en esa Liga. Incluye evaluación. Avanzará al nivel Estatal/Regional. A veces se le llama "Campeonato de Liga".
fr_ca: Tournoi avec des matchs classés et des matchs d'élimination par alliance pour les équipes participant à cette ligue. L'évaluation avec les juges est incluse. Les équipes se qualifient pour le niveau national/régional. Parfois appelé "Championnat de ligue".
ja_jp: そのリーグに参加しているチームのランクマッチとAlliance同士によるトーナメント。 賞などの審査も含めて。 州/地域レベルに進みます。 「リーグチャンピオンシップ」と呼ばれることもあります。
ru_ru: Турнир с рейтинговыми матчами и матчами на выбывание для команд, участвующих в данной лиге. Собеседования включены. Продвижение на уровень штата/региона. Иногда называется "чемпионатом лиги".

source: Group of two or, in eliminations, two or three teams that compete. In elimination matches each team must play at least once.
es_mx: Grupo de dos o, en eliminaciones, dos o tres equipos que compiten. En los partidos de eliminación, cada equipo debe jugar al menos una vez.
fr_ca: Groupe de deux équipes ou, lors des éliminations, de deux ou trois équipes qui compétitionnent. Dans les matchs d’élimination, chaque équipe doit jouer au moins une fois.
ja_jp: 2チームのグループ、またはAlliance同士によるトーナメントでは2チームまたは3チームが対戦する。Alliance同士によるトーナメントでは、各チームが最低1回は試合をしなければならない。
ru_ru: Группа из двух или, в случае отборочных матчей, двух или трех команд, которые участвуют в соревнованиях. В матчах на выбывание каждая команда должна сыграть хотя бы один раз.

source: Ranking Points (RP)
es_mx: Puntos de Clasificación/Ranking Points (RP)
fr_ca: Points de classement (RP)
ja_jp: Ranking Points (RP・ランキングポイント)
ru_ru: Рейтинговые очки (ranking points - RP)

source: Primary basis in rankings at traditional events. For the Power Play season, each team receives 2 RP for winning a qualification match, 1 for tieing, and 0 for losing.
fr_ca: Base principale des classements lors des événements traditionnels. Pour la saison Power Play, chaque équipe reçoit 2 RP pour avoir gagné un match de qualification, 1 pour un match nul, et 0 pour une défaite.
ru_ru: Основной фактор для определения рейтинга в традиционных соревнованиях. В сезоне Power Play, к примеру, каждая команда получала 2 RP за победу в квалификационном матче, 1 - за ничью и 0 - за поражение.

source: TieBreaker Points (TBP)
es_mx: Puntos de desempate/Tie Breaker Points (TBP)
fr_ca: Points de départage (TBP)
ja_jp: TieBreaker Points (TBP・タイブレイカーポイント)

source: Secondary determinant in team rankings for traditional events, primary determinant for remote events. For the Power Play season, this is split up into two parts; TBP1 and TBP2. TBP1 is used before TBP2, and is the alliances/teams autonomous period score. TBP2 is the alliances/teams end game score. (Whether it is alliances/teams depends on if the team is at traditional events, respectively.)
es_mx: Determinante secundario en las clasificaciones de equipos para eventos tradicionales, determinante primario para eventos remotos. Para la temporada Power Play, esto se divide en dos partes; TBP1 y TBP2. TBP1 se utiliza antes de TBP2, y es la puntuación del período autónomo de las alianzas/equipos. TBP2 es la puntuación del juego final (endgame) de las alianzas/equipos. (Si se trata de alianzas/equipos depende de si el equipo está en eventos tradicionales, respectivamente.)
fr_ca: Déterminant secondaire dans le classement des équipes pour les événements traditionnels, déterminant principal pour les événements à distance. Pour la saison de jeu Power Play, il est divisé en deux parties : TBP1 et TBP2. Le TBP1 est utilisé avant le TBP2 et correspond au score de la période autonome des alliances/équipes. Le TBP2 est le score de fin de match des alliances/équipes. (Le fait qu'il s'agisse d'alliances ou d'équipes dépend de la participation de l'équipe à des événements traditionnels).
ja_jp: トラディショナルイベントではチームランキングの二次決定要因、リモートイベントでは一次決定要因になる。Power Playシーズンでは、TBP1とTBP2の2つに分かれる。TBP1はTBP2の前に使用され、Alliance / Teamの自律的な期間のスコアである。TBP2は、Alliance / Teamのエンドゲームスコアです。(Alliance / Team かどうかは、それぞれトラディショナルイベントに参加しているかどうかによる。)
ru_ru: Вторичный фактор, определяющий рейтинг команд на традиционных соревнованиях, основной - на дистанционных. В сезоне Power Play он был разделен на две части: TBP1 и TBP2. TBP1 считается важнее TBP2 и представляет собой счет альянса/команды за автономный период. TBP2 - это счет альянса/команды в конце игры. (Принадлежность к альянсам/командам зависит от того, участвует ли команда в традиционных соревнованиях, соответственно).

source: Qualification Match
es_mx: Partido de clasificación
fr_ca: Match de qualification
ru_ru: Квалификационный матч

source: Qualifying matches (generally 5) with random alliance partners and opponents will be played to determine team rankings.
es_mx: Los partidos de clasificación (generalmente 5) con compañeros de alianza y oponentes aleatorios se jugarán para determinar las clasificaciones del equipo.
fr_ca: Des matchs de qualification (généralement 5) avec des partenaires et des adversaires d’alliance tirés au sort seront joués pour déterminer les classements des équipes.
ja_jp: ランダムなAlliance partnerおよび対戦相手との予選試合 (通常5試合) を行い、チームの順位を決定します。
ru_ru: Для определения рейтинга команд будут сыграны отборочные матчи (обычно по 5 на каждую команду) со случайными партнерами по альянсу и соперниками.

source: Elimination Match
es_mx: Partido de Eliminación
fr_ca: Match d'élimination
ru_ru: Матч на выбывание

source: 2 alliances of 2 or 3 teams each compete in best of 3 matches to determine winning alliance. Also known as elim matches, or just elims.
es_mx: 2 alianzas de 2 o 3 equipos cada una compiten en el mejor de 3 partidos para determinar la alianza ganadora. También conocido como partidos de eliminación, o simplemente eliminatorias.
fr_ca: Deux alliances de 2 ou 3 équipes chacune s'affrontent dans des matchs en ''best-of-three'' pour déterminer l'alliance gagnante. Ces matchs sont également appelés matchs d'élimination, ou simplement "elims".
ja_jp: 2チームまたは3チームの2つのAllianceが3試合のベストを競い、優勝アライアンスを決定する。elim matches、または単にelimsとも呼ばれる。
ru_ru: Два альянса, состоящие из 2 или 3 команд, соревнуются в 2-3 матчей для определения альянса-победителя до двух побед.

source: Robot Components
es_mx: Componentes del Robot
fr_ca: Composantes du robot
ru_ru: Составляющие робота

source: DC Motor
es_mx: Motor de corriente directa/ DC Motor
fr_ca: Moteur à courant continu DC
ru_ru: Бесколлекторный мотор

source: Servo
fr_ca: Servomoteur
ru_ru: Сервопривод

source: Drivetrain (DT)
es_mx: Chasis/ Drivetrain (DT)
fr_ca: Châssis (DT)
ja_jp: Drivetrain (DT・ドライブベース)
ru_ru: Колесная база

source: Mechanism responsible for the movement of the robot.
es_mx: Mecanismo responsable del movimiento del robot.
fr_ca: Mécanisme responsable pour le mouvement du robot.
ja_jp: ロボットが動き回るための機構。
ru_ru: Механизм, отвечающий за движение робота.

source: Intake
fr_ca: Ramasseur
ru_ru: Активный захват

source: Mechanism responsible for picking up game elements from the field by using rotational motion.
es_mx: Mecanismo responsable de recoger elementos de juego del campo mediante el uso de movimiento rotacional.
fr_ca: Mécanisme chargé de ramasser les éléments de jeu sur le terrain en utilisant un mouvement de rotation.
ja_jp: 回転運動によってフィールドからゲームピースを回収する機構。
ru_ru: Механизм, отвечающий за захват игровых элементов с поля с помощью вращательного движения.

source: Claw
es_mx: Garra
fr_ca: Pince
ja_jp: Claw (爪)
ru_ru: Клешня

source: Mechanism responsible for picking up game elements by grasping.
es_mx: Mecanismo responsable de recoger elementos del juego mediante el agarre.
fr_ca: Mécanisme responsable de la prise des éléments de jeu en les saisissant.
ja_jp: ゲームピースをつかむように回収するための機構。

source: Linear Extension/Slide
es_mx: Extensión lineal/ Rieles
fr_ca: Extension linéaire/Glissière
ru_ru: Механизм линейного выдвижения/скольжения

source: Mechanism responsible for extending parts beyond the starting configuration of the robot in a linear fashion.
es_mx: Mecanismo responsable de extender partes más allá de la configuración inicial del robot de manera lineal.
fr_ca: Mécanisme responsable de l'extension de pièces au-delà de la configuration de départ du robot de manière linéaire.
ja_jp: ロボットのスタート時の構成(範囲・大きさ)を超えてパーツを直線的に拡張する機構。
ru_ru: Механизм, отвечающий за линейное выдвижение элементов за пределы начальной конфигурации робота.

source: Arm
es_mx: Brazo
fr_ca: Bras
ru_ru: Манипулятор

source: Mechanism responsible for extending the reach of the robot through rotational motion or multi-axis movement.
es_mx: Mecanismo responsable de extender el alcance del robot a través del movimiento rotacional o el movimiento de varios ejes.
fr_ca: Mécanisme responsable de l'extension de la portée du robot par mouvement rotatif ou mouvement à axes multiples.
ja_jp: 回転運動や多軸運動によって、ロボットの機構の到達範囲を広げる役割を担う機構。
ru_ru: Механизм, отвечающий за расширение зоны действия робота за счет вращательных или многоосевых движений.

source: REV Expansion Hub
fr_ca: Expansion Hub REV

source: Hardware controller for the robot, connected to :term:`Robot Controller` phone. Controls 4 motor and encoders, 6 servos, and various sensors via digital, analog, and I2C ports. Maximum of 2 hubs.
es_mx: Controlador de hardware para el robot, conectado al teléfono :term:`Controlador del Robot`. Controla 4 motores y codificadores/encoders, 6 servos y varios sensores a través de puertos digitales, analógicos y I2C. Máximo de 2 hubs.
fr_ca: Contrôleur matériel du robot, connecté au téléphone :term:`Robot Controller`. Contrôle 4 moteurs et encodeurs, 6 servos et divers capteurs via des ports numériques, analogiques et I2C. Maximum de 2 hubs.
ja_jp: ロボットのハードウェアコントローラで、:term:`Robot Controller` として使用しているAndroid スマートフォンに接続されています。デジタル、アナログ、I2Cポートを介して4つのモーターとエンコーダー、6つのサーボ、各種センサーを制御する。最大2台のハブを使用できます。
ru_ru: Электроника для управления роботом подключаемый к :term:`Robot Controller` . Управляет 4 моторами и энкодерами, 6 сервоприводами и различными датчиками через цифровые, аналоговые и I2C-порты. Максимум в роботе может быть 2 Expansion Hub.

source: REV Control Hub
fr_ca: Control Hub REV

source: Integrated Expansion Hub + :term:`Robot Controller` phone. It serves many of the same purposes as the Expansion Hub but eliminates the need for a :term:`Robot Controller` phone. 1 Expansion Hub may be used along side 1 Control Hub.
es_mx: Hub de Expansión Integrado + teléfono :term:`Controlador de Robot`. Sirve para muchos de los mismos propósitos que el Hub de Expansión, pero elimina la necesidad de un teléfono :term:`Controlador de Robot`. Se puede utilizar 1 Hub de Expansión junto con 1 Hub de Control.
fr_ca: Hub d'Expansion intégré + téléphone :term:`Robot Controller`. Il remplit les mêmes fonctions que le Hub d'Expansion, mais ne nécessite pas de téléphone :term:`Robot Controller`. 1 l'Expansion Hub peut être utilisé avec 1 Control Hub.
ja_jp: Integrated Expansion Hub + :term:`Robot Controller`として使用するAndroid スマートフォン。Expansion Hubと同じ役割を果たしますが、 :term:`Robot Controller`として使用するAndroid スマートフォンが不要になります。1つのExpansion Hubは1つのControl Hubと一緒に使用することができます。
ru_ru: Совмещение Expansion Hub и :term:`Robot Controller` . Он выполняет те же функции, что и Expansion Hub, но не требует использования Robot Controller. 1 Control Hub может использоваться вместе с только 1 Expansion Hub.

source: Driver Station (DS)
es_mx: Estación del conductor/ Driver Station (DS)
fr_ca: Station de pilotage (DS)

source: Android phone connected to the gamepad controller. Drivers interact with the DS phone to start/stop robot.
es_mx: Teléfono Android conectado al controlador del gamepad. Los controladores interactúan con el teléfono DS para iniciar/detener el robot.
fr_ca: Téléphone Android connecté à la manette de jeu. Les conducteurs interagissent avec le téléphone DS pour démarrer/arrêter le robot.
ja_jp: コントローラーを接続したAndroidスマートフォン。ドライバーはAndroidスマートフォンを使用して、ロボットを起動/停止させる。
ru_ru: Android-телефон подключенный к геймпаду. Операторы взаимодействуют с телефоном DS для запуска/остановки робота.

source: Robot Controller
es_mx: Controlador de Robot
fr_ca: Controleur de robot
ru_ru: Robot Controller (RC)

source: Android phone connected to the Expansion Hub. Connects to DS phone via WiFi-Direct.
es_mx: Teléfono Android conectado al Expansion Hub. Se conecta al teléfono DS a través de WiFi-Direct.
fr_ca: Téléphone Android connecté au Expansion Hub. Se connecte au téléphone DS via Wi-FiDirect.
ja_jp: Expansion Hubに接続されたAndroidスマートフォン。Driver Stationの役割をしているAndroidスマートフォンとWi-Fi Directで接続する。
ru_ru: Android-телефон, подключенный к Expansion Hub. Подключается к Driver Station через WiFi-Direct.

source: Gamepad Controller
es_mx: Controlador de Gamepad
fr_ca: Manette de jeu
ru_ru: Геймпад

source: An Xbox or PS4 style controller which the driver uses to control the robot during driver-control period. Maximum of 2.
es_mx: Un controlador de estilo Xbox o PS4 que el conductor utiliza para controlar el robot durante el período de control del conductor. Máximo de 2.
fr_ca: Une manette de type Xbox ou PS4 que le pilote utilise pour contrôler le robot pendant la période de contrôle par le conducteur. Maximum de 2.
ja_jp: XboxまたはPS4スタイルのコントローラーで、ドライバーがドライバーコントロール時間中にロボットを操縦するために使用します。最大2つ。
ru_ru: Геймпад Xbox или PS4, с помощью которого оператор управляет роботом в управляемом Периоде. Максимум 2 на 1 команду в матче.

source: Alliance
es_mx: Alianza
ja_jp: Alliance (同盟)
ru_ru: Альянс

source: Primary basis in rankings at traditional events. For the Power Play season, each team receives 2 RP for winning a qualification match, 1 for tying, and 0 for losing.
es_mx: Base principal en las clasificaciones de eventos tradicionales. Para la temporada Power Play, cada equipo recibe 2 RP por ganar un partido de clasificación, 1 por empatar y 0 por perder.

source: Open-loop :term:`RS-555 series <RS-550 Series Motor>` 12 volt motors used to power mechanisms. Max of 8.
es_mx: Open-loop :term:`RS-555 series <RS-550 Series Motor>` motores de 12 voltios utilizados para alimentar mecanismos. Máximo de 8.
ja_jp: オープンループ `RS-555 シリーズ<RS-550 Series Motor>`12 ボルト モーターは、機構に動力を供給するために使用されます。最大8個。
ru_ru: 12-вольтовые двигатели :term:`серии RS-555 <RS-550 Series Motor>` с открытым контуром, используемые для приведения в действие механизмов. Максимальное количество в роботе - 8.

source: Closed-loop :term:`servo-motors <Servo>` used for precise movement. Controlled by PWM signals. Max of 12.
es_mx: Closed-loop :term:`servo-motores <Servo>` usado para movimientos precisos. Controlado por señales PWM. Un máximo de 12.
ja_jp: 閉ループ`サーボモーター<Servo>`を使用して正確な動きを実現します。PWM信号によって制御されます。最大12個。
ru_ru: :term:`Серводвигатели <Servo>` с замкнутым контуром, используемые для точного перемещения. Управляются ШИМ-сигналами. Не более 12 штук.
