Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/start-here.po
Languages: es_mx, fr_ca, ja_jp, ro_ro, ru_ru, zh_cn

source: Start Here
es_mx: Comienza aquí
fr_ca: Commencer ici
ja_jp: ここから始める
ro_ro: Începe Aici
ru_ru: С чего Начать?
zh_cn: 从这里开始

source: Useful Resources
es_mx: Recursos útiles
fr_ca: Ressources utiles
ja_jp: 役に立つリソース
ro_ro: Resurse Folositoare
ru_ru: Полезные Ресурсы
zh_cn: 实用资源

source: A list of useful resources and accompanying descriptions, with especially pertinent ones marked.
es_mx: Una lista de recursos útiles y descripciones correspondientes, con los más pertinentes marcados.
fr_ca: Liste de ressources utiles et descriptions correspondantes, avec indication des ressources les plus pertinentes.
ja_jp: 役に立つリソースと説明のリストです。特に重要なものはマークされています。
ro_ro: O listă de resurse folositoare și discrieri însoțitoare, cu cele mai importante resurse marcate.
ru_ru: Список полезных ресурсов и сопровождающих описаний, самые актуальные помечены.
zh_cn: 实用资源清单及附带说明，其中的特殊资源已作标记。

source: Being a Team
es_mx: Ser un equipo
fr_ca: Être une équipe
ja_jp: チームを始める
ru_ru: Работа в Команде
zh_cn: 组建一个队伍

source: Covers how to start, organize, and run an effective team.
es_mx: Cubre cómo comenzar, organizar y dirigir un equipo efectivo.
fr_ca: Couvre la façon de créer, d'organiser et de diriger une équipe efficace.
ja_jp: どのようにして効果的なチームを立ち上げ、組織化し、運営するかを説明します。
ru_ru: В этом пункте описано, как создать команду, организовать ее и начать ей руководить.
zh_cn: 涉及如何启动、组织和运营一个高效的队伍。

source: Hardware
fr_ca: Matériel
ja_jp: ハードウェア
ru_ru: Инженерия
zh_cn: 硬件

source: Design Strategy
es_mx: Estrategia de diseño
fr_ca: Stratégie de conception
ja_jp: 設計戦略
ro_ro: Strategie de Design
ru_ru: Стратегия Разработки
zh_cn: 设计策略

source: A list of general tips for your team's design process.
es_mx: Una lista de consejos generales para el proceso de diseño de tu equipo.
fr_ca: Une liste de conseils généraux pour le processus de conception de votre équipe.
ja_jp: チームの設計プロセスのための一般的なヒントのリストです。
ro_ro: O listă de sfaturi generale pentru procesul de design al echipei tale.
ru_ru: Список общих рекомендаций по процессу проектирования различных механизмов и деталей.
zh_cn: 团队设计流程的一般提示清单。

source: Design Tradeoffs
es_mx: Compensaciones de diseño
fr_ca: Compromis de conception
ja_jp: 設計上のトレードオフ
ro_ro: Sacrificii În Design
ru_ru: Решения в Дизайне
zh_cn: 设计权衡

source: Goes over some common robot design decisions and typically superior alternatives to them.
es_mx: Repasa algunas decisiones comunes en el diseño de robots y alternativas típicamente superiores a las mismas.
fr_ca: Passe en revue certaines décisions courantes en matière de conception de robots et les solutions de rechange typiquement supérieures.
ja_jp: いくつかの一般的なロボット設計の決定と、それより優れた代替案について説明します。
ro_ro: Decizii comune în schițarea robotului și alternative superioare.
ru_ru: В этом разделе рассматриваются некоторые распространенные конструкционные решения роботов и типичные альтернативы им.
zh_cn: 介绍一些常见的机器人设计决策，以及典型的优秀替代方案。

source: Drivetrains
es_mx: Chasis
fr_ca: Châssis
ro_ro: Șasiuri
ru_ru: Колесные Базы
zh_cn: 传动系统

source: Because it doesn't matter how good the rest of your mechanisms are if the robot cannot get to where it needs to be (except maybe if you're 8813 in Relic Recovery).
es_mx: Porque no importa qué tan buenos sean el resto de tus mecanismos si el robot no puede llegar a donde necesita estar (excepto tal vez si eres 8813 en Relic Recovery).
fr_ca: Car peu importe la qualité du reste de vos mécanismes si le robot ne peut pas se rendre là où il doit être (sauf peut-être si vous êtes 8813 en Relic Recovery).
ja_jp: なぜなら、ロボットが必要な場所にたどり着けなければ、他のメカニズムがどれだけ優れていても意味がないからだ (8813 Relic Recoveryの場合は例外かもしれない)
ro_ro: Deoarece degeaba ai mecanisme bune pe robot dacă nu poți să îl miști unde trebuie să ajungă (excepție pentru echipa 8813 în Relic Recovery).
ru_ru: Не имеет значения, насколько хороши остальные ваши механизмы, если робот не может добраться в нужное место (за исключением, может быть, 8813 в Relic Recovery).
zh_cn: 因为如果机器人无法到达它需要到达的地方，那么你的其他装置再好也没有用（除非你是 Relic Recovery 赛季中的 8813 队伍）。

source: Active Intake
es_mx: Intake activo
ro_ro: Intake Activ
ru_ru: Активные Захваты
zh_cn: 主动吸入拾取装置

source: Because you want to be able to pick stuff up. Touch it, own it.
es_mx: Porque quieres poder recoger cosas. Tocarlas, poseerlas.
fr_ca: Parce que vous voulez pouvoir prendre les choses en main. Les toucher, se les approprier.
ja_jp: 物を拾えるようになりたいからです。触って、所有して。
ro_ro: Deoarece vrei să poți să colectezi chestii.
ru_ru: Надо уметь захватывать элементы. Бери их, владей ими.
zh_cn: 因为你想拿起东西。接触它，持有它。

source: Linear Motion Guide
es_mx: Guía de movimiento lineal
fr_ca: Guide du mouvement linéaire
ja_jp: Linear Motion ガイド
ro_ro: Ghid Pentru Mișcare Liniară
ru_ru: Гайд по Системам Выдвижения
zh_cn: 线性运动导轨

source: Moving things further than the constraints of the robot is an extremely common task, and linear motion is often one of the best ways to do this.
es_mx: Mover las cosas más allá de las limitaciones del robot es una tarea extremadamente común, y el movimiento lineal suele ser una de las mejores formas de hacerlo.
fr_ca: Déplacer des objets au-delà des contraintes du robot est une tâche extrêmement courante, et le mouvement linéaire est souvent l'un des meilleurs moyens d'y parvenir.
ja_jp: ロボットの制約を超えて機構を動かすことはよくあることで、直線運動はそのための最良の方法の一つであることが多い。
ro_ro: Mișcarea lucrurilor în afara limitelor robotului este o sarcină foarte comună, iar mișcarea liniară este de obicei cea mai bună metodă de a face asta.
ru_ru: Перемещение предметов за пределы размеров робота - чрезвычайно распространенная задача, и линейное выдвижение часто является одним из лучших способов ее решения.
zh_cn: 在机器人的限制范围之外移动物体是一项极为常见的任务，而线性运动通常是实现这一任务的最佳方法之一。

source: Power Transmission
es_mx: Transmisión de potencia
fr_ca: Transmission de puissance
ro_ro: Transmisii de Putere
ru_ru: Передача Момента
zh_cn: 动力传输

source: Different ways to get rotation from point A to point B.
es_mx: Diferentes formas de llevar la rotación desde el punto A hasta el punto B.
fr_ca: Différentes façons d'obtenir une rotation d'un point A à un point B.
ja_jp: A地点からB地点へ回転させるためのさまざまな方法。
ro_ro: Diverse metode de a te roti din punctul A în punctul B.
ru_ru: Различные способы передать вращательный момент из точки A в точку B
zh_cn: 从 A 点到 B 点的不同旋转方式。

source: Programming/Control System
es_mx: Programación/Sistema de Control
fr_ca: Système de programmation/contrôle
ja_jp: プログラミング / コントロールシステム
ro_ro: Programare/Sistem de Control
ru_ru: Программная Часть/Система Управления
zh_cn: 编程/控制系统

source: Options for Programming
es_mx: Opciones para programación
fr_ca: Options de programmation
ja_jp: プログラミングのオプション
ro_ro: Variante de Programare
ru_ru: Способы Программирования Робота
zh_cn: 编程选项

source: Because without programming, the robot is just an expensive brick.
es_mx: Porque sin programación, el robot es solo un ladrillo costoso.
fr_ca: Car sans programmation, le robot n'est qu'une brique coûteuse.
ja_jp: ロボットはプログラムが無ければ、ただの高価なレンガに過ぎないからです。
ro_ro: Deoarece fără programare, robotul este doar o cărămidă scumpă.
ru_ru: Потому что без кода ваш робот просто дорогой кирпич.
zh_cn: 因为没有编程，机器人只是一块昂贵的砖头。

source: Control Systems
es_mx: Sistemas de Control
fr_ca: Systèmes de contrôle
ja_jp: コントロールシステム
ro_ro: Sisteme de Control
ru_ru: Системы Управления Роботом
zh_cn: 控制系统

source: Because without a control system, the robot is just a (significantly less) expensive brick.
es_mx: Porque sin un sistema de control, el robot es solo un ladrillo (significativamente menos) costoso.
fr_ca: En effet, sans système de contrôle, le robot n'est qu'une brique (nettement moins chère).
ja_jp: なぜなら、制御システムがなければ、ロボットは単なる（著しく安価な）レンガに過ぎないからです。
ro_ro: Deoarece fără sisteme de control, robotul este doar o caramidă (mai puțin) scumpă.
ru_ru: Потому что без системы управления робот - это просто дорогой (уже не настолько), но бесполезный кирпич.
zh_cn: 因为如果没有控制系统，机器人就只是一块（不那么）昂贵的砖头。

source: Wiring Guide
es_mx: Guía de cableado
fr_ca: Guide de câblage
ja_jp: 配線ガイド
ro_ro: Ghid de Cablare
ru_ru: Гайд по Проводке
zh_cn: 接线指南

source: Because disconnects are no fun.
es_mx: Porque las desconexiones no son divertidas.
fr_ca: Parce que les déconnexions ne sont pas amusantes.
ja_jp: 切断は面白くないから...
ro_ro: Deoarece deconectarea nu este distractivă.
ru_ru: Внезапное отключение системы на матче - не самое веселое событие.
zh_cn: 因为断开连接并不好玩。

source: Programming Tutorial - Mecanum Drivetrain
es_mx: Tutorial de programación - Chasis Mecanum
fr_ca: Tutoriel de programmation - Moteurs Mecanum
ja_jp: プログラミングチュートリアル - メカナムドライブ
ro_ro: Tutorial de Programare - Șasiul Mecanum
ru_ru: Инструкция по Написанию Кода для Колесной Базы Меканум
zh_cn: 编程教程 - 麦克纳姆 传动系统

source: Because mecanum wheels without the right code are some very expensive questionable quality traction wheels.
es_mx: Porque las ruedas mecanum sin el código correcto son unas ruedas de tracción de calidad cuestionable y muy costosas.
fr_ca: En effet, les roues Mécanum sans le bon code sont des roues de traction très chères et de qualité douteuse.
ja_jp: 適切なプログラムのないメカナムホイールは、非常に高価で動作に問題のあるトラクションホイールであるためです。
ro_ro: Deoarece roțile mecanum fără codul corespunzător sunt doar niște roți de tracțiune de o calitate discutabilă.
ru_ru: Потому что меканум колеса без правильного кода - это супер дорогие колеса с сомнительным трением.
zh_cn: 没有正确编程的麦克纳姆车轮，就只能是非常昂贵但质量有问题的轮子而已。

source: Computer Vision
es_mx: Visión Computarizada
fr_ca: Vision par ordinateur
ja_jp: 画像認識
ru_ru: Видеозрение
zh_cn: 计算机视觉

source: Explains the different common computer vision systems and how to use them (hopefully this doesn't end with a robot uprising).
es_mx: Explica los diferentes sistemas comunes de visión computarizada y cómo usarlos (esperemos que esto no termine con un levantamiento de robots).
fr_ca: Explique les différents systèmes courants de vision par ordinateur et comment les utiliser (en espérant que cela ne se termine pas par un soulèvement des robots).
ja_jp: さまざまな一般的なコンピュータビジョンシステムとその使用方法を説明します。 (ロボットの暴走で終わらないことを願う)
ro_ro: Cum diferitele sisteme de vedere computerizate funcționează și cum să le folosești (sperăm ca aceste sisteme să nu ducă la o revoluție a roboților).
ru_ru: Объясняет как использовать популярные системы видеозрения (вот бы это не закончилось восстанием роботов).
zh_cn: 解释各种常见的计算机视觉系统以及如何使用它们（希望这不会以机器人起义而告终）。

source: FTC Discord
ja_jp: FTCのDiscordコミュニティ

source: The **unofficial** FTC Discord server is a discussion-based community server that has teams ranging from first-year rookies to Winning Alliance Captains at the World Championships. It also has a channel for direct access to vendors.
ja_jp: FTCのDiscordサーバーは、1年目のルーキーから世界大会での優勝したAllianceのキャプテンなどの様々なチームが参加する、ディスカッションベースの **非公式** コミュニティサーバーです。また、ベンダーに直接連絡をするためのチャンネルもあります。
ro_ro: Serverul **neoficial** de Discord FTC este o comunitate bazată pe discuții între echipe de la echipe începătoare până la căpitani ai alianțelor câștigătoare la campionatele mondiale. De asemenea au un chat prin care poți să comunici direct cu diverși vânzători.
