Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/motor-guide/choosing-motor.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: Choosing a Motor
es_mx: Eligiendo un Motor
fr_ca: Choisir un moteur
ro_ro: Cum să alegi un motor
zh_cn: 选择电机

source: Legal Motors
es_mx: Motores Legales
fr_ca: Moteurs légaux
ro_ro: Motoare legale
zh_cn: 合规的电机

source: 12 volt motors are strictly controlled by FTC\ |reg| rules. As of 2025-2026 season, the only FTC legal 12V motors are the following ones:
es_mx: Los motores de 12 voltios están estrictamente controlados por las normas de la FTC. A partir de la temporada 2025-2026, los únicos motores de 12V legales para FTC son los siguientes:
fr_ca: Les moteurs 12 volts sont strictement contrôlés par les règles de FTC. À partir de la saison 2025-2026, les seuls moteurs 12 volts autorisés par FTC sont les suivants :
zh_cn: 12 伏电机受 FTC\ |reg| 规则的严格控制。截至 2025-2026 赛季，FTC 唯一合法的 12 伏电机如下：

source: TETRIX MAX 12V DC (739530, 39530; now discontinued)
es_mx: TETRIX MAX 12V CC (739530, 39530; ya descatalogada)
fr_ca: TETRIX MAX 12V DC (739530, 39530 ; maintenant discontinué)
zh_cn: TETRIX MAX 12V DC (739530, 39530; 现已停产）

source: Many legal gearmotors are sold with labeling based on the entire assembly. These motors may be used with or without the provided gearbox, and/or with any other compatible gearbox. Here are some examples:
es_mx: Muchos motorreductores legales se venden con un etiquetado basado en el conjunto completo. Estos motores pueden utilizarse con o sin la caja de engranajes suministrada, y/o con cualquier otra caja de engranajes compatible. He aquí algunos ejemplos:
fr_ca: De nombreux motoréducteurs légaux sont vendus avec un étiquetage basé sur l'ensemble de l'assemblage. Ces moteurs peuvent être utilisés avec ou sans le réducteur fourni, et/ou avec tout autre réducteur compatible. En voici quelques exemples :
zh_cn: 许多合法的齿轮减速电机在销售时都会根据整个组件进行标注。这些电机可与所提供的齿轮箱一起使用，也可以不与齿轮箱一起使用，或与任何其他兼容的齿轮箱一起使用。 下面是一些例子：

source: `REV Robotics HD Hex Motor 20:1 Spur Gearbox <https://www.revrobotics.com/rev-41-1298/>`_ (REV-41-1298)
es_mx: `REV Robotics HD Hex Motor 20:1 Caja de engranajes rectos <https://www.revrobotics.com/rev-41-1298/>`_ (REV-41-1298)

source: `REV Robotics HD Hex Motor 40:1 Spur Gearbox <https://www.revrobotics.com/rev-41-1301/>`_ (REV-41-1301)
es_mx: `REV Robotics HD Motor Hex 40:1 Caja de engranajes rectos <https://www.revrobotics.com/rev-41-1301/>`_ (REV-41-1301)

source: Continuous Rotation servos can also be a great option in place of a 12V motor in various mechanisms. See :doc:`Choosing a Servo <../servo-guide/choosing-servo>` for details.
es_mx: Los servos de rotación continua también pueden ser una gran opción en lugar de un motor de 12V en varios mecanismos. Consulta :doc:`Cómo elegir un servo <../servo-guide/choosing-servo>` para obtener más información.
fr_ca: Les servos à rotation continue peuvent également être une excellente option pour remplacer un moteur 12V dans divers mécanismes. Voir :doc:`Choosing a Servo <../servo-guide/choosing-servo>` pour plus de détails.
zh_cn: 在各种机械装置中，连续旋转伺服器也是替代 12V 电机的最佳选择。详情请参见 :doc:`Choosing a Servo <../servo-guide/choosing-servo>``。

source: With the exception of the :term:`REV Core Hex Motor <Core Hex Motor>`, all other motors above have very similar structures. They consist of the following components:
es_mx: A excepción del :term:`REV Core Hex Motor <Core Hex Motor>`, todos los demás motores anteriores tienen estructuras muy similares. Constan de los siguientes componentes:
fr_ca: À l'exception du :term:`REV Core Hex Motor <Core Hex Motor>`, tous les autres moteurs ci-dessus ont des structures très similaires. Ils sont constitués des éléments suivants :
zh_cn: 除了 :term:`REV Core Hex Motor<Core Hex Motor>` 外，上述所有其他电机的结构都非常相似。它们由以下部件组成：

source: **Bare motor**. In all cases above, this is a 12V motor of :term:`RS-555 type <RS-550 Series Motor>`, with free speed around 6,000 RPM and stall current around 10A. The motor specs posted by different vendors might be slightly different, but the difference is mainly due to different testing methods. In real life, the bare motors used by :term:`AndyMark NeveRest motors <NeveRest Motor>`, :term:`REV Robotics HD Hex motors <HD Hex Motor>`, and :term:`goBILDA motors <Yellow Jacket Motor>` are virtually identical. The most reliable specs can be found in the :ref:`motor-data` section.
es_mx: **Bare motor**. En todos los casos anteriores, se trata de un motor de 12V del tipo: término: `RS-555 <RS-550 Series Motor>`, con una velocidad libre de unas 6.000 RPM y una corriente de calado de unos 10A. Las especificaciones del motor publicadas por los distintos proveedores pueden ser ligeramente diferentes, pero la diferencia se debe principalmente a los distintos métodos de prueba. En la vida real, los bare motors utilizados por: término: `AndyMark NeveRest motors <NeveRest Motor>`, :término:`REV Robotics HD Hex motors <HD Hex Motor>`, y: término: `goBILDA motors <Yellow Jacket Motor>` son prácticamente idénticos. Las especificaciones más fiables se pueden encontrar en la sección :ref:`datos-del-motor`.
fr_ca: **Moteur dénudé**. Dans tous les cas ci-dessus, il s'agit d'un moteur 12V de :term:`RS-555 type <RS-550 Series Motor>`, avec une vitesse libre d'environ 6,000 RPM et un courant de décrochage d'environ 10A. Les spécifications des moteurs affichées par les différents vendeurs peuvent être légèrement différentes, mais la différence est principalement due à des méthodes de test différentes. Dans la réalité, les moteurs dénudés utilisés par :term:`AndyMark NeveRest motors <NeveRest Motor>`, :term:`REV Robotics HD Hex motors <HD Hex Motor>`, et :term:`goBILDA motors <Yellow Jacket Motor>` sont pratiquement identiques. Les spécifications les plus fiables se trouvent dans la section :ref:`motor-data`.
zh_cn: **裸电机** 。在上述所有情况下，这是 RS-555 型的12V电机 :term:`RS-555 type <RS-550 Series Motor>` ，自由转速约为 6000 RPM，堵转电流约为 10A。不同供应商发布的电机规格可能略有不同，但差异主要是由于测试方法不同。在现实生活中，:term:`AndyMark NeveRest 电机 <NeveRest Motor>` 、 :term:`REV Robotics HD Hex 电机 <HD Hex Motor>` 和 :term:`goBILDA 电机 <Yellow Jacket Motor>` 使用的裸电机几乎相同。最可靠的规格可以在峰值功率和电机曲线部分找到。

source: **Gearbox**. The gearbox is attached to the front of the motor and reduces the speed while increasing the torque. For example, a 20:1 gearbox reduces the speed by a factor of 20, resulting in a no-load speed of around 300RPM. See :term:`Gear Reduction`. A gearbox also contains the output :term:`shaft <Shaft>` (typically a 8mm REX shaft, 5mm hex shaft, or 6mm D shaft) and mounting holes. The gearbox can also be replaced; this is FTC legal but requires some skill.
es_mx: **Caja de engranajes**. La caja de engranajes se acopla a la parte delantera del motor y reduce la velocidad al tiempo que aumenta el par. Por ejemplo, una caja de cambios de 20:1 reduce la velocidad en un factor de 20, lo que resulta en una velocidad sin carga de alrededor de 300RPM. Véase: término:' Reducción de engranajes`. Una caja de engranajes también contiene el eje de salida: término: `eje <Shaft>` (normalmente un eje REX de 8 mm, un eje hexagonal de 5 mm o un eje D de 6 mm) y los orificios de montaje. La caja de engranajes también se puede sustituir; esto es legal según FTC, pero requiere cierta habilidad.
fr_ca: **Réducteur**. La boîte de vitesses est fixée à l'avant du moteur et réduit la vitesse tout en augmentant le couple. Par exemple, un réducteur 20:1 réduit la vitesse par un facteur de 20, ce qui donne une vitesse à vide d'environ 300 tr/min. Voir :term:`Réduction d'engrenage`. Un réducteur contient également un :term:`arbre <Shaft>` de sortie (généralement un arbre REX de 8 mm, un arbre hexagonal de 5 mm ou un arbre D de 6 mm) et des trous de montage. La boîte de vitesses peut également être remplacée ; cette opération est autorisée en FTC mais nécessite quelques compétences.
zh_cn: **齿轮箱**。齿轮箱连接在电机前端，在提高扭矩的同时降低转速。例如，20:1 的齿轮箱可将转速降低 20 倍，使空载转速约为 300RPM。参见 :term:`Gear Reduction`。齿轮箱还包含输出 :term:`shaft <Shaft>`（通常为 8mmREX 轴、5mm六角轴或 6mm D 轴）和安装孔。齿轮箱也可以更换；这在联邦贸易委员会是合法的，但需要一定的技术。

source: **Encoder**. Attached to the back of the motor and protected by a plastic cap, the :term:`encoder <Encoder>` contains a sensor registering motor :term:`shaft <Shaft>` rotation. It can be connected to REV hubs and used for precise control of motor speed or rotating to a specific position.
es_mx: **Encoder**. Fijado a la parte trasera del motor y protegido por una tapa de plástico, el: término: `encoder <Encoder>` contiene un sensor que registra la rotación del: término: `shaft <Shaft>` del motor. Puede conectarse a los REV hubs y utilizarse para un control preciso de la velocidad del motor o para girar a una posición específica.
fr_ca: **Encodeur**. Fixé à l'arrière du moteur et protégé par un capuchon en plastique, le :term:`encodeur <Encoder>` contient un capteur qui enregistre la rotation du moteur :term:`shaft <Shaft>`. Il peut être connecté aux moyeux REV et utilisé pour contrôler avec précision la vitesse du moteur ou la rotation vers une position spécifique.
ro_ro: **Encoder**. Atașat de partea din spate a motorului și protejat de un capac de plastic, :term:`encoderul <Encoder>` conține un senzor care înregistrează rotațiile :term:`axului <Shaft>` motorului.
zh_cn: **编码器** 。编码器安装在电机背面，由塑料盖保护， :term:`编码器 <Encoder>` 包含一个记录电机 :term:`轴 <Shaft>` 旋转的传感器 它可以连接到REV hub，用于精确控制电机速度或旋转到特定位置。

source: Since the bare motor is similar for all motors discussed above, the choice of the right motor is dictated by the gearbox: the :term:`gear ratio <Gear Reduction>`, output :term:`shaft <Shaft>` type, and ease of mounting.
es_mx: Dado que el bare motor es similar para todos los motores analizados anteriormente, la elección del motor adecuado viene dictada por la caja de engranajes: la: término: `relación de engranes<Gear Reduction>`, el output del tipo de: término:' shaft <Shaft>` y la facilidad de montaje.
fr_ca: Étant donné que le moteur dénudé est similaire pour tous les moteurs mentionnés ci-dessus, le choix du bon moteur est dicté par la boîte de vitesses : le :term:`rapport d'engrenage <Gear Reduction>`, le type d'arbre de sortie :term:` <Shaft>`, et la facilité de montage.
ro_ro: Deoarece motoarele de bază sunt similare pentru toate motoarele discutate mai sus, alegerea motorului corect este dictată de cutia de viteze ( :term:`raportul <Gear Reduction>` acesteia), tipul de :term:`ax <Shaft>` de ieșire și ușurința montării.
zh_cn: 由于裸电机与上面讨论的所有电机相似，因此正确电机的选择取决于变速箱：齿轮比 :term:`齿轮减速箱 <Gear Reduction>` 、输出 :term:`轴 <Shaft>` 类型和安装的简易。

source: Gearboxes
es_mx: Cajas de Engranajes
fr_ca: Boîtes de vitesses
ro_ro: Cutiile de Viteze
zh_cn: 齿轮箱

source: There are two kinds of gearboxes: spur gearboxes, and planetary (also known as orbital) gearboxes. Their inner structure and difference is discussed in detail in :doc:`gearbox-anatomy` section. For new teams, it suffices to know that planetary gearboxes much more reliable, but may be slightly more expensive. Spur gearboxes can strip under shock loads (for example, when your robot hits a wall), requiring you to replace the gearbox. For this reason, it is advised to use planetary gearboxs, especially in high-load use cases such as drivetrains.
es_mx: Existen dos tipos de cajas de engranajes: rectas y planetarias (también conocidas como orbitales). Su estructura interna y sus diferencias se tratan en detalle en la sección :doc:`anatomia-de-caja-de-engranajes`. Para los equipos nuevos, basta con saber que las cajas de engranajes planetarios son algo más caras, pero más fiables. Las cajas de engranajes rectos pueden romperse bajo cargas de choque (por ejemplo, cuando el robot choca contra una pared), lo que obliga a sustituir la caja de engranajes. Por este motivo, se aconseja utilizar reductores planetarios especialmente en casos de uso con cargas elevadas, como los chasises.
fr_ca: Il existe deux types de réducteurs : les réducteurs à engrenages droits et les réducteurs planétaires (également connus sous le nom de réducteurs orbitaux). Leur structure interne et leurs différences sont examinées en détail dans la section :doc:`gearbox-anatomy`. Pour les nouvelles équipes, il suffit de savoir que les réducteurs planétaires sont beaucoup plus fiables, mais qu'ils peuvent être légèrement plus chers. Les réducteurs à engrenages droits peuvent se rompre sous l'effet d'un choc (par exemple, lorsque votre robot heurte un mur), ce qui vous oblige à remplacer le réducteur. C'est pourquoi il est conseillé d'utiliser des réducteurs planétaires, en particulier dans les cas d'utilisation à forte charge tels que les chaînes cinématiques.
zh_cn: 齿轮箱有两种：正齿轮箱和行星齿轮箱（也称为轨道齿轮箱）。它们的内部结构和区别在 :doc:`gearbox-anatomy` 部分详细讨论。对于新团队来说，只需知道行星齿轮箱更可靠，但价格可能略高即可。正齿轮箱在受到冲击载荷时（例如，当你的机器人撞墙时）可能会剥落，需要更换齿轮箱。出于这个原因，建议在高负载高冲击情况中使用行星齿轮箱，例如传动系统。

source: Planetary Gearboxes
es_mx: Caja de Engranes Planetarios
fr_ca: Réducteurs planétaires
zh_cn: 行星齿轮箱

source: Standard planetary gearboxes include :term:`AndyMark NeveRest Orbital motors <NeveRest Motor>`, :term:`REV 20:1 Planetary motor <HD Hex Motor>`, and :term:`goBILDA's 5202/5203/5204 Series Yellow Jacket Motors <Yellow Jacket Motor>`.
es_mx: Los reductores planetarios estándar incluyen :term:`AndyMark NeveRest Orbital motors <NeveRest Motor>`, :term:`REV 20:1 Planetary motor <HD Hex Motor>`, y :term:`goBILDA's 5202/5203/5204 Series Yellow Jacket Motors <Yellow Jacket Motor>`.
fr_ca: Les réducteurs planétaires standard comprennent :term:`AndyMark NeveRest Orbital motors <NeveRest Motor>`, :term:`REV 20:1 Planetary motor <HD Hex Motor>`, et :term:`goBILDA's 5202/5203/5204 Series Yellow Jacket Motors <Yellow Jacket Motor>`.
zh_cn: 标准行星齿轮箱包括 :term:`AndyMark NeveRest Orbital motors<NeveRest Motor>`、:term:`REV 20:1 Planetary motor <HD Hex Motor>` 和 :term:`goBILDA's 5202/5203/5204 Series Yellow Jacket Motors<Yellow Jacket Motor>`。

source: Any of these "standard" gearboxes are more robust than spur gearboxes. Like the spur gearboxes, the gearboxes from different vendors, while not interchangeable, are very comparable in terms of robustness. Once again, the main thing to consider here is your desired reduction, your desired motor connections, and your desired output :term:`shaft <Shaft>` type.
es_mx: Cualquiera de estas cajas de cambios "estándar" es más robusta que las cajas de engranajes rectos. Al igual que las cajas de engranajes rectos, las cajas de engranajes de diferentes proveedores, aunque no son intercambiables, son muy comparables en términos de robustez. Una vez más, lo principal a tener en cuenta aquí es la reducción deseada, las conexiones de motor deseadas y el tipo de salida :término:`shaft <Shaft>` deseado.
fr_ca: Tous ces réducteurs "standards" sont plus robustes que les réducteurs à engrenages droits. Comme pour les réducteurs à engrenages droits, les réducteurs des différents fournisseurs, bien qu'ils ne soient pas interchangeables, sont très comparables en termes de robustesse. Une fois de plus, la principale chose à prendre en compte est la réduction souhaitée, les connexions du moteur souhaitées et le type :term:`shaft <Shaft>` de sortie souhaité.
zh_cn: 这些“标准”齿轮箱中的任何一个都比直齿轮箱更坚固。像直齿轮箱一样，来自不同供应商的齿轮箱虽然不能互换，但在稳健性方面非常具有可比性。同样，这里要考虑的主要问题是您想要的减速、想要的电机连接和想要的输出 :term:`轴 <Shaft>` 类型。

source: `goBILDA Yellow Jacket <https://www.gobilda.com/yellow-jacket-planetary-gear-motors/>`_ has the most varied selection of gearbox ratios with too many to list here, but utilize the rather uncommon :term:`3.5mm Bullet` connection for power. The output :term:`shaft <Shaft>` is a 8mm REX (7mm hex rounded to 8 mm) or :term:`6mm D-shaft <Shaft>`.
es_mx: GOBILDA Yellow Jacket <https://www.gobilda.com/yellow-jacket-planetary-gear-motors/>`_ tiene la más variada selección de relaciones de transmisión con demasiados para enumerar aquí, pero utilizan el poco común :term:`Bala de 3.5mm` conexión para potencia. La salida del :term:`eje <Shaft>` es un 8mm REX (7mm hex redondeado a 8 mm) o :term:`6mm D-eje <Shaft>`.
fr_ca: `goBILDA Yellow Jacket <https://www.gobilda.com/yellow-jacket-planetary-gear-motors/>`_ a la sélection la plus variée de rapports de boîte de vitesses, trop nombreux pour être énumérés ici, mais utilise la connexion :term:`3.5mm Bullet` plutôt rare pour la puissance. L'arbre de sortie :term:``shaft <Shaft>` est un REX 8mm (7mm hexagonal arrondi à 8 mm) ou :term:`6mm D-shaft <Shaft>`.
zh_cn: `goBILDA Yellow Jacket <https://www.gobilda.com/yellow-jacket-planetary-gear-motors/>`_有最多样化的齿轮箱比例可供选择，这里就不一一列举了，但使用相当不常见的 :term:`3.5mm Bullet`连接来提供动力。输出:term:`shaft<Shaft>` 是 8 毫米 REX（7 毫米六角四舍五入为 8 毫米）或 :term:`6 毫米 D 型轴<Shaft>`。

source: `REV HD Hex Motor with UltraPlanetary Gearbox <https://www.revrobotics.com/rev-41-1600/>`_ - The UltraPlanetary is a customizable planetary gearbox that is designed for FTC. The three gearbox options are 3:1, 4:1, and 5:1, and can be mix & matched to create a custom ratio. It is possible to use from one to three gearboxes for a minimum ratio of 3:1 and a maximum of 125:1. The motor uses the same connections (:term:`JST VH`) as the REV Expansion and Control Hub for power, which means no adapter cables are necessary.
es_mx: `REV HD Hex Motor with UltraPlanetary Gearbox <https://www.revrobotics.com/rev-41-1600/>`_ - El UltraPlanetary es un reductor planetario personalizable que está diseñado para FTC. Las tres opciones de caja de engranajes son 3:1, 4:1, y 5:1, y se pueden mezclar y combinar para crear una relación personalizada. Es posible utilizar de una a tres cajas de engranajes para una relación mínima de 3:1 y máxima de 125:1. El motor utiliza las mismas conexiones (:term:`JST VH`) que el REV Expansion y Control Hub para la alimentación, lo que significa que no son necesarios cables adaptadores.
fr_ca: `REV HD Hex Motor with UltraPlanetary Gearbox <https://www.revrobotics.com/rev-41-1600/>`_ - L'UltraPlanetary est un réducteur planétaire personnalisable conçu pour FTC. Les trois options du réducteur sont 3:1, 4:1 et 5:1, et peuvent être combinées pour créer un rapport personnalisé. Il est possible d'utiliser de un à trois réducteurs pour un rapport minimum de 3:1 et maximum de 125:1. Le moteur utilise les mêmes connexions (:term:`JST VH`) que le REV Expansion and Control Hub pour l'alimentation, ce qui signifie qu'aucun câble d'adaptation n'est nécessaire.
zh_cn: 配有 UltraPlanetary 齿轮箱的 REV HD Hex 电机<https://www.revrobotics.com/rev-41-1600/>`_ - UltraPlanetary 是一种可定制的行星齿轮箱，专为 FTC 而设计。三个齿轮箱选项分别为 3:1、4:1 和 5:1，可以混合搭配以创建自定义比例。可以使用一个到三个齿轮箱，最小传动比为 3:1，最大传动比为 125:1。 电机使用与 REV 扩展和控制集线器相同的连接（:term:`JST VH`）供电，这意味着无需转接电缆。

source: While REV lists the UltraPlanetary stages as 3:1, 4:1, and 5:1, their actual gear ratios are slightly different. Consult the `REV UltraPlanetary User's Manual for the exact gear ratios <https://docs.revrobotics.com/rev-crossover-products/ultraplanetary/cartridge-details>`_.
es_mx: Aunque REV enumera las etapas UltraPlanetary como 3:1, 4:1, y 5:1, sus relaciones de transmisión reales son ligeramente diferentes. Consulte el Manual del Usuario del UltraPlanetario REV para conocer las relaciones de transmisión exactas <https://docs.revrobotics.com/rev-crossover-products/ultraplanetary/cartridge-details>`_.
fr_ca: Bien que REV indique que les étages de l'UltraPlanétaire sont 3:1, 4:1 et 5:1, leurs rapports de vitesse réels sont légèrement différents. Consultez le `REV UltraPlanetary User's Manual pour connaître les rapports exacts <https://docs.revrobotics.com/rev-crossover-products/ultraplanetary/cartridge-details>`_.
zh_cn: 虽然 REV 将 UltraPlanetary 的级数列为 3:1、4:1 和 5:1，但它们的实际齿轮比略有不同。有关确切的齿轮比，请查阅 `REV UltraPlanetary 用户手册 <https://docs.revrobotics.com/rev-crossover-products/ultraplanetary/cartridge-details>`_。

source: The UltraPlanetary was intended to give teams maximum customization without the typical limiting factor - high cost. The total cost for the three stage gearbox and motor is *exceptionally* good value for a customizable motor. In addition, the UltraPlanetary has a female 5mm hex output :term:`shaft <Shaft>` which allows teams to customize the shaft length.
es_mx: El UltraPlanetary fue concebido para ofrecer a los equipos la máxima personalización sin el típico factor limitante: el elevado coste. El coste total de la caja de engranajes de tres etapas y el motor es *excepcionalmente* bueno para un motor personalizable. Además, el UltraPlanetary tiene una salida hexagonal hembra de 5 mm: término: `shaft<Shaft>` que permite a los equipos personalizar la longitud del eje.
fr_ca: L'UltraPlanetary a été conçu pour offrir aux équipes un maximum de personnalisation sans le facteur limitant habituel - le coût élevé. Le coût total du réducteur à trois étages et du moteur est *exceptionnellement* bon pour un moteur personnalisable. De plus, l'UltraPlanetary a une sortie hexagonale femelle de 5mm :term:`shaft <Shaft>` qui permet aux équipes de personnaliser la longueur de l'arbre.
zh_cn: UltraPlanetary 的目的是为团队提供最大程度的定制化服务，而没有典型的限制因素--高成本。三级变速箱和电机的总成本对于可定制的电机来说是非常划算的。此外，UltraPlanetary 还有一个内螺纹 5 毫米六角输出 :term:`shaft<Shaft>`，允许团队定制轴的长度。

source: goBILDA sells a special `output adapter <https://www.gobilda.com/flanged-stainless-steel-shaft-for-rev-motion-pattern-8mm-rex-29mm-length/>`_ and `motor mount <https://www.gobilda.com/1702-series-quad-block-motor-mount-43-3/>`_ that allows easily using the UltraPlanetary with the goBILDA system.
es_mx: goBILDA vende un `adaptador de salida` especial <https://www.gobilda.com/flanged-stainless-steel-shaft-for-rev-motion-pattern-8mm-rex-29mm-length/>`_ y un `motor de montaje <https://www.gobilda.com/1702-series-quad-block-motor-mount-43-3/>`_ que permite utilizar fácilmente el UltraPlanetary con el sistema goBILDA.
fr_ca: goBILDA vend un `adaptateur de sortie <https://www.gobilda.com/flanged-stainless-steel-shaft-for-rev-motion-pattern-8mm-rex-29mm-length/>`_ et un `motor mount <https://www.gobilda.com/1702-series-quad-block-motor-mount-43-3/>`_ qui permet d'utiliser facilement l'UltraPlanetary avec le système goBILDA.
zh_cn: goBILDA 销售一种特殊的 “输出适配器 <https://www.gobilda.com/flanged-stainless-steel-shaft-for-rev-motion-pattern-8mm-rex-29mm-length/>`_ ”和 “电机安装座 <https://www.gobilda.com/1702-series-quad-block-motor-mount-43-3/>`_”，可以方便地将 UltraPlanetary 与 goBILDA 系统结合使用。

source: `AndyMark NeveRest Orbital <https://andymark.com/products/neverest-orbital-gearmotors>`_ motors come in four :term:`ratios <Gear Reduction>`, 1:1, 3.7:1, 19.2:1, 50.9:1, and 263.7:1. The output shaft is a :term:`6mm D-shaft <Shaft>`, and the motors have inbuilt cables with :term:`Anderson PowerPole` or :term:`JST VH` connectors to connect to power.
es_mx: Los motores :term:`AndyMark NeveRest Orbital <https://andymark.com/products/neverest-orbital-gearmotors>`_ vienen en cuatro :term:`relaciones <Gear Reduction>`, 1:1, 3.7:1, 19.2:1, 50.9:1, y 263.7:1. El eje de salida es un :term:`eje en D de 6 mm <Shaft>`, y los motores incorporan cables con conectores :term:`Anderson PowerPole` o :term:`JST VH` para conectarlos a la corriente.
fr_ca: Les moteurs :term:``AndyMark NeveRest Orbital <https://andymark.com/products/neverest-orbital-gearmotors>`_ sont disponibles en quatre :term:`ratios <Gear Reduction>`, 1:1, 3.7:1, 19.2:1, 50.9:1, et 263.7:1. L'arbre de sortie est un :term:`arbre en D de 6mm <Shaft>`, et les moteurs ont des câbles intégrés avec :term:`Anderson PowerPole` ou :term:`JST VH` connecteurs pour se connecter à l'alimentation.
zh_cn: `AndyMark NeveRest Orbital <https://andymark.com/products/neverest-orbital-gearmotors>`_ 电机有四种 :term:`ratios<Gear Reduction>`，分别为 1:1、3.7:1、19.2:1、50.9:1 和 263.7:1。输出轴为 :term:`6mmD-shaft<Shaft>`，电机内置电缆，配有 :term:`Anderson PowerPole` 或 :term:`JST VH` 接头，用于连接电源。
