Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/motor-guide/choosing-motor.po
Languages: es_mx, fr_ca, ro_ro, zh_cn

source: `AndyMark NeveRest Hex <https://andymark.com/products/neverest-hex-gearmotors>`_ motors come in five :term:`ratios <Gear Reduction>`, 1:1, 3.7:1, 13.7:1, 19.2:1, 50.9:1, and 263.7:1. The output shaft is a :term:`3/8 inch hex shaft <Shaft>`, and the motors have :term:`JST VH` connectors on the motors to connect to power cables.
es_mx: Los motores :term:`AndyMark NeveRest Hex <https://andymark.com/products/neverest-hex-gearmotors>`_ vienen en cinco :term:`ratios <Gear Reduction>`, 1:1, 3.7:1, 13.7:1, 19.2:1, 50.9:1, y 263.7:1. El eje de salida es un eje hexagonal de :term:`3/8 de pulgada <Shaft>`, y los motores tienen conectores :term:`JST VH` en los motores para conectarlos a los cables de alimentación.
fr_ca: Les moteurs :term:``AndyMark NeveRest Hex <https://andymark.com/products/neverest-hex-gearmotors>`_ sont disponibles en cinq :term:`ratios <Gear Reduction>`, 1:1, 3.7:1, 13.7:1, 19.2:1, 50.9:1, et 263.7:1. L'arbre de sortie est un :term:``arbre hexagonal de 3/8 pouces <Shaft>`, et les moteurs sont équipés de :term:``JST VH` connecteurs sur les moteurs pour se connecter aux câbles d'alimentation.
zh_cn: `AndyMark NeveRest Hex <https://andymark.com/products/neverest-hex-gearmotors>`_ 电机有五种 :term:`ratios<Gear Reduction>`，分别为 1:1、3.7:1、13.7:1、19.2:1、50.9:1 和 263.7:1。输出轴为 :term:`3/8 英寸六角轴<Shaft>`，电机上有 :term:`JST VH` 连接器，用于连接电源线。

source: Spur Gearboxes
es_mx: Cajas de engranajes rectos
fr_ca: Boites d'engrenages
zh_cn: 正齿轮箱

source: Spur gearboxes are NOT recommended due to their shorter lifespan and lower mechanical resilience compared to planetary gearboxes. If you are purchasing new motors, it is highly suggested to purchase planetary gearbox motors instead. Care should be taken to not put load on the output shaft of a spur gearbox. In particular, spur gear motors should NOT be used in high load applications, such as a drivetrain.
es_mx: Las cajas de engranajes rectos NO se recomiendan debido a su menor vida útil y resistencia mecánica en comparación con las cajas de engranajes planetarios. Si va a comprar motores nuevos, se recomienda encarecidamente adquirir motores con reductores planetarios. Se debe tener cuidado de no poner carga en el eje de salida de un reductor de engranajes rectos. En particular, los motorreductores de engranajes rectos NO deben utilizarse en aplicaciones de alta carga, como un chasis.
fr_ca: Les boites d'engrenages ne sont pas recommandés en raison de leur durée de vie plus courte et de leur résistance mécanique plus faible que celle des réducteurs planétaires. Si vous achetez de nouveaux moteurs, il est fortement conseillé d'acheter des moteurs à engrenages planétaires. Il faut veiller à ne pas mettre de charge sur l'arbre de sortie d'une boite d'engrenages droits. En particulier, les moteurs à engrenages droits ne doivent PAS être utilisés dans des applications à forte charge, telles qu'une base pilotable.
zh_cn: 与行星齿轮箱相比，正齿轮箱的使用寿命更短，机械弹性更低，因此不推荐使用正齿轮箱。如果要购买新电机，强烈建议购买行星齿轮箱电机。应注意不要在正齿轮箱的输出轴上施加负载。特别是，正齿轮减速电机不应用于高负载场合，如传动系统。

source: Motors with spur gearboxes include :term:`AndyMark NeveRest Classic motors <NeveRest Motor>` (in 40:1 and 60:1 ratios), the :term:`REV HD Hex 40:1 Spur motor <HD Hex Motor>`, and the discontinued goBILDA 5201 Series Yellow Jacket Spur Gear Motors. All of them offer similar performance and reliability, so your choice is primarily dictated by the convenience of mounting and connecting to the rest of your design (e.g., if you use REV kit, you should probably choose :term:`REV HD Hex motor <HD Hex Motor>`, as it uses the same :term:`5mm hex shaft <Shaft>` as the rest of REV system).
es_mx: Entre los motores con engranajes rectos se incluyen :term:`AndyMark NeveRest Classic motors <NeveRest Motor>` (en relaciones 40:1 y 60:1), el :term:`REV HD Hex 40:1 Spur motor <HD Hex Motor>`, y los descatalogados goBILDA 5201 Series Yellow Jacket Spur Gear Motors. Todos ellos ofrecen un rendimiento y una fiabilidad similares, por lo que su elección viene dictada principalmente por la comodidad de montaje y conexión con el resto de su diseño (por ejemplo, si utiliza el kit REV, probablemente debería elegir :term:`REV HD Hex motor <HD Hex Motor>`, ya que utiliza el mismo :term:`eje hexagonal de 5 mm <Shaft>` que el resto del sistema REV).
fr_ca: <NeveRest Motor>Les moteurs à engrenages droits comprennent :term:`AndyMark NeveRest Classic motors ` (dans les rapports 40:1 et 60:1), le :term:`REV HD Hex 40:1 Spur motor <HD Hex Motor>`, et les moteurs à engrenages droits goBILDA 5201 Series Yellow Jacket, dont la production a été abandonnée. Tous offrent des performances et une fiabilité similaires, de sorte que votre choix est principalement dicté par la commodité de montage et de connexion au reste de votre conception (par exemple, si vous utilisez le kit REV, vous devriez probablement choisir :term:`REV HD Hex motor <HD Hex Motor>`, car il utilise le même :term:``arbre hexagonal de 5 mm <Shaft>` que le reste du système REV).
zh_cn: 带有正齿轮箱的电机包括 :term:`AndyMark NeveRest Classic 电机<NeveRest Motor>`（比例为 40:1 和 60:1），:term:`REV HD Hex 40:1 正齿轮电机<HD Hex Motor>`，以及已停产的 goBILDA 5201 系列 Yellow Jacket 正齿轮电机。它们都具有相似的性能和可靠性，因此您的选择主要取决于安装和与其他设计连接的便利性（例如，如果您使用 REV 套件，您可能应该选择 :term:`REV HD Hex 电机<HD Hex Motor>`，因为它与 REV 系统的其他部分使用相同的 :term:`5毫米六角<Shaft>`）。

source: :term:`REV HD Hex Motor with Spur Gearbox <HD Hex Motor>` - This motor comes in a 20:1 or 40:1 ratio, and uses the same connections (:term:`JST VH`) as the REV Expansion and Control Hub for power, which means no adapter cables are necessary. The output :term:`shaft <Shaft>` is a 5mm hex :term:`shaft <Shaft>`. :term:`REV UltraHex <UltraHex>` has a 5mm hex :term:`bore <Bore>` running through the middle of a 1/2" hex :term:`shaft <Shaft>`, which makes adapting this motor to any length of :term:`UltraHex`, and by extension, 1/2" hex :term:`shaft <Shaft>`, very easy.
es_mx: :term:`REV HD Hex Motor con Caja de engranajes rectos <HD Hex Motor>` - Este motor viene en una relación de 20:1 o 40:1, y utiliza las mismas conexiones (:term:`JST VH`) que el REV Expansion y Control Hub para la alimentación, lo que significa que no son necesarios cables adaptadores. El :term:`eje <Shaft>` de salida es un :term:`eje <Shaft>` hexagonal de 5mm. :term:`REV UltraHex <UltraHex>` tiene un :term:`taladro <Bore>` hexagonal de 5mm que pasa por el medio de un :term:`eje <Shaft>` hexagonal de 1/2", lo que hace que adaptar este motor a cualquier longitud de :term:`UltraHex`, y por extensión, :term:`eje <Shaft>` hexagonal de 1/2", sea muy fácil.
fr_ca: :term:`REV HD Hex Motor with Spur Gearbox <HD Hex Motor>` - Ce moteur est disponible dans un rapport de 20:1 ou 40:1, et utilise les mêmes connexions (:term:`JST VH`) que le REV Expansion and Control Hub pour l'alimentation, ce qui signifie qu'aucun câble d'adaptation n'est nécessaire. L'arbre de sortie :term:`shaft <Shaft>` est un :term:`shaft <Shaft>` hexagonal de 5mm. :term:`REV UltraHex <UltraHex>` a un :term:`bore <Bore>` hexagonal de 5mm passant au milieu d'un :term:`shaft <Shaft>` hexagonal de 1/2", ce qui rend l'adaptation de ce moteur à n'importe quelle longueur de :term:`UltraHex`, et par extension, à un :term:`shaft <Shaft>` hexagonal de 1/2", très facile.
zh_cn: :term:`REV HD Hex Motor with Spur Gearbox<HD Hex Motor>` - 该电机的传动比为 20:1 或 40:1，使用与 REV Expansion和Control Hub 相同的连接方式（:term:`JST VH`）供电，这意味着无需转接电缆。输出 :term:`shaft<Shaft>` 是 5 毫米六角 :term:`shaft<Shaft>`。:term:`REV UltraHex<UltraHex>` 有一个 5 毫米六角 :term:`bore<Bore>` 贯穿 1/2 英寸六角 :term:`shaft<Shaft>`的中间，这使得将此电机适配到任何长度的 :term:`UltraHex` 以及 1/2 英寸六角 :term:`shaft<Shaft>` 非常容易。

source: :term:`AndyMark NeveRest Classic <NeveRest Motor>` motors come in 40:1 and 60:1 ratios. The output shaft is a :term:`6mm D-shaft <Shaft>`, and the motors have inbuilt cables with :term:`Anderson PowerPole` or :term:`JST VH` connectors to connect to power.
es_mx: Los motores :term:`AndyMark NeveRest Classic <NeveRest Motor>` vienen en relaciones de 40:1 y 60:1. El eje de salida es un :term:`6mm D-eje<Shaft>`, y los motores llevan cables incorporados con conectores :term:`Anderson PowerPole` o :term:`JST VH` para conectarlos a la corriente.
fr_ca: Les moteurs :term:`AndyMark NeveRest Classic <NeveRest Motor>` sont disponibles dans les rapports 40:1 et 60:1. L'arbre de sortie est un :term:`arbre en D de 6mm <Shaft>`, et les moteurs ont des câbles intégrés avec :term:`Anderson PowerPole` ou :term:`JST VH` connecteurs pour se connecter à l'alimentation.
zh_cn: :term:`AndyMark NeveRest Classic<NeveRest Motor>` 电机有 40:1 和 60:1 两种比例。输出轴为 :term:`6mmD-shaft<Shaft>`，电机内置电缆，配有 :term:`Anderson PowerPole` 或 :term:`JST VH` 接头，用于连接电源。

source: Choosing The Right Gearbox
es_mx: Escogiendo la Caja de Engranajes Adecuados
fr_ca: Choisir la bonne boîte de vitesses
zh_cn: 选择合适的齿轮箱

source: For regular use, any of the planetary gearboxes will fit your needs. Planetary gearboxes are just a tiny bit more expensive, but boast better backlash and efficiency, higher load capacity, and better capacity for shock loads than spur gearboxes. The tradeoffs, cost and mechanical noise, are almost never a factor.
es_mx: Para uso regular, cualquiera de las cajas de engranajes planetarios se adaptará a tus necesidades. Las cajas de engranajes planetarios son un poco más caras, pero tienen mejor retroceso y eficiencia, mayor capacidad de carga y mejor capacidad para cargas de impacto que las cajas de engranajes rectos. Los compromisos, el costo y el ruido mecánico, casi nunca son un factor.
fr_ca: Pour un usage régulier, n'importe lequel des réducteurs planétaires répondra à vos besoins. Les réducteurs planétaires sont un tout petit peu plus chers, mais ils présentent un meilleur jeu et une meilleure efficacité, une capacité de charge plus élevée et une meilleure résistance aux chocs que les réducteurs à engrenages droits. Les compromis, le coût et le bruit mécanique, ne sont presque jamais un facteur.
zh_cn: 对于常规使用，任何行星齿轮箱都能满足您的需求。行星齿轮箱价格稍贵，但与正齿轮箱相比，具有更好的反向间隙和效率、更高的负载能力和更强的抗冲击能力。成本和机械噪音几乎从来不是取舍的因素。

source: Because both gearbox types are so similar in price for similar ratios, we generally recommend the use of a planetary over a spur gearbox.
es_mx: Porque ambos tipos de cajas de cambios son tan similares en precio para relaciones similares, generalmente recomendamos el uso de una caja de cambios planetaria en lugar de una caja de cambios de engranaje recto.
fr_ca: Le prix des deux types de réducteurs étant très proche pour des rapports similaires, nous recommandons généralement l'utilisation d'un réducteur planétaire plutôt que d'un réducteur à engrenages droits.
zh_cn: 由于这两种类型的变速箱在类似传动比下的价格非常接近，因此我们通常建议使用行星齿轮变速箱而不是正齿轮变速箱。

source: If you already own spur gearboxes, try to use them in lower-load situations, and use planetary motors on your drivetrain and high-load mechanisms.
es_mx: Si ya dispone de cajas de engranajes rectos, intente utilizarlos en situaciones de menor carga, y emplee motores planetarios en tu chasis y los mecanismos de alta carga.
fr_ca: Si vous possédez déjà des moteurs à engrenages droits, essayez de les utiliser dans des situations de faible charge, et utilisez des moteurs planétaires pour votre chaîne cinématique et vos mécanismes à forte charge.
zh_cn: 如果您已经拥有正齿轮箱，请尽量在低负载情况下使用它们，而在传动系统和高负载机构中使用行星电机。

source: For small reductions, it may be more economical to choose a motor you already own and build an external reduction using gears, chain, or belts. It should again come down to your desired output shaft, desired gear ratio, and for the UltraPlanetary, whether you want the ability to swap parts out on the fly.
es_mx: Para reducciones pequeñas, puede ser más económico elegir un motor que ya poseas y construir una reducción externa utilizando engranajes, cadena o correas. Debe depender nuevamente de tu eje de salida deseado, relación de engranajes deseada y, para el UltraPlanetary, si deseas la capacidad de intercambiar piezas sobre la marcha.
fr_ca: Pour les petites réductions, il peut être plus économique de choisir un moteur que vous possédez déjà et de construire une réduction externe à l'aide d'engrenages, de chaînes ou de courroies. Le choix doit se faire en fonction de l'arbre de sortie désiré, du rapport de transmission souhaité et, pour l'UltraPlanetary, de la possibilité de remplacer les pièces à la volée.
zh_cn: 对于小型减速机来说，选择一个你已经拥有的电机，然后使用齿轮、链条或皮带制造一个外部减速机可能会更经济。对于 UltraPlanetary，您还需要考虑您所需的输出轴、所需的齿轮比，以及是否需要随时更换部件的能力。

source: `goBILDA Yellow Jacket 520x Series 12V DC <https://www.gobilda.com/yellow-jacket-planetary-gear-motors>`_ (5201, 5202, 5203, and 5204 series, e.g. 5201-0002-0026)
fr_ca: `goBILDA Yellow Jacket 520x Series 12V DC <https://www.gobilda.com/yellow-jacket-planetary-gear-motors>`_ (5201, 5202, 5203, et 5204 series, e.g. 5201-0002-0026)
zh_cn: `goBILDA Yellow Jacket 520x Series 12V DC <https://www.gobilda.com/yellow-jacket-planetary-gear-motors>`_（5201、5202、5203 和 5204 系列，例如 5201-0002-0026）

source: `goBILDA 5000 Series 12V DC <https://www.gobilda.com/5000-series-motors>`_ (e.g. 5000-0002-4008)
zh_cn: `goBILDA 5000 系列 12 伏直流 <https://www.gobilda.com/5000-series-motors>`_ （例如 5000-0002-4008）

source: 12 V motors are strictly controlled by FTC rules. As of 2020-2021 season, the only FTC legal motors are the following ones:
ro_ro: Motoarele de 12V sunt restricționate de regulile FTC. Ca din sezonul 2020-2021, singurele motoare legale în FTC sunt următoarele:

source: TETRIX 12V DC Motor (`regular <https://www.pitsco.com/TETRIX-DC-Gear-Motor>`_, `Torquenado <https://www.pitsco.com/TETRIX-MAX-TorqueNADO-Motor-with-Encoder/>`_)
ro_ro: Motoarele TETRIX 12V DC (`normal <https://www.pitsco.com/TETRIX-DC-Gear-Motor>`_, `Torquenado <https://www.pitsco.com/TETRIX-MAX-TorqueNADO-Motor-with-Encoder/>`_)

source: `AndyMark NeveRest series 12V DC Motors <https://www.andymark.com/categories/mechanical-gearboxes-gearmotors>`_
ro_ro: `Motoarele AndyMark 12V DC din seria NeveRest <https://www.andymark.com/categories/mechanical-gearboxes-gearmotors>`_

source: Modern Robotics/MATRIX 12V DC Motors (this also includes `goBILDA motors <https://www.gobilda.com/motors/>`_, which are MATRIX motors with a different gearbox)
ro_ro: Motoarele Modern Robotics/MATRIX 12V DC (acestea includ și `motoarele goBILDA <https://www.gobilda.com/motors/>`_, care sunt motoare MATRIX cu o cutie de viteze diferită)

source: `REV Robotics HD Hex 12V DC Motor <https://www.revrobotics.com/rev-41-1301/>`_
ro_ro: `Motorul REV Robotics HD Hex 12V DC <https://www.revrobotics.com/rev-41-1301/>`_

source: `REV Robotics Core Hex 12V DC Motor <https://www.revrobotics.com/rev-41-1300/>`_
ro_ro: `Motorul REV Robotics Core Hex 12V DC <https://www.revrobotics.com/rev-41-1300/>`_

source: With the exception of :term:`REV Core Hex Motor <Core Hex Motor>`, which is discussed separately, all other motors above have very similar structures. They consist of the following components.
ro_ro: Cu excepția motorului :term:`REV Core Hex Motor <Core Hex Motor>`, care este discutat separat, toate celelalte motoare de mai sus au structuri foarte similare. Acestea sunt formate din următoarele componente:

source: **Bare motor**. In all cases above, this is a 12V motor of :term:`RS-555 type <RS-550 Series Motor>`, with free speed around 6,000 RPM and stall current around 10A. The motor specs posted by different vendors might be slightly different, but the difference is mainly due to different testing methods. In real life, the bare motors used by :term:`AndyMark NeveRest motors <NeveRest Motor>`, :term:`REV Robotics HD Hex motors <HD Hex Motor>`, and :term:`goBILDA motors <Yellow Jacket Motor>` are virtually identical. The most reliable specs can be found on the `VEX website <https://motors.vex.com/other-motors/am-neverest>`_.
ro_ro: **Motorul de bază**. În toate cazurile de mai sus, acesta este un motor de 12V de tipul :term:`RS-555 <RS-550 Series Motor>`, cu o viteză de aproximativ 6,000 RPM și pierderea de viteză la 10A. Specificațiile motoarelor postate de furnizori diferiți poate fi ușor diferite, dar diferențele apar în general din cauza metodelor folosite în testare. În viața reală, motoarele de bază folosite de :term:`motoarele AndyMark NeveRest <NeveRest Motor>` , :term:`motoarele REV Robotics HD Hex <HD Hex Motor>` și :term:`motoarele goBILDA <Yellow Jacket Motor>` sunt identice. Cele mai de încredere specificații pot fi găsite pe `site-ul VEX <https://motors.vex.com/other-motors/am-neverest>`_.

source: **Gearbox**. The gearbox is attached to the front of the motor and reduces the speed while increasing the torque. For example, a 20:1 gearbox reduces the speed by a factor of 20, resulting in a no-load speed of around 300RPM. See :term:`Gear Reduction`. A gearbox also contains the output :term:`shaft <Shaft>` (typically 6mm D profile; REV motors use 5mm hex shafts) and mounting holes. The gearbox can also be replaced; this is FTC legal but requires some skill.
ro_ro: **Cutia de viteze**. Cutia de viteze este atașată de partea frontală a motorului și reduce viteza pentru a crește cuplul acestuia. De exemplu, o cutie de viteze cu un raport de 20:1 va reduce viteza de 20 de ori, rezultând într-o viteză fără sarcină de aproximativ 300RPM. Vezi :term:`Reductor`. O cutie de viteze conține :term:`axul <Shaft>` de ieșire (de obicei un profil în D de 6mm; motoarele REV folosesc axuri hexagonale de 5mm) și găurile de prindere. Cutia de viteze poate fi înlocuită, acest lucru fiind legal in FTC, dar necesită îndemânare.

source: There are two kinds of gearboxes: spur and planetary (also known as orbital). Their inner structure and difference is discussed in detail in :doc:`gearbox-anatomy` section. For new teams, it suffices to know that planetary gearboxes are slightly more expensive, but more reliable. Spur gearboxes can strip under shock loads (for example, when your robot hits a wall), requiring you to replace the gearbox. For this reason, it is advised to use planetary gearbox in high-load use cases such as drivetrains.
ro_ro: Există două tipuri de cutii de viteze: planetare (sau orbitale) și pe pinioane. Structura lor internă și diferențele sunt discutate în detaliu în secțiunea :doc:`gearbox-anatomy`. Pentru echipele începătoare, este suficient să știi faptul că angrenajele planetare sunt puțin mai scumpe, dar mai fiabile. Angrenajele pe pinioane se pot rupe sub presiune (de exemplu, când robotul lovește un perete), fiind nevoie de o înlocuire. Din acest motiv, este recomandat să folosești un angrenaj planetar pentru situațiile de sarcini mari, precum șasiurile.

source: Available Spur Gearboxes and Motors
ro_ro: Cutii de viteze cu ax necentrat și motoare disponibile

source: Spur gearboxes are NOT recommended due to their shorter lifespan and lower mechanical resilience compared to planetary gearboxes. If you are purchasing new motors, it is highly suggested to purchase planetary gearbox motors instead. Care should be taken to not put load on the output shaft of a spur gearbox. In particular, spur gear motors should NOT be used in high load applications, such as a drivetrain
ro_ro: Cutiile de viteze cu ax necentrat nu sunt recomandate din cauza unei durate de viață scurte și o rezistență mecanică redusă față de cutiile de viteze planetare. Dacă alegeți să cumpărați motoare noi, este recomandat să cumpărați unele cu o cutie de viteză planetară. Atenție este necesară pentru a nu pune sarcină pe axul unei cutii de viteze cu ax necentrat. În special, motoarele cu astfel de cutii de viteze nu ar trebui folosite in aplicații unde se exercită o sarcină mare asupra lor, cum ar fi un șasiu.

source: Motors with spur gearboxes include :term:`AndyMark NeveRest Classic motors <NeveRest Motor>` (in 40:1 and 60:1 ratios), the :term:`REV HD Hex 40:1 Spur motor <HD Hex Motor>`, and goBILDA 5201 Series Yellow Jacket Spur Gear Motors. All of them offer similar performance and reliability, so your choice is primarily dictated by the convenience of mounting and connecting to the rest of your design (e.g., if you use REV kit, you should probably choose :term:`REV HD Hex motor <HD Hex Motor>`, as it uses the same :term:`5mm hex shaft <Shaft>` as the rest of REV system).
ro_ro: Motoarele cu ax necentrat includ: :term:` motoarele AndyMark NeveRest Classic <NeveRest Motor>` (cu rapoarte de 40:1 și 60:1), :term:`motoarele REV HD Hex 40:1 Spur <HD Hex Motor>` și goBILDA 5201 Series Yellow Jacket Spur Gear Motors. Toate acestea oferă performanțe și fiabilitate similare, așa că alegerea lor este în principal dictată de ușurința de montare și conectare la celelalte elemente din design-ul tău. (de exemplu, dacă folosești un kit REV, ar fi bine să alegi :term:`motorul REV HD Hex <HD Hex Motor>`, deoarece utilizează același :term:`ax hexagonal de 5mm <Shaft>` ca restul elementelor din sistemul REV).

source: goBILDA's 5201 series spur gearboxes are much cheaper than either REV's or Andymark's; whether that's a good or bad thing is up to you. They utilize the rather uncommon (in the FTC world) bullet connection for power. However, these are now discontinued. The output shaft is a 6mm D-shaft.
ro_ro: Cutiile de viteze cu ax necentrat de la motoarele goBILDA 5201 sunt mult mai ieftine decât cele de la REV sau Andymark; dacă asta este bine sau nu rămâne la latitudinea ta. Aceste motoare folosesc conectorul de tip bullet pentru curent, mai puțin întâlnit (cel puțin în lumea FTC). Aceste motoare nu se mai fabrică. Axul de ieșire este unul in D de 6mm.

source: :term:`REV HD Hex Planetary <HD Hex Motor>` 40:1 motor - This motor comes only in a 40:1 ratio, but does use the same connections (JST VH) as the REV Expansion and Control Hub for power which means no adapter cables. The output :term:`shaft <Shaft>` is a 5mm hex :term:`shaft <Shaft>`. :term:`REV UltraHex <UltraHex>` has a 5mm hex :term:`bore <Bore>` running through the middle of a 1/2” hex :term:`shaft <Shaft>`, which makes adapting this motor to any length of :term:`UltraHex`, and by extension, 1/2” hex :term:`shaft <Shaft>`, very easy.
ro_ro: Motorul cu raport 40:1 :term:`REV HD Hex Planetary <HD Hex Motor>` - Acest motor este disponibil doar în raportul 40:1, dar folosește aceiași conectori (JST VH) ca REV Expansion și Control Hub pentru putere, ceea ce înseamnă că nu este necesară utilizarea unor adaptoare. :term:`Axul <Shaft>` de ieșire este un :term:`ax <Shaft>` hexagonal de 5mm.
