Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/motor-guide/gearbox-anatomy.po
Languages: es_mx, fr_ca, zh_cn

source: Gearbox Internals
es_mx: Engranajes internos
fr_ca: Boîtes de vitesses internes
zh_cn: 变速箱内部

source: Fundamentally, a gearbox is just a collection of gears and an enclosure that connects them. Gearboxes have an **output ratio**, the final Gear Reduction between the motor input and the final output :term:`shaft <Shaft>`.
es_mx: Fundamentalmente, un Gearbox/Caja de engranajes no es más que un conjunto de engranajes y una caja que los conecta. Las Gearboxes tienen una **relación de salida**, la reducción final entre la entrada del motor y la salida final del :term:`eje <Shaft>`.
fr_ca: Fondamentalement, une boîte de vitesses est simplement un ensemble d'engrenages et un boîtier qui les relie. Les boîtes de vitesses ont un **rapport de sortie**, la réduction finale entre l'entrée du moteur et l':term:`shaft <Shaft>` de sortie finale.
zh_cn: 从根本上说，变速箱只是一组齿轮和连接它们的外壳。齿轮箱有一个**输出比**，即电机输入和最终输出之间的最终齿轮减速比 :term:`shaft <Shaft>`。

source: Term
es_mx: Término
fr_ca: Définition
zh_cn: 术语

source: Gear Reduction
es_mx: Reducción de engranajes
fr_ca: Réduction des engrenages
zh_cn: 齿轮减速

source: Also known as a gear ratio. In any rotational power transmission system (typically involving motors and :term:`servos <Servo>` in FTC\ |reg|), a gear ratio defines both the number of rotations of the system's input and the number of rotations of the output.
es_mx: También conocida como relación de engranes. En cualquier sistema de transmisión de potencia rotacional (normalmente con motores y :term:`servos <Servo>` en FTC\ |reg|), una relación de engranes define tanto el número de rotaciones de la entrada del sistema como el número de rotaciones de la salida.
fr_ca: Également connu sous le nom de rapport d'engrenage. Dans tout système de transmission de puissance par rotation (impliquant généralement des moteurs et :term:`servos <Servo>` dans FTC\ |reg|), un rapport de transmission définit à la fois le nombre de rotations de l'entrée du système et le nombre de rotations de la sortie.
zh_cn: 也称为齿轮比。在任何旋转动力传输系统中（通常涉及电机和:term:`servos <Servo>` in FTC\ |reg|），齿轮比定义了系统输入的旋转圈数和输出的旋转圈数。

source: For instance, a NeveRest 20 gearmotor consists of an unmodified :term:`NeveRest Motor` and a planetary gearbox that has a gear ratio of 20:1 (or, when spoken, "20 to 1"). This means that in order for the output shaft of the gearbox to rotate 1 time, the input shaft of the motor must rotate 20 times. Gear ratios are one of the most important design considerations about a power transmission component.
es_mx: Por ejemplo, un motorreductor NeveRest 20 consiste en un motor :term:`NeveRest` sin modificar y una caja de engranajes planetarios que tiene una relación de transmisión de 20:1 (o, cuando se habla, "20 a 1"). Esto significa que para que el eje de salida de la caja de cambios gire 1 vez, el eje de entrada del motor debe girar 20 veces. Las relaciones de engranes son una de las consideraciones de diseño más importantes sobre un componente de transmisión de potencia.
fr_ca: Par exemple, un motoréducteur NeveRest 20 se compose d'un :term:`NeveRest Motor` non modifié et d'un réducteur planétaire dont le rapport de transmission est de 20:1 (ou, à l'oral, "20 to 1"). Cela signifie que pour que l'arbre de sortie du réducteur tourne une fois, l'arbre d'entrée du moteur doit tourner 20 fois. Les rapports d'engrenage sont l'une des considérations les plus importantes dans la conception d'un composant de transmission de puissance.
zh_cn: 例如，一个 NeveRest 20 齿轮减速电机由一个未修改的 :term:`NeveRest Motor` 和一个齿轮比为20:1（或称"20比1"）的行星齿轮箱组成。这意味着，为了使齿轮箱的输出轴旋转1次，电机的输入轴必须旋转20次。齿轮比是动力传输组件最重要的设计考虑因素之一。

source: Any motor or servo has two properties: speed and torque (or rotational force). These two properties are inversely proportional, meaning that increasing speed decreases torque, and vice versa. For instance, if one wishes to make a mechanism faster at the expense of torque by doubling the speed of that 20:1 gearbox, they would decrease the gear ratio by a factor of 2. Since 20 divided by 2 is 10, the new desired ratio would be 10:1 (this is referred to as gearing up). However, if one wishes to double torque instead, making the system more powerful and robust at the expense of speed, they would increase the gear ratio by a factor of 2, leaving them with a 40:1 ratio (this is referred to as gearing down).
es_mx: Cualquier motor o servomotor FTC tiene dos propiedades: velocidad y torque (o fuerza de rotación). Estas dos propiedades son inversamente proporcionales, lo que significa que al aumentar la velocidad disminuye el torque y viceversa. Por ejemplo, si se desea que un mecanismo sea más rápido a expensas del torque duplicando la velocidad de esa caja de cambios 20:1, se reduciría la relación de transmisión en un factor de 2. Como 20 dividido por 2 es 10, la nueva relación deseada sería 10:1 (esto se denomina aumentar la relación de transmisión). Sin embargo, si lo que se desea es duplicar el torque, haciendo que el sistema sea más potente y robusto a expensas de la velocidad, se aumentaría la relación de transmisión en un factor de 2, con lo que quedaría una relación de 40:1 (esto se denomina reducir).
fr_ca: Tout moteur ou servo possède deux propriétés : la vitesse et le couple (ou force de rotation). Ces deux propriétés sont inversement proportionnelles, ce qui signifie qu'une augmentation de la vitesse diminue le couple, et vice versa. Par exemple, si l'on souhaite rendre un mécanisme plus rapide au détriment du couple en doublant la vitesse de la boîte de vitesses 20:1, on diminuera le rapport de transmission d'un facteur 2. 20 divisé par 2 étant égal à 10, le nouveau rapport souhaité sera de 10:1 (c'est ce que l'on appelle la démultiplication). Toutefois, si l'on souhaite doubler le couple, ce qui rend le système plus puissant et plus robuste au détriment de la vitesse, il faut augmenter le rapport de transmission d'un facteur 2, ce qui donne un rapport de 40:1 (c'est ce que l'on appelle la démultiplication).

source: The most common ways of gearing up or down are using gearboxes, gears, sprockets and belt-driven pulleys, all of which exist in various sizes.
es_mx: Las formas más comunes de aumentar o reducir la velocidad son los reductores, los engranajes, los piñones y las poleas accionadas por correa, todos ellos disponibles en varios tamaños.
fr_ca: Les moyens les plus courants d'augmenter ou de réduire la vitesse sont les boîtes de vitesses, les engrenages, les pignons et les poulies à courroie, qui existent tous en différentes tailles.
zh_cn: 最常见的升档或降档方法是使用齿轮箱、齿轮、链轮和皮带驱动轮，所有这些都有不同的尺寸。

source: In FTC, gearboxes may be more common than you think. Nearly every motor and servo has a gearbox attached or built-in to it. These gearboxes are either spur or planetary.
es_mx: En FTC, las cajas de engranajes pueden ser más comunes de lo que crees. Casi todos los motores y servomotores tienen una caja de engranajes incorporada. Estos reductores pueden ser de engranajes rectos o planetarios.
fr_ca: En FTC, les réducteurs sont plus courants que vous ne le pensez. Presque tous les moteurs et servomoteurs ont un réducteur attaché ou intégré. Ces réducteurs sont soit à engrenages droits, soit à engrenages planétaires.

source: Spur Gearboxes
es_mx: Gearboxes de engranajes rectos
fr_ca: Réducteurs à engrenages droits
zh_cn: 正齿轮箱

source: Spur gearbox
es_mx: Gearbox de engranajes rectos
fr_ca: Réducteur à roues droites
zh_cn: 正齿轮箱

source: A spur gearbox has spur gears which are stacked on top of each other. Gear reduction is achieved through different size gears on the same plane.
es_mx: Una gearbox de engranajes rectos tiene engranajes rectos apilados unos sobre otros. La reducción de engranajes se consigue mediante engranajes de distinto tamaño en el mismo plano.
fr_ca: Un réducteur à engrenages droits comporte des engrenages droits empilés les uns sur les autres. La réduction de la vitesse est obtenue par des engrenages de tailles différentes sur le même plan.
zh_cn: 正齿轮变速箱的正齿轮相互叠加。通过同一平面上不同尺寸的齿轮实现齿轮减速。

source: Spur gearboxes are an arrangement of :term:`gear ratios <Gear Reduction>`, often stacked to achieve a large compound ratio (e.g. 40:1). Each individual ratio only has two :term:`gears <Gear>`- one may be 8:1, another may be 5:1, but the final ratio will be 40:1. These gearboxes are used in the AndyMark NeveRest Classic series and goBILDA's 5201 series motors, as well as :term:`REV HD Hex Motors <HD Hex Motor>`. Due to the nature of how these gearboxes are built, each reduction only has a few teeth from each :term:`gear <Gear>` engaged, and those teeth carry the entire load of the gearbox. It's easy to damage a spur gearbox from shock load, and if one :term:`gear <Gear>` breaks, the entire gearbox will stop functioning.
es_mx: Las gearboxes de engranajes rectos son un conjunto de :term:`relaciones de engranajes <Gear Reduction>`, a menudo apiladas para lograr una gran relación compuesta (por ejemplo, 40:1). Cada relación individual sólo tiene dos :term:`engranes <Gear>`- una puede ser de 8:1, otra de 5:1, pero la relación final será de 40:1. Estos reductores se utilizan en la serie NeveRest Classic de Andymark y en los motores de la serie 5201 de goBILDA, así como en los :term:`REV HD Hex Motors <HD Hex Motor>`. Debido a la naturaleza de cómo están construidas estas gearboxes, cada reducción sólo tiene unos pocos dientes de cada :term:`engrane <Gear>` engranados, y esos dientes soportan toda la carga de la gearbox . Es fácil dañar una gearbox de engranajes rectos por una carga de choque, y si se rompe un :term:`engrane <Gear>`, toda la caja de engranajes dejará de funcionar.
fr_ca: Les boîtes de vitesses droites sont un arrangement de :term:`rapports d'engrenages <Gear Reduction>`, souvent empilés pour obtenir un grand rapport composé (par exemple 40:1). Chaque rapport individuel ne comporte que deux :term:`réducteurs <Gear>` - l'un peut être de 8:1, l'autre de 5:1, mais le rapport final sera de 40:1. Ces réducteurs sont utilisés dans la série AndyMark NeveRest Classic et les moteurs de la série 5201 de goBILDA, ainsi que :term:`REV HD Hex Motors <HD Hex Motor>`. En raison de la nature de la construction de ces réducteurs, chaque réduction n'a que quelques dents de chaque :term:`réducteur <Gear>` engagées, et ces dents supportent la totalité de la charge du réducteur. Il est facile d'endommager un réducteur à engrenages cylindriques sous l'effet des chocs, et si un :term:`réducteur <Gear>` se casse, c'est l'ensemble du réducteur qui cesse de fonctionner.

source: Using spur gearboxes on high-load applications such as drivetrains or arms is not recommended. Instead, use planetary gearboxes.
es_mx: No se recomienda utilizar reductores de engranajes rectos en aplicaciones de alta carga, como chasises o brazos. En su lugar, utilice reductores planetarios.
fr_ca: Il n'est pas recommandé d'utiliser des réducteurs à engrenages droits pour les applications à forte charge telles que les chaînes cinématiques ou les bras. Il est préférable d'utiliser des réducteurs planétaires.
zh_cn: 不建议在传动系统或机械臂等高负荷应用中使用正齿轮变速箱。相反，应使用行星齿轮箱。

source: An example spur gearbox
es_mx: Un ejemplo de gearbox de engranajes rectos
fr_ca: Un exemple de réducteur à engrenages droits
zh_cn: 正齿轮箱示例

source: Example of a spur gearbox inside a servo. Note how all gears mesh with only one other gear.
es_mx: Ejemplo de un engranaje recto dentro de un servo. Observa cómo todos los engranajes engranan sólo con otro engranaje.
fr_ca: Exemple d'un réducteur à engrenages droits à l'intérieur d'un servo. Notez que tous les engrenages ne s'engrènent qu'avec un seul autre engrenage.

source: Advantages of Spur Gearboxes
es_mx: Ventajas de los Gearboxes de Engranajes Rectos
fr_ca: Avantages des réducteurs à engrenages droits
zh_cn: 正齿轮箱的优点

source: Spur gearboxes are NOT recommended for motors due to their shorter lifespan and lower mechanical resilience compared to planetary gearboxes. If you are purchasing new motors, it is highly suggested to purchase planetary gearbox motors instead. Care should be taken to not put load on the output shaft of a spur gearbox. In particular, spur gear motors should NOT be used in high load applications, such as a drivetrain.
es_mx: Las cajas de engranajes rectos NO se recomiendan debido a su menor vida útil y resistencia mecánica en comparación con las cajas de engranajes planetarios. Si va a comprar motores nuevos, se recomienda encarecidamente adquirir motores con caja de engranajes planetarios. Se debe tener cuidado de no poner carga en el eje de salida de una caja de engranajes rectos. En particular, los motorreductores de engranajes rectos NO deben utilizarse en aplicaciones de alta carga, como un chasis.
fr_ca: Les réducteurs à engrenages droits ne sont PAS recommandés pour les moteurs en raison de leur durée de vie plus courte et de leur résistance mécanique plus faible que celle des réducteurs planétaires. Si vous achetez de nouveaux moteurs, il est fortement conseillé d'acheter des moteurs à réducteur planétaire. Il faut veiller à ne pas mettre de charge sur l'arbre de sortie d'un réducteur à engrenages droits. En particulier, les motoréducteurs à engrenages droits ne doivent PAS être utilisés dans des applications à forte charge, telles qu'un châssis.

source: Generally, spur gearboxes are cheaper than planetary gearboxes. However, in FTC that price change is often minimal. An HD Hex Motor + UltraPlanetary gearbox kit from REV is only ~$10 more than an HD Hex Motor + Spur gearbox, and offers significantly more flexibility/customizability.
es_mx: Por lo general, las cajas de engranajes rectos son más baratos que los planetarios. Sin embargo, en FTC ese cambio de precio suele ser mínimo. Un kit de un HD Hex Motor + Ultraplanetary gearbox kit de REV sólo cuesta ~10 $ más que un HD Hex Motor + Caja de engranajes rectos, y ofrece mucha más flexibilidad/personalización.
fr_ca: En général, les réducteurs à engrenages droits sont moins chers que les réducteurs planétaires. Toutefois, en matière de FTC, cette différence de prix est souvent minime. Un kit moteur hexagonal HD + réducteur ultraplanétaire de REV ne coûte que ~10 $ de plus qu'un moteur hexagonal HD + réducteur à engrenages droits, et offre beaucoup plus de flexibilité et de possibilités de personnalisation.

source: Spur gearboxes from different vendors are not interchangeable. However, they are comparable and practically indistinguishable in performance. The main thing to consider here is your **desired reduction, your desired motor connections, and your desired output shaft type**.
es_mx: Los reductores de engranajes rectos de distintos fabricantes no son intercambiables. Sin embargo, son comparables y prácticamente indistinguibles en rendimiento. Lo principal a tener en cuenta aquí es su **reducción deseada, las conexiones de motor deseadas y el tipo de eje de salida deseado**.
fr_ca: Les réducteurs à engrenages droits de différents fournisseurs ne sont pas interchangeables. Cependant, leurs performances sont comparables et pratiquement impossibles à distinguer. L'élément principal à prendre en compte est la réduction ** souhaitée, les connexions du moteur souhaitées et le type d'arbre de sortie souhaité**.
zh_cn: 不同供应商生产的正齿轮箱不能互换。不过，它们的性能相当，几乎没有差别。这里需要考虑的主要因素是**所需的减速器、所需的电机连接和所需的输出轴类型**。

source: Planetary Gearboxes
es_mx: Gearboxes planetarios
fr_ca: Réducteurs planétaires
zh_cn: 行星齿轮箱

source: Planetary gearboxes use a more complex system of gears to achieve a robust reduction in a compact space. In automotive engineering, planetary gear sets can achieve a few different ratios without changing gear size, but all planetary gearboxes that you will see in FTC only achieve one gear ratio.
es_mx: Los gearboxes planetarios utilizan un sistema más complejo de engranajes para lograr una reducción robusta en un espacio compacto. En ingeniería de automoción, los juegos de engranajes planetarios pueden alcanzar unas cuantas relaciones diferentes sin cambiar el tamaño del engranaje, pero todos los reductores planetarios que verás en FTC solo alcanzan una relación de engranes.
fr_ca: Les réducteurs planétaires utilisent un système d'engrenages plus complexe pour obtenir une forte réduction dans un espace compact. Dans l'ingénierie automobile, les trains d'engrenages planétaires peuvent atteindre plusieurs rapports différents sans changer la taille des engrenages, mais tous les réducteurs planétaires que vous verrez en FTC n'atteignent qu'un seul rapport de vitesse.
zh_cn: 行星齿轮箱使用更复杂的齿轮系统，在紧凑的空间内实现强劲的减速。在汽车工程中，行星齿轮组可以在不改变齿轮尺寸的情况下实现几种不同的传动比，但您在 FTC 中看到的所有行星齿轮箱都只能实现一种传动比。

source: Planetary Gear
es_mx: Engranaje Planetario
fr_ca: Engrenage planétaire
zh_cn: 行星齿轮

source: Planetary gearing consists of a center gear (sun gear) which has smaller gears (planet gears) revolving around it. The outer radius has a ring gear which holds the other gears in place.
es_mx: Los engranajes planetarios constan de un engranaje central (engranaje solar) que tiene engranajes más pequeños (engranajes planetarios) girando a su alrededor. El radio exterior tiene una corona dentada que sujeta los demás engranajes.
fr_ca: Les engrenages planétaires sont constitués d'un engrenage central (roue solaire) autour duquel tournent des engrenages plus petits (planétaires). Le rayon extérieur comporte une couronne qui maintient les autres engrenages en place.
zh_cn: 行星齿轮传动由一个中心齿轮（太阳齿轮）和围绕其旋转的较小齿轮（行星齿轮）组成。外半径有一个环形齿轮，用于固定其他齿轮。

source: Planetary gearboxes are used in the AndyMark NeveRest Orbital and Hex gearmotors, REV HD Hex UltraPlanetary motors, and goBILDA's wide selection of :term:`Yellow Jacket planetary gear motors <Yellow Jacket Motor>`. As you can see from the graphic below, there are more teeth meshing per stage than in the spur gearbox.
es_mx: Las cajas de engranajes planetarios se utilizan en los motorreductores AndyMark NeveRest Orbital y Hex, en los motores REV HD Hex UltraPlanetary y en la amplia selección de motores de engranajes planetarios de goBILDA :term:`Yellow Jacket <Yellow Jacket Motor>`. Como puede verse en el gráfico siguiente, hay más dientes engranados por etapa que en el reductor de engranajes rectos.
fr_ca: Les réducteurs planétaires sont utilisés dans les moteurs AndyMark NeveRest Orbital et Hex gearmotors, REV HD Hex UltraPlanetary motors, et dans la large sélection de goBILDA :term:`Yellow Jacket planetary gear motors <Yellow Jacket Motor>`. Comme vous pouvez le voir sur le graphique ci-dessous, il y a plus de dents qui s'engrènent par étage que dans le réducteur à engrenages droits.

source: A planetary gearbox diagram
es_mx: Esquema de un engranaje planetario
fr_ca: Schéma d'une boite de vitesse planétaire
zh_cn: 行星齿轮箱示意图

source: Example of a planetary gearbox stage. Note how the sun gear meshes with more than one gear.
es_mx: Ejemplo de una etapa de engranaje planetario. Observe cómo el engranaje planetario engrana con más de un engranaje.
fr_ca: Exemple d'un étage de réducteur planétaire. Notez que le planétaire s'engrène avec plus d'un engrenage.
zh_cn: 行星齿轮箱级示例。请注意太阳齿轮如何与多个齿轮啮合。

source: Advantages of Planetary Gearboxes
es_mx: Ventajas de los Gearboxes Planetarios
fr_ca: Avantages des boites de vitesse planétaire
zh_cn: 行星齿轮箱的优势

source: Backlash is lower than spur gearbox equivalents. Backlash is defined as the clearance or lost motion caused by gaps between parts. This can easily be explained through putting a wheel or gear on a motor shaft and lightly rotating it. The part should be able to wiggle around a little without having considerable force imparted on it. This is caused because it is impossible for the gear teeth inside the gearbox to mesh perfectly, and is the same for :term:`chain <Chain>` and :term:`sprockets <Sprocket>`, or any other form of power transmission. However, planetary gearboxes have less backlash as they have less stages of gears.
es_mx: El Backlash es inferior a la de los engranajes rectos equivalentes. El backlash se define como la reaccion o pérdida de movimiento causada por los espacios entre las piezas. Esto puede explicarse fácilmente colocando una rueda o un engranaje en el eje de un motor y haciéndolo girar ligeramente. La pieza debe poder moverse un poco sin que se le aplique una fuerza considerable. Esto se debe a que es imposible que los dientes del engranaje dentro de la caja de cambios engranen perfectamente, y es lo mismo para :term:`cadenas <Chain>` y :term:`piñones <Sprocket>`, o cualquier otra forma de transmisión de potencia. Sin embargo, los gearboxes planetarios tienen menos backlash porque tienen menos etapas de engranajes.
fr_ca: Le jeu est inférieur à celui des réducteurs à engrenages droits équivalents. Le jeu est défini comme le jeu ou la perte de mouvement causé par les espaces entre les pièces. On peut facilement l'expliquer en plaçant une roue ou un engrenage sur l'arbre d'un moteur et en le faisant tourner légèrement. La pièce doit pouvoir bouger un peu sans qu'une force considérable ne lui soit imposée. Ce phénomène est dû à l'impossibilité pour les dents de l'engrenage à l'intérieur du réducteur de s'engrener parfaitement, et il en va de même pour :term:`chaîne <Chain>` et :term:`pignons <Sprocket>`, ou pour toute autre forme de transmission de puissance. Toutefois, les réducteurs planétaires ont moins de jeu car ils comportent moins d'étages d'engrenages.
zh_cn: 反向间隙低于正齿轮箱。间隙是指零件之间的间隙或因间隙造成的运动损失。将一个轮子或齿轮放在电机轴上并轻轻旋转，就可以很容易地解释这一点。在没有相当大的力的情况下，零件应该可以稍微晃动一下。这是因为齿轮箱内的齿轮齿不可能完全啮合，这对于 :term:`chain <Chain>` 和 :term:`sprockets <Sprocket>` 或任何其他形式的动力传输都是一样的。不过，行星齿轮箱的齿轮级数较少，因此反向间隙较小。

source: Efficiency is better than spur gearboxes. A typical two-stage spur gearbox is about 85% efficient, whereas most two stage planetary gearboxes are 94% efficient.
es_mx: La eficiencia es superior a la de los gearboxes de engranajes rectos. Una caja de engranajes rectos de dos etapas tiene un rendimiento típico del 85%, mientras que la mayoría de las cajas de engranajes planetarios de dos etapas tienen un rendimiento del 94%.
fr_ca: Le rendement est supérieur à celui des réducteurs à engrenages droits. Un réducteur à engrenages droits à deux étages typique a un rendement d'environ 85 %, alors que la plupart des réducteurs planétaires à deux étages ont un rendement de 94 %.
zh_cn: 效率优于正齿轮齿轮箱。典型的两级正齿轮箱效率约为 85%，而大多数两级行星齿轮箱的效率为 94%。

source: Load capacity is higher for planetary gearboxes. This is due to having multiple teeth engaged per stage, which spreads the load.
es_mx: La capacidad de carga es mayor en los gearboxes planetarios. Esto se debe a que tienen varios dientes engranados por etapa, lo que reparte la carga.
fr_ca: La capacité de charge est plus élevée pour les réducteurs planétaires. Cela est dû au fait que plusieurs dents sont engagées par étage, ce qui répartit la charge.
zh_cn: 行星齿轮箱的负载能力更高。这是由于每级有多个齿啮合，从而分散了负载。

source: This means planetary gearboxes will not break as easily when used in high-load applications such as drivetrains.
es_mx: Esto significa que los reductores planetarios no se rompen tan fácilmente cuando se utilizan en aplicaciones de alta carga, como los chasises.
fr_ca: Cela signifie que les réducteurs planétaires ne se cassent pas aussi facilement lorsqu'ils sont utilisés dans des applications à forte charge telles que les transmissions.
zh_cn: 这意味着行星齿轮箱在用于传动系统等高负荷应用时不会轻易损坏。
