Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/motor-guide/gearbox-anatomy.po
Languages: es_mx, fr_ca, zh_cn

source: Any FTC motor or servo has two properties: speed and torque (or rotational force). These two properties are inversely proportional, meaning that increasing speed decreases torque, and vice versa. For instance, if one wishes to make a mechanism faster at the expense of torque by doubling the speed of that 20:1 gearbox, they would decrease the gear ratio by a factor of 2. Since 20 divided by 2 is 10, the new desired ratio would be 10:1 (this is referred to as gearing up). However, if one wishes to double torque instead, making the system more powerful and robust at the expense of speed, they would increase the gear ratio by a factor of 2, leaving them with a 40:1 ratio (this is referred to as gearing down).
zh_cn: 任何 FTC 马达或舵机都有两个特性：速度和扭矩（或旋转力）。这两种特性成反比，即速度增加扭矩减小，反之亦然。例如，如果有人希望通过将20:1变速箱的速度提高一倍来加快机械装置的速度，但却牺牲了扭矩，那么他就会将齿轮比降低2倍。由于20除以2等于0，因此新的理想齿轮比将是10:1（这被称为齿轮升速）。但是，如果希望将扭矩增加一倍，在牺牲速度的情况下使系统更强大、更坚固，则需要将齿轮比增加2倍，使齿轮比为40:1（这被称为降档）。

source: In FTC, gearboxes may be more common than you think - every motor has a gearbox attached to it. These gearboxes are one of the following two types: spur or planetary. Below we give a detailed analysis of each of these gearbox types. **Just for clarification, the gearboxes below are separate from the base motor.**
zh_cn: 在 FTC 中，齿轮箱可能比您想象的还要常见--每台电机上都有一个齿轮箱。这些齿轮箱有以下两种类型：正齿轮箱或行星齿轮箱。下面我们将对每种齿轮箱类型进行详细分析。**为说明起见，以下齿轮箱与基本电机是分开的。

source: Spur gearboxes are an arrangement of :term:`gear ratios <Gear Reduction>`, often stacked to achieve a large compound ratio (e.g. 40:1). Each individual ratio only has two :term:`gears <Gear>`- one may be 8:1, another may be 5:1, but the final ratio will be 40:1. These gearboxes are used in the Andymark NeveRest Classic series and goBILDA's 5201 series motors, as well as :term:`REV HD Hex Motors <HD Hex Motor>`. Due to the nature of how these gearboxes are built, each reduction only has a few teeth from each :term:`gear <Gear>` engaged, and those teeth carry the entire load of the gearbox. It's easy to damage a spur gearbox from shock load, and if one :term:`gear <Gear>` breaks, the entire gearbox will stop functioning.
zh_cn: 正齿轮箱由 :term:` 齿轮比 <Gear Reduction>` 排列而成，通常叠加以实现较大的复合比（例如 40:1）。每个单独的传动比只有两个 :term:`gear <Gear>`，一个可能是 8:1，另一个可能是 5:1，但最终传动比为 40:1。这些齿轮箱用于 Andymark NeveRest Classic 系列和 goBILDA 的 5201 系列电机，以及 :term:`REV HD Hex Motors <HD Hex Motor>`。由于这些变速箱的构造性质，每个减速机只有 :term:`gear <Gear>` 的几个齿啮合，而这些齿承受着变速箱的全部负荷。正齿轮箱很容易因冲击负荷而损坏，如果一个 :term:`gear <Gear>` 坏了，整个齿轮箱就会停止工作。

source: Example of a spur gearbox. Note how all gears mesh with only one other gear.
zh_cn: 正齿轮箱示例。请注意所有齿轮都只与一个齿轮啮合。

source: Generally, spur gearboxes are cheaper than planetary gearboxes. However, in FTC that price change is often minimal. A 20:1 planetary gearbox from REV is only $4 more than a spur 20:1
zh_cn: 一般来说，正齿轮变速箱比行星齿轮变速箱便宜。然而，在 FTC 中，这种价格变化往往微乎其微。REV 的20:1行星齿轮箱只比20:1正齿轮箱贵4美元。

source: Planetary gearboxes are used in the Andymark Orbital series, some REV HD Hex Planetary and UltraPlanetary Motors and goBILDA's wide selection of :term:`planetary gear motors <Yellow Jacket Motor>`. Additionally, AndyMark sells a few aftermarket planetary gearboxes called NeveRest Sport and 57 Sport. As you can see from the graphic below, there are more teeth meshing per stage than in the spur gearbox.
zh_cn: 行星齿轮箱用于 Andymark Orbital 系列、一些 REV HD Hex 行星和 UltraPlanetary 电机以及 goBILDA 的多种 :term:`planetary gear motors <Yellow Jacket Motor>`。此外，AndyMark 还销售一些名为 NeveRest Sport 和 57 Sport 的售后行星齿轮箱。从下图中可以看出，每级啮合的齿数多于正齿轮变速箱。
