Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/motor-guide/motor-glossary.po
Languages: es_mx, fr_ca, zh_cn

source: Motor Glossary
es_mx: Glosario del motor
fr_ca: Glossaire des moteurs
zh_cn: 电机术语表

source: Core Hex Motor
fr_ca: Moteur hexagonal à noyau
zh_cn: Core Hex电机

source: The Core Hex Motor, sold by REV, is different from the standard :term:`RS-555 series motors <RS-550 Series Motor>` that are generally used by FTC\ |reg| teams. It features a 90 degree orientation and does not contain an output shaft. Thus, teams will have to cut 5 mm hex shaft to length as needed. The Core Hex motor has a slow gear ratio (72:1), and is much less powerful than the RS-555 series motors.
es_mx: El motor Core Hex, vendido por REV, es diferente de los motores estándar de la serie :term:`RS-555 <RS-550 Series Motor>` que suelen utilizar los equipos de FTC. Tiene una orientación de 90 grados y no contiene un eje de salida. Por lo tanto, los equipos tendrán que cortar el eje hexagonal de 5 mm a la longitud necesaria. El motor Core Hex tiene una relación de transmisión lenta (72:1), y no es tan potente como el motor de la serie RS-555.
fr_ca: Le Core Hex Motor, vendu par REV, est différent des moteurs standard :term:`RS-555 series <RS-550 Series Motor>` généralement utilisés par les équipes FTC. Il est orienté à 90 degrés et ne contient pas d'arbre de sortie. Les équipes devront donc couper un arbre hexagonal de 5 mm à la longueur voulue. Le moteur Core Hex a un rapport de démultiplication lent (72:1) et est beaucoup moins puissant que les moteurs de la série RS-555.

source: We advise teams to go against the Basic Bot Guide provided by *FIRST*\ |reg|, as Core Hex Motors should NOT be used to power drivetrains.
es_mx: Aconsejamos a los equipos que vayan en contra de la Guía Básica de Bot proporcionada por *FIRST* |reg|, ya que los Motores Core Hex NO deben usarse para alimentar chasises.
fr_ca: Nous conseillons aux équipes d'aller à l'encontre du Basic Bot Guide fourni par *FIRST*\ |reg|, car les Core Hex Motors ne doivent PAS être utilisés pour alimenter les châssis.
zh_cn: 我们建议参赛队不要使用 *FIRST*\ |reg| 提供的《基本机器人指南》，因为 Core Hex 电机不应被用于驱动传动系统。

source: A REV Robotics Core Hex motor
es_mx: Un motor REV Robotics Core Hex
fr_ca: Un moteur REV Robotics Core Hex
zh_cn: 一个 REV 机器人 Core Hex 电机

source: HD Hex Motor
es_mx: Motor hexagonal HD
fr_ca: Moteur hexagonal HD
zh_cn: HD Hex电机

source: The HD Hex motor, sold by REV Robotics, is a :term:`RS-555 series motor <RS-550 Series Motor>` with spur gear and planetary gearbox options. The motor has a 5mm hex output shaft compatible with REV's motion system.
es_mx: El motor HD Hex, comercializado por REV Robotics, es un motor de la serie :term:`RS-555 <RS-550 Series Motor>` con opciones de engranaje recto y planetario. El motor tiene un eje de salida hexagonal de 5 mm compatible con el sistema de movimiento de REV.
fr_ca: Le moteur HD Hex, vendu par REV Robotics, est un :term:`moteur de la série RS-555 <RS-550 Series Motor>` avec des options d'engrenage droit et d'engrenage planétaire. Le moteur possède un arbre de sortie hexagonal de 5 mm compatible avec le système de mouvement REV.
zh_cn: REV Robotics 销售的 HD Hex 电机是一种 :term:`RS-555 系列电机 <RS-550 Series Motor>` ，有正齿轮和行星齿轮箱可供选择。该电机的 5 毫米六角输出轴与 REV 运动系统兼容。

source: A REV Robotics HD Hex motor
es_mx: Un motor REV Robotics HD Hex
fr_ca: Un moteur REV Robotics HD Hex
zh_cn: 一个 REV Robotics HD Hex 电机

source: NeveRest Motor
es_mx: Motor NeveRest
fr_ca: Moteur NeveRest
zh_cn: NeveRest 电机

source: The NeveRest Motor, sold by AndyMark, is a :term:`RS-555 series motor <RS-550 Series Motor>` that is available in spur gear and planetary options. It has a 6 mm D-shaft output.
es_mx: El motor NeveRest, vendido por AndyMark, es un motor :term:`RS-555 series <RS-550 Series Motor>` que está disponible en opciones de engranaje recto y planetario. Tiene una salida de eje D de 6 mm.
fr_ca: Le moteur NeveRest, vendu par AndyMark, est un :term:`moteur de la série RS-555 <RS-550 Series Motor>` disponible en version à engrenage droit et en version planétaire. Il est doté d'un arbre de sortie en D de 6 mm.

source: Yellow Jacket Motor
es_mx: Motor Yellow Jacket
fr_ca: Moteur Yellow Jacket
zh_cn: Yellow Jacket电机

source: Yellow Jacket motors are the :term:`RS-555 series motor <RS-550 Series Motor>` and :term:`planetary gearbox <Planetary Gear>` sold by goBILDA. They come with a 6 mm D-shaft (5202 series) or 8 mm REX shaft (5203/5204 series) and are available in many different :term:`gear ratios <Gear Reduction>` from 3.7:1 up to 188:1.
es_mx: Los motores Yellow Jacket son el motor :term:`RS-555 series <RS-550 Series Motor>` y la :term:`caja de engranajes planetario <Planetary Gear>` comercializados por goBILDA. Vienen con un eje D de 6 mm (serie 5202) o un eje REX de 8 mm (series 5203/5204) y están disponibles en muchas :term:`relación de engranajes<Gear Reduction>` diferentes, desde 3,7:1 hasta 188:1.
fr_ca: Les moteurs Yellow Jacket sont les :term:`moteurs de la série RS-555 <RS-550 Series Motor>` et les :term:`réducteurs planétaires <Planetary Gear>` vendus par goBILDA. Ils sont livrés avec un arbre D de 6 mm (série 5202) ou un arbre REX de 8 mm (série 5203/5204) et sont disponibles dans de nombreux :term:`rapports d'engrenage <Gear Reduction>` différents, de 3,7:1 à 188:1.

source: A Yellow Jacket motor
es_mx: Un motor Yellow Jacket
fr_ca: Un moteur Yellow Jacket
zh_cn: 一个Yellow Jacket电机

source: UltraHex is 1/2" aluminum hex :term:`shafting <Shaft>` sold by REV Robotics. There is an inner 5 mm hex :term:`bore <Bore>` in the middle, which allows compatibility with REV's 5 mm hex shaft motion system. The 5mm hex bore also allows for a 1/4-20 or M6 screw to be tapped into it. 1/2" hex is also compatible with many FRC\ |reg| vendors.
es_mx: UltraHex es un eje hexagonal de aluminio de 1/2" de :term:`eje <Shaft>` vendido por REV Robotics. Tiene un orificio interior hexagonal de 5 mm <Bore> en el centro, que permite la compatibilidad con el sistema de movimiento de eje hexagonal de 5 mm de REV. El agujero hexagonal de 5 mm también permite roscar en él un tornillo de 1/4-20 o M6. El hexágono de 1/2" también es compatible con muchos proveedores de FRC\ |reg|.
fr_ca: UltraHex est un :term:`shafting <Shaft>` hexagonal en aluminium de 1/2" vendu par REV Robotics. Il comporte un :term:`alésage hexagonal de 5 mm <Bore>` au milieu, qui permet la compatibilité avec le système de mouvement de l'arbre hexagonal de 5 mm de REV. L'alésage hexagonal de 5 mm permet également le taraudage d'une vis 1/4-20 ou M6. L'alésage hexagonal de 1/2" est également compatible avec de nombreux fournisseurs de FRC\ |reg|.
zh_cn: UltraHex 是 REV Robotics 出售的 1/2" 铝质六角 :term:`轴系 <Shaft>` 。中间有一个 5 毫米内六角 :term:`bore <Bore>` ，可与 REV 的 5 毫米内六角轴运动系统兼容。5 毫米内六角孔还可在其中插入 1/4-20 或 M6 螺丝。1/2 "内六角也与许多 FRC\ |reg|供应商兼容。

source: A piece of ultrahex shaft
es_mx: Un trozo de eje ultrahex
fr_ca: Un morceau de manche ultrahex
zh_cn: 一根UltraHex轴

source: RS-550 Series Motor
es_mx: Motor Serie RS-550
fr_ca: Moteur de la série RS-550
zh_cn: RS-550 系列电机

source: The RS-555 series motor is the standard motor in FTC. It forms the base for the :term:`AndyMark NeveRest <NeveRest Motor>`, :term:`REV HD Hex <HD Hex Motor>`, and :term:`goBILDA Yellow Jacket <Yellow Jacket Motor>` motors.
es_mx: El motor de la serie RS-555 es el motor estándar de FTC. Constituye la base de los motores :term:`Andymark NeveRest <NeveRest Motor>`, :term:`REV HD Hex <HD Hex Motor>` y :term:`goBILDA Yellow Jacket <Yellow Jacket Motor>`.
fr_ca: Le moteur de la série RS-555 est le moteur standard de FTC. Il constitue la base des moteurs :term:`AndyMark NeveRest <NeveRest Motor>`, :term:`REV HD Hex <HD Hex Motor>`, et :term:`goBILDA Yellow Jacket <Yellow Jacket Motor>`.

source: A RS-555 motor, in the form of a bare NeveRest motor
es_mx: Un motor RS-555, en forma de solo un motor NeveRest
fr_ca: Un moteur RS-555, sous la forme d'un moteur NeveRest nu
zh_cn: 一个 RS-555 马达，采用裸 NeveRest 马达的形式

source: The Core Hex Motor, sold by REV, is different from the standard :term:`RS-555 series motors <RS-550 Series Motor>` that are generally used by FTC\ |reg| teams. It features a 90 degree orientation and does not contain an output shaft. Thus, teams will have to cut 5 mm hex shaft to length as needed. The Core Hex motor has a slow gear ratio (72:1), and is not as powerful as the RS-555 series motor.
zh_cn: REV 出售的 Core Hex 电机不同于 FTC | |reg| 队伍普遍使用的标准 :term:`RS-555 系列电机 <RS-550 Series Motor>` 。它的特点是方向呈 90 度，不包含输出轴。因此，参赛队必须根据需要切割 5 毫米六角轴。Core Hex 电机的齿轮比（72:1）较慢，功率不如 RS-555 系列电机大。

source: The NeveRest Motor, sold by AndyMark, is a :term:`RS-555 series motor <RS-550 Series Motor>` that is available in spur gear and planetary options. It has a 6mm D-shaft output compatible with Actobotics motion system.
zh_cn: 由 AndyMark 销售的 NeveRest 电机是一种 :term:`RS-555 系列电机 <RS-550 Series Motor>` ，有正齿轮和行星齿轮两种选择。它有一个与 Actobotics 运动系统兼容的 6 毫米 D 轴输出。

source: Yellow Jacket motors are the :term:`RS-555 series motor <RS-550 Series Motor>` and :term:`planetary gearbox <Planetary Gear>` sold by goBILDA. It has a :term:`6mm D-shaft <Shaft>` and is available in many different :term:`gear ratios <Gear Reduction>` from 3.7:1 up to 188:1.
zh_cn: Yellow Jacket 电机是 goBILDA 出售的 :term:`RS-555 系列电机 <RS-550 Series Motor>` 和 :term:`行星齿轮箱 <Planetary Gear>` 。它有一个 :term:`6mm D 型轴 <Shaft>` 并有多种 :term:`齿轮比 <Gear Reduction>` 从 3.7:1 到 188:1。

source: The RS-555 series motor is the standard motor in FTC. It forms the base for the :term:`Andymark NeveRest <NeveRest Motor>`, :term:`REV HD Hex <HD Hex Motor>`, and :term:`goBILDA Yellow Jacket <Yellow Jacket Motor>` motors.
zh_cn: RS-555 系列电机是 FTC 的标准电机。它是 :term:`Andymark NeveRest <NeveRest Motor>` 、 :term:`REV HD Hex <HD Hex Motor>` 和 :term:`goBILDA Yellow Jacket <Yellow Jacket Motor>` 电机的基础。
