Repository: gamemanual0/gm0-translations
Catalog: locale/*/LC_MESSAGES/docs/power-and-electronics/motor-guide/wiring-mounting-motors.po
Languages: es_mx, fr_ca, zh_cn

source: Motor Wiring And Mounting
es_mx: Cableado y montaje del motor
fr_ca: Câblage et montage du moteur
zh_cn: 电机的接线和安装

source: Power Connections
es_mx: Conexiones de alimentación/poder
fr_ca: Connexions électriques
zh_cn: 电源连接

source: Depending on the vendor, the motors can come with one of the following connectors:
es_mx: Dependiendo del proveedor, los motores pueden venir con uno de los siguientes conectores:
fr_ca: Selon le fournisseur, les moteurs peuvent être livrés avec l'un des connecteurs suivants :
zh_cn: 根据供应商的不同，电机可配备以下连接器之一：

source: :term:`JST-VH` connector (REV motors)
es_mx: :term:`Conector JST-VH` (motores REV)
zh_cn: :term:`JST-VH` 连接器 (REV 电机)

source: :term:`Anderson PowerPole` (AndyMark's NeveRest)
es_mx: :term:`Anderson PowerPole` (NeveRest de AndyMark)

source: 3.5mm Bullet connector (goBILDA)
es_mx: Conector Bullet de 3,5 mm (goBILDA)
zh_cn: 3.5 毫米子弹式连接器 (goBILDA)

source: :term:`JST-VH` is probably easiest to use, as it is the same connector used by REV Expansion Hub. The :term:`JST-VH` connection has a locking mechanism for peace of mind. :term:`PowerPoles <Anderson PowerPole>` are very reliable and sturdy but somewhat bulky. Bullet connectors are very compact, making it easy to route the cable through openings, but can disconnect if someone pulls on the wire, so you need to be careful with them.
es_mx: :term:`JST-VH` es probablemente el más fácil de usar, ya que es el mismo conector utilizado por el REV Expansion Hub. La conexión :term:`JST-VH` tiene un mecanismo de bloqueo para mayor tranquilidad. :term:`PowerPoles <Anderson PowerPole>` son muy fiables y resistentes, pero algo voluminosos. Los conectores tipo bala son muy compactos y facilitan el paso del cable a través de aberturas, pero pueden desconectarse si alguien tira del cable, por lo que hay que tener cuidado con ellos.
zh_cn: :term:`JST-VH`可能最容易使用，因为它与 REV Expansion Hub 使用的连接器相同。:term:`JST-VH` 连接带有锁定装置，可放心使用。 :term:`PowerPoles <Anderson PowerPole>` 非常可靠、坚固，但有些笨重。子弹头连接器非常紧凑，便于将电缆穿过开口，但如果有人拉扯电线，就会断开，因此需要小心使用。

source: Since REV Hubs use :term:`JST-VH` connectors, to connect a motor with :term:`Anderson PowerPole` or bullet connectors you need adapters which you can purchase from REV Robotics and goBILDA.
es_mx: Dado que los REV Hubs utilizan conectores :term:`JST-VH`, para conectar un motor con conectores :term:`Anderson PowerPole` o bullet necesitas adaptadores que puedes adquirir en REV Robotics y goBILDA.
zh_cn: 由于 REV 集线器使用 :term:`JST-VH` 接头，要连接使用 :term:`Anderson PowerPole` 或子弹式接头的电机，需要使用适配器，您可以从 REV Robotics 和 goBILDA 购买适配器。

source: You can extend or shorten motor power cables by soldering additional length of cable. This is legal as long as you use 18 gauge or thicker cables. Teams can also purchase extender cables to chain multiple pieces of cable together.
es_mx: Puede alargar o acortar los cables de alimentación del motor soldando una longitud adicional de cable. Esto es legal siempre que se utilicen cables de calibre 18 o más gruesos. Los equipos también pueden comprar cables extensores para encadenar varios trozos de cable.
fr_ca: Vous pouvez rallonger ou raccourcir les câbles d'alimentation du moteur en soudant des longueurs de câble supplémentaires. Cette pratique est légale tant que vous utilisez des câbles de calibre 18 ou plus épais. Les équipes peuvent également acheter des câbles de rallonge pour relier plusieurs morceaux de câble entre eux.
zh_cn: 您可以通过焊接额外长度的电缆来延长或缩短电机电源电缆。只要使用 18 号或更粗的电缆，这种做法都是合法的。参赛队还可以购买延长电缆，将多根电缆连接在一起。

source: For more tips on wiring the robot, see :doc:`/docs/power-and-electronics/wiring`.
es_mx: Para más consejos sobre el cableado del robot, consulte :doc:`/docs/power-and-electronics/wiring`.
fr_ca: Pour plus de conseils sur le câblage du robot, voir :doc:`/docs/power-and-electronics/wiring`.
zh_cn: 有关机器人布线的更多提示，请参阅 :doc:`/docs/power-and-electronics/wiring` 。

source: Encoders
es_mx: Codificadores
fr_ca: Encodeurs
zh_cn: 编码器

source: Encoder cables are very fragile. Take care to protect them from snagging and sharp impacts! It may be prudent to inspect encoder wires once in a while.
es_mx: Los cables de los codificadores son muy frágiles. Tenga cuidado de protegerlos de enganches e impactos bruscos. Puede ser prudente inspeccionar los cables del codificador de vez en cuando.
fr_ca: Les câbles des encodeurs sont très fragiles. Veillez à les protéger contre les accrochages et les impacts tranchants ! Il peut être prudent d'inspecter les câbles des encodeurs de temps à autre.
zh_cn: 编码器电缆非常脆弱。要小心保护，防止被卡住或受到尖锐撞击！为谨慎起见，应定期检查编码器电缆。

source: If using encoders, you need to connect them to the REV hub by a 4-wire cable. REV Hub uses 4-pin :term:`JST-PH` connector for encoder ports. REV motors also use :term:`JST-PH` encoder ports, so you can connect them to the hub by :term:`JST-PH` 4-wire cable, available from REV Robotics.
es_mx: Si utiliza codificadores, deberá conectarlos al concentrador REV mediante un cable de 4 hilos. El concentrador REV utiliza un conector :term:`JST-PH` de 4 patillas para los puertos de codificador. Los motores REV también utilizan puertos de encoder :term:`JST-PH`, por lo que puedes conectarlos al hub mediante un cable :term:`JST-PH` de 4 hilos, disponible en REV Robotics.
zh_cn: 如果使用编码器，则需要用 4 线电缆将其连接到 REV 集线器。REV 集线器的编码器端口使用 4 针 :term:`JST-PH` 连接器。REV 电机也使用 :term:`JST-PH` 编码器端口，因此可以通过 :term:`JST-PH` 4 线电缆将它们连接到集线器，电缆可从 REV Robotics 购买。

source: goBILDA motors use JST-XH 4-pin encoder port (**note the difference: XH vs PH**), so to connect them, you need a JST-PH to JST-XH cable, available from AndyMark or goBILDA.
es_mx: Los motores goBILDA utilizan un puerto de codificador JST-XH de 4 pines (**nótese la diferencia: XH vs PH**), por lo que para conectarlos necesitas un cable JST-PH a JST-XH, disponible en AndyMark o goBILDA.
zh_cn: goBILDA 马达使用 JST-XH 4 针编码器端口（**注意区别：XH 与 PH**），因此要连接它们，需要 JST-PH 转 JST-XH 电缆，可从 AndyMark 或 goBILDA 购买。

source: AndyMark also use JST-XH encoder port; however, an additional problem is that encoders of these motors require 5v power, whereas the encoder port of REV hub only provides 3.3v. Thus, it is recommended that you connect them using level shifters, available from REV Robotics. For details please check the `REV's documentation <https://docs.revrobotics.com/duo-control/sensors/5v-sensors#connecting-5v-encoder>`_.
es_mx: AndyMark también utiliza el puerto de codificador JST-XH; sin embargo, un problema adicional es que los codificadores de estos motores requieren una alimentación de 5v, mientras que el puerto de codificador del hub REV sólo proporciona 3,3v. Por lo tanto, se recomienda que los conectes utilizando cambiadores de nivel, disponibles en REV Robotics. Para más detalles, consulta la documentación de `REV <https://docs.revrobotics.com/duo-control/sensors/5v-sensors#connecting-5v-encoder>`_.
zh_cn: AndyMark 也使用 JST-XH 编码器端口；但另一个问题是，这些电机的编码器需要 5 伏电源，而 REV 集线器的编码器端口只能提供 3.3 伏。因此，建议使用 REV Robotics 提供的电平转换器连接它们。详情请查阅 REV 的文档 <https://docs.revrobotics.com/duo-control/sensors/5v-sensors#connecting-5v-encoder>`_。

source: Mounting Motors
es_mx: Montaje de motores
fr_ca: Montage des moteurs
zh_cn: 安装电机

source: There are two ways to mount a motor: using a :term:`clamping mount <Clamp Mounting>` (such as `32mm goBILDA clamping mount <https://www.gobilda.com/1400-series-1-side-2-post-clamping-mount-32mm-bore/>`_) or :term:`face mounting <Face Mounting>`, using threaded holes in the front face of the gearbox.
es_mx: Hay dos formas de montar un motor: utilizando un soporte de sujeción<Clamp Mounting>` (como `32mm goBILDA clamping mount <https://www.gobilda.com/1400-series-1-side-2-post-clamping-mount-32mm-bore/>`_) o :term:`montaje frontal <Face Mounting>`, utilizando orificios roscados en la cara frontal de la caja de engranajes.
fr_ca: Il y a deux façons de monter un moteur : en utilisant un :term:`support de serrage <Clamp Mounting>` (tel que `montage à serrage goBILDA 32mm <https://www.gobilda.com/1400-series-1-side-2-post-clamping-mount-32mm-bore/>`_) ou :term:`montage par la face avant <Face Mounting>`, en utilisant des trous filetés sur la face avant de la boîte de vitesses.
zh_cn: 有两种安装电机的方法：使用 :term:` 夹紧安装 <Clamp Mounting>` （如 `32mm goBILDA 夹紧安装 <https://www.gobilda.com/1400-series-1-side-2-post-clamping-mount-32mm-bore/>`_）或 :term:` 表面安装 <Face Mounting>`，使用齿轮箱正面的螺纹孔。

source: Clamping Mount
es_mx: Soporte de Sujeción/Montaje con abrazadera
fr_ca: Support de serrage
zh_cn: 夹紧支架

source: Easiest way to mount a motor, as only one screw is required.
es_mx: La forma más fácil de montar un motor, ya que sólo se necesita un tornillo.
zh_cn: 安装电机的最简单方法，因为只需要一个螺丝。

source: Not as secure as face mounting, as clamp friction is looser than face mounting using screws.
es_mx: No es tan seguro como el montaje frontal, ya que la fricción de la abrazadera es menor que en el montaje frontal con tornillos.
fr_ca: Moins solide qu’un montage par la face avant, car la friction du support de serrage est moins importante qu’un montage frontal utilisant des vis.
zh_cn: 由于夹具摩擦力比使用螺钉的正面安装要小，因此不如正面安装牢固。

source: Some gearboxes (particularly spur gear) do not place the output shaft in the center of the gearbox.
es_mx: Algunas cajas de engranajes (especialmente las de engranajes rectos) no colocan el eje de salida en el centro de la caja.
fr_ca: Certains réducteurs (en particulier les réducteurs à engrenages droits) ne placent pas l'arbre de sortie au centre du réducteur.
zh_cn: 有些变速箱（尤其是直齿轮变速箱）并没有将输出轴置于变速箱的中心。

source: Thus, motors with offset shafts are particularly sensitive to clamp mounts, as any rotation of the motor will alter the shaft position. This may have the consequence of losing :term:`chain <Chain>` or :term:`belt <HTD Belt>` tension.
es_mx: Así, los motores con ejes desplazados son especialmente sensibles a los montajes de abrazaderas, ya que cualquier rotación del motor alterará la posición del eje. Esto puede tener como consecuencia la pérdida de tensión de :term:`cadena <Chain>` o :term:`correa <HTD Belt>`.
fr_ca: Ainsi, les moteurs à arbre décalé sont particulièrement sensibles aux montages à collier, car toute rotation du moteur modifie la position de l'arbre. Cela peut avoir pour conséquence une perte de tension de la :term:`chaine <Chain>` ou de la :term:`courroie <HTD Belt>`.
zh_cn: 因此，带偏置轴的电机对夹具特别敏感，因为电机的任何旋转都会改变轴的位置。这可能会导致 :term:`链条 <Chain>` 或 :term:`皮带 <HTD Belt>` 张力损失。

source: It is possible to double clamp a motor - one in front, and one in the back.
es_mx: Es posible sujetar dos veces un motor: uno delante y otro detrás.
fr_ca: Il est possible d'effectuer un double bridage d'un moteur - un à l'avant et un à l'arrière.
zh_cn: 可以对电机进行双夹紧--一个在前，一个在后。

source: To increase friction and reduce the chance of loosening, one can wrap electrical tape around the area of the motor that will be clamped down. Use a couple wraps of tape.
es_mx: Para aumentar la fricción y reducir la posibilidad de que se afloje, se puede envolver cinta aislante alrededor de la zona del motor que se va a sujetar. Utilice un par de vueltas de cinta.
fr_ca: Pour augmenter la friction et réduire le risque de desserrage, il est possible d'enrouler du ruban adhésif autour de la zone du moteur qui sera serrée. Enveloppez le ruban de quelques tours.
zh_cn: 为了增加摩擦力和减少松动的机会，可以在电机夹紧的部位缠上电工胶带。用胶带缠几圈。

source: Face Mount
es_mx: Montaje frontal
fr_ca: Montage par la face avant
zh_cn: 正面安装

source: Slightly more tedious and uses more screws.
es_mx: Un poco más tedioso y utiliza más tornillos.
zh_cn: 稍显繁琐，使用的螺丝也更多。

source: Repairing a broken gearbox or swapping a motor is slower than if using clamp mounting.
es_mx: Reparar una caja de engranajes rota o cambiar un motor es más lento que si se utiliza el montaje con abrazaderas.
zh_cn: 修理损坏的变速箱或更换电机的速度比使用夹具安装要慢。

source: Face mounting is much more reliable than clamp mounting, as the screws hold the motor in place very tightly.
es_mx: El montaje frontal es mucho más fiable que el montaje con abrazadera, ya que los tornillos sujetan el motor con mucha fuerza.
fr_ca: Le montage frontal est beaucoup plus fiable que le montage par serrage, car les vis maintiennent le moteur en place très fermement.
zh_cn: 正面安装比夹钳安装更可靠，因为螺钉能将电机紧紧固定。

source: Teams can use **BLUE** :term:`Loctite` on high-vibration motors to ensure the motor does not jar loose.
es_mx: Los equipos pueden utilizar **BLUE** :term:`Loctite` en motores de alta vibración para garantizar que el motor no se suelte.
fr_ca: Les équipes peuvent utiliser du :term:`Loctite` **bleu** sur les moteurs soumis à de fortes vibrations pour s'assurer que le moteur ne se détache pas.
zh_cn: 参赛队可在高振动电机上使用 **BLUE** :term:`乐泰胶水` 来确保电机不会松动。

source: :term:`Face mounting <Face Mounting>` is recommended for high-load and/or high vibration use cases such as drivetrain. This is as :term:`clamp mounted <Clamp Mounting>` motors can shift and come loose easier than :term:`face mounted <Face Mounting>` motors. It is also recommended to use **BLUE** :term:`Loctite` when :term:`face mounting <Face Mounting>`, if possible.
es_mx: :term:`Montaje frontal <Face Mounting>` se recomienda para casos de uso de alta carga y/o alta vibración, como él chasis. Esto se debe a que los motores :term:`montados en abrazadera <Clamp Mounting>` pueden desplazarse y aflojarse más fácilmente que los motores :term:`montados frontalmente <Face Mounting>`. También se recomienda utilizar **BLUE** :term:`Loctite` al montar :term:`frontalmente <Face Mounting>`, si es posible.
fr_ca: Le :term:`montage frontal <Face Mounting>` est recommandé pour les cas d'utilisation à forte charge et/ou à fortes vibrations tels que la transmission. En effet, les moteurs :term:`montés par serrage <Clamp Mounting>` peuvent se déplacer et se détacher plus facilement que les moteurs :term:`à montage frontal <Face Mounting>`. Il est également recommandé d'utiliser du :term:`Loctite` **bleu** lors du :term:`montage en surface <Face Mounting>`, si possible.
zh_cn: :term:`Face mounting <Face Mounting>` 建议用于高负载和/或高振动的情况，如传动系统。这是因为 :term:`clamp mounted <Clamp Mounting>` 电机比 :term:`face mounted <Face Mounting>` 电机更容易移位和松动。如果可能，还建议在 :term:` 表面安装 <Face Mounting>` 时使用 ** BLUE** :term:`Loctite` 。

source: Note that the pattern of :term:`face mounting <Face Mounting>` holes is different for different vendors. For example, goBILDA uses 4 M4 holes in a square with side 16 mm, whereas AndyMark classic motors use 6 M3 holes on a 31 mm diameter circle. Thus, face mounting NeveRest motors to goBILDA parts requires use of special adapters, and vice versa. Similarly, gearbox diameter also varies between motors, so when choosing a :term:`clamping hub <Clamping Hub>`, make sure to use the right diameter.
es_mx: Tenga en cuenta que el patrón de agujeros del :term:`montaje frontal <Face Mounting>` es diferente para los distintos proveedores. Por ejemplo, goBILDA utiliza 4 orificios M4 en un cuadrado de 16 mm de lado, mientras que los motores clásicos AndyMark utilizan 6 orificios M3 en un círculo de 31 mm de diámetro. Por lo tanto, el montaje frontal de motores NeveRest en piezas goBILDA requiere el uso de adaptadores especiales, y viceversa. Del mismo modo, el diámetro de la caja de engranajes también varía entre motores, por lo que al elegir un :term:`clamping hub <Clamping Hub>`, asegúrese de utilizar el diámetro correcto.
fr_ca: Notez que la configuration des trous :term:`montage frontal <Face Mounting>` est différente selon les fournisseurs. Par exemple, goBILDA utilise 4 trous M4 dans un carré de 16 mm de côté, alors que les moteurs classiques AndyMark utilisent 6 trous M3 sur un cercle de 31 mm de diamètre. Ainsi, le montage frontal des moteurs NeveRest sur les pièces goBILDA nécessite l'utilisation d'adaptateurs spéciaux, et vice-versa. De même, le diamètre de la boîte de vitesses varie également d'un moteur à l'autre, donc lorsque vous choisissez un :term:`moyeu de serrage <Clamping Hub>`, assurez-vous d'utiliser le bon diamètre.
zh_cn: 请注意，不同供应商的 :term:`face mounting <Face Mounting>` 孔型是不同的。例如，goBILDA 在边长为 16 毫米的正方形上使用 4 个 M4 孔，而 AndyMark classic 电机在直径为 31 毫米的圆形上使用 6 个 M3 孔。因此，将 NeveRest 电机安装到 goBILDA 部件上需要使用特殊的适配器，反之亦然。同样，不同电机的齿轮箱直径也不同，因此在选择 :term:`clamping hub <Clamping Hub>` 时，请确保使用正确的直径。

source: :term:`JST VH` connector (REV motors, some AndyMark NeveRest motors)
fr_ca: :term:`JST VH` connecteur (moteurs REV, certains moteurs AndyMark NeveRest)

source: :term:`3.5mm Bullet` connector (goBILDA motors)
fr_ca: :term:Connecteur Bullet 3.5mm (moteurs goBILDA)

source: :term:`Anderson PowerPole` (some AndyMark NeveRest motors)
fr_ca: :term:`Anderson PowerPole` (certains moteurs AndyMark NeveRest)

source: :term:`JST VH` is probably easiest to use, as it is the same connector used by REV Control/Expansion Hubs. It is also locking. :term:`PowerPoles <Anderson PowerPole>` are very reliable and sturdy but somewhat bulky. :term:`3.5mm Bullet` connectors are very compact, making cables easy to route through openings, but can be disconnected.
fr_ca: :term:`JST VH` est probablement le plus facile à utiliser, car il s'agit du même connecteur que celui utilisé par les Control/Expansion Hubs REV. Il est également verrouillable. :term:`PowerPoles <Anderson PowerPole>` sont très fiables et robustes, mais quelque peu encombrants. Les :term:`connecteurs Bullet` de 3,5 mm sont très compacts, facilitant le passage des câbles dans les ouvertures, mais peuvent être déconnectés.

source: Since REV hubs use :term:`JST VH` connectors, to connect a motor with :term:`3.5mm Bullet` or :term:`Anderson PowerPole` connectors, you need adapters which you can purchase from REV Robotics, goBILDA, and AndyMark.
fr_ca: Comme les hubs REV utilisent des connecteurs :term:`JST VH`, pour connecter un moteur avec des connecteurs :term:`3.5mm Bullet` ou :term:`Anderson PowerPole`, vous avez besoin d'adaptateurs que vous pouvez acheter chez REV Robotics, goBILDA, et AndyMark.

source: If using encoders, you need to connect them to the REV hub by a 4-wire cable. REV Hub uses 4-pin :term:`JST PH` connector for encoder ports. REV motors also use :term:`JST PH` encoder ports, so you can connect them to the hub by :term:`JST PH` 4-wire cable, available from REV Robotics.
fr_ca: Si vous utilisez des encodeurs, vous devez les connecter au hub REV à l'aide d'un câble à 4 fils. Le hub REV utilise un connecteur :term:`JST PH` à 4 broches pour les ports des encodeurs. Les moteurs REV utilisent également des ports d'encodeur :term:`JST PH`, vous pouvez donc les connecter au concentrateur par un câble :term:`JST PH` à 4 fils, disponible auprès de REV Robotics.

source: goBILDA and AndyMark motors use JST XH 4-pin encoder port (**note the difference: XH vs PH**), so to connect them, you need a JST PH to JST XH cable, available from goBILDA and AndyMark.
fr_ca: Les moteurs goBILDA et AndyMark utilisent le port encodeur JST XH 4 broches (**notez la différence : XH vs PH**), donc pour les connecter, vous avez besoin d'un câble JST PH vers JST XH, disponible chez goBILDA et AndyMark.
